
// Процедура была в расширении ТТМ_ФормированиеЗаказовНаПроизводство
// Расширение отключено
&ИзменениеИКонтроль("СформироватьЗаказы")
Процедура ТТМ_СформироватьЗаказы(Параметры, АдресРезультата)
	#Вставка
	Потребности = Параметры.ТаблицаПотребностей.Скопировать();
	Если Потребности.Количество()>1 Тогда
		тТаблицаДокументов = Неопределено;
		мСообщения = Новый Массив;
		Для каждого Партия из Потребности Цикл
			Параметры.ТаблицаПотребностей.Очистить();
			ЗаполнитьЗначенияСвойств(Параметры.ТаблицаПотребностей.Добавить(),Партия);
			СформироватьЗаказы(Параметры, АдресРезультата);
			Результат1 = ПолучитьИзВременногоХранилища(Параметры.АдресРезультатаФормированияЗаказов);
			
			Если Результат1<>Неопределено Тогда
				Если тТаблицаДокументов = Неопределено Тогда
					тТаблицаДокументов = Результат1.ТаблицаДокументов.Скопировать();
				Иначе
					Для каждого стрДок Из Результат1.ТаблицаДокументов Цикл
						ЗаполнитьЗначенияСвойств(тТаблицаДокументов.Добавить(),стрДок);
					КонецЦикла;
				КонецЕсли;
			
				тмп = Новый Структура("СписокСообщений");
				ЗаполнитьЗначенияСвойств(тмп,Результат1);
				Если тмп.СписокСообщений = Неопределено Тогда
					Результат1.Вставить("СписокСообщений",Новый Массив);
				КонецЕсли;
					
				Для каждого стрСообщ из Результат1.СписокСообщений Цикл
				мСообщения.Добавить(стрСообщ);
				КонецЦикла;
			КонецЕсли;
			Результат0 = ПолучитьИзВременногоХранилища(АдресРезультата);				
			//Результат = Новый Структура("ТаблицаДокументов,СписокСообщений", Параметры.ТаблицаДокументов, Новый Массив);
			//ДобавитьДокументВРезультат(Документ, Результат, ИспользованиеСтатусов);
			//ПоместитьВоВременноеХранилище(Результат, Параметры.АдресРезультатаФормированияЗаказов);

		КонецЦикла;
		Параметры.ТаблицаПотребностей = Потребности.Скопировать();
		//Результат = Новый Структура("ТаблицаДокументов,СписокСообщений", тТаблицаДокументов, мСообщения);
		////ДобавитьДокументВРезультат(Документ, Результат, ИспользованиеСтатусов);
		//ПоместитьВоВременноеХранилище(Результат, Параметры.АдресРезультатаФормированияЗаказов);

		//ПоместитьВоВременноеХранилище(Результат, Параметры.АдресРезультатаФормированияЗаказов);
		Возврат;
	КонецЕсли;
	#КонецВставки

	ДокументыОбъекты = Новый Массив();
	ТекстКомментарий = НСтр("ru = 'Сформирован автоматически обработкой ""Формирование заказов по потребностям"".';
							|en = 'Generated automatically by the ""Demand-driven orders"" data processor.'");

	Таблица = Параметры.ТаблицаПотребностей; // ТаблицаЗначений
	#Вставка
	Если Таблица.Колонки.Найти("ЭтоОкругление")= Неопределено Тогда
	#КонецВставки
	Таблица.Колонки.Добавить("ЭтоОкругление", Новый ОписаниеТипов("Булево"));
	#Вставка
	КонецЕсли;
	Если Таблица.Колонки.Найти("НазначениеОкругленнойСтроки")= Неопределено Тогда
	#КонецВставки
	Таблица.Колонки.Добавить("НазначениеОкругленнойСтроки", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	#Вставка
	КонецЕсли;
	#КонецВставки
	
	// Округление имеет смысл только когда могут использоваться упаковки номенклатуры
	Если Параметры.ИспользоватьУпаковки Тогда
		ОкруглитьПередСозданиемЗаказов(Таблица);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТаблицаЗначений", Таблица);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ОсновнаяСтрана", ЗначениеНастроекКлиентСерверПовтИсп.ОсновнаяСтрана());
	
	ТекстыЗапроса = Новый СписокЗначений();
	ТекстыЗапроса.Добавить(ВременнаяТаблицаИзТаблицыКЗаказу(), "");
	ТекстыЗапроса.Добавить(ВременнаяТаблицаДанныеЗаполнения(), "");
	
	ТекстыЗапроса.Добавить(ТаблицаЗаказыПоставщикуКОформлению(),    "ТаблицаЗаказыПоставщику");
	ТекстыЗапроса.Добавить(ТаблицаЗаказыНаПеремещениеКоформлению(), "ТаблицаЗаказыНаПеремещение");
	ТекстыЗапроса.Добавить(ТаблицаЗаказыНаСборкуКОформлению(),      "ТаблицаЗаказыНаСборку");
	//++ НЕ УТ
	ТекстыЗапроса.Добавить(ТаблицаЗаказыМатериаловВПроизводство(), "ТаблицаЗаказыМатериаловВПроизводство");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоНаСтороне2_5") Тогда
		ТекстыЗапроса.Добавить(ТаблицаЗаказыПереработчику2_5КОформлению(), "ТаблицаЗаказыПереработчику");
	//++ Устарело_Переработка24
	Иначе
		ТекстыЗапроса.Добавить(ТаблицаЗаказыПереработчикуКОформлению(), "ТаблицаЗаказыПереработчику");
	//-- Устарело_Переработка24
	КонецЕсли;
	//++ НЕ УТКА

	//++ Устарело_Производство21
	ТекстыЗапроса.Добавить(ТаблицаЗаказыНаПроизводствоКОформлению(), "ТаблицаЗаказыНаПроизводство");
	//-- Устарело_Производство21
	ТекстыЗапроса.Добавить(ТаблицаЗаказыНаПроизводство2_2КОформлению(), "ТаблицаЗаказыНаПроизводство2_2");
	//-- НЕ УТКА

	//-- НЕ УТ
	Запрос.УстановитьПараметр("УправлениеПроизводством2_2", ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2"));
	
	УстановитьПривилегированныйРежим(Истина);
	Таблицы = ОбщегоНазначенияУТ.ВыгрузитьРезультатыЗапроса(Запрос, ТекстыЗапроса);
	УстановитьПривилегированныйРежим(Ложь);
	
	ПоляКлючаЗаказа = "НаправлениеДеятельности, Соглашение, Партнер, Организация, Подразделение";
	МассивТаблиц = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Таблицы.ТаблицаЗаказыПоставщику, ПоляКлючаЗаказа);
	
	Для Каждого Элемент Из МассивТаблиц Цикл
		
		ПоляКлючаЗаказа = "Склад";
		ДанныеЗаполнения = Элемент.Ключ;
		ТаблицыПоСкладам = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Элемент.Таблица, ПоляКлючаЗаказа, "");
		
		Если ТаблицыПоСкладам.Количество() = 2 //Если заказ с товарами один, то добавляем работы в него.
			И Не ЗначениеЗаполнено(ТаблицыПоСкладам[0].Таблица[0].Склад) Тогда
			
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицыПоСкладам[0].Таблица, ТаблицыПоСкладам[1].Таблица);
			ТаблицыПоСкладам.Удалить(0);
			
		КонецЕсли;
		
		Для Каждого Элемент1 Из ТаблицыПоСкладам Цикл
			
			ДанныеЗаполнения.Вставить("Склад", Элемент1.Ключ.Склад);
			Элемент1.Таблица.Колонки.ПодразделениеПолучатель.Имя = "Подразделение";
			
			ДанныеЗаполнения.Вставить("Комментарий", ТекстКомментарий);
			ДанныеЗаполнения.Вставить("Товары", Элемент1.Таблица);
			Документ = ПолучитьДокумент(Документы.ЗаказПоставщику, ДанныеЗаполнения, Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
			ДокументыОбъекты.Добавить(Документ);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ПоляКлючаЗаказа = "СкладОтправитель, СкладПолучатель, Организация, Подразделение, НаправлениеДеятельности";
	МассивТаблиц = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Таблицы.ТаблицаЗаказыНаПеремещение, ПоляКлючаЗаказа);
	
	Для Каждого Элемент Из МассивТаблиц Цикл
		
		ДанныеЗаполнения = Элемент.Ключ;
		ДанныеЗаполнения.Вставить("Товары", Элемент.Таблица);
		ДанныеЗаполнения.Вставить("Комментарий", ТекстКомментарий);
		Документ = ПолучитьДокумент(Документы.ЗаказНаПеремещение, ДанныеЗаполнения, Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
		ДокументыОбъекты.Добавить(Документ);
		
	КонецЦикла;
	
	ПоляКлючаЗаказа = "Организация, Подразделение, Склад, Номенклатура, Характеристика, Назначение, НаправлениеДеятельности,
		|НачалоСборкиРазборки, ОкончаниеСборкиРазборки, ДлительностьСборкиРазборки, Количество, КоличествоУпаковок";
	МассивТаблиц = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Таблицы.ТаблицаЗаказыНаСборку, ПоляКлючаЗаказа);
	
	Для Каждого Элемент Из МассивТаблиц Цикл
		
		ДанныеЗаполнения = Элемент.Ключ;
		ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.СборкаТоваров);
		ДанныеЗаполнения.Вставить("Комментарий", ТекстКомментарий);
		Документ = ПолучитьДокумент(Документы.ЗаказНаСборку, ДанныеЗаполнения, Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
		ДокументыОбъекты.Добавить(Документ);
		
	КонецЦикла;
	
	//++ НЕ УТ
	ПоляКлючаЗаказа = "Склад, ЦеховаяКладовая, Организация, Подразделение, НаправлениеДеятельности";
	МассивТаблиц = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Таблицы.ТаблицаЗаказыМатериаловВПроизводство, ПоляКлючаЗаказа);
	
	Для Каждого Элемент Из МассивТаблиц Цикл
		
		ДанныеЗаполнения = Элемент.Ключ;
		ДанныеЗаполнения.Вставить("Товары", Элемент.Таблица);
		ДанныеЗаполнения.Вставить("Комментарий", ТекстКомментарий);
		Документ = ПолучитьДокумент(Документы.ЗаказМатериаловВПроизводство, ДанныеЗаполнения, Перечисления.СтатусыЗаказовМатериаловВПроизводство.КВыполнению);
		ДокументыОбъекты.Добавить(Документ);
		
	КонецЦикла;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Таблицы, "ТаблицаЗаказыПереработчику") Тогда
		
		ПоляКлючаЗаказа = "НаправлениеДеятельности, Соглашение, Партнер, Организация, Подразделение";
		МассивТаблиц = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Таблицы.ТаблицаЗаказыПереработчику, ПоляКлючаЗаказа);
		
		Для Каждого Элемент Из МассивТаблиц Цикл
			
			ПоляКлючаЗаказа = "Склад";
			ДанныеЗаполнения = Элемент.Ключ;
			ТаблицыПоСкладам = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Элемент.Таблица, ПоляКлючаЗаказа, "");
			
			Если ТаблицыПоСкладам.Количество() = 2 //Если заказ с товарами один, то добавляем работы в него.
				И Не ЗначениеЗаполнено(ТаблицыПоСкладам[0].Таблица[0].Склад) Тогда
				
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицыПоСкладам[0].Таблица, ТаблицыПоСкладам[1].Таблица);
				ТаблицыПоСкладам.Удалить(0);
				
			КонецЕсли;
			
			Для Каждого Элемент1 Из ТаблицыПоСкладам Цикл
				
				ДанныеЗаполнения.Вставить("Склад", Элемент1.Ключ.Склад);
				КолонкаТаблицы = Элемент1.Таблица.Колонки.ПодразделениеПолучатель; // 
				КолонкаТаблицы.Имя = "Подразделение";
				
				ДанныеЗаполнения.Вставить("Комментарий", ТекстКомментарий);
				ДанныеЗаполнения.Вставить("Товары", Элемент1.Таблица);
				Если ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоНаСтороне2_5") Тогда
					Документ = ПолучитьДокумент(Документы.ЗаказПереработчику2_5, ДанныеЗаполнения, Перечисления.СтатусыЗаказовПереработчикам.КИсполнению);
				//++ Устарело_Переработка24
				Иначе
					Документ = ПолучитьДокумент(Документы.ЗаказПереработчику, ДанныеЗаполнения, Перечисления.СтатусыЗаказовПереработчикам.КОбеспечению);
				//-- Устарело_Переработка24
				КонецЕсли;
				ДокументыОбъекты.Добавить(Документ);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//++ НЕ УТКА

	//++ Устарело_Производство21
	ПоляКлючаЗаказа = "Организация, Подразделение, НаправлениеДеятельности, Заказ";
	МассивТаблиц = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Таблицы.ТаблицаЗаказыНаПроизводство, ПоляКлючаЗаказа);
	
	Для Каждого Элемент Из МассивТаблиц Цикл
		
		ДанныеЗаполнения = Элемент.Ключ;
		КолонкаТаблицы = Элемент.Таблица.Колонки.ПодразделениеПолучатель; // КолонкаТаблицыЗначений -
		КолонкаТаблицы.Имя = "Подразделение";
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Заказ) Тогда
			ДанныеЗаполнения.Вставить("ПроизводствоПоЗаказу", Истина);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("Товары", Элемент.Таблица);
		ДанныеЗаполнения.Вставить("Комментарий", ТекстКомментарий);
		Документ = ПолучитьДокумент(Документы.ЗаказНаПроизводство, ДанныеЗаполнения, Перечисления.СтатусыЗаказовНапроизводство.КПроизводству);
		
		ДокументыОбъекты.Добавить(Документ);
		
	КонецЦикла;
	//-- Устарело_Производство21
	
	ПоляКлючаЗаказа = "ТипПроизводственногоПроцесса, НаправлениеДеятельности, Организация, Подразделение, Партнер, Договор, ХозяйственнаяОперация"
		+ ?(ПолучитьФункциональнуюОпцию("ДинамическаяСтруктураЗаказовНаПроизводство"), 
			"",
			",ДатаПотребности");
	МассивТаблиц = ОбеспечениеСервер.РазбитьТаблицуПоЗначениюКлюча(Таблицы.ТаблицаЗаказыНаПроизводство2_2, ПоляКлючаЗаказа);
	
	Для Каждого Элемент Из МассивТаблиц Цикл
		
		ДанныеЗаполнения = Элемент.Ключ;
		ДанныеЗаполнения.Вставить("Статус", Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству);
		Элемент.Таблица.Колонки.ПодразделениеПолучатель.Имя = "Подразделение";
		ДанныеЗаполнения.Вставить("Товары", Элемент.Таблица);
		ДанныеЗаполнения.Вставить("Комментарий", ТекстКомментарий);
		#Вставка
		ДанныеЗаполнения.Вставить("ТТМ_ОбеспечениеПотребностей");
		#КонецВставки
		Документ = ПолучитьДокумент(Документы.ЗаказНаПроизводство2_2, ДанныеЗаполнения, Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству);
		
		ДокументыОбъекты.Добавить(Документ);
		
	КонецЦикла;
	//-- НЕ УТКА

	//-- НЕ УТ
	
	ИспользованиеСтатусов = Новый Соответствие();
	ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовПоставщикам");
	ИспользованиеСтатусов.Вставить(Тип("ДокументСсылка.ЗаказПоставщику"),     ИспользоватьСтатусы);
	ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовНаСборку");
	ИспользованиеСтатусов.Вставить(Тип("ДокументСсылка.ЗаказНаСборку"),       ИспользоватьСтатусы);
	ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовНаПеремещение");
	ИспользованиеСтатусов.Вставить(Тип("ДокументСсылка.ЗаказНаПеремещение"),  ИспользоватьСтатусы);
	//++ НЕ УТ

	//++ НЕ УТКА

	//++ Устарело_Производство21
	ИспользованиеСтатусов.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство"), Истина);
	//-- Устарело_Производство21
	ИспользованиеСтатусов.Вставить(Тип("ДокументСсылка.ЗаказНаПроизводство2_2"), Истина);
	//-- НЕ УТКА

	ИспользованиеСтатусов.Вставить(Тип("ДокументСсылка.ЗаказМатериаловВПроизводство"), Истина);
	//++ Устарело_Переработка24
	ИспользованиеСтатусов.Вставить(Тип("ДокументСсылка.ЗаказПереработчику"), Истина);
	//-- Устарело_Переработка24
	ИспользованиеСтатусов.Вставить(Тип("ДокументСсылка.ЗаказПереработчику2_5"), Истина);
	//-- НЕ УТ
	
	// Помещаем в хранилище результат формирования после записи каждого документа на случай прерывания задания
	Результат = Новый Структура("ТаблицаДокументов,СписокСообщений", Параметры.ТаблицаДокументов, Новый Массив);
	Для Каждого Документ Из ДокументыОбъекты Цикл
	#Вставка
		Если Параметры.ТаблицаПотребностей[0].ДатаОтгрузки<>Дата(1,1,1) Тогда
			ПлановаяДатаПроизводства = ТТМ_ОбщегоНазначения.РабочийДеньОтсчетОтДаты(Параметры.ТаблицаПотребностей[0].ДатаОтгрузки,-5);
			Документ.ДатаПотребности = ПлановаяДатаПроизводства;
			МинДатаПотребности = Документ.ДатаПотребности;
			Для Каждого стр из Документ.Продукция Цикл
				стр.ДатаПотребности = ПлановаяДатаПроизводства;
				МинДатаПотребности = Мин(МинДатаПотребности,стр.ДатаПотребности);
			КонецЦикла;
			Если ЗначениеЗаполнено(Документ.НачатьНеРанее) Тогда
				Если Документ.НачатьНеРанее>МинДатаПотребности Тогда
					Документ.НачатьНеРанее = МинДатаПотребности;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		тмп = Документ.Продукция.Выгрузить();
		Документ.Комментарий = СтрШаблон("%1:%2",тмп[0].Количество,тмп[0].Номенклатура);
	#КонецВставки

		
		Ошибка = Не Документ.ПроверитьЗаполнение();
		
		Если Не Ошибка Тогда
			
			НачатьТранзакцию();
			Попытка
				
				Документ.Записать(РежимЗаписиДокумента.Проведение);
				ДобавитьДокументВРезультат(Документ, Результат, ИспользованиеСтатусов);
				ПоместитьВоВременноеХранилище(Результат, Параметры.АдресРезультатаФормированияЗаказов);
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				
				ИмяСобытияЖурнала = НСтр("ru = 'Формирование заказов: создание документов';
										|en = 'Order generation: document creation'", ОбщегоНазначения.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Ошибка = Истина;
				
			КонецПопытки;
			
		КонецЕсли;
		
		Если Ошибка Тогда
			
			НачатьТранзакцию();
			Попытка
				
				Документ.Записать(РежимЗаписиДокумента.Запись);
				ДобавитьДокументВРезультат(Документ, Результат, ИспользованиеСтатусов);
				ПоместитьВоВременноеХранилище(Результат, Параметры.АдресРезультатаФормированияЗаказов);
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				
				ИмяСобытияЖурнала = НСтр("ru = 'Формирование заказов: создание документов';
										|en = 'Order generation: document creation'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ВызватьИсключение;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	ОбеспечениеВДокументахСервер.ПроверитьЗапуститьФоновоеЗаданиеРаспределенияЗапасов();
	
КонецПроцедуры

