

&НаСервере
Функция СтруктураНастроекПДок() Экспорт
	
	Обработка = РеквизитФормыВЗначение("Объект");
	СтруктураНастроек = Обработка.СтруктураНастроекПДок();

	Возврат СтруктураНастроек;
		
КонецФункции

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	
	НастройкиПДок = СтруктураНастроекПДок();
	КлючОбъекта = НастройкиПДок.КлючОбъекта;
	КлючНастроек = "";
	ЗаполнитьЗначенияСвойств(НастройкиПДок,ЭтотОбъект);
	ТТМ_ОбщегоНазначения.ПоместитьДанныеВ_ХОН(КлючОбъекта,НастройкиПДок);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	ЗаписатьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиНаСервере()
	
	НастройкиПДок = СтруктураНастроекПДок();
	КлючОбъекта = НастройкиПДок.КлючОбъекта;
	КлючНастроек = "";
	тмп = ТТМ_ОбщегоНазначения.ДанныеИзХОН(НастройкиПДок.КлючОбъекта);
	Если тмп = Неопределено Тогда
		тмп = НастройкиПДок;
	КонецЕсли;
	Если тмп.Свойство("СразуФормироватьЭтапы") Тогда
		Если тмп.СразуФормироватьЭтапы = Неопределено Тогда
			тмп.СразуФормироватьЭтапы = Истина;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,тмп);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройки(Команда)
	ПрочитатьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНастройкиНаСервере();
КонецПроцедуры


&НаСервере
Функция ДанныеИзХОН(КлючОбъекта,КлючНастроек = "") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ДанныеИзХОН =  ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек,,КлючОбъекта);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ДанныеИзХОН;
КонецФункции

&НаСервере
Процедура ПоместитьДанныеВ_ХОН(КлючОбъекта,Данные,КлючНастроек = "") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,КлючНастроек,Данные,КлючОбъекта);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
