
/////////////////////////////////////////////////////////////////////////
#Область ОбработчикСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ВыпущеннаяПродукцияПриИзменении(Элемент)
	УстановитьУсловноеОформление();		
КонецПроцедуры

#КонецОбласти


/////////////////////////////////////////////////////////////////////////
#Область УсловноеОформление

&НаСервере
Процедура УстановитьУсловноеОформление()		
		НовыйЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформлениеЦветТекста = НовыйЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
		ОформлениеЦветТекста.Значение = WebЦвета.Красный;
		ОформлениеЦветТекста.Использование = Истина;
		
		НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпущеннаяПродукция.Количество");
		НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		НастройкаОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпущеннаяПродукция.ТСД");
		
		ОформляемоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВыпущеннаяПродукцияНоменклатура");
		ОформляемоеПоле.Использование = Истина;
		
		///////////////////////////////////////////////////////////////////////////////////////////////
		НовыйЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ОформлениеЦветТекста = НовыйЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
		ОформлениеЦветТекста.Значение = WebЦвета.Зеленый;
		ОформлениеЦветТекста.Использование = Истина;
		
		НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпущеннаяПродукция.Количество");
		НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НастройкаОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыпущеннаяПродукция.ТСД");
		
		ОформляемоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВыпущеннаяПродукцияНоменклатура");
		ОформляемоеПоле.Использование = Истина;
КонецПроцедуры

#КонецОбласти