
&НаКлиенте
Процедура ТТМ_АРМ_РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт 
		
	ТекущаяСтрока = ДополнительныеПараметры.СтрокаКИзменению; 
	
	Если НоваяСтрока <> Неопределено Тогда
		
		Попытка
			НоваяСтрока.КодСтроки = 0;
			
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ДобавитьСтрокуДляПересчетаСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы, ТекущаяСтрока);
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ДобавитьСтрокуДляПересчетаСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы, НоваяСтрока);
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
				
			РассчитатьСкидкиНаценкиКлиент();			
			РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
				
			СтруктураДействий = Новый Структура;
			ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий,"ОбновитьКэшНоменклатура");
			ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
			
			РазбиениеСтрокВыполнено = Истина;
		Исключение
			РазбиениеСтрокВыполнено = Ложь;
		КонецПопытки;
		
		Если ДополнительныеПараметры.СохранитьИзменения И РазбиениеСтрокВыполнено Тогда	
			ОбработанныеСтрокиДляЗаписи = Новый Структура;
			ОбработанныеСтрокиДляЗаписи.Вставить("ЗаказКлиентаСсылка", Объект.Ссылка);
			ОбработанныеСтрокиДляЗаписи.Вставить("КоллекцияТоваров", Объект.Товары);
				
			Оповестить("ТТМ_АРМ_ПроцедураРазбиенияСтрок", ОбработанныеСтрокиДляЗаписи);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры