
&НаКлиенте
Перем ДанныеИсходнойСтроки;
&НаКлиенте
Перем ТекСтраница;
&НаКлиенте
Перем ТолькоРезерв;
&НаКлиенте
Перем ЗакрытьФормуОбработки; 
&НаКлиенте
Перем МассивОбрабатываемыхСтрок;     

//Функция возвращает значение ОтборПовариантамОбеспечения (число), соответствующее выбранному/устанавливаемому ВариантуОбеспечения
//Функция УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспечения)

//
//Функция УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,,ВариантОбеспеченияПосле);

&НаКлиенте
Процедура РазвернутьВсеСтрокидерева(Команда)
	
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов";        
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
		Строки1Уровня = ЭтаФорма.ДеревоМатериалов.ПолучитьЭлементы();
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		Строки1Уровня = ЭтаФорма.ДеревоМатериаловРезервирование.ПолучитьЭлементы();
	КонецЕсли;                
	ДанныеТекущейСтроки = Элементы[ИмяДерева].ТекущиеДанные;                  
	ЭтаФорма[ИмяТаблицыИдентификаторов].Очистить();
	НовыйИД = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
	НовыйИД.ТекущаяСтрока = Ложь;//Истина;
	НовыйИД.Номенклатура = ДанныеТекущейСтроки.Номенклатура;
	НовыйИД.ИсходнаяНоменклатура = ДанныеТекущейСтроки.ИсходнаяНоменклатура;
	НовыйИД.ЭтапПроизводства = ДанныеТекущейСтроки.ЭтапПроизводства;
	НовыйИД.Идентификатор = ДанныеТекущейСтроки.ПолучитьИдентификатор();
	Для Стр = 0 по Строки1Уровня.Количество()-1 Цикл 
		ТекСтрока = Строки1Уровня.Получить(Стр);
		Элементы[ИмяДерева].Развернуть(ТекСтрока.ПолучитьИдентификатор()); 
		НоваяСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
		НоваяСтрока.ТекущаяСтрока = Ложь;
		НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
		НоваяСтрока.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
		НоваяСтрока.ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсеСтрокиДерева(Команда)
	
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов";   
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование";  
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	КонецЕсли;     
	
	ДанныеТекущейСтроки = Элементы[ИмяДерева].ТекущиеДанные; 
	НовыйИД = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
	НовыйИД.ТекущаяСтрока = Истина;
	НовыйИД.Номенклатура = ДанныеТекущейСтроки.Номенклатура;
	НовыйИД.ИсходнаяНоменклатура = ДанныеТекущейСтроки.ИсходнаяНоменклатура;
	НовыйИД.ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
	НовыйИД.Идентификатор = ДанныеТекущейСтроки.ПолучитьИдентификатор();
	
	Строки1Уровня = ЭтаФорма[ИмяДерева].ПолучитьЭлементы();
	Для Стр = 0 по Строки1Уровня.Количество()-1 Цикл 
		ТекСтрока = Строки1Уровня.Получить(Стр);
		Элементы[ИмяДерева].Свернуть(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтапыНаСервере(перемЭтапы,Списание); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК Ссылка,
	               |	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_КоличествоПроизведено
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Организация = &Организация ";
	Если Списание Тогда Запрос.Текст = Запрос.Текст + "
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Произведено ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ       
				   |	1 КАК НомерСтроки,
	               |	ИСТИНА КАК Обрабатывать,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус КАК Статус,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК ЭтапПроизводства,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация КАК Спецификация
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоПроизведено КАК ВТ_КоличествоПроизведено
	               |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Ссылка = ВТ_КоличествоПроизведено.Ссылка";                       
	Если Списание Тогда Запрос.Текст = Запрос.Текст + "			   
	               |			И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокПлан = ВТ_КоличествоПроизведено.Количество";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Организация = &Организация
	               
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)";
	               
	Если Списание Тогда 
		Запрос.Текст = Запрос.Текст + "
		            |	И ЭтапПроизводства2_2ВыходныеИзделия.Произведено";
					//|	И НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ДатаПроизводства, ДЕНЬ) = &Период
					//|	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
					//|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт = 0.5";  
		Если ЗначениеЗаполнено(Объект.Номенклатура)  Тогда //или ЗначениеЗаполнено(Объект.НоменклатураРезервирование)
			Запрос.Текст = Запрос.Текст + "
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура";
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ПериодОтгрузки)  Тогда //или ЗначениеЗаполнено(Объект.НоменклатураРезервирование)
			Запрос.Текст = Запрос.Текст + "
	               |	И НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ДатаПроизводства, ДЕНЬ) = &Период";
		КонецЕсли;
	Иначе 
		Запрос.Текст = Запрос.Текст + "
					//|	И НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ФактическоеНачалоЭтапа, ДЕНЬ) = &Период
		           	|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт <= 0.5";
		Если ЗначениеЗаполнено(Объект.НоменклатураРезервирование)  Тогда 
			Запрос.Текст = Запрос.Текст + "
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура";
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ДатаЗапуска)  Тогда //или ЗначениеЗаполнено(Объект.НоменклатураРезервирование)
			Запрос.Текст = Запрос.Текст + "
	               |	И НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ФактическоеНачалоЭтапа, ДЕНЬ) = &Период";
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.НомерЗаказа) или ЗначениеЗаполнено(Объект.НомерЗаказаРезервирование) Тогда 
		Запрос.Текст = Запрос.Текст + "	
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Наименование ПОДОБНО ""%"" + &НомерЗаказа + ""%""";
	КонецЕсли;
	
	//Запрос.УстановитьПараметр("ТабЭтапы",перемЭтапы);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Если Не Списание Тогда 
		Запрос.УстановитьПараметр("Период",?(ЗначениеЗаполнено(Объект.ДатаЗапуска),Объект.ДатаЗапуска,ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("Номенклатура",Объект.НоменклатураРезервирование);
		Запрос.УстановитьПараметр("НомерЗаказа",Объект.НомерЗаказаРезервирование);
	Иначе 
		Запрос.УстановитьПараметр("Период",?(ЗначениеЗаполнено(Объект.ПериодОтгрузки),Объект.ПериодОтгрузки,ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("Номенклатура",Объект.Номенклатура);
		Запрос.УстановитьПараметр("НомерЗаказа",Объект.НомерЗаказа);
	КонецЕсли;
		
	ТабЭтапы = Запрос.Выполнить().Выгрузить();  
	
	//Заполним номера строк
	Счетчик = 0;
	Для Каждого СтрЭтап из ТабЭтапы Цикл 
		Счетчик = Счетчик + 1;
		СтрЭтап.НомерСтроки = Счетчик;
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ТабЭтапы,перемЭтапы);
	Если Списание Тогда 
		КопироватьДанныеФормы(перемЭтапы,Этапы);
	Иначе 
		КопироватьДанныеФормы(перемЭтапы,ЭтапыРезервирование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭтапы(Команда)
	Если ТекСтраница = "Списание" Тогда 
		Списание = Истина;
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		Списание = Ложь;
	КонецЕсли;
		
	ЗаполнитьЭтапыСВопросом(Списание);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭтапыСВопросом(Списание)
	
	ДопПараметры = Новый Структура("Списание",Списание);
	ОповещениеПослеВопроса = Новый ОписаниеОповещения("ЗаполнитьЭтапыПродолжение",ЭтаФорма,ДопПараметры);
	ПоказатьВопрос(ОповещениеПослеВопроса,"Обновить список этапов?",РежимДиалогаВопрос.ДаНет,);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭтапыПродолжение(Результат, ДопПараметры)  Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Если ДопПараметры.Списание Тогда 
			Этапы.Очистить();	
			ПеремЭтапы = Этапы;
			
			//КопироватьДанныеФормы(Этапы,перемЭтапы);
			ЗаполнитьЭтапыНаСервере(ПеремЭтапы, Истина);
		Иначе 
			ЭтапыРезервирование.Очистить();
			ПеремЭтапыР = ЭтапыРезервирование;
			//КопироватьДанныеФормы(Этапы,перемЭтапы);
			ЗаполнитьЭтапыНаСервере(ПеремЭтапыР, Ложь);
		КонецЕсли;
		
		
	КонецЕсли;                                              
	//УстановитьУсловноеОформлениеДереваМатериалов(
	//УстановитьУсловноеОформлениеСпискаЭтаповРезервирование();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаказаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Текст = СокрЛП(Текст);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделениеВсехЭтапов(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "Списание" Тогда 
		Для Каждого СтрокаТЧ из Этапы Цикл 
			СтрокаТЧ.Обрабатывать = Ложь;
		КонецЦикла;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "Резервирование"  Тогда 
		Для Каждого СтрокаТЧ из ЭтапыРезервирование Цикл 
			СтрокаТЧ.Обрабатывать = Ложь;
		КонецЦикла;
	КонецЕсли;
	//КопироватьДанныеФормы(Этапы, Этапы);
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "Списание" или ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
		//Переход на списание
		ТекСтраница = "Списание";
		ИмяДерева = Элементы.ДеревоМатериалов.Имя;                         
		Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
			СтраницаМатериалыРезервированиеАктивна = Истина;
		Иначе 
			СтраницаМатериалыРезервированиеАктивна = Ложь;
		КонецЕсли;
		Если ЕстьНесохраненныеДанныеРезервирования и СтраницаМатериалыРезервированиеАктивна Тогда  
			ДопПараметры = Новый Структура("ВернутьсяНаСтраницуМатериаловСписания", Ложь);
			ОповещениеОПродолженииПерехода = Новый ОписаниеОповещения("ПереходНаСПисаниеРезервированиеПродолжение",ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеОПродолженииПерехода, "Есть несохраненные данные Списания, при переходе на Резервирование ни будут утеряны, продолжить?",РежимДиалогаВопрос.ДаНет,10) 
		КонецЕсли;
		//Элементы.СтраницыРезервирования.ТекущаяСтраница = Элементы.Найти("Этапы");
		//Если Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы"  Тогда 
		//	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
		//КонецЕсли;
	ИначеЕсли ТекущаяСтраница.Имя = "Резервирование" или ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда   
		//переход на резервирование
		ТекСтраница = "Резервирование";
		ИмяДерева = Элементы.ДеревоМатериаловРезервирование.Имя;    
		Если Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
			СтраницаМатериалыАктивна = Истина;
		Иначе 
			СтраницаМатериалыАктивна = Ложь;
		КонецЕсли;
		Если ЕстьНесохраненныеДанныеСписания и СтраницаМатериалыАктивна Тогда
			ДопПараметры = Новый Структура("ВернутьсяНаСтраницуМатериаловСписания", Истина);
			ОповещениеОПродолженииПерехода = Новый ОписаниеОповещения("ПереходНаСПисаниеРезервированиеПродолжение",ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеОПродолженииПерехода, "Есть несохраненные данные Списания, при переходе на Резервирование ни будут утеряны, продолжить?",РежимДиалогаВопрос.ДаНет,300) 
		КонецЕсли;
		//Элементы.СтраницыРезервирования.ТекущаяСтраница = Элементы.Найти("ЭтапыРезервирования");  
		
		//Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования"  Тогда 
		//	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
		//КонецЕсли;
	КонецЕсли; 
	АдресХранилищаНормативы = "";
	//Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаМатериалы" или
	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПереходНаСПисаниеРезервированиеПродолжение(Результат, ДопПараметры) Экспорт    
	
	Если ДопПараметры.ВернутьсяНаСтраницуМатериаловСписания Тогда 
		//Переход со Списания на Резервирвоание // Возврат на страницу Списание материалов
		Если Результат = КодВозвратаДиалога.Нет Тогда 
			//Отменить переход
			Элементы.Страницы.ТекущаяСтраница = Элементы.Найти("Списание"); // "СтраницаМатериалы"
		Иначе    
			//Переход на страницу Этапы раздела Резервирования
			Элементы.СтраницыРезервирования.ТекущаяСтраница = Элементы.Найти("ЭтапыРезервирования");
			ПеремЭтапы = ЭтапыРезервирование;
			Этапы.Очистить(); 
			Объект.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"); 
			ЗаполнитьЭтапыНаСервере(ПеремЭтапы, Ложь);
			ИдентификаторыРаскрытыхСтрокДереваМатериалов.Очистить();
		КонецЕсли;
	Иначе            
		//Переход с Резервирвоания на Списание //Возврат к резервированию материалов
		Если Результат = КодВозвратаДиалога.Нет Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.Найти("Резервирование"); // "МатериалыРезервирования"
		Иначе
			//Переход на страницу Этапы раздела Списание
			Элементы.СтраницыСписания.ТекущаяСтраница = Элементы.Найти("СтраницаЭтапы");  
			ПеремЭтапы = Этапы;
			ЭтапыРезервирование.Очистить();   
			Объект.НоменклатураРезервирование = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			ЗаполнитьЭтапыНаСервере(ПеремЭтапы, Истина);
			ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Очистить();
		КонецЕсли;
	КонецЕсли;        
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, ПоЭтапам = Ложь, ДанныеТекущейСтроки = Неопределено)
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "Списание" Тогда 
		Списание = Истина;
		Если Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании и ЗначениеЗаполнено(Объект.ДатаОстатковДляСписания) Тогда 
			ДатаОстатков = Объект.ДатаОстатковДляСписания;
		ИначеЕсли Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании и ЗначениеЗаполнено(Объект.ДатаОстатковДляСписания) Тогда 
			Если Месяц(Объект.ПериодОтгрузки) <> Месяц(Объект.ДатаОстатковДляСписания) Тогда 
				ДатаОстатков = КонецМесяца(Объект.ПериодОтгрузки);
			КонецЕсли;
		ИначеЕсли Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании и не ЗначениеЗаполнено(Объект.ДатаОстатковДляСписания) Тогда 
			Если Месяц(Объект.ПериодОтгрузки) <> Месяц(ТекущаяДатаСеанса()) Тогда 
				ДатаОстатков = КонецМесяца(Объект.ПериодОтгрузки);
			КонецЕсли;
		Иначе 
			ДатаОстатков = Объект.ПериодОтгрузки; //?(ЗначениеЗаполнено(Объект.ПериодОтгрузки), Объект.ПериодОтгрузки, ТекущаяДатаСеанса());
		КонецЕсли; 
		ДатаОтгрузкиМатериалов = Объект.ПериодОтгрузки;
		ОтборПоВариантамОбеспечения = ОтборВариантОбеспечения;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "Резервирование" Тогда 
		Списание = Ложь;
		ДатаОстатков = ТекущаяДатаСеанса(); //Остатки для резервирования всегда на текущую дату!!!
		ДатаОтгрузкиМатериалов = ТекущаяДатаСеанса();
		ОтборПоВариантамОбеспечения = ОтборВариантОбеспеченияРезервирование;
	КонецЕсли;    
	
	///////////////////////////////////////////////////////////////////////////  
	
	//ПереченьДанныхРС = 
	//	?(ПереченьДанных.Свойство("ОбеспечениеМатериаламиИРаботами"), ",МатериалыИУслуги,ВходящиеИзделия", "")
	//	+ ?(ПереченьДанных.Свойство("ВыходныеИзделия"), ",ВыходныеИзделия", "")
	//	+ ?(ПереченьДанных.Свойство("ПобочныеИзделия"), ",ВозвратныеОтходы", "")
	//	+ ?(ПереченьДанных.Свойство("Трудозатраты"), ",Трудозатраты", "")
	//	+ ?(ПереченьДанных.Свойство("ВидыРабочихЦентров"), ",ВидыРабочихЦентров,АльтернативныеВидыРабочихЦентров,Этапы", "");
	//ПереченьДанныхРС = Прав(ПереченьДанныхРС, СтрДлина(ПереченьДанныхРС)-1);
	
	////////////////////////////////////////////////////////////////////////////
	
	
	//ДанныеСпецификации = ПолучитьНормативыПоСпецификации(Ложь, "МатериалыИУслуги,ВходящиеИзделия,Трудозатраты",);  
	//
	//Если ЭтоАдресВременногоХранилища(АдресХранилищаНормативы) Тогда
	//	
	//	Результат = ПолучитьИзВременногоХранилища(АдресХранилищаНормативы);
	//	Возврат Результат;
	//	
	//КонецЕсли;
	//
	//Результат = Новый Структура();
	//
	////ДанныеСпецификации = ПолучитьНормативыПоСпецификации(Истина, "МатериалыИУслуги,ВходящиеИзделия,Трудозатраты");
	//
	//Если ДанныеСпецификации <> Неопределено Тогда
	//	
	//	Таблица = ДанныеСпецификации.МатериалыИУслуги.Скопировать(, "Номенклатура,Характеристика,Упаковка,ДанныеУпаковки,КоличествоУпаковок"); // ТаблицаЗначений - 
	//	Таблица.Свернуть("Номенклатура,Характеристика,Упаковка,ДанныеУпаковки", "КоличествоУпаковок");
	//	Результат.Вставить("ОбеспечениеМатериаламиИРаботами", Таблица);
	//	
	//	Таблица = ДанныеСпецификации.Трудозатраты.Скопировать(, "ВидРабот,Количество"); // ТаблицаЗначений - 
	//	Таблица.Свернуть("ВидРабот", "Количество");
	//	Результат.Вставить("Трудозатраты", Таблица);
	//	
	//КонецЕсли;
	//
	//АдресХранилищаНормативы = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	

	//////////////////////////////////////////////////////////////////////////
	
	Если ПоЭтапам Тогда 
		//Получим все строки для записи в регистр без учета отборов
		//РезультатЗапроса = ПолучитьМатериалыПоДаннымЭтаповДляРегистра(ДатаОстатков,Объект.Склад,Списание);
		РезультатЗапроса = ПолучитьМатериалыПоДаннымЭтаповДляРегистра(ДатаОстатков,Объект.Склад,Списание);
		ЗаписатьДанныеРезервированиеСписаниеМатериаловВРегистрСведений(РезультатЗапроса,ДатаОстатков,Списание, ДатаОтгрузкиМатериалов);
	//	ДанныеРегистра   = ПолучитьМатериалыПоРегистру(ОтборПоВариантамОбеспечения, ДатаОстатков, Объект.Склад, Списание);
	//Иначе 
	//	ДанныеРегистра   = ПолучитьМатериалыПоРегистру(ОтборПоВариантамОбеспечения, ДатаОстатков, Объект.Склад, Списание);
	КонецЕсли;
	ДанныеРегистра   = ПолучитьМатериалыПоРегистру(ОтборПоВариантамОбеспечения, ДатаОстатков, Объект.Склад, Списание);
	ЗаполнитьДеревоМатериаловпоРегистру(ДанныеРегистра, ИмяДерева);  
	
	ОбновитьИдентификаторыСтрокДерева(ИмяДерева, ДанныеТекущейСтроки);
	
	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
	
	//ЗаполнитьТЧМатериаловПоРегистру(ДанныеРегистра, ИмяТЧ);
	//УстановитьУсловноеОформлениеТЧМатериалов(ИмяТЧ);
	
КонецПроцедуры           

&НаСервере
Функция ПолучитьНормативыПоСпецификации(ПолучатьМатериалыПоТребованию, Знач ПереченьДанных = Неопределено, ЭтапОбъект1)
	
	ДанныеПартииПроизводстваКопия = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеПартииПроизводства, Ложь);
	КоэффициентПлан = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки
			(ЭтапОбъект1.УпаковкаПлан, Объект.Номенклатура);
	КоличествоПлан = ЭтапОбъект1.КоличествоУпаковокПлан * КоэффициентПлан;
	ДанныеПартииПроизводстваКопия.Количество = КоличествоПлан;	//КоличествоПлан;
	
	Возврат Документы.ЭтапПроизводства2_2.ПолучитьНормативыПоСпецификации(
		ДанныеПартииПроизводстваКопия,
		ПолучатьМатериалыПоТребованию,
		ПереченьДанных);//,
		//Новый Структура("Этап", ЭтапОбъект1)); //Объект.Этап));
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧМатериалыПоРегистру (РезультатЗапроса, ИмяТЧ)
	ТабМАтериалы = РезультатЗапроса.Выбрать();//Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТЗМатериалы = РеквизитФормыВЗначение(ИмяТЧ,Тип("ТаблицаЗначений")); //"ДеревоМатериалов"
	ТЗМатериалы.Очистить();
		
	Для Каждого СтрНоменклатура из ТЗМатериалы Цикл 
		СтрНом = ТЗМатериалы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНом,СтрНоменклатура);
		СтрНом.Спецификация = СтрНоменклатура.СпецификацияЭтапа;
		СтрНом.Уровень = 1;
		СтрНом.КонтрольОстатка = СтрНом.Остаток -СтрНом.Обеспечить - СтрНом.Расход;
		СтрНом.ОстатокДляУО = СтрНом.Остаток - СтрНом.Обеспечить - СтрНом.Расход; // - СтрНом.КОбеспечению;
		РасходПоНоменклатуре = СтрНом.Расход;
		
		Для Каждого СтрЭтап из СтрНоменклатура.Строки Цикл 
			СтрДет = СтрНом.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДет,СтрЭтап);
			СтрДет.Спецификация = СтрЭтап.СпецификацияЭтапа;
			СтрДет.КонтрольОстатка = СтрДет.Остаток - СтрДет.Обеспечить - СтрДет.Расход;
			СтрДет.ОстатокДляУО = СтрДет.Остаток - СтрДет.Обеспечить - СтрДет.Расход; // - СтрДет.КОбеспечению;
		КонецЦикла;                                                                                             
	КонецЦикла;
	ЗначениеВРеквизитФормы(ТЗМатериалы,ИмяТЧ);
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьДеревоМатериаловпоРегистру (РезультатЗапроса, ИмяДерева)     
	
	Если ИмяДерева = "ДеревоМатериалов" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	ИначеЕсли ИмяДерева = "ДеревоМатериаловРезервирование" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	КонецЕсли;                                       
	//СтруктураПоиска = Новый Структура("ТекущаяСтрока");
	//МассивТекСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
	//ТекСтрока = МассивТекСтрока[0]; 
	//Если не ЗначениеЗаполнено(ТекСтрока.ЭтапПроизводства) Тогда 
	//	ТекСтрокаУровень1 = Истина;
	//Иначе 
	//	ТекСтрокаУровень1 = Ложь;
	//КонецЕсли;
	
	//ТЗ_ИД_Дерева = РеквизитФормыВЗначение(ИмяТаблицыИдентификаторов,Тип("ТаблицаЗначений"));
	ТабМАтериалы = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДерМатериалов = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений")); //"ДеревоМатериалов"
	ДерМатериалов.Строки.Очистить();     
	
	
	//СтруктураПоискаИдентификатора = Новый Структура("Номенклатура, ЭтапПроизводства, ");
	
	НомерСтрокиНоменклатуры = 0;
	Для Каждого СтрНоменклатура из ТабМАтериалы.Строки Цикл 
		НомерСтрокиНоменклатуры = НомерСтрокиНоменклатуры + 1;
		СтрНом = ДерМатериалов.Строки.Добавить();             
		СтрНом.НомерСтрокиНоменклатуры = НомерСтрокиНоменклатуры;
		ЗаполнитьЗначенияСвойств(СтрНом,СтрНоменклатура); //Проверить значение ИсходнойНоменклатуры!!!!!!!
		СтрНом.Спецификация = СтрНоменклатура.СпецификацияЭтапа;
		СтрНом.Уровень = 1;        
		СтрНом.Расход = СтрНом.Зарезервировать + СтрНом.Отгрузить;
		СтрНом.КонтрольОстатка = СтрНом.Остаток - СтрНом.Обеспечить - СтрНом.Расход;
		СтрНом.ОстатокДляУО = СтрНом.Остаток - СтрНом.Обеспечить - СтрНом.Расход; // - СтрНом.КОбеспечению; 
		РасходПоНоменклатуре = СтрНом.Расход;    
		
		///////////////////////////////
		//Обновим идентификатор строки в ТаблицеИдентификаторов
		Если СтрНом.Номенклатура = ТекущаяНоменклатура Тогда                    
			СтруктураПоиска = Новый Структура("ТекущаяСтрока",Истина);
			МассивИДТекСтроки = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
			Если МассивИДТекСтроки.Количество() = 1 Тогда 
				МассивИДТекСтроки[0].Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
			ИначеЕсли МассивИДТекСтроки.Количество() = 0 Тогда 
				ИДТекСтроки = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
				ИДТекСтроки.Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
				ИДТекСтроки.Номенклатура = ТекущаяНоменклатура;
				ИДТекСтроки.ТекущаяСтрока = Истина;
				ИДТекСтроки.ИсходнаяНоменклатура = СтрНом.ИсходнаяНоменклатура;
				ИДТекСтроки.НомерСтрокиНоменклатуры = НомерСтрокиНоменклатуры;
			КонецЕсли;
		КонецЕсли;
		//Если ТекСтрокаУровень1 Тогда 
		//	Если ТекСтрока.ИсходнаяНоменклатура = СтрНом.ИсходнаяНоменклатура 
		/////////////////////////////////////   
		
		Для Каждого СтрЭтап из СтрНоменклатура.Строки Цикл 
			СтрДет = СтрНом.Строки.Добавить(); 
			ЗаполнитьЗначенияСвойств(СтрДет,СтрЭтап);             //Здесь ИсходнаяНоменклатура заполнена!!!
			СтрНом.НомерСтрокиНоменклатуры = НомерСтрокиНоменклатуры;
			СтрДет.Спецификация = СтрЭтап.СпецификацияЭтапа;
			СтрДет.КонтрольОстатка = СтрДет.Остаток - СтрДет.Обеспечить - СтрДет.Расход; 
			СтрДет.ОстатокДляУО = СтрДет.Остаток - СтрДет.Обеспечить - СтрДет.Расход; // - СтрДет.КОбеспечению; 
		КонецЦикла;                                                                                             
	КонецЦикла;
 	ЗначениеВРеквизитФормы(ДерМатериалов,ИмяДерева);    
	
	//Очистим старые идентификаторы строк
	//Для Каждого СтрТабИД из ТЗ_ИД_Дерева Цикл 
	//	СтрТабИД.Идентификатор = Неопределено;
	//КонецЦикла;
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева, );
	
	//ЗначениеВРеквизитФормы(ТЗ_ИД_Дерева, ИмяТаблицыИдентификаторов);
	
КонецПроцедуры     

&НаСервере
Процедура ОбновитьИдентификаторыСтрокДерева(ИмяДерева, ДанныеТекущейСтроки = Неопределено)
	
	СтрокиДерева = ЭтаФорма[ИмяДерева].ПолучитьЭлементы();
	
	//Очистим старые значения идентификаторов      
	Если ИмяДерева = "ДеревоМатериалов" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	ИначеЕсли ИмяДерева = "ДеревоМатериаловРезервирование" Тогда
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование"; 
	КонецЕсли; 
	
	Если ЭтаФорма[ИмяТаблицыИдентификаторов].Количество() = 0 Тогда 
		Возврат; //Ничего обновлять не надо. Нет ни одной раскрытой строки и ни одна строка не выделена
	КонецЕсли;
		
	СтруктураПоискаТекСтроки = Новый Структура("ТекущаяСтрока",Истина);
	МассивТекСтроки = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоискаТекСтроки);
	КоличествоТекущихСтрок = МассивТекСтроки.Количество();
	Если КоличествоТекущихСтрок > 1 Тогда 
		ИскатьТекущуюСтроку = Истина;
		Сообщить("Необходимо исправить запись в таблицу Идентификаторов. Сохранено несколько текущих строк.");
	ИначеЕсли КоличествоТекущихСтрок = 1 Тогда
		ИскатьТекущуюСтроку = Истина;
	Иначе 
		ИскатьТекущуюСтроку = Ложь;
	КонецЕсли;
	Если ИскатьТекущуюСтроку Тогда // и ТекСтрока = Неопределено Тогда 
		ТекСтрока = МассивТекСтроки[0];
	КонецЕсли;

	НашлиТекущуюСтроку = Ложь; 
	ИДТекущейСтроки = Неопределено;
	Для Каждого СтрокаДерева из СтрокиДерева Цикл 
		СтруктураПоиска = Новый Структура;         
		СтруктураПоиска.Вставить("Номенклатура", СтрокаДерева.Номенклатура);
		МассивНайденныхСтрок = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
		КоличествоНайденныхСтрок = МассивНайденныхСтрок.Количество();
		
		Если КоличествоНайденныхСтрок = 1 Тогда 
			СтрокаТаблицы = МассивНайденныхСтрок[0];
			СтрокаТаблицы.Идентификатор = СтрокаДерева.ПолучитьИдентификатор(); 
			Если СтрокаТаблицы.ТекущаяСтрока = Истина Тогда 
				ИскатьТекущуюСтроку = Ложь;
			КонецЕсли;
		ИначеЕсли КоличествоНайденныхСтрок > 1 Тогда 
			Для Каждого СтрокаТаблицы из МассивНайденныхСтрок Цикл 
				СтрокаТаблицы.Идентификатор = СтрокаДерева.ПолучитьИдентификатор();   
				Если СтрокаТаблицы.ТекущаяСтрока = Истина Тогда 
					ИскатьТекущуюСтроку = Ложь;
				КонецЕсли;
			КонецЦикла;
		Иначе 
			Продолжить;
		КонецЕсли;
		Если ИскатьТекущуюСтроку и не НашлиТекущуюСтроку Тогда   
			//Если выбрана строка 1 уровня         
			Если СтрокаДерева.Номенклатура = ТекСтрока.Номенклатура Тогда //СтрокаДерева.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура Тогда // 
				Если не ЗначениеЗаполнено(ТекСтрока.ЭтапПроизводства) Тогда 
					ТекСтрока.Идентификатор = СтрокаДерева.ПолучитьИдентификатор();
					НашлиТекущуюСтроку = Истина;    
					ИДТекущейСтроки = ТекСтрока.Идентификатор;
				Иначе 
					//выполнить поиск по дочерним строкам
					ДочерниеСтроки = СтрокаДерева.ПолучитьЭлементы();
					Если ДочерниеСтроки.Количество() > 0 Тогда 
						Для Каждого ДочерняяСтрока из ДочерниеСтроки Цикл 
							//ОбновитьИдентификаторыСтрокДерева(СтрокаДерева);
							СтруктураПоиска = Новый Структура;
							СтруктураПоиска.Вставить("Номенклатура", ДочерняяСтрока.Номенклатура);
							СтруктураПоиска.Вставить("ЭтапПроизводства",ДочерняяСтрока.ЭтапПроизводства);
							СтруктураПоиска.Вставить("ТекущаяСтрока",Истина);
							МассивНайденныхСтрок = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
							КоличествоНайденныхСтрок = МассивНайденныхСтрок.Количество();
							
							Если КоличествоНайденныхСтрок = 1 Тогда 
								СтрокаТаблицы = МассивНайденныхСтрок[0];
								СтрокаТаблицы.Идентификатор = ДочерняяСтрока.ПолучитьИдентификатор();  
								НашлиТекущуюСтроку = Истина;     
								ИДТекущейСтроки = СтрокаТаблицы.Идентификатор;
							ИначеЕсли КоличествоНайденныхСтрок > 1 Тогда 
								Для Каждого СтрокаТаблицы из МассивНайденныхСтрок Цикл 
									//СтрокаТаблицы = МассивНайденныхСтрок[0];
									СтрокаТаблицы.Идентификатор = ДочерняяСтрока.ПолучитьИдентификатор(); 
									НашлиТекущуюСтроку = Истина;  
									ИДТекущейСтроки = СтрокаТаблицы.Идентификатор;
									//Сообщить("По номенклатуре "+СтрокаТаблицы.НоменклатураРодитель+" спецификации "+СтрокаТаблицы.Спецификация+" в дереве материалов найдено более 1 строки. Уточните условие поиска");
								КонецЦикла;
							Иначе 
								//Если ничего не нашли, то и обновлять нечего
								Продолжить;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли; 				
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;    
	Элементы[ИмяДерева].ТекущаяСтрока = ИДТекущейСтроки;
	//Удалим строки, которых больше нет в дереве (например после Записи в регистр)
	Для Каждого СтрТабИД из ЭтаФорма[ИмяТаблицыИдентификаторов] Цикл 
		Если СтрТабИД.Идентификатор = Неопределено Тогда 
			ЭтаФорма[ИмяТаблицыИдентификаторов].Удалить(СтрТабИД);
		КонецЕсли;
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Функция ПолучитьМатериалыПоРегистру(ОтборПоВариантамОбеспечения, ДатаОстатков, Склад, Списание)
	
	ТекстЗапросаУсловие = СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа КАК СпецификацияЭтапа
	               |ПОМЕСТИТЬ СпецификацииЭтапов
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |				ТОГДА РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок
	               |			ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок / РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель * РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель
	               |		КОНЕЦ) КАК Норматив,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие
	               |ПОМЕСТИТЬ НормативыпоСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииЭтапов КАК СпецификацииЭтапов
	               |			ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = СпецификацииЭтапов.СпецификацияЭтапа
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Спецификация,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК СсылкаНаНоменклатуру
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	СсылкаНаНоменклатуру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК СсылкаНаНоменклатуру,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ПОМЕСТИТЬ ЗначенияДополнительногоРеквизита
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТ_Номенклатура.СсылкаНаНоменклатуру
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
	               |	РаспределениеЗапасов.Склад КАК Склад,
	               |	РаспределениеЗапасов.ВНаличии КАК ВНаличии,
	               |	РаспределениеЗапасов.Резерв КАК ВРезервеСоСклада,
	               |	0 КАК КОтгрузке
	               |ПОМЕСТИТЬ ВТ_СвободныеОстатки
	               |ИЗ
	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |ГДЕ
	               |	РаспределениеЗапасов.Состояние = &Состояние
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.Характеристика,
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	0,
	               |	0,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвободныеОстатки.Номенклатура КАК Номенклатура,
	               |	ВТ_СвободныеОстатки.Характеристика КАК Характеристика,
	               |	ВТ_СвободныеОстатки.Склад КАК Склад,
	               |	СУММА(ВТ_СвободныеОстатки.ВНаличии) КАК ВНаличии,
	               |	СУММА(ВТ_СвободныеОстатки.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	               |	ВЫБОР
	               |		КОГДА СУММА(ВТ_СвободныеОстатки.ВНаличии) >= СУММА(ВТ_СвободныеОстатки.КОтгрузке)
	               |			ТОГДА СУММА(ВТ_СвободныеОстатки.КОтгрузке)
	               |		ИНАЧЕ СУММА(ВТ_СвободныеОстатки.ВНаличии)
	               |	КОНЕЦ КАК КОтгрузке
	               |ПОМЕСТИТЬ ВТ_СвободныеОстаткиСгруппированные
	               |ИЗ
	               |	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СвободныеОстатки.Номенклатура,
	               |	ВТ_СвободныеОстатки.Склад,
	               |	ВТ_СвободныеОстатки.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства
	               |ПОМЕСТИТЬ ВТ_Этапы
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировано,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отгружено
	               |ПОМЕСТИТЬ ВТ_ОтгруженоИЗарезервированоПоЭтапам
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЭтапПроизводства
	               |			ИЗ
	               |				ВТ_Этапы КАК Т)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеЗапасовДвижения.Номенклатура КАК Номенклатура,
	               |	РаспределениеЗапасовДвижения.Период КАК Период,
	               |	СУММА(РаспределениеЗапасовДвижения.Поступило) КАК Поступило
	               |ПОМЕСТИТЬ ПриходыСледующегоМесяца
	               |ИЗ
	               |	РегистрНакопления.РаспределениеЗапасовДвижения КАК РаспределениеЗапасовДвижения
	               |ГДЕ
	               |	РаспределениеЗапасовДвижения.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
	               |	И РаспределениеЗапасовДвижения.Период >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаОстатков, МЕСЯЦ, 1), МЕСЯЦ)
	               |	И РаспределениеЗапасовДвижения.Склад = &Склад
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаспределениеЗапасовДвижения.Номенклатура,
	               |	РаспределениеЗапасовДвижения.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика КАК Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия КАК Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад КАК Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится КАК Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки КАК КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)) КАК СтатьяКалькуляции,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат КАК ПериодЗатрат,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК СпецификацияЭтапа,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь КАК Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание КАК ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска КАК ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК Количество,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок) КАК КоличествоУпаковок,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
	               |	ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВНаличии, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеСоСклада, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.КОтгрузке, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0) КАК Остаток,
	               |	ЕСТЬNULL(ПриходыСледующегоМесяца.Поступило, 0) КАК Поступило,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |					ИЛИ ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обеспечить,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала КАК КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	1 КАК КоличествоСтрок,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК КоличествоВЭтапе,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Отгрузить,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировать,
	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ВыходноеИзделие,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра КАК ИДСтрокиРегистра,
	               |	ПриходыСледующегоМесяца.Номенклатура КАК Номенклатура1,
	               |	ПриходыСледующегоМесяца.Период КАК Период
	               |ПОМЕСТИТЬ ПредварительныеДанные
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа = ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.ресурсныеСпецификации.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияДополнительногоРеквизита КАК ЗначенияДополнительногоРеквизита
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ЗначенияДополнительногоРеквизита.СсылкаНаНоменклатуру, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвободныеОстаткиСгруппированные КАК ВТ_СвободныеОстаткиСгруппированные
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)))
	               |			И (ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтгруженоИЗарезервированоПоЭтапам КАК ВТ_ОтгруженоИЗарезервированоПоЭтапам
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПриходыСледующегоМесяца КАК ПриходыСледующегоМесяца
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ПриходыСледующегоМесяца.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация,
	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра,
	               |	ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВНаличии, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеСоСклада, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.КОтгрузке, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно,
	               |	ПриходыСледующегоМесяца.Номенклатура,
	               |	ПриходыСледующегоМесяца.Период,
	               |	ЕСТЬNULL(ПриходыСледующегоМесяца.Поступило, 0),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив";
	Запрос.Текст = Запрос.Текст + "
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
	               |	ПредварительныеДанные.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ПредварительныеДанные.Характеристика КАК Характеристика,
	               |	ПредварительныеДанные.Серия КАК Серия,
	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеДанные.Обособленно КАК Обособленно,
	               |	ПредварительныеДанные.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ПредварительныеДанные.Склад КАК Склад,
	               |	ПредварительныеДанные.Производится КАК Производится,
	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
	               |	ПредварительныеДанные.Назначение КАК Назначение,
	               |	ПредварительныеДанные.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ПредварительныеДанные.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ПредварительныеДанные.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ПредварительныеДанные.КодСтроки КАК КодСтроки,
	               |	ПредварительныеДанные.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ПредварительныеДанные.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ПредварительныеДанные.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ПредварительныеДанные.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ПредварительныеДанные.ПериодЗатрат КАК Период,
	               |	ПредварительныеДанные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ПредварительныеДанные.Пользователь КАК Пользователь,
	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеДанные.ЭтоСписание КАК ЭтоСписание,
	               |	ПредварительныеДанные.ДатаЗапуска КАК ДатаЗапуска,
	               |	ПредварительныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПредварительныеДанные.Количество КАК Количество,
	               |	ПредварительныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПредварительныеДанные.Норматив КАК Норматив,
	               |	ПредварительныеДанные.Остаток КАК ОстатокОбщий,
	               |	ПредварительныеДанные.Поступило КАК Поступило,
	               |	ПредварительныеДанные.Остаток - ПредварительныеДанные.Поступило КАК Остаток,
	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоЭтапов,
	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
	               |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	ПредварительныеДанные.ИДСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход
	               |ИЗ
	               |	ПредварительныеДанные КАК ПредварительныеДанные
	               |
				   |ГДЕ %ТекстЗапросаУсловие
				   |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ЭтапПроизводства
	               |ИТОГИ
	               |	МАКСИМУМ(Номенклатура),
	               |	МАКСИМУМ(ИсходнаяНоменклатура),
	               |	МАКСИМУМ(ВариантОбеспечения),
	               |	МАКСИМУМ(Обособленно),
	               |	МАКСИМУМ(Склад),
	               |	МАКСИМУМ(Назначение),
	               |	СУММА(Норматив),
	               |	СРЕДНЕЕ(ОстатокОбщий),
	               |	СРЕДНЕЕ(Поступило),
	               |	СРЕДНЕЕ(Остаток),
	               |	СУММА(Обеспечить),
	               |	СРЕДНЕЕ(ОтборПоВариантамОбеспечения),
	               |	МАКСИМУМ(ВидНоменклатуры),
	               |	СУММА(КоличествоСтрок),
	               |	СУММА(Отгрузить),
	               |	СУММА(Зарезервировать),
	               |	СУММА(Расход)
	               |ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаОстатков",КонецДня(ДатаОстатков));
	Запрос.УстановитьПараметр("Свойство",Объект.ДР_КатегорияМатериала);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь()); 
	Запрос.УстановитьПараметр("ЭтоСписание", Списание);
	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе);
	Запрос.УстановитьПараметр("Склад", объект.Склад);
	
	Если ТекстЗапросаУсловие <> "" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ТекстЗапросаУсловие",ТекстЗапросаУсловие);
		Если Списание тогда //и ЗначениеЗаполнено(ОтборКатегорияМатериала) Тогда 
			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериала);
		Иначе //Если не Списание и ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) Тогда  
			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериалаРезервирование);
		КонецЕсли;
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ %ТекстЗапросаУсловие","");
	КонецЕсли;
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеНоменклатураПриИзменении(Элемент)
	
	ИмяДерева = Элемент.Родитель.Имя;
	ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;	
	 
	Если ИмяДерева = "ДеревоМатериалов" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
		ЭтоСписание = Истина;
	ИначеЕсли ИмяДерева = "ДеревоМатериаловРезервирование" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		ЭтоСписание = Ложь;
	КонецЕсли;
	//ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
	
	//Перезапишем номенклатуру в строке таблицы ИдентификаторыРаскрытыхСтрокДерева
	//так как номенклатура изменилась      
	
	ДанныеТекСтроки = Элемент.Родитель.ТекущиеДанные;     
	ТекущаяНоменклатура = ДанныеТекСтроки.Номенклатура; 
	СтруктураПоиска = Новый Структура("ТекущаяСтрока", Истина);
	МассивТекСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска); 
	Если МассивТекСтрока.Количество() = 1 Тогда 
		МассивТекСтрока[0].Номенклатура = ДанныеТекСтроки.Номенклатура;
		МассивТекСтрока[0].НомерСтрокиНоменклатуры = ДанныеТекСтроки.НомерСтрокиНоменклатуры;
	Иначе 
		НовыйИДТекСТроки = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
		НовыйИДТекСТроки.ТекущаяСтрока = Истина;
		НовыйИДТекСТроки.Номенклатура = ДанныеТекСтроки.Номенклатура;
	    НовыйИДТекСТроки.НомерСтрокиНоменклатуры = ДанныеТекСтроки.НомерСтрокиНоменклатуры;  
		НовыйИДТекСТроки.Идентификатор = Элемент.Родитель.ТекущаяСтрока;
		Если ДанныеТекСтроки.Уровень <> 1 Тогда 
			НовыйИДТекСТроки.ЭтапПроизводства = ДанныеТекСтроки.ЭтапПроизводства;    
		Иначе 
			НовыйИДТекСТроки.ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	//!!!!!!ЗаменаМатералаВДереве(ИмяДерева, ИДСтрокиДерева, ЭтоСписание, ДанныеИсходнойСтроки);
	
	СтруктураТекущейСтроки = Новый Структура("Номенклатура,ЭтапПроизводства,ВариантОбеспечения,Спецификация,Склад,СтатьяКалькуляции, СпецификацияЭтапа, КатегорияМатериала, ВыходноеИзделие, КлючСвязиСпецификация");  
	ЗаполнитьЗначенияСвойств(СтруктураТекущейСтроки,ДанныеСтроки);
	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
	МассивСтруктурОбрабатываемыхСтрок.Добавить(СтруктураТекущейСтроки); 
	НоваяСтруктураТекущейСтроки = Новый Структура("Номенклатура,ЭтапПроизводства,ВариантОбеспечения,Спецификация,Склад,СтатьяКалькуляции, СпецификацияЭтапа, КатегорияМатериала, ВыходноеИзделие, КлючСвязиСпецификация");
	ЗаполнитьЗначенияСвойств(НоваяСтруктураТекущейСтроки,ДанныеТекСтроки);
	
	ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок,НоваяСтруктураТекущейСтроки,ЭтоСписание); 
	
	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
	
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь, НоваяСтруктураТекущейСтроки);
	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
	
	ВосстановитьСостояниеДерева(ИмяДерева); 
	
КонецПроцедуры

 &НаКлиенте
Процедура ДеревоМатериаловМатериалПриИзменении(Элемент)
	
	ИмяДерева = Элемент.Родитель.Имя;
	ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериалов;
	//??ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,"ИдентификаторыРаскрытыхСтрокДереваМатериалов");
	//НоваяНоменклатура = МатериалПриИзменении();   
	Если ИмяДерева = "ДеревоМатериалов" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
		ЭтоСписание = Истина;
	ИначеЕсли ИмяДерева = "ДеревоМатериаловРезервирование" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		ЭтоСписание = Ложь;
	КонецЕсли;
	//ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,"ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование");
	
	//Перезапишем номенклатуру в строке таблицы ИдентификаторыРаскрытыхСтрокДерева
	//так как номенклатура изменилась      
	ДанныеТекСтроки = Элемент.Родитель.ТекущиеДанные;     
	ТекущаяНоменклатура = ДанныеТекСтроки.Номенклатура; 
	СтруктураПоиска = Новый Структура("ТекущаяСтрока", Истина);
	МассивТекСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска); 
	Если МассивТекСтрока.Количество() = 1 Тогда 
		МассивТекСтрока[0].Номенклатура = ДанныеТекСтроки.Номенклатура;
		МассивТекСтрока[0].НомерСтрокиНоменклатуры = ДанныеТекСтроки.НомерСтрокиНоменклатуры;
	Иначе 
		НовыйИДТекСТроки = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
		НовыйИДТекСТроки.ТекущаяСтрока = Истина;
		НовыйИДТекСТроки.Номенклатура = ДанныеТекСтроки.Номенклатура;
	    НовыйИДТекСТроки.НомерСтрокиНоменклатуры = ДанныеТекСтроки.НомерСтрокиНоменклатуры;  
		НовыйИДТекСТроки.Идентификатор = Элемент.Родитель.ТекущаяСтрока;
		Если ДанныеТекСтроки.Уровень <> 1 Тогда 
			НовыйИДТекСТроки.ЭтапПроизводства = ДанныеТекСтроки.ЭтапПроизводства;    
		Иначе 
			НовыйИДТекСТроки.ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	////////////////////////////////////////////////////////
	СтруктураТекущейСтроки = Новый Структура("Номенклатура,ЭтапПроизводства,ВариантОбеспечения,Спецификация,Склад,СтатьяКалькуляции, СпецификацияЭтапа, КатегорияМатериала, ВыходноеИзделие");  
	ЗаполнитьЗначенияСвойств(СтруктураТекущейСтроки,ДанныеСтроки);
	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
	МассивСтруктурОбрабатываемыхСтрок.Добавить(СтруктураТекущейСтроки); 
	НоваяСтруктураТекущейСтроки = Новый Структура("Номенклатура,ЭтапПроизводства,ВариантОбеспечения,Спецификация,Склад,СтатьяКалькуляции, СпецификацияЭтапа, КатегорияМатериала, ВыходноеИзделие");
	ЗаполнитьЗначенияСвойств(НоваяСтруктураТекущейСтроки,ДанныеТекСтроки);
	
	ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок,НоваяСтруктураТекущейСтроки,ЭтоСписание); 
	
	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
	
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь, НоваяСтруктураТекущейСтроки);
	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
	
	ВосстановитьСостояниеДерева(ИмяДерева);
	
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
	//ВосстановитьСостояниеДерева(ИмяДерева);
	
КонецПроцедуры      


//** Нормативы **//
#Область Нормативы

&НаСервере
Функция ПолучитьНормативыИзВременногоХранилища(Этап)

	Если ЭтоАдресВременногоХранилища(АдресХранилищаНормативы) Тогда
		
		Результат = ПолучитьИзВременногоХранилища(АдресХранилищаНормативы);
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Структура();
	
	ДанныеСпецификации = ПолучитьНормативыПоСпецификации(Истина, "МатериалыИУслуги,ВходящиеИзделия,Трудозатраты",Этап);
	
	Если ДанныеСпецификации <> Неопределено Тогда
		
		Таблица = ДанныеСпецификации.МатериалыИУслуги.Скопировать(, "Номенклатура,Характеристика,Упаковка,ДанныеУпаковки,КоличествоУпаковок"); // ТаблицаЗначений - 
		Таблица.Свернуть("Номенклатура,Характеристика,Упаковка,ДанныеУпаковки", "КоличествоУпаковок");
		Результат.Вставить("ОбеспечениеМатериаламиИРаботами", Таблица);
		
		Таблица = ДанныеСпецификации.Трудозатраты.Скопировать(, "ВидРабот,Количество"); // ТаблицаЗначений - 
		Таблица.Свернуть("ВидРабот", "Количество");
		Результат.Вставить("Трудозатраты", Таблица);
		
	КонецЕсли;
	
	АдресХранилищаНормативы = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти
//**/////////////////**//

&НаКлиенте
Процедура ВосстановитьСостояниеДерева(ИмяДерева)
	
	//ЭтаФорма[ИияДерева].Сортировать("ТекущаяСтрока возр");
	//Элементы[ИмяДерева].Сортировать("ТекущаяСтрока возр");                 
	Если ТекСтраница = "Списание" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование"
	КонецЕсли;
	//ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Сортировать("ТекущаяСтрока возр");
	///ЭтаФорма[ИмяТаблицыИдентификаторов].Сортировать("ТекущаяСтрока возр");
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого СтрТаб из ЭтаФорма[ИмяТаблицыИдентификаторов] Цикл 
		Если ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(СтрТаб.Идентификатор) <> Неопределено Тогда
			Если СтрТаб.ТекущаяСтрока = Ложь Тогда 
			   Элементы[ИмяДерева].Развернуть(СтрТаб.Идентификатор);
			Иначе 
				Элементы[ИмяДерева].ТекущаяСтрока = СтрТаб.Идентификатор;
			КонецЕсли;
		Иначе 
			//удалим идентификатор из таблицы, так как строки с таким идентификатором больше нет в дереве
			МассивУдаляемыхСтрок.Добавить(СтрТаб);
		КонецЕсли;
	КонецЦикла;
	Для Каждого УдаляемаяСтрока из МассивУдаляемыхСтрок Цикл 
		ЭтаФорма[ИмяТаблицыИдентификаторов].Удалить(УдаляемаяСтрока);
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Функция ПолучитьМатериалыПоЭтапам(ОтборПоВариантамОбеспечения, ДатаОстатков, Склад, Списание)
	
	Если Списание тогда
		ТаблицаЭтапов = РеквизитФормыВЗначение("Этапы",Тип("ТаблицаЗначений"));
	Иначе 
		ТаблицаЭтапов = РеквизитФормыВЗначение("ЭтапыРезервирование",Тип("ТаблицаЗначений"));
	КонецЕсли;
	Если ТаблицаЭтапов.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапросаУсловие = СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабЭтапы.Обрабатывать КАК Обрабатывать,
	               |	ТабЭтапы.Статус КАК Статус,
	               |	ТабЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТабЭтапы.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	               |	ТабЭтапы.Назначение КАК Назначение,
	               |	ТабЭтапы.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ ВТ_Этапы
	               |ИЗ
	               |	&ТабЭтапы КАК ТабЭтапы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Этапы.Обрабатывать КАК Обрабатывать,
	               |	ВТ_Этапы.Статус КАК Статус,
	               |	ВТ_Этапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ВТ_Этапы.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	               |	ВТ_Этапы.Назначение КАК Назначение,
	               |	ВТ_Этапы.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ Таб_ЭтапыДляОбработки
	               |ИЗ
	               |	ВТ_Этапы КАК ВТ_Этапы
	               |ГДЕ
	               |	ВТ_Этапы.Обрабатывать = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК Норматив,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие
	               |ПОМЕСТИТЬ НормативыпоСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Таб_ЭтапыДляОбработки КАК Таб_ЭтапыДляОбработки
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = Таб_ЭтапыДляОбработки.Спецификация
				   //|;
				   //|
				   //|////////////////////////////////////////////////////////////////////////////////
				   //|ВЫБРАТЬ
				   //|	НормативыпоСпецификации.Номенклатура КАК Номенклатура,
				   //|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток
				   //|ПОМЕСТИТЬ ОстаткиМатериалов
				   //|ИЗ
				   //|	НормативыпоСпецификации КАК НормативыпоСпецификации
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ), Склад = &Склад) КАК СвободныеОстаткиОстатки
				   //|		ПО НормативыпоСпецификации.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК СсылкаНаНоменклатуру,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ПОМЕСТИТЬ ЗначенияДополнительногоРеквизита
	               |ИЗ
	               |	НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО НормативыпоСпецификации.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЕСТЬNULL(ЗначенияДополнительногоРеквизита.Значение, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)) КАК КатегорияМатериала,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК ЭтапПроизводства,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	1 КАК КоличествоСтрок,
	               |	НормативыпоСпецификации.Норматив КАК Норматив,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество КАК КоличествоВЭтапе,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
				   |			ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Обеспечить,
				   //|	ВЫБОР
				   //|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется)
				   //|			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
				   //|		ИНАЧЕ 0
				   //|	КОНЕЦ КАК КОбеспечению,
	               |	ВЫБОР
				   //|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно)
				   //|			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Отгрузить,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
				   //|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.УдалитьИзЗаказов)
				   //|			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Зарезервировать,
	               |	0 КАК Остаток,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение КАК Назначение,
	               |	НормативыпоСпецификации.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	НормативыпоСпецификации.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	НормативыпоСпецификации.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ ПредварительныеДанные
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация = НормативыпоСпецификации.Спецификация
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиМатериалов КАК ОстаткиМатериалов
				   //|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(ОстаткиМатериалов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияДополнительногоРеквизита КАК ЗначенияДополнительногоРеквизита
	               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(ЗначенияДополнительногоРеквизита.СсылкаНаНоменклатуру, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЭтапПроизводства
	               |			ИЗ
	               |				Таб_ЭтапыДляОбработки КАК Т)";
	Запрос.Текст = Запрос.Текст + "
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,  //**//
				   |	ПредварительныеДанные.Количествоэтапов КАК КоличествоЭтапов,
	               |	ПредварительныеДанные.Норматив КАК Норматив,
	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
				   //|	ПредварительныеДанные.КОбеспечению КАК КОбеспечению,
	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
	               |	ПредварительныеДанные.Остаток КАК Остаток,
	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеДанные.Склад КАК Склад,
	               |	ПредварительныеДанные.Назначение КАК Назначение,
	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
				   |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
				   |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход
	               |ИЗ
	               |	ПредварительныеДанные КАК ПредварительныеДанные
	               |ГДЕ %ТекстЗапросаУсловие
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура, ЭтапПроизводства 
	               |ИТОГИ
				   |	СУММА(КоличествоСтрок),
	               |	МАКСИМУМ(ВидНоменклатуры),
	               |	СУММА(Норматив),
	               |	СУММА(Обеспечить),
				   //|	СУММА(КОбеспечению),
	               |	СУММА(Отгрузить),
	               |	СУММА(Зарезервировать),
	               |	СРЕДНЕЕ(Остаток),
	               |	МАКСИМУМ(Склад),
	               |	МАКСИМУМ(Назначение),
	               |	МАКСИМУМ(Спецификация),
	               |	СУММА(Расход)
	               |ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("ТабЭтапы", ТаблицаЭтапов);	
	Запрос.УстановитьПараметр("ДатаОстатков",ДатаОстатков);
	Запрос.УстановитьПараметр("Свойство",Объект.ДР_КатегорияМатериала);
	
	Если ТекстЗапросаУсловие <> "" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ТекстЗапросаУсловие",ТекстЗапросаУсловие);
		Если Списание тогда 
			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериала);
		Иначе 
			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериалаРезервирование);
		КонецЕсли;
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ %ТекстЗапросаУсловие","");
	КонецЕсли;
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере
Функция СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание)
	
	ТекстЗапросаУсловие = "";
	Если Списание и ЗначениеЗаполнено(ОтборКатегорияМатериала) Тогда 
		//ТекстЗапросаУсловие = "ГДЕ ПредварительныеДанные.КатегорияМатериала = &КатегорияМатериала ";
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.КатегорияМатериала = &КатегорияМатериала"; // + Символы.ПС;
	КонецЕсли;
	Если не Списание и ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) Тогда 
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = " ПредварительныеДанные.КатегорияМатериала = &КатегорияМатериала"; // + Символы.ПС;
	КонецЕсли;
	Если ОтборПоВариантамОбеспечения = 1 Тогда  //Необеспеченные
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " (ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления) 
		| ИЛИ ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.КОбеспечению)) "; //.УдалитьОбособленно
	ИначеЕсли ОтборПоВариантамОбеспечения = 2 Тогда  //Зарезервированные /////Не обеспечивать
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.СоСклада) ";	 //.НеТребуется
	//ИначеЕсли ОтборПоВариантамОбеспечения = 3 Тогда  //К обеспечению
	//	Если ТекстЗапросаУсловие <> "" Тогда
	//		ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
	//	КонецЕсли;
	//	ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.Требуется)";
	ИначеЕсли ОтборПоВариантамОбеспечения = 4 Тогда  //Не обеспечивать ////Зарезервированные
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.НеТребуется) ";
	ИначеЕсли ОтборПоВариантамОбеспечения = 5 Тогда //Отгруженные
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.Отгрузить) "; 
	КонецЕсли;
	Возврат ТекстЗапросаУсловие;
	
КонецФункции

&НаКлиенте
Процедура ВыделитьВсеЭтапы(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "Списание" Тогда 
		Для Каждого СтрокаТЧ из Этапы Цикл 
			СтрокаТЧ.Обрабатывать = Истина;
		КонецЦикла;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница.Имя = "Резервирование"  Тогда 
		Для Каждого СтрокаТЧ из ЭтапыРезервирование Цикл 
			СтрокаТЧ.Обрабатывать = Истина;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОтгрузитьНаСервере(ИмяДерева,ЭтоСписание, Отбор)
		
	//////////0. Отбор - значение ВариантаОбеспечения (например, ОтгрузитьЗарезервированные)
	//////////1. Получим данные регистра с учетом отборов (Категория материала, ОтборПоВариантамОбеспечения, Пользователь, ЭтоСписание, ВариантОбеспечения (исходный))
	//////////2. Изменим данные в соответствии с данными дерева (синхронизация по полю ИдентификаторСтрокиРегистра)
	//////////3. Загрузить новые данные в регистр
	
	Дерево = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
	
	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	Для Каждого СтрокаДерева из Дерево.Строки Цикл 
		Если ТекНоменклатура <> СтрокаДерева.Номенклатура Тогда // строка 1 уровня. Зафиксируем данные по номенкдатуре и остаткам на складе.
			ТекНоменклатура = СтрокаДерева.Номенклатура;
			ТекОстаток = СтрокаДерева.Остаток;
		КонецЕсли;
		//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
		Для Каждого Стр из СтрокаДерева.Строки Цикл 
			Если ЗначениеЗаполнено(Отбор) и Стр.ВариантОбеспечения <> Отбор Тогда 
				Продолжить;
			ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
				//или Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно Тогда 
				Продолжить;
			КонецЕсли;
			Если ТекНоменклатура = Стр.Номенклатура тогда
				ТекОстаток = ТекОстаток - Стр.Обеспечить;
			КонецЕсли;
			Если ТекОстаток >= 0 Тогда			
				НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
				НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
				НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
				НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
				НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
				Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
					НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
				ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
					НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
				КонецЕсли;
				Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
					НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериала);
				ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда
					НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериалаРезервирование);
				КонецЕсли;
				НЗ.Прочитать(); 
				ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Отгрузить;
				Если НЗ.Количество() = 1 Тогда 
					Для Каждого СтрНЗ из НЗ Цикл 
							Если Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
								//или Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьИзЗаказов тогда
								Количество = Стр.Зарезервировать; 
							ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления
								ИЛИ Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
								Количество = Стр.Обеспечить;
							//ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОбособленно Тогда  
							//	Количество = Стр.Обеспечить;
							Иначе 
								Количество = 0;
							КонецЕсли;
							СтрНЗ.Количество = Количество;
							СтрНЗ.ВариантОбеспечения = ВариантОбеспеченияНовый;
							СтрНЗ.Обособленно = Ложь;
							СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();
							
							ИндексВариантаОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Индекс(ВариантОбеспеченияНовый);
							ИмяПеречисления = Строка(Метаданные.Перечисления.ВариантыОбеспечения.ЗначенияПеречисления[ИндексВариантаОбеспеченияНовый]);
							
							СтрНЗ.ОтборПоВариантамОбеспечения = СоответствиеВариантовОбеспеченияОтбору[ИмяПеречисления];
							СтрНЗ.Обеспечить = ?(ЗначениеЗаполнено(СтрНЗ.Обеспечить),СтрНЗ.Обеспечить,0) - ?(ЗначениеЗаполнено(Количество),Количество,0);
						//В регистре только исходный остаток - его не изменяем!!!
					КонецЦикла;
					ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
					Если не ЭлементОтбора = Неопределено Тогда 
						ЭлементОтбора.Использование = Ложь;
					КонецЕсли;
					НЗ.Записать();
				ИначеЕсли НЗ.Количество() > 1 Тогда 
					//Найти запись с нужным вариантом обеспечения
					Сообщить("Найдено более 1 строки в регистре, уточните условия поиска "+стр.Номенклатура + " " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
				Иначе 
					Сообщить("Не найдена строка регистра для корректировки данных, "+стр.Номенклатура + " " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
				КонецЕсли;
			Иначе 
				Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
			КонецЕсли;
		КонецЦикла;				
	КонецЦикла;
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
			
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузитьЗарезервированные(Команда)
	Если ТекСтраница = "Списание" Тогда 
		Если ОтборВариантОбеспечения = 5 Тогда 
			Возврат;
			Сообщить("Материалы по отбору уже отгружены! ",СтатусСообщения.Важное);
		ИначеЕсли ОтборВариантОбеспечения = 3 Тогда 
			Возврат;
			Сообщить("Материалы по отбору отгружать не требуется! ",СтатусСообщения.Важное);
		КонецЕсли;
		ЭтоСписание = Истина;
		ИмяДерева = "ДеревоМатериалов"; 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
		
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ЭтоСписание = Ложь;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		//Отгрузка доступна только при списании
		Возврат;
	КонецЕсли;
	//Отбор = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	////ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
	//ОтгрузитьНаСервере(ИмяДерева, ЭтоСписание, Отбор);          
	
	ВариантОбеспеченияДо = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,ВариантОбеспеченияДо,ВариантОбеспеченияНовый);
	
	//ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные();    
	////ИДТекСтроки = Элемент.ТекущаяСтрока(); 
	//ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();   
	//
	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства,ИДТекСтроки);
	ВосстановитьСостояниеДерева(ИмяДерева);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступноТолькоРезервирование = ПроверитьДоступ("АРМ_Резервирование");
	Если ДоступноТолькоРезервирование Тогда 
		ТолькоРезерв = Истина;
		Элементы.Списание.Видимость = Ложь;
	Иначе 
		ТолькоРезерв = Ложь;
		Элементы.Списание.Видимость = Истина;
	КонецЕсли;
	
	ТекСтраница = "Резервирование";
	
	//СформироватьСтруктуруСтрокИсходныхДанных();
	ЕстьНесохраненныеДанныеРезервирования = Истина;
	ЕстьНесохраненныеДанныеСписания = Истина;
		
	ТабЭтапы = Этапы;
	ТабЭтапыРезервирование = ЭтапыРезервирование;
	ЗаполнитьЭтапыНаСервере(ТабЭтапы, Истина);
	ЗаполнитьЭтапыНаСервере(ТабЭтапыРезервирование, Ложь);
	
	//Списики выбора не сохраняются, если заполнять на сервере при создании формы, поэтому здесь!!!
	Если ЗначениеЗаполнено(Объект.ДР_КатегорияМатериала) Тогда 
		Элементы.КатегорияМатериала.СписокВыбора.Очистить();
		Элементы.ОтборКатегорияМатериалаРезервирование.СписокВыбора.Очистить();
		ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("КатегорияМатериала");
		ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("ОтборКатегорияМатериалаРезервирование");
	КонецЕсли;	   
	СформироватьСтруктуруСтрокИсходныхДанных();
	//!!!При открытии формы данные в регистр не записываем, 
	//!!!так как записываем при переходе на конкретную страницу материалов данные по отмеченным этапам!!!!
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтруктуруСтрокИсходныхДанных() 
		
	СтруктураДанныхСтроки = Новый Структура;
	СтруктураДанныхСтроки.Вставить("Номенклатура");
	СтруктураДанныхСтроки.Вставить("ИсходнаяНоменклатура");
	СтруктураДанныхСтроки.Вставить("Упаковка");
	СтруктураДанныхСтроки.Вставить("Норматив");
	СтруктураДанныхСтроки.Вставить("Расход");
	СтруктураДанныхСтроки.Вставить("Остаток");
	СтруктураДанныхСтроки.Вставить("ЭтапПроизводства");
	СтруктураДанныхСтроки.Вставить("ВариантОбеспечения");
	СтруктураДанныхСтроки.Вставить("Обособленно");
	СтруктураДанныхСтроки.Вставить("ВидНоменклатуры");
	СтруктураДанныхСтроки.Вставить("Обеспечить");
	СтруктураДанныхСтроки.Вставить("Отгрузить");
	СтруктураДанныхСтроки.Вставить("Зарезервировать");
	СтруктураДанныхСтроки.Вставить("Спецификация");
	СтруктураДанныхСтроки.Вставить("КоличествоСтрок");
	СтруктураДанныхСтроки.Вставить("КонтрольОстатка");
	СтруктураДанныхСтроки.Вставить("КатегорияМатериала");
	СтруктураДанныхСтроки.Вставить("ОстатокДляУО");
	СтруктураДанныхСтроки.Вставить("РасчетнаяПотребность");
	СтруктураДанныхСтроки.Вставить("НоменклатураРодитель");
	СтруктураДанныхСтроки.Вставить("Уровень");
	СтруктураДанныхСтроки.Вставить("КОбеспечению");
	СтруктураДанныхСтроки.Вставить("ВыходноеИзделие");
	СтруктураДанныхСтроки.Вставить("Характеристика");
	СтруктураДанныхСтроки.Вставить("Серия");
	СтруктураДанныхСтроки.Вставить("КоличествоУпаковок");
	СтруктураДанныхСтроки.Вставить("Количество");
	СтруктураДанныхСтроки.Вставить("Склад");
	СтруктураДанныхСтроки.Вставить("Производится");
	СтруктураДанныхСтроки.Вставить("Назначение");
	СтруктураДанныхСтроки.Вставить("СтатусУказанияСерий");
	СтруктураДанныхСтроки.Вставить("СтатусУказанияСерийОтправитель");
	СтруктураДанныхСтроки.Вставить("СтатусУказанияСерийПолучатель");
	СтруктураДанныхСтроки.Вставить("КодСтроки");
	СтруктураДанныхСтроки.Вставить("ИспользуетсяАвтовыбор");
	СтруктураДанныхСтроки.Вставить("СведенияАвтовыбора");
	СтруктураДанныхСтроки.Вставить("ПрименениеМатериала");
	СтруктураДанныхСтроки.Вставить("КлючСвязиСпецификация");
	СтруктураДанныхСтроки.Вставить("СтатьяКалькуляции");
	СтруктураДанныхСтроки.Вставить("ПериодЗатрат");
	СтруктураДанныхСтроки.Вставить("АналитикаУчетаНоменклатуры");
	СтруктураДанныхСтроки.Вставить("КорАналитикаУчетаНоменклатуры");
	СтруктураДанныхСтроки.Вставить("ИдентификаторСтрокиРегистра");
	СтруктураДанныхСтроки.Вставить("ОтборПоВариантамОбеспечения");    
	
	ИсходныеДанныеСтрокиДереваМатериалов = СтруктураДанныхСтроки;
	ИсходныеДанныеСтрокиДереваМатериаловРезервирование = СтруктураДанныхСтроки;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступ(Роль)
	Если РольДоступна(Роль) Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала(ИмяСписка)
    Элементы[ИмяСписка].СписокВыбора.Очистить();
	СписокВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Ссылка КАК КатегорияМатериала
	|ИЗ
	|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Объект.ДР_КатегорияМатериала);
	ТЗ = Запрос.Выполнить().Выгрузить();//.ВыгрузитьКолонку("ЗначениеДопРеквизита");
	
	//Элементы.СписокЗначенийДопРеквизита.СписокВыбора.Добавить("");
	Для Каждого Стр из ТЗ Цикл 
		Элементы[ИмяСписка].СписокВыбора.Добавить(Стр.КатегорияМатериала, Стр.КатегорияМатериала.Наименование);
		СписокВыбора.Добавить(Стр.КатегорияМатериала,Стр.КатегорияМатериала.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияСпискаВыбораВариантОбеспечения(ИмяСписка)
	
	Элементы[ИмяСписка].СписокВыбора.Очистить();
	//Элементы.ВариантОбеспеченияРезервирование.СписокВыбора.Добавить(1,"Необеспеченные");
	Элементы[ИмяСписка].СписокВыбора.Добавить(1,"К Обеспечению"); 	  // Требуется    //// Обособленно
	Элементы[ИмяСписка].СписокВыбора.Добавить(2,"Зарезервированные"); // СоСклада     ////, ИзЗаказов
	//Элементы[ИмяСписка].СписокВыбора.Добавить(3,"К обеспечению");   // Требуется
	Элементы[ИмяСписка].СписокВыбора.Добавить(4,"Не обеспечивать");   // НеТребуется
	Элементы[ИмяСписка].СписокВыбора.Добавить(5,"Отгруженные");       // Отгрузить     ////, ОтгрузитьОбособленно

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если не ЗначениеЗаполнено(Объект.ПериодОтгрузки) Тогда 
		Объект.ПериодОтгрузки = ТекущаяДатаСеанса();
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.ДатаЗапуска) Тогда 
		Объект.ДатаЗапуска = ТекущаяДатаСеанса();
	КонецЕсли;

	//При выполнении на сервере не сохраняется, поэтому выполняется при открытии формы
	Если ЗначениеЗаполнено(Объект.ДР_КатегорияМатериала) Тогда 
		Элементы.КатегорияМатериала.СписокВыбора.Очистить();
		Элементы.ОтборКатегорияМатериалаРезервирование.СписокВыбора.Очистить();
		ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("КатегорияМатериала");
		ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("ОтборКатегорияМатериалаРезервирование");
	КонецЕсли;
	Элементы.ВариантОбеспечения.СписокВыбора.Очистить();
	Элементы.ВариантОбеспеченияРезервирование.СписокВыбора.Очистить();
	ЗаполнитьЗначенияСпискаВыбораВариантОбеспечения("ВариантОбеспечения");
	ЗаполнитьЗначенияСпискаВыбораВариантОбеспечения("ВариантОбеспеченияРезервирование");
	
	СоответствиеВариантовОбеспеченияОтбору = Новый Структура();
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьОбособленно"			,1);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("Требуется"						,2);
	////СоответствиеВариантовОбеспеченияОтбору.Вставить("КОбеспечнию"					,1);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("НеТребуется"					,3);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("СоСклада"						,4);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьИзЗаказов"				,4);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("Отгрузить"						,5);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьОтгрузитьОбособленно"	,5);      
	
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьОбособленно"			,1);       
	СоответствиеВариантовОбеспеченияОтбору.Вставить("КОбеспечнию"					,1);
	СоответствиеВариантовОбеспеченияОтбору.Вставить("РезервироватьПоМереПоступления",1);
	СоответствиеВариантовОбеспеченияОтбору.Вставить("СоСклада"						,2);
	СоответствиеВариантовОбеспеченияОтбору.Вставить("НеТребуется"					,3);
	СоответствиеВариантовОбеспеченияОтбору.Вставить("Отгрузить"						,5);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьОтгрузитьОбособленно"	,5);
	
КонецПроцедуры

//Процедура записывает в регистр данные по обеспечению материалами по данным Этапов производста.
//устанавливает каждой строке регистра Уникальный идентификатор для связи со строками дерева знрачений.
//Параметры: Период = период среза остатков по материалам;
&НаСервере
Процедура ЗаписатьДанныеРезервированиеСписаниеМатериаловВРегистрСведений(РезультатЗапроса, Период, ЭтоСписание, ДатаОтгрузкиМатериалов)
		
	ТабДанныеРегистра = РезультатЗапроса.Выгрузить();
	Если ТабДанныеРегистра.Количество() > 0 Тогда 
		НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		ТекПользователь = Пользователи.АвторизованныйПользователь(); 
		НЗ.Отбор.Пользователь.Установить(ТекПользователь);
		НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ.Прочитать();   	
		НЗ.Загрузить(ТабДанныеРегистра);  
		
		//Установим для каждой строки регистра УникальныйИдентификатор 
		Этап = Неопределено; 
		МассивНоменклатурыБезНормативов = Новый Массив;
		Для Каждого СтрНЗ из НЗ Цикл 
			
			СтрНЗ.ДатаОтгрузки = ДатаОтгрузкиМатериалов; 
			СтрНЗ.ИдентификаторСтрокиРегистра = Новый УникальныйИдентификатор;
			
			//Получим нормативы
			Если Этап <> СтрНЗ.ЭтапПроизводства Тогда 
				Этап = СтрНЗ.ЭтапПроизводства;
				УстановитьДанныеПартииПроизводства(Этап);  
				Нормативы = ПолучитьНормативыИзВременногоХранилища(Этап);
			КонецЕсли;    
			
			//Запишем нормативы в регистр 
			
			//Если Нормативы.ОбеспечениеМатериаламиИРаботами.Количество() > 0 Тогда 
			СтруктураПоиска = Новый Структура("Номенклатура",СтрНЗ.Номенклатура); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
			МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
			Если МассивНайденныхСтрок.Количество() > 1 Тогда 
				Сообщить("Норматив: найдено более 1 строки! " + СтрНЗ.Номенклатура);
			ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
				СтрНЗ.Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
				//СтрНЗ.Норматив = МассивНайденныхСтрок[0].Количество;
				//СтрНЗ.Норматив = МассивНайденныхСтрок[0].КоличествоУпаковокНаЕдиницуПартииВыпуска;
			Иначе   
				Если МассивНоменклатурыБезНормативов.Найти(СтрНЗ.Номенклатура) = Неопределено Тогда 
					МассивНоменклатурыБезНормативов.Добавить(СтрНЗ.Номенклатура);
				КонецЕсли;
				
			КонецЕсли; 
			//КонецЕсли;
				
		КонецЦикла; 
		НЗ.Записать(); 
		ТекстНачалаСообщения = "Данная позиция отсутствует в спецификации, норматив не найден ";
		ТекстСообщения = "";
		Для Каждого СтрНоменклатура из МассивНоменклатурыБезНормативов Цикл 
			ТекстСообщения = ТекстСообщения + ТекстНачалаСообщения + СтрНоменклатура + Символы.ПС;
		КонецЦикла;  
		Если не ТекстСообщения = "" Тогда 
			Сообщить(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

//Сейчас не нужно, эти функции нужны для расчета количества по формуле, когда мы имеем формулу
#Область ВспомогательныеФункции1С
&НаСервере
// Возвращает Истина, если функциональная подсистема существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
// У функциональной подсистемы снят флажок "Включать в командный интерфейс".
// См. также ОбщегоНазначенияПереопределяемый.ПриОпределенииОтключенныхПодсистем
// и ОбщегоНазначенияКлиент.ПодсистемаСуществует для вызова из клиентского кода.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//  Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
//  	МодульВариантыОтчетов.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево - Истина, если подсистема существует.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	ИменаПодсистем = СтандартныеПодсистемыПовтИсп.ИменаПодсистем();
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции 

&НаСервере
// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//   ОбщийМодуль
//   МодульМенеджераОбъекта
//
// Пример:
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщегоНазначения.ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщегоНазначения.ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
		УстановитьБезопасныйРежим(Истина);
		Модуль = Вычислить(Имя);
		// АПК:488-вкл
	ИначеЕсли СтрЧислоВхождений(Имя, ".") = 1 Тогда
		Возврат СерверныйМодульМенеджера(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не существует.';
				|en = 'Common module ""%1"" does not exist.'"),
			Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции  

&НаСервере
// Возвращает серверный модуль менеджера по имени объекта.
Функция СерверныйМодульМенеджера(Имя)
	ОбъектНайден = Ложь;
	
	ЧастиИмени = СтрРазделить(Имя, ".");
	Если ЧастиИмени.Количество() = 2 Тогда
		
		ИмяВида = ВРег(ЧастиИмени[0]);
		ИмяОбъекта = ЧастиИмени[1];
		
		Если ИмяВида = ВРег("Константы") Тогда
			Если Метаданные.Константы.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыСведений") Тогда
			Если Метаданные.РегистрыСведений.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыНакопления") Тогда
			Если Метаданные.РегистрыНакопления.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыБухгалтерии") Тогда
			Если Метаданные.РегистрыБухгалтерии.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыРасчета") Тогда
			Если Метаданные.РегистрыРасчета.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Справочники") Тогда
			Если Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Документы") Тогда
			Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Отчеты") Тогда
			Если Метаданные.Отчеты.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Обработки") Тогда
			Если Метаданные.Обработки.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("БизнесПроцессы") Тогда
			Если Метаданные.БизнесПроцессы.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ЖурналыДокументов") Тогда
			Если Метаданные.ЖурналыДокументов.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Задачи") Тогда
			Если Метаданные.Задачи.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ПланыСчетов") Тогда
			Если Метаданные.ПланыСчетов.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ПланыОбмена") Тогда
			Если Метаданные.ПланыОбмена.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ПланыВидовХарактеристик") Тогда
			Если Метаданные.ПланыВидовХарактеристик.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ПланыВидовРасчета") Тогда
			Если Метаданные.ПланыВидовРасчета.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ОбъектНайден Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Объект метаданных ""%1"" не существует.';
				|en = 'Metadata object ""%1"" does not exist.'"), Имя);
	КонецЕсли;
	
	// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
	УстановитьБезопасныйРежим(Истина);
	Модуль = Вычислить(Имя);
	// АПК:488-вкл
	
	Возврат Модуль;
КонецФункции
#КонецОбласти

&НаСервере
Процедура ЗаписатьДанныеЭтаповВТЧ(РезультатЗапроса, Период, ЭтоСписание)
	ТабМатериалы = РезультатЗапроса.Выгрузить();
	//ТабМатериалы = Объект.МатериалыСписание.Выгрузить();
	ТабМатериалы.Колонки.Удалить("Норматив");
	ТабМатериалы.Колонки.Удалить("Остаток");
	ТабМатериалы.Колонки.Удалить("ЭтапПроизводства");
	ТабМатериалы.Колонки.Удалить("СпецификацияЭтапа");
	ТабМатериалы.Колонки.Удалить("Пользователь");
	ТабМатериалы.Колонки.Удалить("Категори\яМатериала");
	ТабМатериалы.Колонки.Удалить("отборПоВариантамОбеспечения");
	
	Если ЭтоСписание Тогда 
		Объект.МатериалыСписание.Загрузить(ТабМатериалы);
	Иначе 
		Объект.МатериалыРезервирование.Загрузить(ТабМатериалы);
	КонецЕсли;
КонецПроцедуры

//Получаем запросом данные Этапов производства, отмеченных для обработки
&НаСервере
Функция ПолучитьМатериалыПоДаннымЭтаповДляРегистра(Период,Склад,ЭтоСписание, ОтборПоКатегориямМатериалов = Ложь, ОтборПоВариантамОбеспечения = Ложь) //ПолучитьМатериалыПоЭтапамДляРегистра
	
	Если ЭтоСписание Тогда 
		ТабЭтапы = РеквизитФормыВЗначение("Этапы",Тип("ТаблицаЗначений"));
	Иначе 
		ТабЭтапы = РеквизитФормыВЗначение("ЭтапыРезервирование",Тип("ТаблицаЗначений"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабЭтапы.Обрабатывать КАК Обрабатывать,
	               |	ТабЭтапы.Статус КАК Статус,
	               |	ТабЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТабЭтапы.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	               |	ТабЭтапы.Назначение КАК Назначение,
	               |	ТабЭтапы.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ ВТ_Этапы
	               |ИЗ
	               |	&ТабЭтапы КАК ТабЭтапы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Этапы.Обрабатывать КАК Обрабатывать,
	               |	ВТ_Этапы.Статус КАК Статус,
	               |	ВТ_Этапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ВТ_Этапы.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	               |	ВТ_Этапы.Назначение КАК Назначение,
	               |	ВТ_Этапы.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ Таб_ЭтапыДляОбработки
	               |ИЗ
	               |	ВТ_Этапы КАК ВТ_Этапы
	               |ГДЕ
	               |	ВТ_Этапы.Обрабатывать = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок) КАК Норматив,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи КАК КлючСвязи
	               |ПОМЕСТИТЬ НормативыпоСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Таб_ЭтапыДляОбработки КАК Таб_ЭтапыДляОбработки
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = Таб_ЭтапыДляОбработки.Спецификация
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НормативыпоСпецификации.Номенклатура КАК Номенклатура,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК КатегорияМатериала
	               |ПОМЕСТИТЬ ВТ_КатегорииНоменклатуры
	               |ИЗ
	               |	НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО НормативыпоСпецификации.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(СвободныеОстаткиОстатки.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	СвободныеОстаткиОстатки.Склад КАК Склад,
	               |	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличии,
	               |	0 КАК ВРезервеСоСклада,
	               |	0 КАК ВРезервеПодЗаказ,
	               |	0 КАК КОтгрузке
	               |ПОМЕСТИТЬ ВТ_СвободныеОстатки
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, ) КАК СвободныеОстаткиОстатки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток,
	               |	ТоварыКОтгрузкеОстатки.ВРезервеОстаток,
	               |	0,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(&ДатаОстатков, ) КАК ТоварыКОтгрузкеОстатки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвободныеОстатки.Номенклатура КАК Номенклатура,
	               |	ВТ_СвободныеОстатки.Характеристика КАК Характеристика,
	               |	ВТ_СвободныеОстатки.Склад КАК Склад,
	               |	СУММА(ВТ_СвободныеОстатки.ВНаличии) КАК ВНаличии,
	               |	СУММА(ВТ_СвободныеОстатки.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	               |	СУММА(ВТ_СвободныеОстатки.ВРезервеПодЗаказ) КАК ВРезервеПодЗаказ,
	               |	СУММА(ВТ_СвободныеОстатки.КОтгрузке) КАК КОтгрузке
	               |ПОМЕСТИТЬ ВТ_СвободныеОстаткиСгруппированные
	               |ИЗ
	               |	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СвободныеОстатки.Номенклатура,
	               |	ВТ_СвободныеОстатки.Характеристика,
	               |	ВТ_СвободныеОстатки.Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировано,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |				ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отгружено
	               |ПОМЕСТИТЬ КоличествоРезервИОтгрузка
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЭтапПроизводства
	               |			ИЗ
	               |				Таб_ЭтапыДляОбработки КАК Т)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК ИсходнаяНоменклатура,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК Характеристика,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Серия КАК Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	               |	КОНЕЦ КАК ИсходнаяЕдиницаИзмерения,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Обособленно КАК Обособленно,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Производится КАК Производится,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Спецификация КАК Спецификация,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение КАК Назначение,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КодСтроки КАК КодСтроки,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ВЫРАЗИТЬ(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СведенияАвтовыбора КАК СТРОКА(250)) КАК СведенияАвтовыбора,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(справочник.статьиКалькуляции.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПУстаяСсылка)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции
	               |		ИНАЧЕ НормативыпоСпецификации.СтатьяКалькуляции
	               |	КОНЕЦ КАК СтатьяКалькуляции,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Период КАК ПериодЗатрат,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	СУММА(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество) КАК Количество,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок, 0) = 0
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок
	               |		КОНЕЦ) КАК КоличествоУпаковок,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(НормативыпоСпецификации.Упаковка, НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения) <> НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения
	               |				ТОГДА ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0) / НормативыпоСпецификации.Упаковка.Числитель * НормативыпоСпецификации.Упаковка.Знаменатель
	               |			ИНАЧЕ ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0)
	               |		КОНЕЦ) КАК Норматив,
	               |	ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВНаличии, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеСоСклада, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеПодЗаказ, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.КОтгрузке, 0) КАК Остаток,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК ЭтапПроизводства,
	               |	НормативыпоСпецификации.Спецификация КАК СпецификацияЭтапа,
	               |	&Пользователь КАК Пользователь,
	               |	&ЭтоСписание КАК ЭтоСписание,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |					ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обеспечить,
	               |	ЕСТЬNULL(ВТ_КатегорииНоменклатуры.КатегорияМатериала, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)) КАК КатегорияМатериала,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |				ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |			ТОГДА 1
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |			ТОГДА 2
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	               |			ТОГДА 4
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА 5
	               |	КОНЕЦ КАК ОтборПоВариантамОбеспечения,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспеченияДоИзмененияОбновлениемИБ КАК ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Подразделение КАК Подразделение,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено КАК Отменено,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПричинаОтмены КАК ПричинаОтмены
	               |ПОМЕСТИТЬ ПредварительныеОстатки
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация = ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)))
	               |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация = НормативыпоСпецификации.КлючСвязи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КатегорииНоменклатуры КАК ВТ_КатегорииНоменклатуры
	               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(ВТ_КатегорииНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвободныеОстаткиСгруппированные КАК ВТ_СвободныеОстаткиСгруппированные
	               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)))
	               |			И (ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)))
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЭтапПроизводства
	               |			ИЗ
	               |				Таб_ЭтапыДляОбработки КАК Т)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	               |	КОНЕЦ,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ДатаОтгрузки,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Производится,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Спецификация,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерий,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийОтправитель,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийПолучатель,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КодСтроки,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИспользуетсяАвтовыбор,
	               |	ВЫРАЗИТЬ(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СведенияАвтовыбора КАК СТРОКА(250)),
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПрименениеМатериала,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(справочник.статьиКалькуляции.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПУстаяСсылка)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции
	               |		ИНАЧЕ НормативыпоСпецификации.СтатьяКалькуляции
	               |	КОНЕЦ,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Период,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.АналитикаУчетаНоменклатуры,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВНаличии, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеСоСклада, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеПодЗаказ, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.КОтгрузке, 0),
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка,
	               |	НормативыпоСпецификации.Спецификация,
	               |	ЕСТЬNULL(ВТ_КатегорииНоменклатуры.КатегорияМатериала, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)),
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Обособленно,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИдентификаторСтроки,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Подразделение,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПричинаОтмены,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |				ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |			ТОГДА 1
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |			ТОГДА 2
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	               |			ТОГДА 4
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА 5
	               |	КОНЕЦ,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеОстатки.Номенклатура КАК Номенклатура,
	               |	ПредварительныеОстатки.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ПредварительныеОстатки.Характеристика КАК Характеристика,
	               |	ПредварительныеОстатки.Серия КАК Серия,
	               |	ПредварительныеОстатки.Упаковка КАК Упаковка,
	               |	ПредварительныеОстатки.ИсходнаяЕдиницаИзмерения КАК ИсходнаяЕдиницаИзмерения,
	               |	ПредварительныеОстатки.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеОстатки.Обособленно КАК Обособленно,
	               |	ПредварительныеОстатки.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ПредварительныеОстатки.Склад КАК Склад,
	               |	ПредварительныеОстатки.Производится КАК Производится,
	               |	ПредварительныеОстатки.Спецификация КАК Спецификация,
	               |	ПредварительныеОстатки.Назначение КАК Назначение,
	               |	ПредварительныеОстатки.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ПредварительныеОстатки.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ПредварительныеОстатки.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ПредварительныеОстатки.КодСтроки КАК КодСтроки,
	               |	ПредварительныеОстатки.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ПредварительныеОстатки.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ПредварительныеОстатки.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ПредварительныеОстатки.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ПредварительныеОстатки.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ПредварительныеОстатки.ПериодЗатрат КАК ПериодЗатрат,
	               |	ПредварительныеОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ПредварительныеОстатки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ПредварительныеОстатки.Количество КАК Количество,
	               |	ПредварительныеОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПредварительныеОстатки.Норматив КАК Норматив,
	               |	ПредварительныеОстатки.Остаток + ЕСТЬNULL(КоличествоРезервИОтгрузка.Зарезервировано, 0) + ЕСТЬNULL(КоличествоРезервИОтгрузка.Отгружено, 0) КАК Остаток,
	               |	ПредварительныеОстатки.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеОстатки.СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ПредварительныеОстатки.Пользователь КАК Пользователь,
	               |	ПредварительныеОстатки.ЭтоСписание КАК ЭтоСписание,
	               |	ПредварительныеОстатки.Обеспечить КАК Обеспечить,
	               |	ПредварительныеОстатки.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеОстатки.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ПредварительныеОстатки.ВариантОбеспеченияДоИзмененияОбновлениемИБ КАК ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	               |	ПредварительныеОстатки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ПредварительныеОстатки.Подразделение КАК Подразделение
	               |ИЗ
	               |	ПредварительныеОстатки КАК ПредварительныеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоРезервИОтгрузка КАК КоличествоРезервИОтгрузка
	               |		ПО ПредварительныеОстатки.Номенклатура = КоличествоРезервИОтгрузка.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтапПроизводства,
	               |	Номенклатура";
	
	ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Период));
	Запрос.УстановитьПараметр("ТабЭтапы",ТабЭтапы);
	Запрос.УстановитьПараметр("ЭтоСписание",ЭтоСписание);
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.УстановитьПараметр("Свойство", Объект.ДР_КатегорияМатериала);
	Возврат Запрос.Выполнить();
КонецФункции

&НаКлиенте
Процедура ЗначениеДопРеквизитаПриИзменении(Элемент)
	ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериалов", Ложь);
	//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериалов");
КонецПроцедуры

&НаСервере
Процедура ЗарезервироватьВсеНаСервере(ИмяДерева,ЭтоСписание)
	
	//////////1. Получим данные регистра с учетом отборов (Категория материала, ОтборПоВариантамОбеспечения, Пользователь, ЭтоСписание, ВариантОбеспечения (исходный))
	//////////2. Изменим данные в соответствии с данными дерева (синхронизация по полю ИдентификаторСтрокиРегистра)
	//////////3. Загрузить новые данные в регистр
	
	Дерево = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
	
	//ДеревоМатериалов = Новый ДеревоЗначений;//////////////////////////////////////////////////////////
	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	Для Каждого Строка из Дерево.Строки Цикл 
		Если ТекНоменклатура <> Строка.Номенклатура Тогда
			ТекНоменклатура = Строка.Номенклатура;
			ТекОстаток = Строка.Остаток;
		КонецЕсли;
		//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
		НоменклатураБезОстатка = Новый ТаблицаЗначений;
		НоменклатураБезОстатка.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		НоменклатураБезОстатка.Колонки.Добавить("Этап",Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
		Для Каждого Стр из Строка.Строки Цикл 
			Если ТекНоменклатура = Стр.Номенклатура тогда
				ТекОстаток = ТекОстаток - Стр.Обеспечить;
			КонецЕсли;
			Если ТекОстаток >= 0 Тогда			
				НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
				НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
				НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
				НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
				НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
				Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
					НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
				ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
					НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
				КонецЕсли;
				Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
					НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериала);
				ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда 
					НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериалаРезервирование);
				КонецЕсли;
				НЗ.Прочитать();
				Если НЗ.Количество() = 1 Тогда 
					//ТЗ = НЗ.Выгрузить();
					Для Каждого СтрНЗ из НЗ Цикл 
						//Если НЗ.Отбор[НЗ.Отбор.Количество()-28] = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения").Использование  = Ложь Тогда 
							//НЗ.Отбор.Удалить(НЗ.Отбор.Количество()-28);
						//НЗ.Отбор[НЗ.Отбор.Количество()-28].Использование = Ложь;
						//КонецЕсли;
						//СтрНЗ.Количество = Стр.Обеспечить + Стр.;  
						СтрНЗ.Обеспечить = СтрНЗ.Количество - СтрНЗ.Обеспечить;
						СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
						Если СтрНЗ.Обособленно Тогда 
							СтрНЗ.Обособленно = Ложь;
						КонецЕсли;
						СтрНЗ.ОтборПоВариантамОбеспечения = 2;//4;
						СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();
						//СтрНЗ.Обеспечить = 0;
						
						//В регистре только исходный остаток - его не изменяем!!!
						//СтрНЗ.Остаток = ОстатокПослеРезервированияВсехСтрокПоНоменклатуре;
						
						//Закомментировала корректировку строки дерева, так как дерево перестраивается по регистру
						
						//Стр.Зарезервировать = Стр.Обеспечить;
						//Стр.Отгрузить		= 0;
						//Стр.Обеспечить		= 0;
						//Стр.КонтрольОстатка = Стр.Остаток - Стр.Зарезервировать - Стр.Отгрузить - Стр.Обеспечить - Стр.КОбеспечению;			 
						
					КонецЦикла;
					ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
					Если не ЭлементОтбора = Неопределено Тогда 
						ЭлементОтбора.Использование = Ложь;
					КонецЕсли;
					//НЗ.Загрузить(ТЗ);
					НЗ.Записать();
				ИначеЕсли НЗ.Количество() > 1 Тогда 
					//Найти запись с нужным вариантом обеспечения
					Сообщить("Найдено более 1 строки в регистре, уточните условия поиска",СтатусСообщения.Важное);
				Иначе 
					Сообщить("Не найдена строка регистра для корректировки данных, "+стр.Номенклатура + " "+ Стр.ЭтапПроизводства,СтатусСообщения.Важное);
				КонецЕсли;
			Иначе               
				ПараметрыПоиска = Новый Структура("Номенклатура,Этап");
				МассивСтрокБезОстатка = НоменклатураБезОстатка.НайтиСтроки(ПараметрыПоиска);
				Если МассивСтрокБезОстатка.Количество() = 0 Тогда 
					НоваяСтрока = МассивСтрокБезОстатка.Добавить();
					НоваяСтрока.Номенклатура = Стр.Номенклатура ;
					НоваяСтрока.Этап = Стр.ЭтапПроизводства;     
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;	       
		ТекстНачалаСообщения = "Отсутствует остаток для резервирования по номенклатуре ";
		ТекстСообщения = "";
		Для Каждого СтрТЗ из НоменклатураБезОстатка Цикл 
			ТекстСообщения = ТекстСообщения + ТекстНачалаСообщения + " " + СтрТЗ.Номенклатура + ", " + СтрТЗ.Этап + Символы.ПС;
		КонецЦикла;                           
		Сообщить(ТекстСообщения,СтатусСообщения.Важное);
	КонецЦикла;
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	
	//ЭтапОбъект 
	//ДанныеСпецификации = ПолучитьНормативыПоСпецификации("МатериалыИУслуги,Трудозатраты", Истина, Ложь);
	//
	//Если ДанныеСпецификации.Свойство("МатериалыИУслуги") Тогда
	//	Таблица = ДанныеСпецификации.МатериалыИУслуги.Скопировать(, "Номенклатура,Характеристика,Количество");
	//	Таблица.Свернуть("Номенклатура,Характеристика", "Количество");
	//	Результат.Вставить("ОбеспечениеМатериаламиИРаботами", Таблица);
	//КонецЕсли;
	
	
	//АдресХранилищаНормативы = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	//Если ЭтоАдресВременногоХранилища(АдресИлиНормативы) Тогда
	//	НормативыИзХранилища = ПолучитьИзВременногоХранилища(АдресИлиНормативы);
	//Иначе
	//	НормативыИзХранилища = АдресИлиНормативы;
	//КонецЕсли;
	//Если ЗначениеЗаполнено(НормативыИзХранилища) И НормативыИзХранилища.Свойство(ИмяТЧ) Тогда
	//	Нормативы = НормативыИзХранилища[ИмяТЧ];
	//Иначе
	//	Нормативы = Неопределено;
	//КонецЕсли;
	//
	//Если ИмяТЧ = "ОбеспечениеМатериаламиИРаботами" Тогда
	//	
	//	СтруктураПоиска = Новый Структура("Номенклатура,Характеристика");
	//	
	//	Результат = УправлениеПроизводством.ПолучитьНормативы(
	//		Нормативы,
	//		МассивДанных,
	//		СтруктураПоиска,
	//		Истина);
	//	
	//ИначеЕсли ИмяТЧ = "Трудозатраты" Тогда
	//	
	//	СтруктураПоиска = Новый Структура("ВидРабот");
	//	
	//	Результат = УправлениеПроизводством.ПолучитьНормативы(
	//		Нормативы,
	//		МассивДанных,
	//		СтруктураПоиска,
	//		Ложь);
	//
	//КонецЕсли;
	
	
	////ПараметрыВыборки = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных(ПереченьДанных, МенеджерВременныхТаблиц);
	
	//ПартияПроизводства				ФиксированнаяСтруктура	ФиксированнаяСтруктура
		//Договор
		//Запланировано
		//Количество
		//НазначениеПродукция
		//НаправлениеДеятельности
		//Номенклатура
		//ОсновноеИзделиеНоменклатура
		//ОсновноеИзделиеХарактеристика
		//ПартияПроизводства
		//Партнер     //не заполнено
		//Распоряжение
		//Спецификация
		//ТипПроизводственногоПроцесса
		//Характеристика
		//ХозяйственнаОперация
	//ПереченьДанных					"МатериалыИУслуги,Трудозатраты"	Строка
	//ПолучатьМатериалыПоТребованию		Истина							Булево
	//ОкруглятьКоличествоШтучныхТоваров	Ложь							Булево
	//Отбор								Структура						Структура
		//Этап	87215 ПА11-МК Миксер мотор.с коутером д/попкорна	СправочникСсылка.ЭтапыПроизводства
		
		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарезервироватьВсе(Команда)
	Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
		ЭтоСписание = Ложь;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		//ЗарезервироватьВсеНаСервере("ДеревоМатериаловРезервирование", Ложь);
	ИначеЕсли Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда   
		ЭтоСписание = Истина;
		ИмяДерева = "ДеревоМатериалов"
		//ЗарезервироватьВсеНаСервере("ДеревоМатериалов", Истина); 
	КонецЕсли;         
	ВариантОбеспеченияПосле = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,,ВариантОбеспеченияПосле);
	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДР_КатегорияМатериалаПриИзменении(Элемент)
	ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("КатегорияМатериала");
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтгрузкиПриИзменении(Элемент)
	ЗаполнитьЭтапыСВопросом(Истина);
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)
	ЗаполнитьЭтапыСВопросом(Истина);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ЗаполнитьЭтапыСВопросом(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыСписанияПриСменеСтраницы(Элемент, ТекущаяСтраница)  
	ИмяДерева = "ДеревоМатериалов";
	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов"; 
	
	Если ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
		Если не ЗначениеЗаполнено(Объект.ПериодОтгрузки) Тогда 
			Элементы.СтраницыСписания.ТекущаяСтраница = Элементы.СтраницаЭтапы;
			Сообщить("Заполните дату списания!");
			Возврат;                          
		КонецЕсли;                                                                              
		//УстановитьДанныеПартииПроизводства();  
		ПараметрыПоиска = Новый Структура("Обрабатывать", Истина);   
		ЭтапОбъект = Этапы.НайтиСтроки(ПараметрыПоиска)[0].ЭтапПроизводства;
		ЗаполнитьСпецификациюПоВыбраннымЭтапам("Этапы", Истина);
		ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, Истина); 
		//ОбновитьИдентификаторыСтрокДерева(ИмяДерева);
		//ОбновитьИдентификаторыСтрокДереваНовая(ИмяДерева,ИмяТаблицыИдентификаторов, Элементы[ИмяДерева].ТекущиеДанные);
		ВосстановитьСостояниеДерева(ИмяДерева);
		УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаЭтапы" Тогда
		Если ДеревоМатериалов.ПолучитьЭлементы().Количество() > 0 Тогда 
			ДопПарметры = Новый Структура("ЭтоСписание",Истина); 
			ДопПарметры.Вставить("ИмяДерева",ИмяДерева);
			ДопПарметры.Вставить("ИмяТаблицыИдентификаторов",ИмяТаблицыИдентификаторов);
			ОповещениеПриПереходеНаСтрЭтапы = Новый ОписаниеОповещения("ПереходНаСтрЭтапыПродолжение",ЭтаФорма,ДопПарметры);
			ПоказатьВопрос(ОповещениеПриПереходеНаСтрЭтапы,"Данные по корректировке материалов будут утеряны, продолжить?",РежимДиалогаВопрос.ДаНет, 300);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСпецификациюПоВыбраннымЭтапам(ИмяТаблицыЭтапы, ЭтоСписание)
	
	ТЗ = ЭтаФорма[ИмяТаблицыЭтапы].Выгрузить(,"Спецификация"); 
	МассивСпецификаций = ТЗ.ВыгрузитьКолонку("Спецификация");
	МассивСпецификаций = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСпецификаций); 
	Если МассивСпецификаций.Количество() = 1 Тогда
		Если ЭтоСписание Тогда 
			Спецификация = МассивСпецификаций[0];
		Иначе 
			СпецификацияРезервирование = МассивСпецификаций[0];
		КонецЕсли;
	Иначе  
		Если ЭтоСписание Тогда 
			Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
		Иначе 
			СпецификацияРезервирование = Справочники.РесурсныеСпецификации.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеПартииПроизводства(Этап)  
	
	ПараметрыПоиска = Новый Структура("Обрабатывать", Истина);   
	//ЭтапОбъект = Этапы.НайтиСтроки(ПараметрыПоиска)[0].ЭтапПроизводства;
	ДанныеПартииПроизводства = Документы.ЭтапПроизводства2_2.ДанныеПартииПроизводства(Этап.Распоряжение, Этап.НазначениеПродукция, Этап.ПартияПроизводства);
	
КонецПроцедуры

//+20.01.22
&НаСервере
//МассивДанныхРаскрытыхСтрок содержит структуры с данными строки (ИД, Номенклатура, ЭтапПроизводства(необязательно))
Процедура ОбновитьИдентификаторыСтрокДереваНовая(ИмяДерева, ИмяТаблицыИдентификаторов, ДанныеТекСтроки)

	//ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(ДанныеТекСтроки.Идентификатор);
	Для Каждого СтрокаДерева из ДеревоМатериаловРезервирование.ПолучитьЭлементы() Цикл //ИмяДерева 
		Для Каждого СтрИД из ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование Цикл //ИмяТаблицыИдентификаторов 
			СтрокаДерева.
			СтрокаДерева.ПолучитьИдентификатор();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
//-20.01.22

&НаКлиенте
Процедура ОтборКатегорияМатериалаРезервированиеПриИзменении(Элемент )
	ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериаловРезервирование", Ложь);
	//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериаловРезервирование");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыРезервированияПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ИмяДерева = "ДеревоМатериаловРезервирование";         
	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	Если ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда  
		ЗаполнитьСпецификациюПоВыбраннымЭтапам("ЭтапыРезервирование",Ложь);
		ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, Истина);  
		//ОбновитьИдентификаторыСтрокДерева(ИмяДерева);
		//ОбновитьИдентификаторыСтрокДереваНовая(ИмяДерева,ИмяТаблицыИдентификаторов, Элементы[ИмяДерева].ТекущиеДанные);
		ВосстановитьСостояниеДерева(ИмяДерева);      
		//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериаловРезервирование");
	ИначеЕсли ТекущаяСтраница.Имя = "ЭтапыРезервирования" Тогда  
		Если ДеревоМатериаловРезервирование.ПолучитьЭлементы().Количество() > 0 Тогда 
			ДопПарметры = Новый Структура;
			ДопПарметры.Вставить("ЭтоСписание",Ложь); 
			ДопПарметры.Вставить("ИмяДерева",ИмяДерева);
			ДопПарметры.Вставить("ИмяТаблицыИдентификаторов",ИмяТаблицыИдентификаторов);
			ОповещениеПриПереходеНаСтрЭтапы = Новый ОписаниеОповещения("ПереходНаСтрЭтапыПродолжение",ЭтаФорма,ДопПарметры);
			ПоказатьВопрос(ОповещениеПриПереходеНаСтрЭтапы,"Данные по корректировке материалов будут утеряны, продолжить?",РежимДиалогаВопрос.ДаНет, 300);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходНаСтрЭтапыПродолжение(Результат, ДопПараметры) Экспорт   
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		УдалитьМатериалыДляКорректирвокиИзРегистра(ДопПараметры.ЭтоСписание);
		ЭтаФорма[ДопПараметры.ИмяТаблицыИдентификаторов].Очистить();
	Иначе 
		Если Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаЭтапы" Тогда 
			Элементы.СтраницыСписания.ТекущаяСтраница = Элементы.СтраницаМатериалы;
		ИначеЕсли Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "ЭтапыРезервирования" Тогда 
			Элементы.СтраницыРезервирования.ТекущаяСтраница = Элементы.МатериалыРезервирования;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьМатериалыДляКорректирвокиИзРегистра (ЭтоСписание)
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.этоСписание.Установить(ЭтоСписание);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураРезервированиеПриИзменении(Элемент)
	ЗаполнитьЭтапыСВопросом(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаказаРезервированиеПриИзменении(Элемент)
	ЗаполнитьЭтапыСВопросом(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗапускаПриИзменении(Элемент)
	ЗаполнитьЭтапыСВопросом(Ложь);
КонецПроцедуры

#Область Оформление

&НаСервере
Процедура УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева)
	
	#Область УОстрок1уровня
	
	УсловноеОформление.Элементы.Очистить();
	ЭлементыУО = УсловноеОформление.Элементы;
		
	///////////////////////////////////////////////////////
	//Установим оформление Зарезервированных строк 1 уровня
	НовыйЭлементУО = ЭлементыУО.Добавить();
	ГруппаЭлементовОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 2; // 4;
	ЭлементОтбора.Использование = Истина;
	
	//ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	//ЭлементОтбора.ПравоеЗначение = 5;
	//ЭлементОтбора.Использование = Истина;
		
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтый);
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	//Установим оформление Отгруженных строк 1 уровня
	НовыйЭлементУО = ЭлементыУО.Добавить();
	ГруппаЭлементовОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 5;
	ЭлементОтбора.Использование = Истина;
		
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноЗеленый);
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;    
	
	//Установим оформление строк 1 уровня с Остатком на Складе < Потребности
	НовыйЭлементУО = ЭлементыУО.Добавить();
	ГруппаЭлементовОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".КонтрольОстатка");          //".ОстатокДляУО");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	#конецОбласти
	
	#Область УОподчиненныхстрок
	
	//Установим оформление строк с Остатком на Складе < Потребности
	НовыйЭлементУО = ЭлементыУО.Добавить(); 
	ГруппаОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//10.03.2022
	//ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".КонтрольОстатка");     //".ОстатокДляУО");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	//Установим оформление Зарезервированных строк (подчиненных)
	НовыйЭлементУО = ЭлементыУО.Добавить();
	//ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ГруппаОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 2; //4;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
		
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтый);
	
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	//Установим оформление Отгруженных строк (подчиненных)
	НовыйЭлементУО = ЭлементыУО.Добавить();
	ГруппаОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 5;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
		
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый); !!
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); -- синезел яркий
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ВесеннеЗеленый); -- яркий
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноЗеленый);
	
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	#конецОбласти
	
КонецПроцедуры 

//&НаСервере //Не используется!!!
//Процедура УстановитьУсловноеОформлениеСпискаЭтаповРезервирование()
//	ЭлементыУО = УсловноеОформление.Элементы;
//	НовыйЭлементУО = ЭлементыУО.Добавить();
//	
//	ЭлементОтбора = НовыйЭлементУО.элеме.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	
//КонецПроцедуры

#КонецОбласти

&НаСервере
//БезКонтекста
Процедура ДеревоМатериаловРезервированиеОтгрузитьПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеОтгрузитьПриИзменении(Элемент)
	//ПОКА НЕТ ОБРАБОТКИ!!!///
	//ДеревоМатериаловРезервированиеОтгрузитьПриИзмененииНаСервере();
	
	//ТекСтрока=Элементы.ДеревоМатериаловРезервирование.ТекущиеДанные; 
	//ИДТекСтроки = Элементы.ДеревоМатериаловРезервирование.ТекущаяСтрока;
	//ТекСтрока = Элемент.ТекущиеДанные();
	
	ИмяДерева = "ДеревоМатериаловРезервирование";
	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";	
	
	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства,ИДТекСтроки);
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,Элементы[ИмяДерева].ТекущиеДанные);
	ВосстановитьСостояниеДерева(ИмяДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеПриАктивизацииСтроки(Элемент)
	
	ИмяДерева = Элемент.Имя; 
	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	Если Элемент.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	Иначе 
		ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные;         
		//ИДТекСтроки = Элементы[ИмяДерева].ТекущаяСтрока;
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериаловРезервирование, ТекСтрока);
		//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства, ИДТекСтроки);
	КонецЕсли;              
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	Иначе 
		ТекСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериалов, ТекСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловОтгрузитьПриИзменении(Элемент)
	
	ИсходныеДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;  
	Если ТекСтраница = "Списание" Тогда 
		ТекСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;     
		ИмяДерева = "ДеревоМатериалов";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
		//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериалов,ТекСтрока);
		ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериалов;	
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ТекСтрока = Элементы.ДеревоМатериаловРезервирование.ТекущиеДанные;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериаловРезервирование,ТекСтрока);
		ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
	КонецЕсли;
	
	Если ТекСтрока.Уровень = 1 Тогда 
		ОбщееКоличествоОбеспечить = ?(ЗначениеЗаполнено(ТекСтрока.Обеспечить), ТекСтрока.Обеспечить, 0);
		ОбщееКоличествоОтгрузить = ?(ЗначениеЗаполнено(ТекСтрока.Отгрузить), ТекСтрока.Отгрузить, 0);
		КоличествоПодчиненныхСтрок = ТекСтрока.ПолучитьЭлементы().Количество();   
		ОбработаноСтрок = 0; 
		ОсталосьОтгрузить = ОбщееКоличествоОтгрузить;
		ДопустимыйОстаток = ДанныеСтроки.Остаток/КоличествоПодчиненныхСтрок;
		Для Каждого ПодчиненнаяСтрока из ТекСтрока.ПолучитьЭлементы() Цикл   
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,ПодчиненнаяСтрока);
			КоличествоИсходное = ПодчиненнаяСтрока.Количество;
			Если УпаковкаШтуки(ПодчиненнаяСтрока.Упаковка) Тогда 
				Если ОбработаноСтрок = КоличествоПодчиненныхСтрок - 1 Тогда 
					Количество = ОсталосьОтгрузить;
					//ПодчиненнаяСтрока.Резервировать = ОбщееКоличествоРезервировать;  
					ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное, Истина, Ложь,ДопустимыйОстаток);
				Иначе                     
					Количество = Цел(ОбщееКоличествоОтгрузить/КоличествоПодчиненныхСтрок);
					//ПодчиненнаяСтрока.Резервировать = Цел(ОбщееКоличествоРезервировать/КоличествоПодчиненныхСтрок);
					//ПодчиненнаяСтрока.Обеспечить = ПодчиненнаяСтрока.Обеспечить +  
					//ОбщееКоличествоРезервировать = ОбщееКоличествоРезервировать - ПодчиненнаяСтрока.Резервировать;
					ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное, Истина, Ложь, ДопустимыйОстаток);
					//ОбработаноСтрок = ОбработаноСтрок + 1;
				КонецЕсли;  
			Иначе 
				Количество = ОбщееКоличествоОтгрузить/КоличествоПодчиненныхСтрок;
				ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное, Истина, Ложь, ДопустимыйОстаток);
			КонецЕсли;  
			ОбработаноСтрок = ОбработаноСтрок + 1;                    
			ОсталосьОтгрузить = ОсталосьОтгрузить - Количество;
		КонецЦикла;                                                          
		//ТекСтрока.Зарезервировать = ИсходныеДанныеСтрокиДереваМатериалов.Отгрузить;
		//ТекСтрока.Отгрузить = ИсходныеДанныеСтрокиДереваМатериалов.Отгрузить;
	Иначе        
		ДопустимыйОстаток = ДанныеСтроки.Остаток;
		КоличествоОбеспечить = ?(ЗначениеЗаполнено(ТекСтрока.Обеспечить), ТекСтрока.Обеспечить, 0);
		КоличествоОтгрузить = ?(ЗначениеЗаполнено(ТекСтрока.Отгрузить), ТекСтрока.Отгрузить, 0);
		Количество = КоличествоОтгрузить;
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
		КоличествоИсходное = ДанныеСтроки.Количество;
		ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное, Истина, Ложь, ДопустимыйОстаток);  
	КонецЕсли;     
	
	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);	
	
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь, ДанныеСтроки); 
	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
	ВосстановитьСостояниеДерева(ИмяДерева);

	//
	//ТекСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;
	//Если ТекСтрока.Уровень = 1 Тогда 
	//	ОбщееКоличествоОбеспечить = ТекСтрока.Обеспечить;
	//	ОбщееКоличествоОтгрузки = ТекСтрока.Отгрузить;
	//	КоличествоПодчиненныхСтрок = ТекСтрока.ПолучитьЭлементы().Количество();
	//	Для Каждого ПодчиненнаяСтрока из ТекСтрока.ПолучитьЭлементы() Цикл 
	//		//ПодчиненнаяСтрока.Обеспечить
	//	КонецЦикла;
	//	ТекСтрока.Отгрузить = ИсходныеДанныеСтрокиДереваМатериалов.Отгрузить;
	//	Возврат;    
	//Иначе 
	//	
	//КонецЕсли; 
	
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияВРегистр(ТекСтрока,ЭтоСписание)
	
	МЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьМенеджерЗаписи();
	МЗ.Пользователь = Пользователи.АвторизованныйПользователь();
	МЗ.ЭтоСписание = ЭтоСписание;
	МЗ.ИдентификаторСтрокиРегистра = ТекСтрока.ИдентификаторСтрокиРегистра;
	//ЗаполнитьЗначенияСвойств(МЗ,ИсходныеДанныеСтрокиДереваМатериалов);
	
	//МЗ.Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	//МЗ.ЭтапПроизводства = ИсходныеДанныеСтрокиДереваМатериалов.ЭтапПроизводства;
	//МЗ.Номенклатура = ИсходныеДанныеСтрокиДереваМатериалов.Номенклатура
	МЗ.Прочитать();
	ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока,"Количество,КоличествоУпаковок, ВариантОбеспечения, Обеспечить");
	МЗ.Записать();
	//Если ЗначениеЗаполнено(ТекСтрока.НоваяНоменклатура) Тогда 
	//	МЗ.НоваяНоменклатура = ТекСтрока.НоваяНоменклатура;
	//	МЗ.НоваяЕдиницаИзмерения = ТекСтрока.НоваяЕдиницаИзмерения;
	//	МЗ.ОбеспечитьНов = ТекСтрока.Обеспечить
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗарезервироватьВыбранныеСтроки(Команда)
	
	СформироватьСтруктуруСтрокИсходныхДанных();
	Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
		//МассивСтрок = Элементы.ДеревоМатериаловРезервирование.ВыделенныеСтроки;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ЭтоСписание = Ложь;  
		СтруктураДанныхИсходнойСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
	ИначеЕсли Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
		//МассивСтрок = Элементы.ДеревоМатериалов.ВыделенныеСтроки;
		ИмяДерева = "ДеревоМатериалов";
		ЭтоСписание = Истина; 
		СтруктураДанныхИсходнойСтроки = ИсходныеДанныеСтрокиДереваМатериалов;
	КонецЕсли;  
	ТекущаяНоменклатура = Элементы[ИмяДерева].ТекущиеДанные.Номенклатура;
	ДанныеТекущейСтроки = Элементы[ИмяДерева].ТекущиеДанные;    
	ЗаполнитьЗначенияСвойств(СтруктураДанныхИсходнойСтроки,ДанныеТекущейСтроки);
	
	СписокВариантовОбеспечения = новый СписокЗначений;
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьОбособленно"));
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно"));
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению"));
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления"));
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется"));
	
    МассивСтруктурОбрабатываемыхСтрок = ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки(СписокВариантовОбеспечения, ИмяДерева, ЭтоСписание);
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	ОтборПоВариантуОбеспечения = 4;
	ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивСтруктурОбрабатываемыхСтрок, ИмяДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения);
	
	//УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,,ВариантОбеспеченияНовый);
	
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь,ДанныеИсходнойСтроки);
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,Неопределено);
	ВосстановитьСостояниеДерева(ИмяДерева);
	
	//Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
	//	//МассивСтрок = Элементы.ДеревоМатериаловРезервирование.ВыделенныеСтроки;
	//	ИмяДерева = "ДеревоМатериаловРезервирование";
	//	ЭтоСписание = Ложь;
	//ИначеЕсли Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
	//	МассивСтрок = Элементы.ДеревоМатериалов.ВыделенныеСтроки;
	//	ИмяДерева = "ДеревоМатериалов";
	//	ЭтоСписание = Истина;
	//КонецЕсли; 
	//МассивСтрок = Элементы[ИмяДерева].ВыделенныеСтроки;
	//МассивОбрабатываемыхСтрок = Новый Массив;
	//Для Каждого Стр из МассивСтрок Цикл 
	//	Если ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Стр) <> Неопределено Тогда 
	//		ДочерниеСтроки = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Стр).ПолучитьЭлементы();
	//		Если ДочерниеСтроки.Количество() <> 0 Тогда 
	//			Для Каждого НСтр из ДочерниеСтроки Цикл 
	//				МассивОбрабатываемыхСтрок.Добавить(НСтр.ПолучитьИдентификатор());
	//			КонецЦикла;
	//		Иначе 
	//			МассивОбрабатываемыхСтрок.Добавить(Стр);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
	//Для Каждого МСтр из МассивОбрабатываемыхСтрок Цикл 
	//	ТекСтрока = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(МСтр);
	//	ДанныеСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, ВариантОбеспечения");
	//	Если ТекСтрока <> Неопределено Тогда 
	//		Если Текстрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить") Тогда 
	//			Продолжить;
	//		КонецЕсли;
	//		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
	//		МассивСтруктурОбрабатываемыхСтрок.Добавить(ДанныеСтроки);
	//	КонецЕсли;
	//КонецЦикла;
	//ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивСтруктурОбрабатываемыхСтрок, ИмяДерева, ЭтоСписание);
	////Дерево обновляется при записи данных в регистр
	////ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	
		
КонецПроцедуры      

&НаСервере
//БезКонтекста
Процедура ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивВыбранныхСтрок, ИмяДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения) //
	
	Для Каждого Стр из МассивВыбранныхСтрок Цикл 
		ОбновитьВариантОбеспеченияВСтрокеРегистра(Стр, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения);
	КонецЦикла;
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, Ложь);
КонецПроцедуры

&НаСервере
Процедура ОбновитьВариантОбеспеченияВСтрокеРегистра(СтрокаДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения)
		
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСПисание.Установить(ЭтоСписание);
	//НЗ.Отбор.ИдентификаторСтрокиРегистра.Установить(СтрокаДерева.ИдентификаторСтрокиРегистра);
	НЗ.Отбор.Номенклатура.Установить(СтрокаДерева.Номенклатура);
	НЗ.Отбор.ЭтапПРоизводства.Установить(СтрокаДерева.ЭтапПроизводства);
	НЗ.Отбор.ВариантОбеспечения.Установить(СтрокаДерева.ВариантОбеспечения);
	НЗ.Прочитать();
	Если НЗ.Количество() = 1 Тогда 
		//нашли единственную строку  //Добавить пропуск отгруженных строк
		НЗ[0].ВариантОбеспечения = ВариантОбеспеченияНовый; //Перечисления.ВариантыОбеспечения.СоСклада;
		НЗ[0].ОтборПоВариантамОбеспечения = ОтборПоВариантуОбеспечения; //4; 
		НЗ[0].ДатаОтгрузки = ?(ЭтоСписание,Объект.ПериодОтгрузки,СтрокаДерева.ЭтапПроизводства.ДатаОтгрузки); 
		//Если не НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОбособленно Тогда 
		//	НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка();
		//КонецЕсли;
		Если НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада и НЗ[0].Обособленно Тогда 
			НЗ[0].Обособленно = Ложь; 
			НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка();
		ИначеЕсли НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда  
			Если не НЗ[0].Обособленно Тогда 
				НЗ[0].Обособленно = Истина; 
				НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка(); //Проверить!!!!
			Иначе 
				НазначениеПродукции = СтрокаДерева.ЭтапПроизводства.ВыходныеИзделия[0].Назначение;
				НЗ[0].Назначение = НазначениеПродукции; //Проверить!!!!
			КонецЕсли;   
		ИначеЕсли НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
			Если не НЗ[0].Обособленно Тогда 
				НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка(); //Проверить!!!!
			Иначе 
				НазначениеПродукции = СтрокаДерева.ЭтапПроизводства.ВыходныеИзделия[0].Назначение;
				НЗ[0].Назначение = НазначениеПродукции; //Проверить!!!!
			КонецЕсли;
		ИначеЕсли НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
			НЗ[0].Обособленно = Ложь;
			НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли НЗ.Количество() > 1 Тогда 
		Сообщить("Найдено более 1 строки регистра для резервирования! Уточните параметры поиска!",СтатусСообщения.Важное);
	Иначе 
		Сообщить("Не найдено строки для корректировки данных! Уточните параметры поиска!", СтатусСообщения.Важное);
	КонецЕсли;
	НЗ.Отбор.Найти("ВариантОбеспечения").Использование = Ложь;
	НЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//ДопПараметры = Новый Структура(Отказ);
	Если не ЗавершениеРаботы Тогда 
		Если не ЗакрытьФормуОбработки Тогда 
			Отказ = Истина;
			ОповещениеПриВыходе = Новый ОписаниеОповещения("ВопросПриВыходеПродолжение",ЭтаФорма,);
			ПоказатьВопрос(ОповещениеПриВыходе, "При выходе из обработки все несохраненные данные не сохранятся, продолжить?",РежимДиалогаВопрос.ДаНет);
		Иначе 
			
		КонецЕсли;
	Иначе 
		//!!!Ошибка!!! Серверные вызовы запрещены при завершении работы! //Без контекста тоже не прокатывает!
		//ОчиститьРегистрСведенийПриВыходеИзОбработки();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВопросПриВыходеПродолжение (Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ОчиститьРегистрСведенийПриВыходеИзОбработки();
		ЗакрытьФормуОбработки = Истина;
		ЭтаФорма.Закрыть();
	Иначе 
		//ЗакрытьФормуОбработки = Истина;
		//ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьРегистрСведенийПриВыходеИзОбработки()
	ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(ТекПользователь);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
КонецПроцедуры

&НаСервере
Процедура ОтменитьРезервВсеСтрокиНаСервере(ИмяДерева,ЭтоСписание)
	
	Дерево = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	Для Каждого Строка из Дерево.Строки Цикл 
		Если ТекНоменклатура <> Строка.Номенклатура Тогда
			ТекНоменклатура = Строка.Номенклатура;
			//ТекОстаток = Строка.Остаток;
		КонецЕсли;
		//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
		Для Каждого Стр из Строка.Строки Цикл 
			Если ТекНоменклатура = Стр.Номенклатура тогда
				//ТекОстаток = ТекОстаток + Стр.Обеспечить;
			КонецЕсли;
			//Если ТекОстаток >= 0 Тогда			
				НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
				НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
				НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
				
				//Обрабатываем только зарезервированные материалы, поэтому отбор по заререзервированным материалам устанавливаем безусловно!!!!!
				НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(2);  //(4)
				НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
				НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
				//Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
				//	НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
				//ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
				//	НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
				//КонецЕсли;
				
				Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
					НЗ.Отбор.КатегорияМатериала = ОтборКатегорияМатериала;
				ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда 
					НЗ.Отбор.КатегорияМатериала = ОтборКатегорияМатериалаРезервирование;
				КонецЕсли;
				НЗ.Прочитать();
				Если НЗ.Количество() = 1 Тогда 
					Для Каждого СтрНЗ из НЗ Цикл 
						//Если НЗ.Отбор[НЗ.Отбор.Количество()-28] = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения").Использование  = Ложь Тогда 
							//НЗ.Отбор.Удалить(НЗ.Отбор.Количество()-28);
							//НЗ.Отбор[НЗ.Отбор.Количество()-28].Использование = Ложь;
						//КонецЕсли;
						СтрНЗ.Количество = Стр.Обеспечить + Стр.Зарезервировать;
						//СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОбособленно;
						СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
						СтрНЗ.Обособленно = Истина;
						
						СтрНЗ.ОтборПоВариантамОбеспечения = 1;
						СтрНЗ.Обеспечить = Стр.Обеспечить + Стр.Зарезервировать;
						//СтрНЗ.Остаток = ОстатокПослеРезервированияВсехСтрокПоНоменклатуре;
						
						//Строки дерева не корректируем, так как дерево перерисовывается по данным регистра
						//Стр.Зарезервировать = Стр.Обеспечить;
						//Стр.Отгрузить		= 0;
						//Стр.Обеспечить		= 0;
						//Стр.КонтрольОстатка = Стр.Остаток - Стр.Зарезервировать - Стр.Отгрузить - Стр.Обеспечить - Стр.КОбеспечению;			 
					КонецЦикла;
					ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
					Если не ЭлементОтбора = Неопределено Тогда 
						ЭлементОтбора.Использование = Ложь;
					КонецЕсли;
						//НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения").Использование  = Ложь;
					НЗ.Записать();
				ИначеЕсли НЗ.Количество() > 1 Тогда 
					//Найти запись с нужным вариантом обеспечения
					Сообщить("Найдено более 1 строки в регистре, уточните условия поиска",СтатусСообщения.Важное);
				Иначе 
					Сообщить("Не найдена строка регистра для корректировки данных!",СтатусСообщения.Важное);
				КонецЕсли;
			//Иначе 
			//	Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства + Символы.ПС,СтатусСообщения.Важное);
			//КонецЕсли;
		КонецЦикла;				
	КонецЦикла;
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьРезервВсеСтроки(Команда)
	//Элементы.ДеревоМатериалов.ТекущиеДанные
	//Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
	Если ТекСтраница = "Резервирование" Тогда 
		ЭтоСписание = Ложь;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		//ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		//ОтменитьРезервВсеСтрокиНаСервере("ДеревоМатериаловРезервирование", Ложь);
	ИначеЕсли Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
		ЭтоСписание = Истина;
		ИмяДерева = "ДеревоМатериалов";
		//ОтменитьРезервВсеСтрокиНаСервере("ДеревоМатериалов", Истина);
	КонецЕсли;                                                  
	ВариантОбеспеченияДо = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	ВариантОбеспеченияПосле = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления");
	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,ВариантОбеспеченияДо,ВариантОбеспеченияПосле);
	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	//ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные;
	//ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();
	//
	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства,ИДТекСтроки);
	ВосстановитьСостояниеДерева(ИмяДерева);
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиКорректировкиВТЧ(ЭтоСписание, ЭтапПроизводства, ПереченьКолонок)	
	Если ЭтоСписание Тогда 
		ТабМатериалы = Объект.МатериалыСписание;
	Иначе 
		ТабМатериалы = Объект.МатериалыРезервирование;
	КонецЕсли;
	
	//НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	//НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства);
	//НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	//НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь()); 
	//Пользователь = Пользователи.ТекущийПользователь();
	//НЗ.Прочитать(); 
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныхРегистра();
	Запрос.УстановитьПараметр("ЭтапПроизводства", ЭтапПроизводства);
	Запрос.УстановитьПараметр("ЭтоСписание", ЭтоСписание);  
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//ТЗСкорректирвоанныеСтрокиЭтапа = НЗ.Выгрузить(,ПереченьКолонок);
	
	ТЗСкорректирвоанныеСтрокиЭтапа = ТЗ.Скопировать(,ПереченьКолонок);
	ТЗСкорректирвоанныеСтрокиЭтапа.Сортировать("Номенклатура Возр");  
	//МассивПериодЗатрат = ТЗСкорректирвоанныеСтрокиЭтапа.ВыгрузитьКолонку("ПериодЗатрат");
	//
	//ТЗСкорректирвоанныеСтрокиЭтапа.Колонки.
	//ТЗСкорректирвоанныеСтрокиЭтапа.ЗагрузитьКолонку(МассивПериодЗатрат,"Период"); 
	
	//ТЗСкорректирвоанныеСтрокиЭтапа = Новый ТаблицаЗначений;
	//ТЗСкорректирвоанныеСтрокиЭтапа.Колонки.Найти("ПериодЗатрат").Имя = 
	ТабМатериалы.Загрузить(ТЗСкорректирвоанныеСтрокиЭтапа);

КонецПроцедуры    

&НаСервере 
Функция ТекстЗапросаДанныхРегистра()
	
	Возврат "ВЫБРАТЬ
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика КАК Характеристика,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия КАК Серия,
	        |	ВЫБОР
	        |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка = ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	        |			ТОГДА ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	        |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	        |	КОНЕЦ КАК Упаковка,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки КАК ДатаОтгрузки,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад КАК Склад,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится КАК Производится,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий КАК СтатусУказанияСерий,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки КАК КодСтроки,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора КАК СведенияАвтовыбора,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала КАК ПрименениеМатериала,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатьяКалькуляции КАК СтатьяКалькуляции,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Отменено КАК Отменено,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПричинаОтмены КАК ПричинаОтмены,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат КАК Период,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспеченияДоИзмененияОбновлениемИБ КАК ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтроки КАК ИдентификаторСтроки,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение КАК Подразделение,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа КАК СпецификацияЭтапа,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь КАК Пользователь,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание КАК ЭтоСписание,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска КАК ДатаЗапуска,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяЕдиницаИзмерения КАК ИсходнаяЕдиницаИзмерения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодОтгрузки КАК ПериодОтгрузки,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала КАК КатегорияМатериала,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество КАК Количество,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок КАК КоличествоУпаковок,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Остаток КАК Остаток,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обеспечить КАК Обеспечить,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОбеспечитьНов КАК ОбеспечитьНов,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоНеОбеспечено КАК КоличествоНеОбеспечено
	        |ИЗ
	        |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	        |ГДЕ
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства = &ЭтапПроизводства
	        |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	        |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь";
	
КонецФункции

&НаКлиенте
Процедура ЗафиксироватьКорректировки(Команда)
	
	Если ТекСтраница = "Списание" и не ЗначениеЗаполнено(Объект.ПериодОтгрузки) Тогда
		Сообщить("Заполните ""Дату отгрузки""! списание не выполнено",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////
	ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима();
	
	Оповещение = Новый ОписаниеОповещения("ПослеПредоставленияРазрешения",ЭтаФорма);
	МассивИДРазрешений = ПолучитьМассивИдентификаторовРазрешений(СписокИДЗапросовРазрешений);
	РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(МассивИДРазрешений, ЭтаФорма, Оповещение);
	
	//УстановитьПривилегированныйРежим(Истина);
	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Истина);  
	
	/////////////////////////////////////////////////////////////////
	
	Сообщить("Начало обработки этапов " + Строка(ТекущаяДата()));
	
	Если ТекСтраница = "Списание" Тогда 
		ТабЭтапы = Этапы;
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ТабЭтапы = ЭтапыРезервирование;
	КонецЕсли;           
	ОтборСтрок = Новый Структура("Обрабатывать",Истина);
	МассивЭтаповДляОбработки = ТабЭтапы.НайтиСтроки(ОтборСтрок);
	Для Каждого СтрЭтап из МассивЭтаповДляОбработки Цикл //ТабЭтапы 
		//Если СтрЭтап.Обрабатывать Тогда 
		Этап = СтрЭтап.ЭтапПроизводства; 
		//**//
		//НачатьТранзакцию();
		ДанныеЭтапа = ПолучитьДанныеЭтапа(Этап);
		Если ТекСтраница = "Списание" Тогда 
			Если ДанныеЭтапа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен") или ДанныеЭтапа.КолСтрРасход > 0 Тогда 
				ЭтапОтменен = ОтменитьРасходМатериаловВЭтапе(Этап);  
				Если ЭтапОтменен Тогда 
					УдалитьСвязанныеПередачиМатериалов(Этап);
				КонецЕсли;
			КонецЕсли;
			//УдалитьСвязанныеПередачиМатериалов(Этап);
		КонецЕсли;
		МатериалыЗаполнили = ЗаполнитьМатериалыЭтапаПоДаннымРегистра(Этап);
		Если не МатериалыЗаполнили Тогда    
			//ОтменитьТранзакцию();
			Возврат; //Сообщение с описанием ошибки в функции
		КонецЕсли;
		Если ТекСтраница = "Списание" Тогда 
			СформировалиПередачуМатериалов = СформироватьПередачуМатериаловНаСервере(Этап);
			Если не СформировалиПередачуМатериалов Тогда
				//ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			ЗаполнилиРасходЭтапа = ЗаполнитьРасходЭтапа(Этап);
			Если не ЗаполнилиРасходЭтапа Тогда
				//ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
		КонецЕсли;  
		//КонецЕсли;      
		//ЗафиксироватьТранзакцию();
		Сообщить("Обработка этапа завершена " + Этап);
	КонецЦикла;
	
	Сообщить("Время окончания обработки этапов "+ Строка(ТекущаяДата()));
	
	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЭтапа(Этап)
	
	ДанныеЭтапа = Новый Структура("Статус, КолСтрРАсход",Этап.Статус,Этап.РасходМатериаловИРабот.Количество());
	Возврат ДанныеЭтапа;
	
КонецФункции

&НаСервере
Функция ОтменитьРасходМатериаловВЭтапе(Этап)
	
	ОбъектЭтап = Этап.ПолучитьОбъект(); 
	ОбъектЭтап.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат;
	ОбъектЭтап.КоличествоУпаковокФакт = 0.5;
	ОбъектЭтап.РасходМатериаловИРабот.Очистить(); 
	
	ЗаписьУспешна = Ложь;
	Попытка
		ОбъектЭтап.Записать();
		ЗаписьУспешна = Истина;
	Исключение
		Сообщить("Не удалось отменить завершение этапа " + Этап);
		ЗаписьУспешна = Ложь;
	КонецПопытки;    
	
	Возврат ЗаписьУспешна;
	
КонецФункции

&НаСервере
Процедура УдалитьСвязанныеПередачиМатериалов(Этап)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Разрешенные
		|	СвязанныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&Этап) КАК СвязанныеДокументы
		|ГДЕ
		|	СвязанныеДокументы.Ссылка.Проведен = ИСТИНА
		|	И СвязанныеДокументы.Ссылка ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
		|	И СвязанныеДокументы.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектПередачаМатериалов = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ОбъектПередачаМатериалов.УстановитьПометкуУдаления(Истина);
		Исключение
			Сообщить("Не удалось пометить связанный документ "+ОбъектПередачаМатериалов + Этап);
		КонецПопытки;
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Функция СформироватьПередачуМатериаловНаСервере(Этап)
	
	МассивСсылок = Новый Массив();
	МассивСсылок.Добавить(Этап);
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивСсылок,
		"ДвижениеПродукцииИМатериалов", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство"));
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	Документ = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	Документ.Заполнить(ДанныеЗаполнения);
	Документ.Дата = Объект.ПериодОтгрузки;
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
	Исключение
		Сообщить("Ошибка формирования Передачи материалов "+Этап+"  "+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьРасходЭтапа(Этап)

	ПараметрыФормы = Новый Структура("Ключ",Этап);
	Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",ПараметрыФормы);	
	Форма.РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспеченияЗавершение(КодВозвратаДиалога.Да, Неопределено);
	Для каждого Строка из Форма.Объект.РасходМатериаловИРабот Цикл
		Строка.ДатаРасхода = Объект.ПериодОтгрузки;
	КонецЦикла;
	Форма.Объект.РасходОднойДатой = Истина;
	Форма.Объект.ДатаРасхода = Объект.ПериодОтгрузки;
	ФактНачалоЭтапа = Форма.Объект.ФактическоеНачалоЭтапа;
	Если НачалоДня(ФактНачалоЭтапа) = Объект.ПериодОтгрузки Тогда
		Форма.Объект.ФактическоеОкончаниеЭтапа = ФактНачалоЭтапа;
	Иначе
		Форма.Объект.ФактическоеОкончаниеЭтапа = Объект.ПериодОтгрузки;
	КонецЕсли;
	Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен");
	Форма.Объект.КоличествоУпаковокФакт = Форма.Объект.КоличествоУпаковокПлан;
	//Форма.ОбработатьЗавершениеВыполненияЭтапа();
	Попытка
		Форма.Записать();
		Возврат Истина;
	Исключение
		Сообщить("Ошибка при заполнении расхода "+Этап+" "+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
		
КонецФункции	

&НаКлиенте
Функция ЗаполнитьМатериалыЭтапаПоДаннымРегистра(ЭтапПроизводства)
	
	Если ТекСтраница = "Резервирование" Тогда 
		ЭтоСписание = Ложь;
		//ТабЭтапы = ЭтапыРезервирование;
		ТабМатериалы = Объект.МатериалыРезервирование;
	ИначеЕсли ТекСтраница = "Списание" Тогда 
		ЭтоСписание = Истина;
		//ТабЭтапы = Этапы;
		ТабМатериалы = Объект.МатериалыСписание;
	КонецЕсли;
	//Для Каждого Стр из ТабЭтапы Цикл 
		//Если не Стр.Обрабатывать Тогда 
		//	Продолжить;
		//КонецЕсли;
		СтруктураКлючФормы = Новый Структура("Ключ",ЭтапПроизводства);
		Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",СтруктураКлючФормы);
		ТЧОбеспечение = Форма.Объект.ОбеспечениеМатериаламиИРаботами;
		ТЧОбеспечение.Очистить();
		ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапа();   
		//ТабМатериалы = 
		ПеренестиКорректировкиВТЧ(ЭтоСписание, ЭтапПроизводства, ПереченьКолонок);
		//ТЧОбеспечение.Загрузить(ТабМатериалы.Выгрузить()); //**Метод недоступен на клиенте**//
		Для Каждого Стр из ТабМатериалы Цикл 
			НоваяСтрока = ТЧОбеспечение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр); 
		КонецЦикла;  
		//Форма.Объект.ОбеспечениеМатериаламиИРаботами = ТЧОбеспечение;
		Форма.Объект.НеОтгружатьЧастями = Истина; 
		Если ЭтоСписание Тогда 
			Форма.Объект.ДатаОтгрузки = Объект.ПериодОтгрузки;
		//Иначе 
		//	Форма.Объект.ДатаОтгрузки = ТекущаяДатаСеанса();
		КонецЕсли;
		Попытка
			Форма.Записать();
			Возврат Истина;
		Исключение
			Сообщить("Ошибка записи "+Стр.ЭтапПроизводства+"  "+ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	//КонецЦикла;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПереченьКолонокТЧМатериалыЭтапа()
	
	ПереченьКолонок = "Номенклатура,Характеристика,Серия,Упаковка,КоличествоУпаковок,Количество,ВариантОбеспечения,Обособленно,ДатаОтгрузки,Склад,Производится,Спецификация,Назначение,СтатусУказанияСерий,СтатусУказанияСерийОтправитель,СтатусУказанияСерийПолучатель,КодСтроки,ИспользуетсяАвтовыбор,СведенияАвтовыбора,ПрименениеМатериала,КлючСвязиСпецификация,СтатьяКалькуляции,Отменено,ПричинаОтмены,Период,АналитикаУчетаНоменклатуры,КорАналитикаУчетаНоменклатуры,Подразделение,ВариантОбеспеченияДоИзмененияОбновлениемИБ,ИдентификаторСтроки";
	//"Номенклатура,  
	//|Характеристика, 
	//|Серия, 
	//|Упаковка, 
	//|КоличествоУпаковок, 
	//|Количество, 
	//|ВариантОбеспечения, 
	//|ДатаОтгрузки, 
	//|Склад, 
	//|Производится, 
	//|Спецификация, 
	//|Назначение, 
	//|СтатусУказанияСерий, 
	//|СтатусУказанияСерийОтправитель, 
	//|СтатусУказанияСерийПолучатель, 
	//|КодСтроки, 
	//|ИспользуетсяАвтовыбор, 
	//|СведенияАвтовыбора, 
	//|ПрименениеМатериала, 
	//|КлючСвязиСпецификация, 
	//|СтатьяКалькуляции, 
	//|Период, 
	//|АналитикаУчетаНоменклатуры, 
	//|КорАналитикаУчетаНоменклатуры";
	Возврат ПереченьКолонок;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПереченьКолонокТЧМатериалыЭтапаДляСвертки()
	//без количества
	
	ПереченьКолонок = "Номенклатура,Характеристика,Серия,Упаковка,ВариантОбеспечения,ДатаОтгрузки,Склад,Производится,Спецификация,Назначение,СтатусУказанияСерий,СтатусУказанияСерийОтправитель,СтатусУказанияСерийПолучатель,КодСтроки,ИспользуетсяАвтовыбор,СведенияАвтовыбора,ПрименениеМатериала,КлючСвязиСпецификация,СтатьяКалькуляции,Период,АналитикаУчетаНоменклатуры,КорАналитикаУчетаНоменклатуры,Обособленно,Отменено,ПричинаОтмены,Подразделение,ВариантОбеспеченияДоИзмененияОбновлениемИБ,ИдентификаторСтроки";
	//"Номенклатура,  
	//|Характеристика, 
	//|Серия, 
	//|Упаковка, 
	////|КоличествоУпаковок, 
	////|Количество, 
	//|ВариантОбеспечения, 
	//|ДатаОтгрузки, 
	//|Склад, 
	//|Производится, 
	//|Спецификация, 
	//|Назначение, 
	//|СтатусУказанияСерий, 
	//|СтатусУказанияСерийОтправитель, 
	//|СтатусУказанияСерийПолучатель, 
	//|КодСтроки, 
	//|ИспользуетсяАвтовыбор, 
	//|СведенияАвтовыбора, 
	//|ПрименениеМатериала, 
	//|КлючСвязиСпецификация, 
	//|СтатьяКалькуляции, 
	//|Период, 
	//|АналитикаУчетаНоменклатуры, 
	//|КорАналитикаУчетаНоменклатуры";
	Возврат ПереченьКолонок;
	
КонецФункции

#Область ФункцииПривилегированногоРежима

&НаСервереБезКонтекста
Функция ПолучитьМассивИдентификаторовРазрешений(знач СписокИДЗапросовРазрешений)
	МассивИДРазрешений = Новый Массив;
	Для Каждого ИД из СписокИДЗапросовРазрешений Цикл 
		МассивИДРазрешений.Добавить(ИД.Значение);
	КонецЦикла;
	Возврат МассивИДРазрешений;
КонецФункции

&НаКлиенте
Процедура ПослеПредоставленияРазрешения(Результат,ДопПараметры) Экспорт
	//Если Результат = КодВозвратаДиалога.ОК Тогда 
	//	Сообщить("Разрешение на использование привилегированного режима установлено!");
	//Иначе 
	//	Сообщить("Разрешение на использование привилегированного режима не получено!");
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Включить)
	Если не Включить Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Включить);
	Если Включить Тогда 
		УстановитьБезопасныйРежим(Истина);
		УстановитьБезопасныйРежим(Ложь);
	Иначе 
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;
	РФ_ПривилегированныйРежим = ПривилегированныйРежим();
	РФ_БезопасныйРежим = БезопасныйРежим();
КонецПроцедуры

&НаСервере
Процедура ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима()
	СписокИДЗапросовРазрешений.Очистить();
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеПривилегированногоРежима("Разрешение привилегированного режима для пользователей с ограниченными правами");
	МассивРазрешений = Новый Массив;
	МассивРазрешений.Добавить(Разрешение);
	ИДЗапроса = РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(МассивРазрешений, ЭтотОбъект, Истина);
	СписокИДЗапросовРазрешений.Добавить(ИДЗапроса);
КонецПроцедуры

#КонецОбласти

#Область РедактированиеУдалениеДанныхДерева

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеЗарезервироватьПриИзменении(Элемент)

	//ИсходныеДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;  
	Если ТекСтраница = "Списание" Тогда 
		ТекСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;  
		ИмяДерева = "ДеревоМатериалов";  
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
		//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериалов,ТекСтрока);
		ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериалов;	
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ТекСтрока = Элементы.ДеревоМатериаловРезервирование.ТекущиеДанные;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериаловРезервирование,ТекСтрока);
		ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
	КонецЕсли;    
	
	Если ТекСтрока.Уровень = 1 Тогда 
		ОбщееКоличествоОбеспечить = ?(ЗначениеЗаполнено(ТекСтрока.Обеспечить), ТекСтрока.Обеспечить, 0);
		ОбщееКоличествоРезервировать = ?(ЗначениеЗаполнено(ТекСтрока.Зарезервировать), ТекСтрока.Зарезервировать, 0);
		КоличествоПодчиненныхСтрок = ТекСтрока.ПолучитьЭлементы().Количество();   
		ОбработаноСтрок = 0;
		КоличествоЗарезервировано = 0;  
		ДопустимыйОстаток = ДанныеСтроки.Остаток/КоличествоПодчиненныхСтрок;
		Для Каждого ПодчиненнаяСтрока из ТекСтрока.ПолучитьЭлементы() Цикл   
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,ПодчиненнаяСтрока);
			КоличествоИсходное = ПодчиненнаяСтрока.Количество;
			Если УпаковкаШтуки(ПодчиненнаяСтрока.Упаковка) Тогда 
				Если ОбработаноСтрок = КоличествоПодчиненныхСтрок - 1 Тогда 
					Количество = ОбщееКоличествоРезервировать - КоличествоЗарезервировано;
					КоличествоЗарезервировано = КоличествоЗарезервировано + Количество;
					//ПодчиненнаяСтрока.Резервировать = ОбщееКоличествоРезервировать;                      
					ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное,,Истина,ДопустимыйОстаток);
				Иначе                     
					Количество = Цел(ОбщееКоличествоРезервировать/КоличествоПодчиненныхСтрок);
					КоличествоЗарезервировано = КоличествоЗарезервировано + Количество;
					//ПодчиненнаяСтрока.Резервировать = Цел(ОбщееКоличествоРезервировать/КоличествоПодчиненныхСтрок);
					//ПодчиненнаяСтрока.Обеспечить = ПодчиненнаяСтрока.Обеспечить +  
					//ОбщееКоличествоРезервировать = ОбщееКоличествоРезервировать - ПодчиненнаяСтрока.Резервировать;
					ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное,,Истина, ДопустимыйОстаток);
					ОбработаноСтрок = ОбработаноСтрок + 1;
				КонецЕсли;  
			Иначе 
				Количество = ОбщееКоличествоРезервировать/КоличествоПодчиненныхСтрок;
				ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное,,Истина, ДопустимыйОстаток);
				КоличествоЗарезервировано = КоличествоЗарезервировано + Количество;
			КонецЕсли;
		КонецЦикла;
		ТекСтрока.Зарезервировать = КоличествоЗарезервировано; //ДанныеСтроки.Отгрузить;
	Иначе   
		ДопустимыйОстаток = ДанныеСтроки.Остаток;
		КоличествоОбеспечить = ?(ЗначениеЗаполнено(ТекСтрока.Обеспечить), ТекСтрока.Обеспечить, 0);
		КоличествоРезервировать = ?(ЗначениеЗаполнено(ТекСтрока.Зарезервировать), ТекСтрока.Зарезервировать, 0);
		Количество = КоличествоОбеспечить;
		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
		КоличествоИсходное = ДанныеСтроки.Количество;
		ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное,,Истина, ДопустимыйОстаток);     
	КонецЕсли;   
	
	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
		
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь, ДанныеСтроки);
	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
	
	//ИДТекСтроки = Элементы[ИмяДерева].ТекущаяСтрока;
	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства, ИДТекСтроки);
	
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
	ВосстановитьСостояниеДерева(ИмяДерева);     
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов)
	
	ДанныеТекСтроки = Элементы[ИмяДерева].ТекущиеДанные;
	ИДТекСтроки = Элементы[ИмяДерева].ТекущаяСтрока; 
	СтруктураПоиска = Новый Структура("ТекущаяСтрока", Истина);
	МассивТекСтр = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
	Если МассивТекСтр.Количество() = 1 Тогда 
		ТекстрокаИД = МассивТекСтр[0];
		ЗаполнитьЗначенияСвойств(ТекстрокаИД,ДанныеТекСтроки);
		ТекстрокаИД.ТекущаяСтрока = Истина;
		ТекстрокаИД.Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
	ИначеЕсли МассивТекСтр.Количество() > 1 Тогда 
		ТекстрокаИД = МассивТекСтр[0];
		ЗаполнитьЗначенияСвойств(ТекстрокаИД,ДанныеТекСтроки);
		ТекстрокаИД.ТекущаяСтрока = Истина;
		ТекстрокаИД.Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
		Сообщить("Найдено более 1 текущей строки в таблице идентификаторов, проверить добавление текущей строки!",СтатусСообщения.Важное);
	Иначе 
		//добавим текущую строку в таблицу идентификаторов
		НоваСтрокаИД = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();  
		ЗаполнитьЗначенияСвойств(НоваСтрокаИД, ДанныеТекСтроки);
		НоваСтрокаИД.ТекущаяСтрока = Истина;
		НоваСтрокаИД.Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//БезКонтекста
Процедура ИзменитьКоличествоВСтрокеРегистра(Количество, СтрокаДанных, КоличествоИсходное, Отгрузить = Ложь, Зарезервировать = Ложь, ДопустимыйОстаток)
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Номенклатура.Установить(СтрокаДанных.Номенклатура);
	Если ЗначениеЗаполнено(СтрокаДанных.ЭтапПроизводства) Тогда 
		НЗ.Отбор.ЭтапПроизводства.Установить(СтрокаДанных.ЭтапПроизводства);
	КонецЕсли;
	//ЗаполнитьЗначенияСвойств(НЗ.Отбор,СтрокаДанных);
	НЗ.Прочитать();              
	//НЗ.Отбор.ВариантОбеспечения.Использование = Ложь;   
	Если Отгрузить Тогда 
		ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	ИначеЕсли Зарезервировать Тогда 
		ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
	КонецЕсли;
	
	Для Каждого СтрНЗ из НЗ Цикл 
		СтрНЗ.ВариантОбеспечения = ВариантОбеспечения; 
		СтрНЗ.ОтборПоВариантамОбеспечения = УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспечения);
		СтрНЗ.Обособленно = Ложь; //При отгрузке и резерве обособленность не нужна (только при обеспечении!!!)
		Если ЗначениеЗаполнено(СтрНЗ.Упаковка) Тогда 
			КоэффициентПересчета = СтрНЗ.Упаковка.Числитель * СтрНЗ.Упаковка.Знаменатель;
		Иначе 
			КоэффициентПересчета = 1;
		КонецЕсли;
		Если КоэффициентПересчета = 0 Тогда 
			КоэффициентПересчета = 1;
		КонецЕсли;
		Если Количество > КоличествоИсходное Тогда 
			Если Количество <= ДопустимыйОстаток Тогда
				СтрНЗ.Количество = Количество;
				СтрНЗ.КоличествоУпаковок = Количество/КоэффициентПересчета; //СтрНЗ.Упаковка.Числитель * СтрНЗ.Упаковка.Знаменатель;
			Иначе 
				СтрНЗ.Количество = ДопустимыйОстаток;
				СтрНЗ.КоличествоУпаковок = СтрНЗ.Остаток/КоэффициентПересчета; //СтрНЗ.Упаковка.Числитель * СтрНЗ.Упаковка.Знаменатель;
				Сообщить("Нельзя " +?(Отгрузить,"отгрузить","") + ?(Зарезервировать,"зарезервировать","")+ " больше остатка!");
			КонецЕсли;
		ИначеЕсли Количество <= КоличествоИсходное Тогда 
			СтрНЗ.Количество = Количество;   
			СтрНЗ.КоличествоУпаковок = Количество/КоэффициентПересчета; //СтрНЗ.Упаковка.Числитель * СтрНЗ.Упаковка.Знаменатель;
		КонецЕсли;
	
	КонецЦикла; 
	НЗ.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УпаковкаШтуки(Упаковка)
	
	Если Упаковка.ЕдиницаИзмерения  = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(796) Тогда 
		Возврат  Истина;
	Иначе 
		Возврат Ложь;   
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ОтгрузитьВсе(Команда)
	Если ТекСтраница = "Списание" Тогда 
		Если ЗначениеЗаполнено(ОтборВариантОбеспечения) Тогда 
			Если ОтборВариантОбеспечения = 3 Тогда 
				Возврат;
				Сообщить("Отгружать материалы не требуется!", СтатусСообщения.Важное);
			ИначеЕсли ОтборВариантОбеспечения = 5 Тогда 
				Возврат;
				Сообщить("Материалы уже отгружены!", СтатусСообщения.Важное);
			КонецЕсли;
		КонецЕсли;
		ЭтоСписание = Истина;
		ИмяДерева = "ДеревоМатериалов"; 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	ИначеЕсли ТекСтраница = "Резервирование"  Тогда 
		ЭтоСписание = Ложь;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	КонецЕсли;
	//ОтгрузитьВсеНаСервере(ИмяДерева,ЭтоСписание)
	Отбор = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ПустаяСсылка");
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
	ОтгрузитьНаСервере(ИмяДерева, ЭтоСписание, Отбор);           
	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,,ВариантОбеспеченияНовый);
		
	//ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные();    
	////ИДТекСтроки = Элемент.ТекущаяСтрока(); 
	//ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();   
	//
	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства,ИДТекСтроки);
	ВосстановитьСостояниеДерева(ИмяДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСписание(Команда)
	
	ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима();
	
	Оповещение = Новый ОписаниеОповещения("ПослеПредоставленияРазрешения",ЭтаФорма);
	МассивИДРазрешений = ПолучитьМассивИдентификаторовРазрешений(СписокИДЗапросовРазрешений);
	РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(МассивИДРазрешений, ЭтаФорма, Оповещение);
	
	//УстановитьПривилегированныйРежим(Истина);
	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Истина);

	ЭтоСписание = Истина;
	ТабЭтапы = Этапы;
	ТабМатериалы = Объект.МатериалыСписание;
	
	Для Каждого СтрЭтап из ТабЭтапы Цикл 
		//
		//ПараметрыФормы = Новый Структура("Ключ",СтрЭтап.ЭтапПроизводства);
		//Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",ПараметрыФормы,ЭтаФорма);
		
		Если не СтрЭтап.Обрабатывать Тогда 
			Продолжить;
		КонецЕсли;
		СтруктураКлючФормы = Новый Структура("Ключ",СтрЭтап.ЭтапПроизводства);
		Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",СтруктураКлючФормы);
		ТЧОбеспечение = Форма.Объект.ОбеспечениеМатериаламиИРаботами;
		ТЧОбеспечение.Очистить();
		ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапа();
		//ТабМатериалы = 
		ПеренестиКорректировкиВТЧ(ЭтоСписание, СтрЭтап.ЭтапПроизводства, ПереченьКолонок);
		//ТЧОбеспечение.Загрузить(ТабМатериалы.Выгрузить()); //**Метод недоступен на клиенте**//
		Для Каждого Стр из ТабМатериалы Цикл 
			НоваяСтрока = ТЧОбеспечение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		КонецЦикла;
		//ЭтапОбъект = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
		//ЭтапОбъект.
		//форма.объект.
		Форма.Объект.НеОтгружатьЧастями = Истина;
		Если ЭтоСписание Тогда 
			Форма.Объект.ДатаОтгрузки = Объект.ПериодОтгрузки;
		КонецЕсли;
		Попытка
			Форма.Записать();
		Исключение
			Сообщить("Ошибка записи "+СтрЭтап.ЭтапПроизводства+"  "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;	
	
	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПередНачаломИзменения(Элемент, Отказ)    
	
	ИсхДанныеСтроки = ЗапомнитьИсходныеДанныеСтроки();
	
КонецПроцедуры  

&НаКлиенте
Функция ЗапомнитьИсходныеДанныеСтроки()
	
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
		ЭтоСписание = Истина;  
		ДанныеТекСтроки = Элементы[ИмяДерева].ТекущиеДанные;
		ИДТекСтроки = ДанныеТекСтроки.ПолучитьИдентификатор();
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериалов, ДанныеТекСтроки);
		//ОбновитьИДТекущейСтроки(ИмяДерева, ИмяТаблицыИдентификаторов,ДанныеТекСтроки.Номенклатура, ДанныеТекСтроки.ЭтапПроизводства, ИДТекСтроки);
		Возврат ИсходныеДанныеСтрокиДереваМатериалов;
	ИначеЕсли ТекСтраница = "резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование";    
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		ЭтоСписание = Ложь; 
		ДанныеТекСтроки = Элементы[ИмяДерева].ТекущиеДанные;
		ИДТекСтроки = ДанныеТекСтроки.ПолучитьИдентификатор();
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериаловРезервирование, ДанныеТекСтроки);
		//ОбновитьИДТекущейСтроки(ИмяДерева, ИмяТаблицыИдентификаторов,ДанныеТекСтроки.Номенклатура, ДанныеТекСтроки.ЭтапПроизводства, ИДТекСтроки);
		Возврат ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
	КонецЕсли;
	
КонецФункции

&НаСервере
//
//Делаем отбор по старой номенклатуре (НЗ) и по новой (НЗ1). Затем добавляем строку в новый набор и заполняем по старой номенклатуре. Старый набор очищаем, Новый записываем
//
//
Процедура ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок, ТекСтрока, ЭтоСписание)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Пользователь = Пользователи.АвторизованныйПользователь(); 
	Для Каждого Стр из МассивСтруктурОбрабатываемыхСтрок Цикл 
		НЗ=РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ.Отбор.Пользователь.Установить(Пользователь);
		НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура); 
		Если ЗначениеЗаполнено(Стр.ЭтапПроизводства) Тогда 
			НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ВариантОбеспечения) Тогда 
			НЗ.Отбор.ВариантОбеспечения.Установить(Стр.ВариантОбеспечения); 
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Спецификация) Тогда 
			НЗ.Отбор.СпецификацияЭтапа.Установить(Стр.Спецификация);      
		КонецЕсли;
		НЗ.Прочитать();
		//Стр = НЗ[0];  
		
		НЗ1=РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ1.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ1.Отбор.Пользователь.Установить(Пользователь);
		НЗ1.Отбор.Номенклатура.Установить(ТекСтрока.Номенклатура);
		НЗ1.Прочитать();
		
		Для Каждого СтрНЗ из НЗ Цикл 
			//Сообщить(Строка(НЗ.Количество()) + " строк будет удалено из регистра."); 
			//Стр.Номенклатура = ТекСтрока.Номенклатура;
			
			ЕдиницаИзмерения = ТекСтрока.Номенклатура.ЕдиницаИзмерения; 
						
			НоваяСтрока = НЗ1.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрНЗ);  
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
			НоваяСтрока.Упаковка = ЕдиницаИзмерения;
			НоваяСтрока.ЕдиницаИзмерения = ЕдиницаИзмерения;
			//НоваяСтрока.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;  //.УдалитьОбособленно
			//+22.08.22
			НоваяСтрока.ДатаОтгрузки = Объект.ПериодОтгрузки;   
			НоваяСтрока.ПериодЗатрат = КонецМесяца(Объект.ПериодОтгрузки);
			//-22.08.22
			НоваяСтрока.ОтборПоВариантамОбеспечения = 1;                                                       
			НоваяСтрока.Обособленно = Истина;
			НоваяСтрока.Норматив = 0;
			//НоваяСтрока.Количество = 0;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество * НоваяСтрока.Упаковка.Числитель / НоваяСтрока.Упаковка.Знаменатель;
			НоваяСтрока.Обеспечить = СтрНЗ.Норматив; // - СтрНЗ.Количество;
			НоваяСтрока.КатегорияМатериала = ПолучитьКатегориюМатериала(ТекСтрока.Номенклатура);
			НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(ТекСтрока.Номенклатура,ТекСтрока.Склад);    
			
			Если НЗ1.Количество() > 0 Тогда 
				КлючСвязи = НЗ1[0].КлючСвязиСпецификация;
				НоваяСтрока.КлючСвязиСпецификация = КлючСвязи;
			КонецЕсли;
			
			//??НоваяСтрока.АналитикаУчетаНоменклатуры = Справочники.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка();
			//??НоваяСтрока.КорАналитикаУчетаНоменклатуры = Справочники.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка();  
		КонецЦикла;
		
		НЗ.Очистить();
		НЗ.Записать();
		
		НЗ1.Записать();  
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
//Остаток получаем по регистру ТоварыНаСкладах.
//Этот регистр не учитывает "мягкий резерв", который формируется и распределяется 
//при выбранном варианте обеспечения  "КОбеспечению" (Требуется) и НЕ "Обособленно"!!!!
Функция ПолучитьОстаток(Номенклатура) 
	
	Запрос = Новый Запрос;      
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			&Период,
	               |			Номенклатура = &Номенклатура
	               |				И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Количество() > 0 Тогда 
		Выборка.Следующий();
		Возврат Выборка.Остаток;
	Иначе 
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаСервере
Функция  ЗаменаМатералаВДереве(ИмяДерева, ИДСтрокиДерева, ЭтоСписание, ДанныеИсходнойСтроки)
//Процедура	
	ТекСтрока = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(ИДСтрокиДерева);
	ИсходнаяНоменклатура = ДанныеИсходнойСтроки.Номенклатура;
	ДанныеСтроки = Новый Структура("Номенклатура, ИсходнаяНоменклатура, ЭтапПроизводства, ВариантОбеспечения, Спецификация, КлючСвязиСпецификация");  
	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
	
	Если ТекСтрока <> Неопределено Тогда 
		Если ЗначениеЗаполнено(ИсходнаяНоменклатура) и ТекСтрока.Номенклатура <> ИсходнаяНоменклатура Тогда 
			Если ДанныеИсходнойСтроки.Уровень = 1 Тогда     
				//Надо обработать все строки по номенклатуре    
				ДанныеСтроки.Номенклатура = ИсходнаяНоменклатура;
				//ДанныеСтроки.ИсходнаяНоменклатура = ИсходнаяНоменклатура; 
				МассивСтруктурОбрабатываемыхСтрок.Добавить(ДанныеСтроки);
				ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок,ТекСтрока,ЭтоСписание);
			Иначе                                           
				//надо обработать только текущую строку, поэтому структура отбора по полным данным строки
				ЗаполнитьЗначенияСвойств(ДанныеСтроки,ДанныеИсходнойСтроки); 
				МассивСтруктурОбрабатываемыхСтрок.Добавить(ДанныеСтроки);
				ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок,ТекСтрока,ЭтоСписание);
			КонецЕсли;
		КонецЕсли
	КонецЕсли;
	
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь); 
	
	ОбновитьИдентификаторыСтрокДереваПослеИзмененияНоменклатуры(ИмяДерева,ТекСтрока, ИсходнаяНоменклатура);
	//ИДТекСтроки = Элементы[ИмяДерева].ТекущиеДанные.ПолучитьИдентификатор();
	//СтруктураВозврата = Новый Структура("НоваяНоменклатура, ИДТекСтроки", ТекСтрока.Номенклатура);
	Возврат ТекСтрока.Номенклатура; //СтруктураВозврата
	
КонецФункции //Процедуры

&НаСервере
Процедура ОбновитьИдентификаторыСтрокДереваПослеИзмененияНоменклатуры(ИмяДерева,ТекСтрока, ИсходнаяНоменклатура);
		
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуРегистра(МассивСтруктурОбрабатываемыхСтрок,ЭтоСписание)
	
	Для Каждого Стр из МассивСтруктурОбрабатываемыхСтрок Цикл 
		НЗ=РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
		НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);  
		Если ЗначениеЗаполнено(Стр.ЭтапПроизводства) Тогда 
			НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ВариантОбеспечения) Тогда 
			НЗ.Отбор.ВариантОбеспечения.Установить(Стр.ВариантОбеспечения); 
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Спецификация) Тогда 
			НЗ.Отбор.СпецификацияЭтапа.Установить(Стр.Спецификация);      
		КонецЕсли;
		НЗ.Прочитать();
		Сообщить(Строка(НЗ.Количество()) + " строк будет удалено из регистра.");
		НЗ.Очистить();
		НЗ.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуВРегистр(СтрокаДерева,ЭтоСписание,ДатаОтгрузки)
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Номенклатура.Установить(СтрокаДерева.Номенклатура);
	НЗ.Отбор.ЭтапПроизводства.Установить(СтрокаДерева.ЭтапПроизводства);
	НЗ.Отбор.ВариантОбеспечения.Установить(СтрокаДерева.ВариантОбеспечения); //??Почему устанавливается ВариантОбеспечения?? Д.б. "Требуется"!!!
	
	НЗ.Прочитать();
	НоваяСтрока = НЗ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДерева);
	НоваяСтрока.Пользователь = Пользователь;
	НоваяСтрока.ЭтоСписание = ЭтоСписание;  
	НоваяСтрока.Обеспечить = НоваяСтрока.Количество;     
	//+22.08.22
	НоваяСтрока.ДатаОтгрузки = ДатаОтгрузки;
	НоваяСтрока.ПериодЗатрат = КонецМесяца(ДатаОтгрузки);
	//-22.08.22
	////НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;
	//??10.03.22 НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Требуется;
	//??10.03.22 НоваяСтрока.Обособленно = Истина;
	НоваяСтрока.ОтборПоВариантамОбеспечения = УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(НоваяСтрока.ВариантОбеспечения);
	НоваяСтрока.КлючСвязиСпецификация = СтрокаДерева.КлючСвязиСпецификация;
	
	НЗ.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспечения)
	Если ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления
		ИЛИ ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда  //УдалитьОбособленно
		Возврат 1;
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда //или ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьИзЗаказов
		Возврат 2;
	//ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Требуется Тогда 
	//	Возврат 3;	
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда 
		Возврат 4;
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда //или ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно
		Возврат 5;
	КонецЕсли;
КонецФункции
	
&НаКлиенте            
//Старая//
Процедура ОбновитьИДТекущейСтрокиСтарая(ИмяДерева,ИмяТаблицыИдентификаторов,ТекНоменклатура,ЭтапПроизводства = Неопределено, ИДТекСтроки = Неопределено)
	//Если не ЗначениеЗаполнено(ИДТекСтроки) Тогда 
	//	Если ЗначениеЗаполнено(ЭтапПроизводства) Тогда 
	//		ТекущаяСтрока1Уровня = Ложь;
	//		////СтруктураПоиска.Вставить("ЭтапПроизводства", ЭтапПроизводства);
	//	Иначе 
	//		ТекущаяСтрока1Уровня = Истина;
	//	КонецЕсли;
	//	КоллекцияЭлементов1Уровня = Этаформа[ИмяДерева].ПолучитьЭлементы();
	//	Для Каждого СтрокаДерева из КоллекцияЭлементов1Уровня Цикл
	//		Если СтрокаДерева.Номенклатура = ТекНоменклатура Тогда 
	//			Если ТекущаяСтрока1Уровня Тогда 
	//				ИДТекСтроки = СтрокаДерева.ПолучитьИдентификатор();
	//				Прервать;
	//			Иначе 
	//				ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы();
	//				Для Каждого Стр из ПодчиненныеСтроки Цикл 
	//					Если Стр.ЭтапПроизводства = ЭтапПроизводства Тогда 
	//						ИДТекСтроки = Стр.ПолучитьИдентификатор();
	//						Прервать;
	//					КонецЕсли;
	//				КонецЦикла;
	//			КонецЕсли;
	//		Иначе 
	//			Продолжить;
	//		КонецЕсли; 
	//	КонецЦикла; 
	//КонецЕсли;
	//Если ИДТекСтроки = Неопределено Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//СтруктураПоиска = Новый Структура;
	//СтруктураПоиска.Вставить("ТекущаяСтрока", Истина);     
	//
	//МассивТекСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
	//Если МассивТекСтрока.Количество() = 0 Тогда
	//	НайденнаяСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
	//Иначе 
	//	НайденнаяСтрока = МассивТекСТрока[0];
	//КонецЕсли;
	//НайденнаяСтрока.Номенклатура  		= ТекНоменклатура; //ИсходнаяНоменклатура;
	//НайденнаяСтрока.ИсходнаяНоменклатура= ИсходнаяНоменклатура; //ИсходнаяНоменклатура;
	//НайденнаяСтрока.ЭтапПроизводства	= ?(ЗначениеЗаполнено(ЭтапПроизводства), ЭтапПроизводства, ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка"));
	//НайденнаяСтрока.Идентификатор		= ИДТекСтроки;
	//НайденнаяСтрока.ТекущаяСтрока		= Истина;  

КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПередУдалением(Элемент, Отказ) 
	
	//Запоминаем данные исходной строки дерева в реквизит формы ИсходныеДанныеСтрокиДереваМатериалов или ИсходныеДанныеСтрокиДереваМатериаловРезервирование
	ДанныеИсходнойСтроки =ЗапомнитьИсходныеДанныеСтроки();
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов";
		ЭтоСписание = Истина;
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ЭтоСписание = Ложь;
	КонецЕсли;  
	
	
	
	ОчиститьЗаписиРегистраДляУдаления(ДанныеИсходнойСтроки,ЭтоСписание);
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаписиРегистраДляУдаления(ДанныеУдаляемойСтроки, ЭтоСписание);
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Номенклатура.Установить(ДанныеУдаляемойСтроки.Номенклатура);    
	Если ЗначениеЗаполнено(ДанныеУдаляемойСтроки.ЭтапПроизводства) Тогда 
		НЗ.Отбор.ЭтапПроизводства.Установить(ДанныеУдаляемойСтроки.ЭтапПроизводства);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдаляемойСтроки.ВариантОбеспечения) Тогда 
		НЗ.Отбор.ВариантОбеспечения.Установить(ДанныеУдаляемойСтроки.ВариантОбеспечения);
	КонецЕсли;   
	Если ЗначениеЗаполнено(ДанныеУдаляемойСтроки.Спецификация) Тогда 
		НЗ.Отбор.СпецификацияЭтапа.Установить(ДанныеУдаляемойСтроки.Спецификация);      
	КонецЕсли;
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеПередНачаломИзменения(Элемент, Отказ)
	
	ДанныеТекСтроки = ЗапомнитьИсходныеДанныеСтроки(); 
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов"; 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование"; 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	КонецЕсли;
		
	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
	
КонецПроцедуры


&НаКлиенте
Процедура ОтгрузитьВыбранныеСтроки(Команда)
	Если ТекСтраница = "Списание" Тогда 
		Если ЗначениеЗаполнено(ОтборВариантОбеспечения) Тогда 
			Если ОтборВариантОбеспечения = 3 Тогда 
				Возврат;
				Сообщить("Отгружать материалы не требуется!", СтатусСообщения.Важное);
			ИначеЕсли ОтборВариантОбеспечения = 5 Тогда 
				Возврат;
				Сообщить("Материалы уже отгружены!", СтатусСообщения.Важное);
			КонецЕсли;
		КонецЕсли;
		ЭтоСписание = Истина;
		ИмяДерева = "ДеревоМатериалов";  
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	ИначеЕсли ТекСтраница = "Резервирование"  Тогда 
		ЭтоСписание = Ложь;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	КонецЕсли; 
		
	СписокВариантовОбеспечения = новый СписокЗначений;
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьОбособленно"));
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьИзЗаказов"));
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению"));
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется"));
	
	МассивСтруктурОбрабатываемыхСтрок = ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки(СписокВариантовОбеспечения, ИмяДерева, ЭтоСписание);
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
	ОтборПоВариантуОбеспечения = 5;
	ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивСтруктурОбрабатываемыхСтрок, ИмяДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения);
	
	//ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные;
	////ИДТекСтроки = Элемент.ТекущаяСтрока(); 
	//ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();
	//
	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства, ИДТекСтроки);
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,Неопределено);
	ВосстановитьСостояниеДерева(ИмяДерева);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьПоСпецификации(Команда)
	
	Если ТекСтраница = "Списание" Тогда 
		//ВРЕМЕННО закомментировала ВОЗВРАТ и добавила обработку процедуры для вкладки списание
		//При списании этапов, которые были ранее зарезервированы по этой обработке нельзя заполнять по спецификации
		//Возврат;               
		МассивЭтапов = Этапы.НайтиСтроки(Новый Структура("Обрабатывать", Истина));
		ИмяДерева = "ДеревоМатериалов";
		ЭтоСписание = Истина;
		//Для Каждого СтрЭтап из МассивЭтапов Цикл 
		//	ПараметрыФормы = Новый Структура("Ключ",СтрЭтап.ЭтапПроизводства);
		//	Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",ПараметрыФормы);
		//	Форма.Обеспечение_ЗаполнитьПоСпецификацииЗавершение(КодВозвратаДиалога.Да, Неопределено);
		//	
		//	//ТабОбеспечение = Форма.Объект.ОбеспечениеМатериаламиИРаботами;
		//	ТабМатериалы = Форма.Объект.ОбеспечениеМатериаламиИРаботами;
		//	ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапаДляСвертки();
		//	ЗаполнитьРегистрПоСпецификациям(ТабМатериалы, Форма.Объект.Ссылка, Истина, ПереченьКолонок);
		//	//   
		//КонецЦикла;   
		//ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериалов",Ложь);
		////УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериалов");	
		//
		//Сообщить("Материалы этапов заполенны по спецификации!", СтатусСообщения.Важное);	
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		МассивЭтапов = ЭтапыРезервирование.НайтиСтроки(Новый Структура("Обрабатывать", Истина)); 
		ИмяДерева = "ДеревоМатериаловРезервирование";   
		ЭтоСписание = Ложь;
	КонецЕсли;  
	
	Для Каждого СтрЭтап из МассивЭтапов Цикл 
		ПараметрыФормы = Новый Структура("Ключ",СтрЭтап.ЭтапПроизводства);
		Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",ПараметрыФормы);
		//Форма.Обеспечение_ЗаполнитьПоСпецификацииЗавершение(КодВозвратаДиалога.Да, Неопределено); 
		
		ПереченьДанных = Новый Структура("ОбеспечениеМатериаламиИРаботами");                         
		ДополнительныеПараметры = Новый Структура;
		Форма.Производство_ЗаполнитьПоСпецификацииЗавершение(ПереченьДанных,ДополнительныеПараметры);
		
		ТабМатериалы = Форма.Объект.ОбеспечениеМатериаламиИРаботами; 
		ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапаДляСвертки();
		ЗаполнитьРегистрПоСпецификациям(ТабМатериалы, Форма.Объект.Ссылка, ЭтоСписание, ПереченьКолонок);  //СтрЭтап.ЭтапПроизводства
	КонецЦикла;   
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	Сообщить("Материалы этапов заполенны по спецификации!", СтатусСообщения.Важное);
    
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьРегистрПоСпецификациям(ТаблицаДанных, СсылкаНаЭтап, ЭтоСписание, ПереченьКолонок)
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание); 
	НЗ.Отбор.ЭтапПроизводства.Установить(СсылкаНаЭтап);
	НЗ.Прочитать();  
	НЗ.Очистить();  
	НЗ.Записать();
	//
	//ТЗ = ТаблицаДанных.Выгрузить();
	////ТЗ = Новый ТаблицаЗначений;           
	//СтруктураОтбора = Новый СТруктура("Упаковка",Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	//МассивСтрокБезУпаковки = ТЗ.НайтиСтроки(СтруктураОтбора);
	//Для Каждого Элем из МассивСтрокБезУпаковки Цикл 
	//	Элем.Упаковка = Элем.Номенклатура.ЕдиницаИзмерения;
	//КонецЦикла;
	//ТЗ.Свернуть(ПереченьКолонок,"Количество, КоличествоУпаковок");
	////ТабОстатки = ПолучитьТабОстаткиМатериалов(ТаблицаДанных);
	Для каждого Стр из ТаблицаДанных Цикл //ТаблицаДанных Цикл	
		НоваяСтрока	= НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);                   
		//НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОбособленно;  
		//+19.04.22
		//Если Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Требуется Тогда 
		//	НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Требуется;
		//	НоваяСтрока.Обособленно = Истина;
		//КонецЕсли;  
		//-
		Если Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
			НоваяСтрока.Обособленно = Истина;
		КонецЕсли;              

		ДатаОтгрузки = ?(ЭтоСписание, Объект.ПериодОтгрузки, СсылкаНаЭтап.ДатаОтгрузки);
		//Остаток будет расчитан по регистрам при Обновлении материалов в Дереве по Регистру.
		//НоваяСтрока.Остаток = ПолучитьОстаток(Стр.Номенклатура); //ТабОстатки.Найтистроки(Новый Структура("Номенклатура",Стр.Номенклатура))[0].Остаток;
		НоваяСтрока.Обеспечить = Стр.Количество;
		НоваяСтрока.Норматив = Стр.Количество;
		НоваяСтрока.Пользователь = Пользователь;
		НоваяСтрока.ЭтоСписание = ЭтоСписание;
		НоваяСтрока.ЭтапПроизводства = СсылкаНаЭтап;
		НоваяСтрока.СпецификацияЭтапа = СсылкаНаЭтап.Спецификация;
		НоваяСтрока.КатегорияМатериала = ПолучитьКатегориюМатериала(Стр.Номенклатура);
		НоваяСтрока.ЕдиницаИзмерения = Стр.Номенклатура.ЕдиницаИзмерения;
		НоваяСтрока.Упаковка = ?(ЗначениеЗаполнено(Стр.Упаковка),Стр.Упаковка,НоваяСтрока.ЕдиницаИзмерения); 
		НоваяСтрока.ОтборПоВариантамОбеспечения = 1; //2; ?? 
		НоваяСтрока.ДатаОтгрузки = ДатаОтгрузки;
		//НоваяСтрока.ЭтапПроизводства = СсылкаНаЭтап; // УСТАНОВЛЕН ОТБОР ПО ЗНАЧЕНИЮ ЭТАПА
		
	КонецЦикла;    
	НЗ.Записать();
	
КонецПроцедуры    

#Область ЗаполнениеПоСпецификации

&НаСервере  
Процедура ЗаполнитьОбеспечениеПоСпецификацииНаСервере()
	
	//Объект.ОбеспечениеМатериаламиИРаботами.Очистить();
	//	
	//ДанныеСпецификации = ПолучитьНормативыПоСпецификации("МатериалыИУслуги", Ложь, Истина);
	//Если ДанныеСпецификации = Неопределено
	//	ИЛИ НЕ ДанныеСпецификации.Свойство("МатериалыИУслуги") Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ОбщегоНазначенияУТ.ДобавитьСтрокиВТаблицу(
	//	Объект.ОбеспечениеМатериаламиИРаботами,
	//	ДанныеСпецификации.МатериалыИУслуги,
	//	Новый Структура("КлючСвязиСпецификация", "КлючСвязи"),
	//	Новый Структура("ДатаОтгрузки", Объект.ЖелаемаяДатаОбеспечения));
	//
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства",
	//	ОбеспечениеПроизводстваКлиентСервер.ПараметрыДействияПроверитьЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства(Объект));
	//
	//ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.ОбеспечениеМатериаламиИРаботами, СтруктураДействий, Неопределено);
	//
	//ПослеИзмененияСтрокТЧПрограммноНаСервере("ОбеспечениеМатериаламиИРаботами",, СтруктураДействий);
	//
	//ПроверитьНаличиеУточненийНоменклатуры("ОбеспечениеМатериаламиИРаботами", ЕстьУточненияМатериалов);
	//НастроитьЗависимыеЭлементыФормы(ЭтаФорма, "ЕстьУточненияМатериалов");
	
КонецПроцедуры

//&НаСервере
//Функция ПолучитьНормативыПоСпецификации(Знач ПереченьДанных, ПолучатьМатериалыПоТребованию, ОкруглятьКоличествоШтучныхТоваров)
//	//
//	//Нормативы = Документы.ЭтапПроизводства2_2.ПолучитьНормативыПоСпецификации(ДанныеПартииПроизводства,
//	//																			ПереченьДанных,
//	//																			ПолучатьМатериалыПоТребованию,
//	//																			ОкруглятьКоличествоШтучныхТоваров,
//	//																			Новый Структура("Этап", Объект.Этап));
//	//Возврат Нормативы;
//	//
//КонецФункции

//Заполнение по спецификации
#КонецОбласти 

&НаСервере
Функция ПолучитьКатегориюМатериала(Номенклатура) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Владелец КАК Свойство,
	               |	ЗначенияСвойствОбъектов.Ссылка КАК КатегорияМатериала,
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |		ПО НоменклатураДополнительныеРеквизиты.Свойство = ЗначенияСвойствОбъектов.Владелец
	               |			И НоменклатураДополнительныеРеквизиты.Значение = ЗначенияСвойствОбъектов.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство",Объект.ДР_КатегорияМатериала);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КатегорияМатериала;
	Иначе 
		Возврат Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьТабОстаткиМатериалов(ТабМатериалов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабМатериалов.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ТабНоменклатура
	               |ИЗ
	               |	&ТабМатериалов КАК ТабМатериалов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабНоменклатура.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) КАК Остаток
	               |ИЗ
	               |	ТабНоменклатура КАК ТабНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
	               |		ПО ЕСТЬNULL(ТабНоменклатура.Номенклатура,Значение(Справочник.Номенклатура.ПустаяСсылка)) = ЕСТЬNULL(СвободныеОстаткиОстатки.Номенклатура,Значение(Справочник.Номенклатура.ПустаяСсылка))";
	Запрос.УстановитьПараметр("ТабМатериалов", ТабМатериалов.Выгрузить());
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов"; 
		ЭтоСписание = Истина;
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ЭтоСписание = Ложь;
	КонецЕсли;       
	Если Элементы[ИмяДерева].ТекущиеДанные.Уровень = 1 Тогда 
		Возврат;
	КонецЕсли;
	//ДобавитьСтрокуВТекущуюВетку(ИмяДерева, ЭтоСписание);
	РазделитьСтроку(ИмяДерева,ЭтоСписание);
	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
	
КонецПроцедуры

&НаСервере 
Функция РазделитьСтроку(ИмяДерева, ЭтоСписание)
	
	//1.Добавить в Регистр строку по данным текущей строки
	//2.перерисовать дерево
	
	//РодительскаяСтрока = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(ИДТекСтроки).ПолучитьРодителя(); 
	Если ЭтоСписание Тогда 
		ИсходныеДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериалов;
	Иначе 
		ИсходныеДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
	КонецЕсли;
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь()); 
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Номенклатура.Установить(ИсходныеДанныеСтроки.Номенклатура);    
	НЗ.Отбор.ЭтапПроизводства.Установить(ИсходныеДанныеСтроки.ЭтапПроизводства);    
	НЗ.Отбор.ВариантОбеспечения.Установить(ИсходныеДанныеСтроки.ВариантОбеспечения);  
	//НЗ.Отбор.ИсходнаяНоменклатура.Установить(ИсходныеДанныеСтроки.ИсходнаяНоменклатура);
	НЗ.Прочитать(); 
	НоваяСтрока = НЗ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,НЗ[0]);
	Новаястрока.ИсходнаяНоменклатура = Справочники.Номенклатура.ПустаяССылка();
	НоваяСтрока.Количество = ИсходныеДанныеСтроки.Норматив - ИсходныеДанныеСтроки.Количество;
	НоваяСтрока.Обеспечить = НоваяСтрока.Количество;
	//НЗ[0].Количество = НЗ[0].Количество - 1;
	//НЗ[0].Обеспечить = НЗ[0].Обеспечить - 1;
	НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;   //.УдалитьОбособленно;
	НоваяСтрока.Обособленно = Истина;
	НоваяСтрока.ОтборПоВариантамОбеспечения = 1;
	
	НЗ.Отбор.ВариантОбеспечения.Использование = Ложь;
	НЗ.Записать();
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь); 
	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
		
КонецФункции

&НаКлиенте
Процедура ВариантОбеспеченияРезервированиеПриИзменении(Элемент)
	ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериаловРезервирование",Ложь);
	//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериаловРезервирование");
КонецПроцедуры

&НаСервере
Функция ДеревоМатериаловРезервированиеПередУдалениемНаСервере(ИДТекСтроки)
	
	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	ИмяДерева = "ДеревоМатериаловРезервирование";
	СтруктураСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, Спецификация, ВариантОбеспечения");
	ЗаполнитьЗначенияСвойств(СтруктураСтроки,ИсходныеДанныеСтрокиДереваМатериаловРезервирование);
	
	МассивСтруктурОбрабатываемыхСтрок.Добавить(СтруктураСтроки);
	Попытка 
		//НомерТекуще Элементы.ДеревоМатериаловРезервирование.ТекущаяСтрока
		УдалитьСтрокуРегистра(МассивСтруктурОбрабатываемыхСтрок, Ложь);
		
		ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
		Возврат Истина;
	Исключение       
		Сообщить("Ошибка при удалении данных регистра по номенклатуре " + СтруктураСтроки.Номенклатура);
		Возврат Ложь;
	КонецПопытки;
	
	//НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	//НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь()); 
	//НЗ.Отбор.ЭтоСписание.Установить(Ложь);
	//НЗ.Отбор.Номенклатура.Установить(ИсходныеДанныеСтрокиДереваМатериаловРезервирование.Номенклатура);
	//Если ИсходныеДанныеСтрокиДереваМатериаловРезервирование.Уровень <> 1 Тогда 
	//	НЗ.Отбор.ЭтапПроизводства.Установить(ИсходныеДанныеСтрокиДереваМатериаловРезервирование.ЭтапПроизводства);
	//КонецЕсли;
	//НЗ.Прочитать();

	//Попытка
	//	НЗ.Очистить();
	//	НЗ.Записать(); 
	//	ОбновитьДанныеПоМатериаламНаСервере(
	//	Возврат Истина; 
	//Исключение
	//	Возврат Ложь;
	//КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеПередУдалением(Элемент, Отказ)
	СтрокаУдалена = ДеревоМатериаловРезервированиеПередУдалениемНаСервере(Элемент.ТекущиеДанные.ПолучитьИдентификатор());
	Если не СтрокаУдалена Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбеспеченияПриИзменении(Элемент)
	ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериалов",Ложь);
	//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериалов");
КонецПроцедуры


&НаКлиенте
Процедура ДеревоМатериаловРезервированиеПослеУдаления(Элемент)
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов";
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование";
	КонецЕсли;
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, Ложь);    
	ВосстановитьСостояниеДерева(ИмяДерева);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере(ИмяТЧ, ИмяДерева)
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРезервВыделенныхСтрок(Команда)      
	
	Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
		//МассивСтрок = Элементы.ДеревоМатериаловРезервирование.ВыделенныеСтроки;
		ИмяДерева = "ДеревоМатериаловРезервирование";
		ЭтоСписание = Ложь;
	ИначеЕсли Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
		//МассивСтрок = Элементы.ДеревоМатериалов.ВыделенныеСтроки;
		ИмяДерева = "ДеревоМатериалов";
		ЭтоСписание = Истина;
	КонецЕсли;
	
	СписокВариантовОбеспечения = Новый СписокЗначений;
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"));
	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьИзЗаказов"));    
	
	МассивСтруктурОбрабатываемыхСтрок = ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки(СписокВариантовОбеспечения, ИмяДерева, ЭтоСписание);
	
	//ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьОбособленно");
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению");    //РезервироватьПоМереПоступления");
	ОтборПоВариантуОбеспечения = 1;
	
	ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивСтруктурОбрабатываемыхСтрок, ИмяДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения);

КонецПроцедуры  

&НаКлиенте
функция ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки(СписокВариантовОбеспечения, ИмяДерева, ЭтоСписание)
	
	МассивСтрок = Элементы[ИмяДерева].ВыделенныеСтроки;
	МассивОбрабатываемыхСтрок = Новый Массив;
	Для Каждого Стр из МассивСтрок Цикл  
		ОтменаРезерва = не МассивОбрабатываемыхСтрок.Найти(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада")) = Неопределено;
		Если ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Стр).Остаток = 0 и не ОтменаРезерва Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Стр) <> Неопределено Тогда 
			ДочерниеСтроки = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Стр).ПолучитьЭлементы();
			Если ДочерниеСтроки.Количество() <> 0 Тогда 
				Для Каждого НСтр из ДочерниеСтроки Цикл 
					МассивОбрабатываемыхСтрок.Добавить(НСтр.ПолучитьИдентификатор());
				КонецЦикла;
			Иначе 
				МассивОбрабатываемыхСтрок.Добавить(Стр);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
	Для Каждого МСтр из МассивОбрабатываемыхСтрок Цикл 
		ТекСтрока = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(МСтр);
		ДанныеСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, ВариантОбеспечения");
		Если ТекСтрока <> Неопределено Тогда        
			Если СписокВариантовОбеспечения.НайтиПоЗначению(Текстрока.ВариантОбеспечения) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
			МассивСтруктурОбрабатываемыхСтрок.Добавить(ДанныеСтроки);
		КонецЕсли;
	КонецЦикла;                              
	
	Возврат МассивСтруктурОбрабатываемыхСтрок;
	
КонецФункции


&НаКлиенте
Процедура ДеревоМатериаловРезервированиеПередРазворачиванием(Элемент, Строка, Отказ)
	// Запоминаем идентификатор строки развернутого узла
	//**/////////////////////////////////////////////////////////////
	//Элемент.ТекущаяСтрока = Строка;
	ТекСтрока = Элемент.ДанныеСтроки(Строка);
	ТекущаяНоменклатура = ТекСтрока.Номенклатура;
	ИДТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Идентификатор",Строка); 
	//СтруктураПоиска.Вставить("ТекущаяСтрока",Ложь); 

	МассивНайденныхСтрок = ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.НайтиСтроки(СтруктураПоиска);
	КоличествонайденныхСтрок = МассивНайденныхСтрок.Количество();
	
	Если КоличествонайденныхСтрок = 0 Тогда 
		СтрокаЗаписи = ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Добавить();
		СтрокаЗаписи.Номенклатура = ТекущаяНоменклатура;
		СтрокаЗаписи.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
		СтрокаЗаписи.Идентификатор = ИДТекущейСтроки;
		СтрокаЗаписи.ТекущаяСтрока = Ложь;
	КонецЕсли;
	//**//////////////////////////////////////////////////////////////
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеПередСворачиванием(Элемент, ИДСтроки, Отказ)
	//Удалим из ТаблицыИдентификаторв свернутый узел
	 ТекСтрока = ЭтаФорма.ДеревоМатериаловРезервирование.НайтиПоИдентификатору(ИДСтроки);
	 Если ТекСтрока = Неопределено Тогда
		//ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование
		Возврат;
	КонецЕсли;
	
	//ТекущаяНоменклатура = ТекСтрока.Номенклатура;  
	//ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
	//ИДТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Идентификатор",ИДСтроки); //ИДТекущейСтроки);
		
	МассивНайденныхСтрок = ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.НайтиСтроки(СтруктураПоиска);
	КоличествонайденныхСтрок = МассивНайденныхСтрок.Количество();
	Если КоличествонайденныхСтрок = 1 Тогда 
		СтрокаТаблицыИД = МассивНайденныхСтрок[0];
		ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Удалить(СтрокаТаблицыИД);
	ИначеЕсли КоличествонайденныхСтрок > 1 Тогда 
		СтрокаТаблицыИД = МассивНайденныхСтрок[0];
		ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Удалить(СтрокаТаблицыИД);
		Сообщить("В таблице Идентификаторов строк найдено более 1 строки. Уточните значения поиска");
	Иначе 
		Сообщить("В таблице Идентификаторов строк по условиям поиска строк не найдено.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеОбеспечитьПриИзменении(Элемент) 
	
	//ОБРАБОТКИ ПОКА НЕТ!!!!
	
	ИмяДерева = "ДеревоМатериаловРезервирование";
	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	
	
	//ИДТекСтроки = Элементы[ИмяДерева].ТекущаяСтрока;
	//
	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ИсходныеДанныеСтрокиДереваМатериаловРезервирование.Номенклатура, ИсходныеДанныеСтрокиДереваМатериаловРезервирование.ЭтапПроизводства, ИДТекСтроки);
	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева
	ВосстановитьСостояниеДерева(ИмяДерева);        
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПередРазворачиванием(Элемент, Строка, Отказ)
	// Запоминаем идентификатор строки развернутого узла
	//**/////////////////////////////////////////////////////////////
	//Элемент.ТекущаяСтрока = Строка;
	ТекСтрока = Элемент.ДанныеСтроки(Строка);
	ТекущаяНоменклатура = ТекСтрока.Номенклатура;
	ИДТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Идентификатор",Строка); 
	//СтруктураПоиска.Вставить("ТекущаяСтрока",Ложь); 

	МассивНайденныхСтрок = ИдентификаторыРаскрытыхСтрокДереваМатериалов.НайтиСтроки(СтруктураПоиска);
	КоличествонайденныхСтрок = МассивНайденныхСтрок.Количество();
	
	Если КоличествонайденныхСтрок = 0 Тогда 
		СтрокаЗаписи = ИдентификаторыРаскрытыхСтрокДереваМатериалов.Добавить();
		СтрокаЗаписи.Номенклатура = ТекущаяНоменклатура;
		СтрокаЗаписи.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
		СтрокаЗаписи.Идентификатор = ИДТекущейСтроки;
		СтрокаЗаписи.ТекущаяСтрока = Ложь;
	КонецЕсли;
	//**//////////////////////////////////////////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловПередСворачиванием(Элемент, ИДСтроки, Отказ)
	//Удалим из ТаблицыИдентификаторв свернутый узел
	 ТекСтрока = ЭтаФорма.ДеревоМатериалов.НайтиПоИдентификатору(ИДСтроки);
	 Если ТекСтрока = Неопределено Тогда
		//ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование
		Возврат;
	КонецЕсли;
	
	//ТекущаяНоменклатура = ТекСтрока.Номенклатура;  
	//ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
	//ИДТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Идентификатор",ИДСтроки); //ИДТекущейСтроки);
		
	МассивНайденныхСтрок = ИдентификаторыРаскрытыхСтрокДереваМатериалов.НайтиСтроки(СтруктураПоиска);
	КоличествонайденныхСтрок = МассивНайденныхСтрок.Количество();
	Если КоличествонайденныхСтрок = 1 Тогда 
		СтрокаТаблицыИД = МассивНайденныхСтрок[0];
		ИдентификаторыРаскрытыхСтрокДереваМатериалов.Удалить(СтрокаТаблицыИД);
	ИначеЕсли КоличествонайденныхСтрок > 1 Тогда 
		СтрокаТаблицыИД = МассивНайденныхСтрок[0];
		ИдентификаторыРаскрытыхСтрокДереваМатериалов.Удалить(СтрокаТаблицыИД);
		Сообщить("В таблице Идентификаторов строк найдено более 1 строки. Уточните значения поиска");
	Иначе 
		Сообщить("В таблице Идентификаторов строк по условиям поиска строк не найдено.");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьОстаткиНаТекущуюДатуПриСписанииПриИзменении(Элемент)
	Элементы.ДатаОстатковДляСписания.Видимость = Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании; 
	Если Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании Тогда 
		Если Месяц(ТекущаяДата()) <> Месяц(Объект.ПериодОтгрузки) Тогда 
			Объект.ДатаОстатковДляСписания = КонецМесяца(Объект.ПериодОтгрузки);
		//Иначе 
		//	Объект.ДатаОстатковДляСписания = Дата(1,1,1);
		КонецЕсли;
	Иначе // не Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании Тогда 
		Объект.ДатаОстатковДляСписания = Дата(1,1,1);
	КонецЕсли;                          
	ИмяДерева = "ДеревоМатериалов";
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	ВосстановитьСостояниеДерева(ИмяДерева);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОстатковДляСписанияПриИзменении(Элемент)
	Если Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании Тогда 
		Если не ЗначениеЗаполнено(Объект.ДатаОстатковДляСписания) и Месяц(Объект.ПериодОтгрузки) <> Месяц(ТекущаяДата()) Тогда 
			Объект.ДатаОстатковДляСписания = КонецМесяца(Объект.ПериодОтгрузки);
			Сообщить("Дата остатков не должна превышать конец месяца Даты списания!");
		ИначеЕсли ЗначениеЗаполнено(Объект.ДатаОстатковДляСписания) и Месяц(Объект.ПериодОтгрузки) <> Месяц(Объект.ДатаОстатковДляСписания) Тогда
			Объект.ДатаОстатковДляСписания = КонецМесяца(Объект.ПериодОтгрузки);
			Сообщить("Дата остатков не должна превышать конец месяца Даты списания!");
		КонецЕсли;
	Иначе    
		Объект.ДатаОстатковДляСписания = Дата(1,1,1);
	КонецЕсли; 
	ИмяДерева = "ДеревоМатериалов";
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	ВосстановитьСостояниеДерева(ИмяДерева);
КонецПроцедуры

&НаСервере
Процедура ОбособленноПриИзмененииНаСервере(ИмяДерева, ДанныеТекущейСтроки)
	
	//Если ТекСтраница = "Списание" Тогда
	//	Если ДанныеТекущейСтроки.Уровень = 1 Тогда 
	//		
	//	КонецЕсли;
	//ИначеЕсли ТекСтраница = "Резервирвоание" Тогда 
	//	Если ДанныеТекущейСтроки.Уровень = 1 Тогда 
	//		//
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеОбособленноПриИзменении(Элемент)
	ОбособленноПриИзмененииНаСервере("ДеревоМатериаловРезервирование",Элемент.ТекущиеДанные);
	//ДеревоМатериаловРезервированиеОбособленноПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обособленно(Команда)
	//Только для Резервирования    
	ИмяДерева = "ДеревоМатериаловРезервирование";
	ЭтоСписание = Ложь;
	Обособленно = Истина;
	УстановитьпризнакОбособленноВРегистре(ИмяДерева,ЭтоСписание,Обособленно); //Пользователи.АвторизованныйПользователь());
КонецПроцедуры

&НаКлиенте
Процедура НеОбособленно(Команда)
	//Только для Резервирования
	ИмяДерева = "ДеревоМатериаловРезервирование";
	ЭтоСписание = Ложь;                               
	Обособленно = Ложь;
	УстановитьпризнакОбособленноВРегистре(ИмяДерева,ЭтоСписание,Обособленно); //,Пользователи.АвторизованныйПользователь());
КонецПроцедуры

&НаСервере
Процедура УстановитьпризнакОбособленноВРегистре(ИмяДерева,ЭтоСписание, Обособленно)   //, ТекПользователь)
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Прочитать();
	Для Каждого СтрНЗ из НЗ Цикл 
		СтрНЗ.Обособленно = Обособленно;
	КонецЦикла;                         
	НЗ.Записать();
	
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	
КонецПроцедуры     

&НаСервере
Процедура УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,ВариантОбеспеченияДо, ВариантОбеспеченияПосле)
	//////////1. Получим данные регистра с учетом отборов (Категория материала, ОтборПоВариантамОбеспечения, Пользователь, ЭтоСписание, ВариантОбеспечения (исходный))
	//////////2. Изменим данные в соответствии с данными дерева (синхронизация по полю ИдентификаторСтрокиРегистра)
	//////////3. Загрузить новые данные в регистр
	Дерево = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	Для Каждого Строка из Дерево.Строки Цикл 
		Если ТекНоменклатура <> Строка.Номенклатура Тогда
			ТекНоменклатура = Строка.Номенклатура;
			ТекОстаток = Строка.Остаток;
		КонецЕсли;       
		НоменклатураБезОстатка = Новый ТаблицаЗначений;
		НоменклатураБезОстатка.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		НоменклатураБезОстатка.Колонки.Добавить("Этап",Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
		
		//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
		//ТекстНачалаСообщения = "Отсутствует остаток для резервирования по номенклатуре ";
		//ТекстСообщенияОтсутствуетОстаток = "";
		Для Каждого Стр из Строка.Строки Цикл 
			Если ТекНоменклатура = Стр.Номенклатура и (ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.СоСклада 
				или ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.Отгрузить) тогда
				ТекОстаток = ТекОстаток - Стр.Обеспечить;
				Если ТекОстаток < 0 Тогда 
					//Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства + Символы.ПС,СтатусСообщения.Важное);
					//ТекстСообщенияОтсутствуетОстаток = ТекстНачалаСообщения + " " + Стр.Номенклатура + ", " + Стр.ЭтапПроизводства + Символы.ПС;
					ПараметрыПоиска = Новый Структура("Номенклатура,Этап");
					МассивСтрокБезОстатка = НоменклатураБезОстатка.НайтиСтроки(ПараметрыПоиска);
					Если МассивСтрокБезОстатка.Количество() = 0 Тогда 
						НоваяСтрока = НоменклатураБезОстатка.Добавить();
						НоваяСтрока.Номенклатура = Стр.Номенклатура ;
						НоваяСтрока.Этап = Стр.ЭтапПроизводства;     
					КонецЕсли;
					
					Продолжить;
					
				КонецЕсли;
			КонецЕсли;
			//Если ТекОстаток >= 0 Тогда			
			НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
			НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
			НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
			НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
			НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);   
			
			//Отбор по ВариантамОбеспечения устанавливаем только по значениям ОтборВариантОбеспечения или ОтборВариантОбеспеченияРезервирование 
			//ЕСЛИ этот отбор ЗАДАН
			//Остальное решаем какое значениеобрабатывать и какое значение установить в момент формирования записи регистра 
			//ОтборВариантОбеспечения 
			//Количество (Обеспечить)
			
			Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
				НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
			ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
				НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
			КонецЕсли;
			Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
				НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериала);
			ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда 
				НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериалаРезервирование);
			КонецЕсли;
			НЗ.Прочитать();
			Если НЗ.Количество() = 1 Тогда 
				Для Каждого СтрНЗ из НЗ Цикл 
					//Если НЗ.Отбор[НЗ.Отбор.Количество()-28] = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения").Использование  = Ложь Тогда 
						//НЗ.Отбор.Удалить(НЗ.Отбор.Количество()-28);
					//НЗ.Отбор[НЗ.Отбор.Количество()-28].Использование = Ложь;
					//КонецЕсли;
					//СтрНЗ.Количество = Стр.Обеспечить + Стр.;     
					Если ЭтоСписание Тогда 
						Если ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
							СтрНЗ.Обеспечить = СтрНЗ.Количество - СтрНЗ.Обеспечить;
							//СтрНЗ.Количество = СтрНЗ.Обеспечить + СтрНЗ.Количество;
						КонецЕсли;
					Иначе 
						//СтрНЗ.Количество = СтрНЗ.Обеспечить;
						Если ЗначениеЗаполнено(ВариантОбеспеченияПосле) и ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.СоСклада Тогда  
							СтрНЗ.Обеспечить = СтрНЗ.Количество - СтрНЗ.Обеспечить;
							//СтрНЗ.Количество = СтрНЗ.Обеспечить + СтрНЗ.Количество;
						ИначеЕсли ЗначениеЗаполнено(ВариантОбеспеченияПосле) и ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
							//СтрНЗ.Обеспечить = СтрНЗ.Количество - ?(ЗначениеЗаполнено(СтрНЗ.Обеспечить),СтрНЗ.Обеспечить,0) - ?(ЗначениеЗаполнено(СтрНЗ.о;
						ИначеЕсли ЗначениеЗаполнено(ВариантОбеспеченияПосле) и ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.КОбеспечению
							и ЗначениеЗаполнено(ВариантОбеспеченияДо) и ВариантОбеспеченияДо = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
							СтрНЗ.Обеспечить = СтрНЗ.Количество + Стр.Зарезервировать;
							//СтрНЗ.Количество = СтрНЗ.Количество + Стр.Зарезервировать;
						КонецЕсли;   
					КонецЕсли;
					СтрНЗ.ВариантОбеспечения = ВариантОбеспеченияПосле; 
					
					//ИндексВариантаОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Индекс(ВариантОбеспеченияПосле);
					//ИмяПеречисления = Строка(Метаданные.Перечисления.ВариантыОбеспечения.ЗначенияПеречисления[ИндексВариантаОбеспеченияНовый]);
					//	
					//СтрНЗ.ОтборПоВариантамОбеспечения = СоответствиеВариантовОбеспеченияОтбору[ИмяПеречисления];
					СтрНЗ.ОтборПоВариантамОбеспечения = УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспеченияПосле);
					
					Если ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
						Если СтрНЗ.Обособленно Тогда 
							СтрНЗ.Обособленно = Ложь; 
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрНЗ.Назначение) Тогда 
							СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();   
						КонецЕсли;
					ИначеЕсли ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда 
						Если СтрНЗ.Обособленно Тогда 
							СтрНЗ.Обособленно = Ложь;
						КонецЕсли;
					ИначеЕсли СтрНЗ.Обособленно и не ЗначениеЗаполнено(СтрНЗ.Назначение) Тогда 
						СтрНЗ.Назначение = СтрНЗ.ЭтапПроизводства.НазначениеПродукция; //НазначениеМатериалы; 
					ИначеЕсли не СтрНЗ.Обособленно и ЗначениеЗаполнено(СтрНЗ.Назначение) Тогда  
						СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();            
					ИначеЕсли ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
						Если СтрНЗ.Обособленно Тогда 
							СтрНЗ.Обособленно = Ложь;
						КонецЕсли;
						Если СтрНЗ.Обособленно Тогда 
							СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();
						КонецЕсли;
					Иначе 
						Сообщить("Неучтенный вариант события!!! Обратитесь к администратору!",СтатусСообщения.Важное);                           
					КонецЕсли;			 
				КонецЦикла;
				ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
				Если не ЭлементОтбора = Неопределено Тогда 
					ЭлементОтбора.Использование = Ложь;
				КонецЕсли;
				НЗ.Записать();
			ИначеЕсли НЗ.Количество() > 1 Тогда 
				//Найти запись с нужным вариантом обеспечения
				Сообщить("Найдено более 1 строки в регистре, уточните условия поиска",СтатусСообщения.Важное);
			Иначе 
				Сообщить("Не найдена строка регистра для корректировки данных, "+стр.Номенклатура + " "+ Стр.ЭтапПроизводства,СтатусСообщения.Важное);
			КонецЕсли;
			//Иначе 
			//	Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства + Символы.ПС,СтатусСообщения.Важное);
			//КонецЕсли;
		КонецЦикла;	
		ТекстНачалаСообщения = "Отсутствует остаток для резервирования по номенклатуре ";
		ТекстСообщенияОтсутствуетОстаток = "";
		Для Каждого СтрТЗ из НоменклатураБезОстатка Цикл  
			ТекстСообщенияОтсутствуетОстаток = ТекстСообщенияОтсутствуетОстаток + ТекстНачалаСообщения + " " + СтрТЗ.Номенклатура + ", " + СтрТЗ.Этап + Символы.ПС;
		КонецЦикла;  
		Если не ТекстСообщенияОтсутствуетОстаток = "" Тогда 
			Сообщить(ТекстСообщенияОтсутствуетОстаток,СтатусСообщения.Важное);
		КонецЕсли;
		//Для Каждого СтрТЗ из НоменклатураБезОстатка Цикл 
		//	ТекстСообщения = ТекстСообщения + ТекстНачалаСообщения + " " + СтрТЗ.Номенклатура + ", " + СтрТЗ.Этап + Символы.ПС;
		//КонецЦикла;
		//Сообщить(ТекстСообщенияОтсутствуетОстаток);
	КонецЦикла;
	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МягкийРезерв(Команда)
	ИмяДерева = "ДеревоМатериаловРезервирование";
	ЭтоСписание = Ложь;                               
	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,, ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления"));
	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	//УстановитьпризнакОбособленноВРегистре(ИмяДерева,ЭтоСписание,Обособленно); //,Пользователи.АвторизованныйПользователь());
	
КонецПроцедуры

//Для возможности отмены закрытия формы без потери данных 
ЗакрытьФормуОбработки = Ложь;    


