//							  
//&НаСервере
//Процедура ЗагрузитьПодборНаСервере()
//	
//	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
//	ТабПодбора = ПолучитьТаблицуПодбора();   
//	Если ТабПодбора = Неопределено Тогда 
//		Сообщить("Нет данных для загрузки");
//		Возврат;
//	КонецЕсли;
//	
//	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();  
//	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
//	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());  
//	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
//	НомерЭтапа = 1;
//	ОстатокШтук = 0;
//	Для Каждого СтрТПодбора из ТабПодбора Цикл 
//		НЗ.Отбор.ЭтапПРоизводства.Установить(СтрТПодбора.ЭтапПроизводства);
//		НЗ.Отбор.Номенклатура.Установить(СтрТПодбора.Номенклатура);
//		НЗ.Прочитать();  
//		Если НЗ.Количество() > 0 Тогда   
//			Для Каждого СтрНЗ из НЗ Цикл   
//				//Если упаковка - шт, ШтукиТолькоЦеликом и количество Подобрано НЕ ЦЕЛОЕ
//				//переделим подобранное количество по этапам
//				Если ОбработкаОбъект.УпаковкаШтуки(СтрТПодбора.Упаковка) и ШтукиТолькоЦеликом и (СтрТПодбора.КоличествоУпаковок<>Цел(СтрТПодбора.КоличествоУпаковок)) Тогда 
//					Если НомерЭтапа <> СтрТПодбора.КоличествоЭтапов Тогда 
//						КоличествоПодобрано = Цел(СтрТПодбора.КоличествоУпаковок); // + ОстатокШтук; 
//						ОстатокТекСтроки = СтрТПодбора.КоличествоУпаковок - Цел(СтрТПодбора.КоличествоУпаковок);
//						ОстатокШтук = ОстатокШтук + ОстатокТекСтроки;
//						НомерЭтапа = НомерЭтапа + 1;
//					Иначе 
//						КоличествоПодобрано = ОстатокШтук;
//					КонецЕсли;
//				Иначе 	
//					КоличествоПодобрано = СтрТПодбора.КоличествоУпаковок;
//				КонецЕсли;
//				Если не ЗначениеЗаполнено(СтрНЗ.КатегорияМатериала) Тогда 
//					СтрНЗ.КатегорияМатериала = ОбработкаОбъект.ПолучитьКатегориюМатериала(СтрНЗ.Номенклатура,ДР_КатегорияМатериала);
//				КонецЕсли;    
//				//СтрНЗ.ПодобраноНаТСД = КоличествоПодобрано;
//				СтрНЗ.КоличествоУпаковок = КоличествоПодобрано;
//				
//				Числитель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Числитель),СтрНЗ.Упаковка.Числитель,1);
//				Знаменатель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Знаменатель),СтрНЗ.Упаковка.Знаменатель,1);
//				СтрНЗ.Количество = СтрНЗ.КоличествоУпаковок * Числитель / Знаменатель;
//				
//				СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
//				СтрНЗ.Обособленно = Ложь;
//				СтрНЗ.ОтборПоВариантамОбеспечения = 4;
//			КонецЦикла;   
//		Иначе  
//			//Для Каждого Этап из СписокЭтапов Цикл 
//			Если Номенклатура <> СтрТПодбора.Номенклатура Тогда 
//				Номенклатура = СтрТПодбора.Номенклатура;
//				//НомерЭтапа = 1;
//				//ОстатокШтук = 0;
//				//Иначе 
//				//	НомерЭтапа = НомерЭтапа+1;
//			КонецЕсли;
//			СтрНЗ = НЗ.Добавить();
//			ЗаполнитьЗначенияСвойств(СтрНЗ,СтрТПодбора); 
//			СтрНЗ.ЭтоСписание = ЭтоСписание;
//			СтрНЗ.ДатаОтгрузки = ДатаОтгрузки;
//			СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада; //.КОбеспечению;
//			СтрНЗ.Обособленно = Ложь; 
//			СтрНЗ.ОтборПоВариантамОбеспечения = 4;
//			СтрНЗ.ИдентификаторСтроки = Новый УникальныйИдентификатор;
//			СтрНЗ.КатегорияМатериала = ОбработкаОбъект.ПолучитьКатегориюМатериала(СтрТПодбора.Номенклатура,ДР_КатегорияМатериала); // = 
//			СтрНЗ.КлючСвязиСпецификация = ОбщегоНазначенияБТС.ПустойУникальныйИдентификатор();//Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
//			СтрНЗ.Норматив = 0;
//			СтрНЗ.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(СтрТПодбора.Номенклатура, СтрТПодбора.Склад);
//			//Если упаковка - шт, ШтукиТолькоЦеликом и количество Подобрано НЕ ЦЕЛОЕ
//			//переделим подобранное количество по этапам
//			Если ОбработкаОбъект.УпаковкаШтуки(СтрТПодбора.Упаковка) и ШтукиТолькоЦеликом и (СтрТПодбора.КоличествоУпаковок<>Цел(СтрТПодбора.КоличествоУпаковок)) Тогда 
//				Если НомерЭтапа <> СтрТПодбора.КоличествоЭтапов Тогда 
//					КоличествоПодобрано = Цел(СтрТПодбора.КоличествоУпаковок); // + ОстатокШтук; 
//					ОстатокТекСтроки = СтрТПодбора.КоличествоУпаковок - Цел(СтрТПодбора.КоличествоУпаковок);
//					ОстатокШтук = ОстатокШтук + ОстатокТекСтроки;
//					НомерЭтапа = НомерЭтапа + 1;
//				Иначе 
//					КоличествоПодобрано = ОстатокШтук;
//				КонецЕсли;
//			Иначе
//				КоличествоПодобрано = СтрТПодбора.КоличествоУпаковок;
//			КонецЕсли;
//			//СтрНЗ.ПодобраноНаТСД = КоличествоПодобрано; 
//			СтрНЗ.КоличествоУпаковок = КоличествоПодобрано; //СтрТПодбора.КоличествоУпаковок;
//			//Если не ЗначениеЗаполнено(СтрНЗ.Упаковка.Числитель) Тогда 
//			//	Числитель = 1;  
//			//Иначе 
//			//	Числитель = СтрНЗ.Упаковка.Числитель;
//			//КонецЕсли;    
//			Числитель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Числитель),СтрНЗ.Упаковка.Числитель,1);
//			Знаменатель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Знаменатель),СтрНЗ.Упаковка.Знаменатель,1);
//			//Если не ЗначениеЗаполнено(СтрНЗ.Упаковка.Знаменатель) Тогда 
//			//	Знаменатель = 1;  
//			//Иначе 
//			//	Знаменатель = СтрНЗ.Упаковка.Знаменатель;
//			//КонецЕсли;
//			СтрНЗ.Количество = СтрНЗ.КоличествоУпаковок * Числитель / Знаменатель;
//			//СтрНЗ.Период;
//			//СтрНЗ.ПериодЗатрат = КонецМесяца(ДатаОтгрузки);
//			//СтрНЗ.ПериодОтгрузки = КонецМесяца(ДатаОтгрузки);          
//			СтрНЗ.ДатаОтгрузки = ДатаОтгрузки; //Объект.ПериодОтгрузки;   
//			СтрНЗ.ПериодЗатрат = КонецМесяца(ДатаОтгрузки);//КонецМесяца(Объект.ПериодОтгрузки);
//			
//			СтрНЗ.Подразделение = Склад.Подразделение;
//			СтрНЗ.Пользователь = Пользователи.АвторизованныйПользователь();
//			СтрНЗ.Склад = Склад;
//			//СтрНЗ.Спецификация;
//			СтрНЗ.СтатьяКалькуляции = СтатьяКалькуляции;
//			
//		КонецЕсли;
//		НЗ.Записать();
//	КонецЦикла;
//		
//КонецПроцедуры
//							  
//&НаКлиенте
//Процедура ЗагрузитьПодбор(Команда)
//	ЗагрузитьПодборНаСервере();
//	ЭтаФорма.Закрыть();
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьТаблицуПодбора()
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТТМ_ПодборМатериаловПоСпецификацииЭтапы.ЭтапПроизводства) КАК КоличествоЭтапов,
//	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка КАК Ссылка
//	               |ПОМЕСТИТЬ КоличествоЭтаповДокумента
//	               |ИЗ
//	               |	Документ.ТТМ_ПодборМатериаловПоСпецификации.Этапы КАК ТТМ_ПодборМатериаловПоСпецификацииЭтапы
//	               |ГДЕ
//	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Проведен
//	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Ответственный = &Пользователь
//	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ТТМ_СтатусыПодбораМатериалов.ЗагруженСТСД)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель, 1) = 1
//	               |			ТОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / КоличествоЭтаповДокумента.КоличествоЭтапов / 1 * ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Знаменатель, 1)
//	               |		КОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель = 0
//	               |			ТОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / КоличествоЭтаповДокумента.КоличествоЭтапов / 1 * 1
//	               |		ИНАЧЕ ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / КоличествоЭтаповДокумента.КоличествоЭтапов / ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель, 1) * ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Знаменатель, 1)
//	               |	КОНЕЦ КАК Количество,
//	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка КАК Упаковка,
//	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
//	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Назначение КАК Назначение,
//	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация КАК Спецификация,
//	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Склад КАК Склад,
//	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / КоличествоЭтаповДокумента.КоличествоЭтапов КАК КоличествоУпаковок,
//	               |	КоличествоЭтаповДокумента.КоличествоЭтапов КАК КоличествоЭтапов
//	               |ИЗ
//	               |	Документ.ТТМ_ПодборМатериаловПоСпецификации.ОбеспечениеМатериаламиИРаботами КАК ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТТМ_ПодборМатериаловПоСпецификации.Этапы КАК ТТМ_ПодборМатериаловПоСпецификацииЭтапы
//	               |		ПО ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка = ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоЭтаповДокумента КАК КоличествоЭтаповДокумента
//	               |		ПО (КоличествоЭтаповДокумента.Ссылка = ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка)
//	               |ГДЕ
//	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Ответственный = &Пользователь
//	               |	И ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Проведен
//	               |	И ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ТТМ_СтатусыПодбораМатериалов.ЗагруженСТСД)
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	Номенклатура
//	               |АВТОУПОРЯДОЧИВАНИЕ";
//	Запрос.УстановитьПараметр("Пользователь",Пользователи.АвторизованныйПользователь());
//	Запрос.УстановитьПараметр("ДокументПодбора",Объект.ДокументПодбораМатериалов); 
//	РезультатЗапроса = Запрос.Выполнить();
//	Если не РезультатЗапроса.Пустой() Тогда 
//		Возврат РезультатЗапроса.Выгрузить();
//	Иначе 
//		Возврат Неопределено;
//	КонецЕсли;
//КонецФункции

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
//	
//	//Элементы.ДокументПодбораМатериалов.СписокВыбора.Добавить(Объект.ДокументПодбораМатериалов);
//	
//	Если Параметры.Свойство("ЭтоСписание") Тогда 
//		ЭтоСписание = Параметры.ЭтоСписание;
//	КонецЕсли;
//	Если Параметры.Свойство("СписокЭтапов") Тогда 
//		СписокЭтапов = Параметры.СписокЭтапов;
//	КонецЕсли;         
//	Если Параметры.Свойство("ДатаОтгрузки") Тогда 
//		ДатаОтгрузки = Параметры.ДатаОтгрузки;
//	КонецЕсли; 
//	Если Параметры.Свойство("Склад") Тогда 
//		Склад = Параметры.Склад;
//	КонецЕсли;    
//	Если Параметры.Свойство("СтатьяКалькуляции") Тогда 
//		СтатьяКалькуляции = Параметры.СтатьяКалькуляции;
//	КонецЕсли;     
//	Если Параметры.Свойство("ШтукиТолькоЦеликом") Тогда 
//		ШтукиТолькоЦеликом = Параметры.ШтукиТолькоЦеликом;
//	КонецЕсли;   
//	Если Параметры.Свойство("ДР_КатегорияМатериала") Тогда 
//		ДР_КатегорияМатериала = Параметры.ДР_КатегорияМатериала;
//	КонецЕсли;
//	
//КонецПроцедуры 
