
&НаСервереБезКонтекста
Процедура ЗаполнитьРегистрНаСервере(ДополнительноеСведение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК Спецификация,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ДополнительныеСведения.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДополнительноеСведение
	               |	И ДополнительныеСведения.Значение = ИСТИНА";
	Запрос.УстановитьПараметр("ДополнительноеСведение",ДополнительноеСведение);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрТЗ из ТЗ Цикл 
		НЗ = РегистрыСведений.ТТМ_ПроверенныеСпецификации.СоздатьНаборЗаписей();
		НЗ.Отбор.Спецификация.Установить(СтрТЗ.Спецификация);
		НЗ.Прочитать();
		Если НЗ.Количество() = 0 Тогда 
			НоваяЗапись = НЗ.Добавить();
			НоваяЗапись.Спецификация = СтрТЗ.Спецификация;
			НоваяЗапись.СпецификацияПроверена = Истина; 
			НоваяЗапись.Период = НачалоДня(ТекущаяДатаСеанса());
			НоваяЗапись.Проверил = Пользователи.АвторизованныйПользователь();
		КонецЕсли;                                              
		НЗ.Записать();
	КонецЦикла;                                                 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРегистр(Команда)
	ЗаполнитьРегистрНаСервере(Объект.ДополнительноеСведение);
КонецПроцедуры
