 ////////////////////////////////////////////////////////////////////////////////////////////////////////// 
#Область ТТМ_АРМ_ВыпускРеализацияГлобальныеПеременные

Перем АдресХранилищаНормативы;
Перем ДатаОтгрузкиОбязательна;
Перем СкладОбязателен;
Перем КэшированныеЗначения;

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПриИзмененииДанныхФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ДатаВыпуска = ПолучитьТекДату();
	Объект.ДатаРеализации = ПолучитьТекДату();
	ОбновитьТаблицуЭтапов();
КонецПроцедуры

//&НаСервере
//Функция ПолучитьШаблоныЭтикеток()
//	
//	СтруктураВозврата = Новый Структура();
//	СтруктураВозврата.Вставить("ШаблонТТМ",Справочники.ШаблоныЭтикетокИЦенников.НайтиПоНаименованию("Этикетка ТТМ",Истина));
//	СтруктураВозврата.Вставить("ШаблонСН",Справочники.ШаблоныЭтикетокИЦенников.НайтиПоНаименованию("Этикетка СН", Истина));
//	Возврат СтруктураВозврата;
//	
//КонецФункции

&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент)	
	//Объект.Организация = ИзделиеПриИзмененииНаСервере(Объект.Изделие);
	ОбновитьТаблицуЭтапов();
КонецПроцедуры  

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)	
	
	ТекущаяСтраница = Элементы.НастройкиАРМ.ТекущаяСтраница.Имя;
	Если ТекущаяСтраница = "ВыпускИРеализация" Тогда 
		ОбновитьТаблицуЭтапов();
	ИначеЕсли ТекущаяСтраница = "Администрирование" Тогда 
		ОбновитьСписокРеализаций();
	КонецЕсли;
		
КонецПроцедуры 

&НаКлиенте
Процедура ЗаказКлиентаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ПолучитьДанныеВыбораРасширенные(Текст);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Текст = "" Тогда
		ОчиститьЗаказНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЭтикетокДляПечатиПриИзменении(Элемент)
	
	//СтруктураПоиска = Новый Структура("Отметка", Истина);
	//РезультатОтбора = ТаблицаЭтапов.НайтиСтроки(СтруктураПоиска);
	//
	//Если РезультатОтбора <> Неопределено Тогда
	//	Для Каждого ТекЭтап Из РезультатОтбора Цикл
	//		ТекЭтап.Отметка = Ложь;
	//	КонецЦикла;
	//	
	//	Объект.Количество = 0;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьЗаказНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаказНаСервере()
	Документы.ЗаказКлиента.ПустаяСсылка();	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЭтаповОтметкаПриИзменении(Элемент)     
	
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;   // Элементы[Элемент.Родитель.Имя].ТекущиеДанные
	ПараметрыПоиска = Новый Структура("Ссылка",ТекСтрока.Ссылка);
	МассивСтрокПоЭтапу = ТаблицаЭтапов.НайтиСтроки(ПараметрыПоиска);
	Если МассивСтрокПоЭтапу.Количество() > 1 Тогда
		Для Каждого Стр из МассивСтрокПоЭтапу Цикл 
			Стр.Отметка = Истина;
		КонецЦикла;
	КонецЕсли;
	
	КоличествоОтмеченныхЭтапов = ПолучитьКоличествоНоменклатуры();
	Объект.Количество = КоличествоОтмеченныхЭтапов;  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзделиеПриИзмененииНаСервере(Номенклатура)
	Организация = Неопределено;
	
	Если СтрНайти("(RB)",Номенклатура.Наименование) <> 0 Тогда 
		Организация = Справочники.Организации.НайтиПоНаименованию("Роболабс");
	Иначе 
		Организация = Справочники.Организации.НайтиПоНаименованию("Тверьторгмаш");
	КонецЕсли;
	
	Возврат Организация;	
КонецФункции

&НаКлиенте
Процедура ИзделиеОчистка(Элемент, СтандартнаяОбработка)
	ИзделиеОчисткаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзделиеОчисткаНаСервере()
	Объект.Изделие = Справочники.Номенклатура.ПустаяСсылка();
	ОбновитьТаблицуЭтапов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуЭтапов()
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда
		НомерПоДанныеКлиента = Объект.ЗаказКлиента.НомерПоДаннымКлиента;
		ДатаПоДаннымКлиента  = Объект.ЗаказКлиента.ДатаПоДаннымКлиента;
	Иначе
		НомерПоДанныеКлиента = "";
		ДатаПоДаннымКлиента = Дата('00010101');
	КонецЕсли;    
	
    //Заполнить таблицу Этапов 
	ТабЭтапы = РеквизитФормыВЗначение("ТаблицаЭтапов", Тип("ТаблицаЗначений"));
	
	Запрос = новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК Регистратор,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ_ЗарегистрированныеСерийныеНомера
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	               |	&УсловиеУчетСН
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК Ссылка,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ_ЗарегистрированныеСерийныеНомера.СерийныйНомер, """") КАК СерийныйНомер,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт КАК Выполнено,
	               |	ЕСТЬNULL(ВТ_ЗарегистрированныеСерийныеНомера.Количество, ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок) КАК Количество,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокПлан КАК Запланировано,
	               |	ЛОЖЬ КАК Отметка
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗарегистрированныеСерийныеНомера КАК ВТ_ЗарегистрированныеСерийныеНомера
	               |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ВТ_ЗарегистрированныеСерийныеНомера.Регистратор
	               |			И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ВТ_ЗарегистрированныеСерийныеНомера.Номенклатура
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
	               |	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Отменено
	               |	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Произведено
				   //|";
	               |	&УсловиеНоменклатура
				   |	&УсловиеЗаказКлиента
	               |
	               |УПОРЯДОЧИТЬ ПО 
				   |	СерийныйНомер";
		
	Запрос.УстановитьПараметр("Номенклатура",Объект.Изделие);
	//Запрос.УстановитьПараметр("Заказ", Объект.ЗаказКлиента);
	
	Если ЗначениеЗаполнено(Объект.Изделие) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеНоменклатура"," И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура ");		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеУчетСН"," И ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = &Номенклатура ");
		//Запрос.УстановитьПараметр("Номенклатура",Объект.Изделие);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеНоменклатура","");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеУчетСН","");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеЗаказКлиента"," И ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ = &Заказ ");
		Запрос.УстановитьПараметр("Заказ", Объект.ЗаказКлиента);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеЗаказКлиента","");
	КонецЕсли;
	
	ТабЭтапы = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ТабЭтапы, "ТаблицаЭтапов");
	
	Объект.Количество = 0;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоНоменклатуры()
	ПараметрыОтбора = Новый Структура("Отметка", Истина);
	Возврат ТаблицаЭтапов.Выгрузить(ПараметрыОтбора,"Количество").Итог("Количество");
КонецФункции

 &НаСервереБезКонтекста
Функция ПолучитьТекДату()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораРасширенные(СтрокаПоиска)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("СтрокаПоиска", СтрокаПоиска);
	СтруктураОтбора.Вставить("ВводПоСтрокеРасширенный", Истина);
	
	СтрокаПоиска = СтрЗаменить(СтруктураОтбора.СтрокаПоиска, """", ""); 
	
	Если СтрокаПоиска <> "" И СтруктураОтбора.Свойство("ВводПоСтрокеРасширенный") Тогда
		МассивСловПоиска = СтрРазделить(СтрокаПоиска, " ", Ложь); 

		Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ		
						|	Назначения.Заказ КАК Заказ,
						|	Назначения.Наименование КАК Наименование,
						|	Назначения.ПометкаУдаления КАК ПометкаУдаления
						|ПОМЕСТИТЬ ВТ_ЗаказКлиентаОтборПоНомеру
						|ИЗ
						|	Справочник.Назначения КАК Назначения
						|ГДЕ
						|	Назначения.Наименование ПОДОБНО &СловоПоиска
						|	И НЕ Назначения.ПометкаУдаления
						|	И НЕ Назначения.Заказ.ПометкаУдаления
						//|	И Назначения.Заказ.Статус <> &СтатусЗаказа
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
						|	ВТ_ЗаказКлиентаОтборПоНомеру.Наименование КАК Наименование,
						|	ВТ_ЗаказКлиентаОтборПоНомеру.ПометкаУдаления КАК ПометкаУдаления
						|ИЗ
						|	ВТ_ЗаказКлиентаОтборПоНомеру КАК ВТ_ЗаказКлиентаОтборПоНомеру
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
						|		ПО (СостоянияЗаказовКлиентов.Заказ = ВТ_ЗаказКлиентаОтборПоНомеру.Заказ)
						|ГДЕ
						|	СостоянияЗаказовКлиентов.Состояние <> &Состояние";
		
		Запрос.УстановитьПараметр("СловоПоиска", "%" + СтрокаПоиска + "%");
		//Запрос.УстановитьПараметр("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.Закрыт);
		Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗаказовКлиентов.ГотовКЗакрытию);
				
		Выборка = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		СписокВыбора = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Значение", ВыборкаДетальныеЗаписи.Заказ);
			СтруктураОтбора.Вставить("ПометкаУдаления", ВыборкаДетальныеЗаписи.ПометкаУдаления);
			
			СписокВыбора.Добавить(СтруктураОтбора, ТТМ_ДанныеВыбораСервер.ПодсветитьСлова(ВыборкаДетальныеЗаписи.Наименование, МассивСловПоиска));
		КонецЦикла;
	
		ДанныеВыбора = СписокВыбора;
	КонецЕсли;
		
	Возврат ДанныеВыбора;	
КонецФункции

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ДополнительныеКоманды 

&НаКлиенте
Процедура ОтметитьВсеЭтапы(Команда)  
	ВыбраннаяСтраница = Элементы.НастройкиАРМ.ТекущаяСтраница.Имя;
	
	Если ВыбраннаяСтраница = "ВыпускИРеализация" Тогда 
		Для Каждого Стр из ТаблицаЭтапов Цикл 
			стр.Отметка = Истина;
		КонецЦикла;		
		КоличествоОтмеченныхЭтапов = ПолучитьКоличествоНоменклатуры();
		Объект.Количество = КоличествоОтмеченныхЭтапов;	
	ИначеЕсли ВыбраннаяСтраница = "СтраницаРеализация" Тогда 
		Для Каждого Стр из СписокЗаказовКРеализации Цикл 
			стр.Отметка = Истина;
		КонецЦикла;	
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для выбранной страницы обработка не задана!'"));
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура СнятьОтметкиВсе(Команда)   
	ВыбраннаяСтраница = Элементы.НастройкиАРМ.ТекущаяСтраница.Имя;
	Если ВыбраннаяСтраница = "ВыпускИРеализация" Тогда 
		Для Каждого Стр из ТаблицаЭтапов Цикл 
			стр.Отметка = Ложь;
		КонецЦикла;   
		КоличествоОтмеченныхЭтапов = ПолучитьКоличествоНоменклатуры();
		Объект.Количество = КоличествоОтмеченныхЭтапов;
	ИначеЕсли ВыбраннаяСтраница = "СтраницаРеализация" Тогда 
		Для Каждого Стр из СписокЗаказовКРеализации Цикл 
			стр.Отметка = Ложь;
		КонецЦикла;	
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для выбранной страницы обработка не задана!'"));
	КонецЕсли;
КонецПроцедуры     

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ОповещениеПользователя

&НаКлиенте
Процедура ОповеститьПользователя(ТекущаяКоманда)
	Если ТекущаяКоманда = "Выпуск" Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Выпуск и реализация'"),, 
			НСтр("ru = 'Формирование выпуска завершено'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация
		);
	ИначеЕсли ТекущаяКоманда = "Реализация" Или ТекущаяКоманда = "РеализацияВсехЗаказов" Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Выпуск и реализация'"),, 
			НСтр("ru = 'Формирование реализаций завершено'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация
		); 	
	ИначеЕсли ТекущаяКоманда = "ЗаполнитьДокументОтгрузка" Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Выпуск и реализация'"),, 
			НСтр("ru = 'Формирование докумета отгрузки завершено'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация
		);
	ИначеЕсли ТекущаяКоманда = "СохранитьТекущиеНастройки" Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Выпуск и реализация'"),, 
			НСтр("ru = 'Настройки успешно сохранены'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация
		);
	ИначеЕсли ТекущаяКоманда = "ВосстановитьНастройки" Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Выпуск и реализация'"),, 
			НСтр("ru = 'Настройки успешно выгружены'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация
		); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияКлючевыхПолей(ТекущаяКоманда, Знач ПроверкаВыполнена = Истина)
	Сообщение = Новый СообщениеПользователю;
	
	Если ТекущаяКоманда.Действие = "Выпуск" Тогда
		Если Объект.Изделие.Пустая() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			   НСтр("ru = 'Не выбрано изделие'"),,
			   "Изделие",
			   "Объект.Изделие");
			
			ПроверкаВыполнена = Ложь;		
		ИначеЕсли Объект.ЗаказКлиента.Пустая() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			   НСтр("ru = 'Не выбран заказ клиента'"),,
			   "ЗаказКлиента",
			   "Объект.ЗаказКлиента");
			
			ПроверкаВыполнена = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяКоманда.Действие = "Реализация" Тогда
		Если Объект.ЗаказКлиента.Пустая() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			   НСтр("ru = 'Не выбран заказ клиента'"),,
			   "ЗаказКлиента",
			   "Объект.ЗаказКлиента");
			
			ПроверкаВыполнена = Ложь;	
		//ИначеЕсли ТаблицаОтбораЦен.Количество() = 0 Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю(
		//	   НСтр("ru = 'Не заполнены настройки для проверки установленных цен в заказе'"),,
		//	   "ТаблицаОтбораЦен");			
		//	
		//	ПроверкаВыполнена = Ложь;	
		//ИначеЕсли СписокАдресовДляРассылки.Количество() = 0 Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю(
		//	   НСтр("ru = 'Нет ни одного адреса для отправки уведомлений'"),,
		//	   "СписокАдресовДляРассылки");			
		//	
		//	ПроверкаВыполнена = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	Если ТекущаяКоманда.Действие = "РеализацияВсехЗаказов" Тогда
		//Если ТаблицаОтбораЦен.Количество() = 0 Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю(
		//		НСтр("ru = 'Не заполнены настройки для проверки установленных цен в заказе'"),,
		//		"ТаблицаОтбораЦен");			
		//	ПроверкаВыполнена = Ложь;
		//ИначеЕсли СписокАдресовДляРассылки.Количество() = 0 Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет ни одного адреса для отправки уведомлений'"),,"СписокАдресовДляРассылки");			
		//	ПроверкаВыполнена = Ложь;	
		//Иначе
			ОтветПользователя = Вопрос(НСтр("ru = 'Напечать УПД по всем заказам?'"), РежимДиалогаВопрос.ДаНет, 0,, НСтр("ru = 'Печать УПД'"));
			
			Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
				ПроверкаВыполнена = Ложь;
			КонецЕсли;
		//КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяКоманда.Действие = "ПечатьЭтикеток" Тогда
		Если Объект.Изделие.Пустая() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			   НСтр("ru = 'Не выбрано изделие'"),,
			   "Изделие",
			   "Объект.Изделие");
			ПроверкаВыполнена = Ложь;    
		ИначеЕсли Объект.ШаблонЭтикетки.Пустая() Тогда    
			Объект.ШаблонЭтикетки = ПолучитьШаблонЭтикетки("Этикетка ТТМ");
			//Объект.ШаблонЭтикетки = Элементы.ШаблонЭтикетки.СписокВыбора.НайтиПоЗначению("Этикетка ТТМ");
		КонецЕсли;  
	КонецЕсли;
	Если ТекущаяКоманда.Действие = "ПечатьСерийныхНомеров" Тогда
		Если Объект.Изделие.Пустая() Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не выбрано изделие'"),,
			   "Изделие",
			   "Объект.Изделие");
			ПроверкаВыполнена = Ложь;    
		ИначеЕсли Объект.ШаблонЭтикетки.Пустая() Тогда  
			Объект.ШаблонЭтикетки = ПолучитьШаблонЭтикетки("Этикетка СН");
			//Объект.ШаблонЭтикетки =  Элементы.ШаблонЭтикетки.СписокВыбора.НайтиПоЗначению("Этикетка СН");
		КонецЕсли;
	КонецЕсли;
		
	Возврат ПроверкаВыполнена;	
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьШаблонЭтикетки(НаименованиеЭтикетки)
	Возврат  Справочники.ШаблоныЭтикетокИЦенников.НайтиПоНаименованию(НаименованиеЭтикетки, Истина);
КонецФункции

&НаКлиенте
Процедура ПредупреждениеПользователю(ДокументСсылка)
	ПоказатьПредупреждение(, НСтр("ru = 'Необходимо отсканировать товары в документе: '") + ДокументСсылка, 15, "Реализация");
КонецПроцедуры

&НаКлиенте
Процедура ВопросПользователюПередВыполнениемОперации(Команда)
	
	Если Команда.Действие = "Выпуск" Тогда
		ТекстВопроса = НСтр("ru = 'Сформировать выпуск для выбранных изделий?'");
		ЗаголовокВопроса = НСтр("ru = 'Формирование выпуска'");
	КонецЕсли;
	
	Если Команда.Действие = "Реализация" Тогда
		ТекстВопроса = НСтр("ru = 'Сформировать реализацию по заказу: '") + Объект.ЗаказКлиента;
		ЗаголовокВопроса = НСтр("ru = 'Формирование реализации'");
	КонецЕсли;
	
	Если Команда.Действие = "РеализацияВсехЗаказов" Тогда
		ТекстВопроса = НСтр("ru = 'Сформировать реализацию по всем заказам?'");
		ЗаголовокВопроса = НСтр("ru = 'Формирование реализации'");
	КонецЕсли;
	
	Если Команда.Действие = "ЗаполнитьДокументОтгрузка" Тогда
		ТекстВопроса = НСтр("ru = 'Сформировать документ для ТСД?'");
		ЗаголовокВопроса = НСтр("ru = 'Документ отгрузки товаров'");
	КонецЕсли;
	
	Если Команда.Действие = "СохранитьТекущиеНастройки" Тогда
		ТекстВопроса = НСтр("ru = 'Сохранить текущие настройки?'");
		ЗаголовокВопроса = НСтр("ru = 'Настройка отбора и проверки цен'");
	КонецЕсли;
	
	Если Команда.Действие = "ВосстановитьНастройки" Тогда
		ТекстВопроса = НСтр("ru = 'Восстановить сохраненные настройки?'");
		ЗаголовокВопроса = НСтр("ru = 'Настройка отбора и проверки цен'");
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Команда);     
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0,, ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопроса(ОтветПользователя, ДополнительныеПараметры) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееДействиеКоманды = ДополнительныеПараметры.Действие;
	РезультатВыполнения = Ложь;
	
	///////////////////////////////////////////////////////////////////////////////////////
	Если ТекущееДействиеКоманды = "Выпуск" Тогда
		ВыпускСформирован = ОформитьВыпускНаСервере();
		
		Если ВыпускСформирован Тогда
			ОповеститьПользователя(ТекущееДействиеКоманды);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущееДействиеКоманды = "Реализация" Тогда
		
		Попытка
			СформироватьРеализациюПоЗаказу(Объект.ЗаказКлиента);
			РезультатВыполнения = Истина;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("'Ошибка при формировании реализации: '") + ОписаниеОшибки());
		КонецПопытки;
			
		Если РезультатВыполнения Тогда
			Если ПечатьУПД Тогда		
				НапечататьУПД();		
			КонецЕсли;
	
			ОповеститьПользователя(ТекущееДействиеКоманды);
		КонецЕсли;		
		
		//НачатьПроверкуЦенВРеализации();    - Временно отключено, по требованию менеджера
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////////
	Если ТекущееДействиеКоманды = "РеализацияВсехЗаказов" Тогда 
		
		
		ПроверкаВыполнена = ПроверкаЗаполненияКлючевыхПолей(ДополнительныеПараметры);  
		
		//*****
		СозданиеРеализацияПродолжение(ОтветПользователя,ДополнительныеПараметры);
		
		//*****
		
		//МассивЗаказов = ПолучитьМассивЗаказов();
		//
		//Если МассивЗаказов.Количество() = 0 Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет заказов с выпуском'"));
		//	Возврат;
		//КонецЕсли;
		//
		//Для Каждого Заказ Из МассивЗаказов Цикл	
		//	
		//	Попытка
		//		СформироватьРеализациюПоЗаказу(Заказ.ЗаказКлиента);
		//		
		//		Если ПроверкаВыполнена Тогда
		//			НапечататьУПД();
		//		КонецЕсли;
		//	
		//		РезультатВыполнения = Истина;
		//	Исключение
		//		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("'Ошибка при формировании реализации: '") + ОписаниеОшибки());
		//	КонецПопытки;
		//	
		//КонецЦикла;
		
		//НачатьПроверкуЦенВРеализации();    - Временно отключено, по требованию менеджера
	КонецЕсли;
	
	
	///////////////////////////////////////////////////////////////////////////////////////
	Если ТекущееДействиеКоманды = "ЗаполнитьДокументОтгрузка" Тогда
		Попытка
			СформироватьДокументТекущаяОтгрузка();
			РезультатВыполнения = Истина;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("'Ошибка при заполнении документа отгрузки товаров: '") + ОписаниеОшибки());
		КонецПопытки;	
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////////
	Если ТекущееДействиеКоманды = "СохранитьТекущиеНастройки" Тогда
		Попытка
			СохранитьНастройки();
			РезультатВыполнения = Истина;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("'Ошибка при попытке сохранения настроек: '") + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////////
	Если ТекущееДействиеКоманды = "ВосстановитьНастройки" Тогда
		Попытка
			ПолучитьНастройкиИзХранилища();
			РезультатВыполнения = Истина;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("'Ошибка при попытке выгрузки настроек: '") + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Если РезультатВыполнения Тогда
		ОповеститьПользователя(ТекущееДействиеКоманды);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


/////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ФормированиеВыпуска

&НаКлиенте
Процедура Выпуск(Команда)
	//Было 
	//Отказ = Ложь;             	
	//ВыполнитьПроверкиЗаказа(Отказ);	
	//Если НЕ Отказ Тогда
		//Сообщить("Формирование выпуска завершено.");
	//КонецЕсли;
	
	//+Дарвин А.А. 08.09.23
	КлючевыеПоляЗаполнены = ПроверкаЗаполненияКлючевыхПолей(Команда);
	 
	Если Не КлючевыеПоляЗаполнены Тогда
		Возврат;
	КонецЕсли;
	
	ВопросПользователюПередВыполнениемОперации(Команда);
	//Дарвин А.А.
	
КонецПроцедуры

&НаСервере
функция ОформитьВыпускНаСервере()
	//++Дарвин 18.08.23
	ВыпускСформирован = Ложь;
	//Дарвин 
	
	ИзделиеПоЗаказу = Объект.ЗаказКлиента.Товары.Выгрузить(Новый Структура("Номенклатура, ВариантОбеспечения", Объект.Изделие, Перечисления.ВариантыОбеспечения.КОбеспечению));
	КоличествоПоЗаказуКОбеспечению =  ИзделиеПоЗаказу.Итог("Количество");
	
	ИзделиеПоЗаказу = Объект.ЗаказКлиента.Товары.Выгрузить(Новый Структура("Номенклатура, ВариантОбеспечения", Объект.Изделие, Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления));
	КоличествоПоЗаказуРезервПоМереПоступления =  ИзделиеПоЗаказу.Итог("Количество");	
	
	КоличествоПоЗаказу = КоличествоПоЗаказуКОбеспечению + КоличествоПоЗаказуРезервПоМереПоступления;
	
	//*Ганьшина Е. 24.10.2025
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Ссылка КАК Ссылка,
	               |	Т.Номенклатура КАК Номенклатура,
	               |	Т.Назначение КАК Назначение,
	               |	Т.СерийныйНомер КАК СерийныйНомер,
	               |	Т.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ_Этапы
	               |ИЗ
	               |	&ТабЭтапы КАК Т
	               |ГДЕ
	               |	Т.Отметка = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ПОМЕСТИТЬ НоменклатураУчитываетсяПоСН
	               |ИЗ
	               |	ВТ_Этапы КАК ВТ_Этапы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО ВТ_Этапы.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &ДопРеквизитУчетСерий
	               |	И НоменклатураДополнительныеРеквизиты.Значение = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК Ссылка,
	               |	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество,
	               |	ЕСТЬNULL(НоменклатураУчитываетсяПоСН.Значение, ЛОЖЬ) КАК УчитыватьСерийныйНомера,
	               |	ВТ_Этапы.СерийныйНомер КАК СерийныйНомер
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Назначение = Назначения.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураУчитываетсяПоСН КАК НоменклатураУчитываетсяПоСН
	               |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = НоменклатураУчитываетсяПоСН.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Этапы КАК ВТ_Этапы
	               |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ВТ_Этапы.Номенклатура
	               |			И ЭтапПроизводства2_2ВыходныеИзделия.Назначение = ВТ_Этапы.Назначение
	               |			И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ВТ_Этапы.Ссылка
	               |ГДЕ
	               |	НЕ Назначения.ПометкаУдаления
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	               |	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Отменено
	               |	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Произведено
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = &Статус
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка,
	               |	ЕСТЬNULL(НоменклатураУчитываетсяПоСН.Значение, ЛОЖЬ),
	               |	ВТ_Этапы.СерийныйНомер";  
	
	ПараметрыОтбора = Новый Структура("Отметка",Истина);
	МассивЭтапов = ТаблицаЭтапов.Выгрузить(ПараметрыОтбора,"Ссылка").ВыгрузитьКолонку("Ссылка");
	ТабЭтапы = ТаблицаЭтапов.Выгрузить(ПараметрыОтбора,"Отметка, Ссылка, Номенклатура, Назначение, СерийныйНомер, Количество");
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЭтаповПроизводства2_2.Начат);
	Запрос.УстановитьПараметр("ТабЭтапы", ТабЭтапы); 
	ДополнительныйРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","УчитываатьСерийныеНомераНоменклатуры_ТТМ");
	Запрос.УстановитьПараметр("ДопРеквизитУчетСерий",ДополнительныйРеквизит);
	//-
		
	Результат = Запрос.Выполнить();
		
	Если Не Результат.Пустой() Тогда	
		Этапы = Результат.Выгрузить();
		КоличествоВыпуска = Этапы.Итог("Количество");
		
		Если Объект.Количество > КоличествоПоЗаказу Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Количество выпуска превышает количество по заказу'"));
		Иначе
			Если Объект.Количество > КоличествоВыпуска Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Количество выпуска превышает количество в этапах. Обработано '") + Строка(КоличествоВыпуска));
			КонецЕсли; 
			ИзменитьЭтапы(Этапы);
		КонецЕсли;
		
	//++Дарвин А.А. 25.08.23
		ОбновитьТаблицуЭтапов();
		ВыпускСформирован = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Формирование выпуска завершено'"));		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран этап для обработки'"));
	КонецЕсли;  
	
	//Если ВыпускСформирован Тогда 
	//	//+ Ганьшина Е
	//	//ИзменитьСтатусОбеспечения();
	//	ЗаказОбъект = Объект.ЗаказКлиента;
	//	
	//	ПереченьВариантов = Новый Массив();
	//	ПереченьВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));  
	//	
	//	Результат = Новый Структура("ПереченьВариантов, ЗаполнятьЦелымиУпаковками");
	//	Результат.ПереченьВариантов = ПереченьВариантов;
	//	Результат.ЗаполнятьЦелымиУпаковками = Ложь;
	//	
	//	//ЗаказИзменен = Ложь; 
	//	
	//	ПараметрыВстраивания = Документы.ЗаказКлиента.ДоступныеОстаткиПараметрыВстраивания();
	//	

	//	МассивДок = Новый Массив();
	//	МассивДок.Добавить(ЗаказОбъект);
	//	
	//	ПараметрыПроцедуры = Новый Структура();
	//	
	//	ПараметрыПроцедуры.Вставить("КодДействия", "ДЕЙСТВИЕ_ОТГРУЗИТЬ");
	//	ПараметрыЗаполнения = Новый Структура();
	//	ПараметрыЗаполнения.Вставить("СнятьФлагОтгружатьОднойДатой", Истина);  
	//	ПараметрыЗаполнения.Вставить("ЗаполнитьДатуОтгрузкиОднойДатой", Ложь );
	//	ПараметрыПроцедуры.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);        
	//	
	//	ПараметрыПроцедуры.Вставить("Заказы", МассивДок);  
	//	ПараметрыПроцедуры.Вставить("ПараметрыВстраивания", ПараметрыВстраивания); 
	//	РезультатВыполненияДействий = ОбеспечениеВДокументахСервер.ВыполнитьДействиеДляЗаказовПослеВопроса(ПараметрыПроцедуры);
	//		
	//	Если Не РезультатВыполненияДействий.СписокОшибок.Количество() = 0 Тогда
	//		Сообщить("Не удалось проставить действике ""Отгрузить"" в строках Заказа клиента: " + ЗаказОбъект);
	//		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	//	КонецЕсли;
	//	//- Ганьшина Е
	//КонецЕсли;
	
	Возврат ВыпускСформирован;
	//Дарвин
КонецФункции

&НаСервере
Процедура ИзменитьЭтапы(ДокЭтапы)
	
	ОсталосьВыпустить = Объект.Количество;
	
	Для каждого Док из ДокЭтапы Цикл 
		//+Ганьшина Е. 24.10.2025
		Если Док.УчитыватьСерийныйНомера и не ЗначениеЗаполнено(Док.Серийныйномер) Тогда 
			Сообщить("Не указан серийный номер продукции " + Док.Номенклатура + Символы.ПС + "Выпуск не офромлен! " + Док.Ссылка);
			Возврат;
		КонецЕсли;
		//-
		
		ДокОбъект = Док.Ссылка.ПолучитьОбъект();
		НайденныеСтроки = ДокОбъект.ВыходныеИзделия.НайтиСтроки(Новый Структура("Номенклатура", Объект.Изделие));
		
		Для Каждого Стр из НайденныеСтроки Цикл   
			Если ОсталосьВыпустить >= Стр.Количество Тогда
				Стр.Произведено = Истина;
				Стр.ДатаПроизводства = Объект.ДатаВыпуска;
				ОсталосьВыпустить = ОсталосьВыпустить - Стр.Количество;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ДокОбъект.КоличествоУпаковокФакт  = 0.5;
		
		ЭтапОбновлен = Ложь;
		Попытка
			УстановитьПривилегированныйРежим(Истина);
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			УстановитьПривилегированныйРежим(Ложь);
			ЭтапОбновлен = Истина;
		Исключение
			Сообщить("Не удалось изменить документ " + ДокОбъект.Номер + " от " + ДокОбъект.Дата);
			
			// Запись события в журнал регистрации для системного администратора.
	    	ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Выполнение операции'"),
				УровеньЖурналаРегистрации.Ошибка,,, 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	    	ВызватьИсключение;
		КонецПопытки;
		
		Если ЭтапОбновлен Тогда
			КОтгрузке = КОтгрузке + СоздатьПередачуПродукцииНаСклад(ДокОбъект);
		КонецЕсли;
		
		Если ОсталосьВыпустить <= 0 Тогда
			Прервать;
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПередачуПродукцииНаСклад(Этап)
	
	МассивСсылок = Новый Массив();
	МассивСсылок.Добавить(Этап.Ссылка);
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивСсылок,
		"ДвижениеПродукцииИМатериалов", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства"));
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	Документ = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	Документ.Заполнить(ДанныеЗаполнения);
	Документ.Дата = Объект.ДатаВыпуска;
	
	Попытка
		НачатьТранзакцию();
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
		
		Возврат Документ.Товары.Итог("Количество");
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("'Ошибка во время проведения документа: '") + Документ + " " + ОписаниеОшибки());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		Возврат 0;
	КонецПопытки;
	
КонецФункции

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ФормированиеРеализации

&НаКлиенте
Процедура Реализация(Команда)
	КлючевыеПоляЗаполнены = ПроверкаЗаполненияКлючевыхПолей(Команда);
	ДокументСсылка = ПроверкаДокументаПередФормированием();
	
	Если Не КлючевыеПоляЗаполнены Тогда
		Возврат;
	ИначеЕсли ДокументСсылка <> Неопределено Тогда
		ПредупреждениеПользователю(ДокументСсылка);
		Возврат;
	КонецЕсли;

	ВопросПользователюПередВыполнениемОперации(Команда);
КонецПроцедуры

&НаКлиенте
Процедура РеализацияВсехЗаказов(Команда)
	ДокументСсылка = ПроверкаДокументаПередФормированием();
	
	Если ДокументСсылка <> Неопределено Тогда
		ПредупреждениеПользователю(ДокументСсылка);
		Возврат;
	КонецЕсли;
	
	ВопросПользователюПередВыполнениемОперации(Команда);
КонецПроцедуры

&НаКлиенте
Процедура СозданиеРеализацияПродолжение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат; 
	КонецЕсли;                                         
			
	МассивЗаказов = Новый Массив;
	Для Каждого Стр из СписокЗаказовКРеализации Цикл    
		Если Стр.Отметка Тогда 
			МассивЗаказов.Добавить(Стр.ЗаказКлиента);
		КонецЕсли;
	КонецЦикла;               
	Если МассивЗаказов.Количество() > 0 Тогда 
		Для Каждого ЗаказКлиента Из МассивЗаказов Цикл
			ДокументРеализации = ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка");
			ДокументРеализации = СозданиеРеализацииЗавершение(ЗаказКлиента, Объект.ДатаРеализации);
			РеализацияСформирована = ДокументРеализации <> ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка");
			УПДРаспечатан = не ПечатьУПД;
			Если ПечатьУПД и РеализацияСформирована Тогда  
				УПДРаспечатан = НапечататьУПД_ПоРеализации(ДокументРеализации);
			КонецЕсли; 
			РезультатВыполнения = РеализацияСформирована и УПДРаспечатан;
		КонецЦикла;	
	Иначе 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет заказов с неотгруженными остатками!'"));
	КонецЕсли;
	
	Если РезультатВыполнения Тогда
		ПолучитьСписокЗаказовДляОтгрузки1();
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Выпуск и реализация'"),, 
			НСтр("ru = 'Формирование реализаций завершено'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация
		);
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция СозданиеРеализацииЗавершение(ЗаказКлиента, ДатаРеализации)

	//РезультатВыполнения = Ложь;
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	//РеализацияСформирвоана = Ложь; 
	ДокументРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	Попытка
		ДокументРеализации = ТТМ_ДанныеВыбораСервер.СформироватьРеализациюПоЗаказу(ЗаказКлиента, ДатаРеализации);
		//РеализацияСформирвоана = ЗначениеЗаполнено(ДокументРеализации);
		//Если ПечатьУПД Тогда 
		//	УПДРаспечатан = ТТМ_ОбработкаАрмовКлиент.НапечататьУПД();
		//Иначе 
		//	УПДРаспечатан = Истина;
		//КонецЕсли;                 
		//РезультатВыполнения = РеализацияСформирвоана и УПДРаспечатан;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("'Ошибка при формировании реализации: '") + ОписаниеОшибки());
		Возврат ДокументРеализации;
	КонецПопытки;
			
	Возврат ДокументРеализации
	
КонецФункции    


&НаКлиенте
Функция НапечататьУПД_ПоРеализации(Реализация) Экспорт
	Если ЗначениеЗаполнено(Реализация) Тогда
		ВПФ = ПолучитьВПФНаСервере();                      
		//ВПФ = ПредопределенноеЗначение("Справочник.ДополнительныеОтчетыИОбработки.УПД с комментарием");
		
		Если ВПФ.Пустая() Тогда
			Сообщить("Не найдена внешняя печатная форма ""УПД с комментарием""!");
			Возврат Ложь;
		КонецЕсли;
		
		ОбъектыНазначения = Новый Массив;
		ОбъектыНазначения.Добавить(Реализация);
		ПараметрыОткрытия = Новый Структура("ИсточникДанных, ПараметрыИсточника");
		ПараметрыОткрытия.ИсточникДанных = ВПФ;
		ПараметрыОткрытия.ПараметрыИсточника = Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
		ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды = "УПДСКомментариемТТМ";
		ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения = ОбъектыНазначения;
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия);
	КонецЕсли; 
	Возврат Истина
КонецФункции      

&НаСервере
Функция ПолучитьВПФНаСервере()
	Возврат ТТМ_ДанныеВыбораСервер.НайтиВПФ();
КонецФункции

//&НаСервере
//Функция ПолучитьАдресОбъектаобработки()
//	
//	ОбработкаОбъект = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.ТТМ_АРМ_ВыпускРеализация"));
//	АдресОбъектаОбработки = ПоместитьВоВременноеХранилище(ОбработкаОбъект,ЭтотОбъект.УникальныйИдентификатор);
//	Возврат АдресОбъектаОбработки;
//	
//КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВыбранныйЗаказ" Тогда
		Объект.ЗаказКлиента = Параметр.ЗаказКлиента;
		ОбновитьТаблицуЭтапов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
функция ПолучитьМассивЗаказов()
	СписокЗаказовКОтгрузке = ПолучитьСписокЗаказовДляОтгрузки();
		
	Если СписокЗаказовКОтгрузке.Количество() = 0 Тогда
		МассивЗаказов = ОбщегоНазначения.ТаблицаЗначенийВМассив(СписокЗаказовКОтгрузке);
		Возврат МассивЗаказов;
	КонецЕсли;
	
	//Вызов серверной функции из модуля объекта
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	СгруппированныеЗаказы = ТекущийОбъект.ГруппировкаЗаказовСВыпуском(СписокЗаказовКОтгрузке);	
	МассивЗаказов = ОбщегоНазначения.ТаблицаЗначенийВМассив(СгруппированныеЗаказы);
		
	Возврат МассивЗаказов;
КонецФункции

 &НаСервере
Процедура СформироватьРеализациюПоЗаказу(ЗаказКлиента)
	
	//Изменим статус обеспечения
	ЗаказОбъект = ЗаказКлиента;
	
	ПереченьВариантов = Новый Массив();
	ПереченьВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));  
	
	Результат = Новый Структура("ПереченьВариантов, ЗаполнятьЦелымиУпаковками");
	Результат.ПереченьВариантов = ПереченьВариантов;
	Результат.ЗаполнятьЦелымиУпаковками = Ложь;
	
	ЗаказИзменен = Ложь; 
	
	ПараметрыВстраивания = Документы.ЗаказКлиента.ДоступныеОстаткиПараметрыВстраивания();
	
	МассивДок = Новый Массив();
	МассивДок.Добавить(ЗаказОбъект);
	
	ПараметрыПроцедуры = Новый Структура();
	
	ПараметрыПроцедуры.Вставить("КодДействия", "ДЕЙСТВИЕ_ОТГРУЗИТЬ");
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("СнятьФлагОтгружатьОднойДатой", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьДатуОтгрузкиОднойДатой", Ложь );
	ПараметрыПроцедуры.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);        
	
	ПараметрыПроцедуры.Вставить("Заказы", МассивДок);
	ПараметрыПроцедуры.Вставить("ПараметрыВстраивания", ПараметрыВстраивания);
	
	РезультатВыполненияДействий = ОбеспечениеВДокументахСервер.ВыполнитьДействиеДляЗаказовПослеВопроса(ПараметрыПроцедуры);
	Если РезультатВыполненияДействий.СписокОшибок.Количество() = 0 Тогда  
		СоздатьРеализациюПоЗаказу(ЗаказКлиента);  
	Иначе 
		Сообщить("Не удалось проставить действике ""Отгрузить"" в строках Заказа клиента: " + ЗаказОбъект);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура СоздатьРеализациюПоЗаказу(Основание)
	
	МассивСсылок = Новый Массив();
	МассивСсылок.Добавить(Основание);
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.РеализацияТоваровУслугПараметрыОткрытияФормы(МассивСсылок);
	ДанныеЗаполнения = ПараметрыОткрытия.Основание;
	
	Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	Документ.Заполнить(ДанныеЗаполнения);
	Документ.Дата = ?(Объект.ДатаРеализации = НачалоДня(ТекущаяДата()), ТекущаяДата(), Объект.ДатаРеализации + 60*60*17);
	
	//***************************************  
	//Если заполнено поле продукция, 
	//удалим из ТЧ Товары строки не соответствующие отбору	
	//Если ЗначениеЗаполнено(Объект.Изделие) и ЗначениеЗаполнено(Объект.Количество) Тогда 
	//	ТЗ_Товары = Документ.Товары.Выгрузить();
	//	КоличествоРеализовано = 0;
	//	
	//	Для Каждого СтрТовары из ТЗ_Товары Цикл 
	//		Если СтрТовары.Номенклатура <> Объект.Изделие Тогда 
	//			ТЗ_Товары.Удалить(СтрТовары);
	//		Иначе  
	//			//уточнить количество и выполнить обработку строки
	//			//Если СтрТовары.Количество < КоличествоРеализовано Тогда 
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Документ.Товары.Загрузить(ТЗ_Товары);
	//КонецЕсли;
	//**************************
	
	Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	СоздатьСчетФактуру = Ложь;
	Если Документ.Товары.Количество() > 0 Тогда
		Попытка
			
			НачатьТранзакцию();      
			
			НовыйНомер = ПолучитьСледующийНомерРеализации(Документ.Организация);  
			Если НовыйНомер = 0 Тогда 
				Документ.УстановитьНовыйНомер();                
			Иначе 
				Документ.Номер = НовыйНомер;
			КонецЕсли;
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗафиксироватьТранзакцию();
			
			СоздатьСчетФактуру = Истина;
			
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    		ВызватьИсключение;
		КонецПопытки;
		
		Если СоздатьСчетФактуру Тогда
			НовыйСчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйСчетФактура, Документ.Ссылка);
			
			НовыйСчетФактура.ДокументОснование 	= Документ.Ссылка;
			СтрокаОснований = НовыйСчетФактура.ДокументыОснования.Добавить();  
			СтрокаОснований.ДокументОснование 	= Документ.Ссылка;   
			
			НовыйСчетФактура.ЗаполнитьПараметрыСчетаФактурыПоОснованию(Документ.Ссылка);
						
			НовыйСчетФактура.КодВидаОперацииНаУменьшение = "18";
			НовыйСчетФактура.Дата 				= Объект.ДатаРеализации;
			НовыйСчетФактура.ДатаВыставления 	= Объект.ДатаРеализации;
			
			НовыйСчетФактура.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Реализация = Документ.Ссылка;
	Иначе
		Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сформировать документ реализации. Табличная часть товары пустая.'"));
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСледующийНомерРеализации(Организация)
	
	НовыйНомер = 0;
	Запрос= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВЫБОР
	               |		КОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 0, 2) = ""ЦБ""
	               |			ТОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 4, 6)
	               |		КОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 0, 4) = ""00ЦБ""
	               |			ТОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 7)
	               |		КОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 0, 4) = ""РБЦБ""
	               |			ТОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 7)
				   |		КОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 0, 4) = ""0РЦБ""
	               |			ТОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 7)
	               |		ИНАЧЕ ""0""
	               |	КОНЕЦ КАК НомерЧисловой,
	               |	СчетФактураВыданный.Номер КАК Номер
	               |ИЗ
	               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |ГДЕ
	               |	СчетФактураВыданный.Организация = &Организация
	               |	И СчетФактураВыданный.Дата >= НАЧАЛОПЕРИОДА(&ДатаОтгрузки, ГОД)
	               |	И СчетФактураВыданный.Дата <= КОНЕЦПЕРИОДА(&ДатаОтгрузки, ГОД)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерЧисловой УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";    
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОтгрузки", Объект.ДатаРеализации);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда 
		МаксНомер = Выборка.Номер;  
		НомерЧисловой = Выборка.НомерЧисловой;
	Иначе 
		МаксНомер = "0";                       
		НомерЧисловой = "0";
	КонецЕсли;
	
	Если МаксНомер = "0" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Максимальный номер не определён! Нумерация начнётся сначала!'"),,,,);
		Возврат Число(МаксНомер);
	КонецЕсли;
	
	НовыйНомерЧисло = Формат(Число(НомерЧисловой) + 1,"ЧГ=0");
	НовыйНомерСтрока = Строка(НовыйНомерЧисло);
	НовыйНомер = Лев(МаксНомер,СтрДлина(МаксНомер) - СтрДлина(НовыйНомерСтрока)-1) + НовыйНомерСтрока;
	
	Возврат НовыйНомер; 
КонецФункции

&НаКлиенте
Процедура ПоказатьСписокЗаказовРеализации(Команда)
	АдресВоВременномХранилище = ПолучитьСписокЗаказовДляОтгрузки(Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	ОткрытьФормуМодально("Обработка.ТТМ_АРМ_ВыпускРеализация.Форма.ФормаСпискаЗаказов", ПараметрыФормы, ЭтотОбъект); 
КонецПроцедуры

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область Печать

&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	
	ПроверкаВыполнена = ПроверкаЗаполненияКлючевыхПолей(Команда);
	
	Если Не ПроверкаВыполнена Тогда 
		Возврат;
	КонецЕсли;
	
	//16.01.2026                                                        
	ДанныеТекущейСтрокиТаблицы = Элементы.ТаблицаЭтапов.ТекущиеДанные;
	Номенклатура = Объект.Изделие;
	Если не ЗначениеЗаполнено(Номенклатура) Тогда 
		//Передаем номенклатуру из текущей строки Таблицы
		Номенклатура = ДанныеТекущейСтрокиТаблицы.Номенклатура;
	КонецЕсли;
	КоличествоВыбрано = Объект.Количество;
	Если Объект.Количество = 0 Тогда 
		КоличествоВыбрано = ДанныеТекущейСтрокиТаблицы.Количество;
	КонецЕсли;
	
	//23.06.2025 
	СтруктураПечати = ПолучитьСтруктуруПечати(Номенклатура, КоличествоВыбрано, КоличествоЭтикетокДляПечати);
	
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Изделие);
	ИменаМакетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ЭтикеткаТовары");	 
	
	//23.06.2025
	//СтруктураПечати = ПолучитьСтруктуруПечати(МассивОбъектов, Объект.Количество, КоличествоЭтикетокДляПечати);
	//-
		
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьЭтикетокИЦенников",
		ИменаМакетов,
		МассивОбъектов,
		ЭтаФорма,
		СтруктураПечати
	);
	
КонецПроцедуры    

&НаКлиенте
Процедура НапечататьУПД()
	Если ЗначениеЗаполнено(Реализация) Тогда
		ВПФ = НайтиВПФ();
		
		Если ВПФ.Пустая() Тогда
			Сообщить("Не найдена внешняя печатная форма ""УПД с комментарием""!");
			Возврат;
		КонецЕсли;
		
		ОбъектыНазначения = Новый Массив;
		ОбъектыНазначения.Добавить(Реализация);
		ПараметрыОткрытия = Новый Структура("ИсточникДанных, ПараметрыИсточника");
		ПараметрыОткрытия.ИсточникДанных = ВПФ;
		ПараметрыОткрытия.ПараметрыИсточника = Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
		ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды = "УПДСКомментариемТТМ";
		ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения = ОбъектыНазначения;
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия);
	КонецЕсли;
КонецПроцедуры
        
&НаСервереБезКонтекста
функция ПолучитьСтруктуруПечати(НоменклатураСсылка, КоличествоЭтапов, ПроизвольноеКоличество, МассивСН = Неопределено, ВариантПечати = 1)
	//23.06.2025
	//КоличествоДляПечати = ?(КоличествоЭтапов = 0, ПроизвольноеКоличество, КоличествоЭтапов);	  
	Если ВариантПечати = 1 Тогда 
		КоличествоДляПечати = ?(ПроизвольноеКоличество = 0, КоличествоЭтапов , ПроизвольноеКоличество);	    
	Иначе 
		КоличествоДляПечати = 1;
	КонецЕсли;
	//07.07.2025
	//МассивЭтапов = Новый Массив;
	//Для Каждого стр из МассивСтрок Цикл 
	//	МассивЭтапов.Добавить(Стр.Ссылка);
	//КонецЦикла;
	//-
	Возврат ТТМ_ДанныеВыбораСервер.СформироватьСтруктуруПечатиЭтикеток(НоменклатураСсылка, КоличествоДляПечати, МассивСН, ВариантПечати);
	
КонецФункции

&НаСервере
Функция НайтиВПФ()

   Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("УПД с комментарием"); 
    
КонецФункции

#КонецОбласти


/////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область НастройкиФормыОтбораЦен

&НаКлиенте
Процедура СохранитьТекущиеНастройки(Команда)
    ВопросПользователюПередВыполнениемОперации(Команда);	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройки(Команда)
	ВопросПользователюПередВыполнениемОперации(Команда);
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	КлючНастроек = "Обработка.ТТМ_АРМ_ВыпускРеализация"; // + ПараметрыСеанса.ТекущийПользователь;
	Настройки = Новый Соответствие;
	Настройки.Вставить("ТаблицаОтбораЦен", ТаблицаОтбораЦен.Выгрузить());
	Настройки.Вставить("СписокАдресовДляРассылки", СписокАдресовДляРассылки.ВыгрузитьЗначения());
	    
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ТТМ_АРМ_ВыпускРеализация", КлючНастроек, Настройки);	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиИзХранилища()
	КлючНастроек = "Обработка.ТТМ_АРМ_ВыпускРеализация";  // + ПараметрыСеанса.ТекущийПользователь;
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.ТТМ_АРМ_ВыпускРеализация", КлючНастроек);
			
	Если ЗначениеНастроек = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Не найден список настроек для проверки цен в заказах'"));
		Возврат;
	КонецЕсли;
			
	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда
		Для Каждого ТекНастройки Из ЗначениеНастроек Цикл
			Если ТекНастройки.Ключ = "ТаблицаОтбораЦен" Тогда  
				ТаблицаНастроекОтбораЦен = ТекНастройки.Значение;
				ТаблицаОтбораЦен.Загрузить(ТаблицаНастроекОтбораЦен);
			КонецЕсли;
			
			Если ТекНастройки.Ключ = "СписокАдресовДляРассылки" Тогда
				МассивПочтовыхАдресов = ТекНастройки.Значение;
				СписокАдресовДляРассылки.ЗагрузитьЗначения(МассивПочтовыхАдресов);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;		
		
КонецПроцедуры

#КонецОбласти


/////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПроверкаУстановленныхЦенВЗаказеКлиента

&НаСервере
Процедура НачатьПроверкуЦенВРеализации()
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Валюта", Справочники.Валюты.НайтиПоНаименованию("руб.", Истина)); 
	ПараметрыОтбора.Вставить("ТЗГраницыИЦены", ТаблицаОтбораЦен.Выгрузить());
	ПараметрыОтбора.Вставить("ДатаНачала", НачалоДня(Объект.ДатаРеализации));
	ПараметрыОтбора.Вставить("ДатаОкончания", КонецДня(Объект.ДатаРеализации));
	ПараметрыОтбора.Вставить("НаДату", КонецДня(Объект.ДатаРеализации)); 
	ПараметрыОтбора.Вставить("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Фоб", Истина));
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ВыгруженнаяТаблица = ТекущийОбъект.ПроверитьУстановленныеЦеныВЗаказеКлиента(ПараметрыОтбора);
	
	Если ВыгруженнаяТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НачатьПроверкуЗаписейВРегистреОтправленныхПисем(ВыгруженнаяТаблица);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПочтовоеСообщение(ВыгруженнаяТаблица, СписокАдресовДляРассылки)
	ТабДок = ПодготовитьТабличныйДокументДляОтправки(ВыгруженнаяТаблица);
	
	УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("1C:ТТМ АРМ Выпуск и реализация", Истина);
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = "Уведомление из 1С";
	
	Для Каждого ВыбранныйАдрес Из СписокАдресовДляРассылки Цикл 
		Письмо.Получатели.Добавить(ВыбранныйАдрес.Значение);
	КонецЦикла;
		
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML5);
	Файл = Новый ЧтениеТекста(ИмяВременногоФайла);
	Текст = Файл.Прочитать();
	Письмо.Тексты.Добавить(Текст, ТипТекстаПочтовогоСообщения.HTML);
	Письмо.ОбработатьТексты();
	
    РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗаписьОтправителя, Письмо);	
КонецПроцедуры

&НаСервере
функция ПодготовитьТабличныйДокументДляОтправки(ВыгруженнаяТаблица)
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	МакетОтчета = ТекущийОбъект.ПолучитьМакет("РасхожденияУстановленныхЦенВЗакахИРеализации_XML");
	
	ОбластьШапка = МакетОтчета.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьРеквизитыТаблицы = МакетОтчета.ПолучитьОбласть("РеквизитыТаблицы");	
	ТабДок.Вывести(ОбластьРеквизитыТаблицы);
	
    ЗначенияРеквизитовТаблицы = МакетОтчета.ПолучитьОбласть("ЗначенияРеквизитовТаблицы");
	
	Для Каждого ТекДанные Из ВыгруженнаяТаблица Цикл		
		ЗначенияРеквизитовТаблицы.Параметры.Заполнить(ТекДанные);
		ТабДок.Вывести(ЗначенияРеквизитовТаблицы);
	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.ОтображатьСетку = Ложь;

	Возврат ТабДок; 
КонецФункции

// - Проверяем регистр перед отправкой почтового сообщения
&НаСервере
Процедура НачатьПроверкуЗаписейВРегистреОтправленныхПисем(ИсходныйСписокНоменклатуры)
	
	СписокНаОтправкуБезДублей = СформироватьНовуюТаблицуРассылкиБезДублей();
		
	Для Каждого ТекДанные Из ИсходныйСписокНоменклатуры Цикл
		МожемОтправитьПисьмо = ПроверитьЗаписиВРегистреОтправленныхПисем(ТекДанные);
		
		Если МожемОтправитьПисьмо Тогда
			НоваяСтрока = СписокНаОтправкуБезДублей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокНаОтправкуБезДублей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьПочтовоеСообщение(СписокНаОтправкуБезДублей, СписокАдресовДляРассылки);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьЗаписиВРегистреОтправленныхПисем(ТекущиеДанные, Знач СоздатьНовыйНаборЗаписей = Ложь, Знач МожемОтправитьПисьмо = Ложь) 
	НазначениеСсылка = Справочники.Назначения.НайтиПоНаименованию(ТекущиеДанные.Заказ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_РассылкаЭлектронныхПисем.Период КАК Период,
	               |	ТТМ_РассылкаЭлектронныхПисем.Назначение КАК Назначение,
	               |	ТТМ_РассылкаЭлектронныхПисем.Номенклатура КАК Номенклатура,
	               |	ТТМ_РассылкаЭлектронныхПисем.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ТТМ_РассылкаЭлектронныхПисем КАК ТТМ_РассылкаЭлектронныхПисем
	               |ГДЕ
	               |	ТТМ_РассылкаЭлектронныхПисем.Статус = &Статус
	               |	И ТТМ_РассылкаЭлектронныхПисем.Период = &Период
	               |	И ТТМ_РассылкаЭлектронныхПисем.Назначение = &Назначение
	               |	И НЕ ТТМ_РассылкаЭлектронныхПисем.Назначение.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Назначение", НазначениеСсылка);
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Статус",  Перечисления.ТТМ_СтатусыОтправленныхПисем.Отправлено);
	 
	СписокРассылок = Запрос.Выполнить().Выгрузить();
	СтруктураОтбора = Новый Структура("Номенклатура", ТекущиеДанные.Номенклатура);
	МассивНайденныхСтрок = СписокРассылок.НайтиСтроки(СтруктураОтбора);

	СоздатьНовыйНаборЗаписей = ?(МассивНайденныхСтрок.Количество() >  0, Ложь, Истина);

	//Создаем новую запись, если не было отправленных писем по данному заказу
	Если СоздатьНовыйНаборЗаписей Тогда
		СделатьЗаписьВРегистрПоПисьму(ТекущиеДанные, НазначениеСсылка);
		МожемОтправитьПисьмо = Истина;
	КонецЕсли;
	
	Возврат МожемОтправитьПисьмо;	
КонецФункции

&НаСервереБезКонтекста
Процедура СделатьЗаписьВРегистрПоПисьму(ТекущиеДанные, НазначениеСсылка) 
	
	НаборЗаписей = РегистрыСведений.ТТМ_РассылкаЭлектронныхПисем.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Назначение.Установить(НазначениеСсылка); 
	НаборЗаписей.Отбор.Номенклатура.Установить(ТекущиеДанные.Номенклатура);
	
	НоваяЗапись = НаборЗаписей.Добавить();	
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.Назначение = НазначениеСсылка;
	НоваяЗапись.Номенклатура = ТекущиеДанные.Номенклатура;
	НоваяЗапись.Статус = Перечисления.ТТМ_СтатусыОтправленныхПисем.Отправлено;
		
	Попытка
		НачатьТранзакцию();
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка записи отправленного письма: '") + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьНовуюТаблицуРассылкиБезДублей()
	СписокНаОтправкуБезДублей = Новый ТаблицаЗначений;
	СписокНаОтправкуБезДублей.Колонки.Добавить("Заказ", Новый ОписаниеТипов("Строка"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("Реализация", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("ДатаОтгрузки", Новый ОписаниеТипов("Дата"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("ПроцентОтличия", Новый ОписаниеТипов("Число"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("Разница", Новый ОписаниеТипов("Число"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("УстановкаЦен", Новый ОписаниеТипов("ДокументСсылка.УстановкаЦенНоменклатуры"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("ЦенаРеализации", Новый ОписаниеТипов("Число"));
	СписокНаОтправкуБезДублей.Колонки.Добавить("ЦенаУстановленная", Новый ОписаниеТипов("Число"));
	
	Возврат СписокНаОтправкуБезДублей;
КонецФункции

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ДополнительнаяУстановкаРазрешений
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СписокИДЗапросовРазрешений.Очистить();
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеПривилегированногоРежима("Разрешение привилегированного режима для пользователей с ограниченными правами");
	МассивРазрешений = Новый Массив;
	МассивРазрешений.Добавить(Разрешение);
	ИДЗапроса = РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(МассивРазрешений, ЭтотОбъект, Истина);
	СписокИДЗапросовРазрешений.Добавить(ИДЗапроса);
   	ОбновитьОстаткиСерий();
	АдресАналитик = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	//ПолучитьНастройкиИзХранилища();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивИдентификаторовРазрешений(знач СписокИДЗапросовРазрешений)
	МассивИДРазрешений = Новый Массив;
	
	Для Каждого ИД из СписокИДЗапросовРазрешений Цикл 
		МассивИДРазрешений.Добавить(ИД.Значение);
	КонецЦикла;
	
	Возврат МассивИДРазрешений;
КонецФункции

&НаКлиенте
Процедура ПослеПредоставленияРазрешения(Результат,ДопПараметры) Экспорт
	//Если Результат = КодВозвратаДиалога.ОК Тогда 
	//	Сообщить("Разрешение на использование привилегированного режима установлено!");
	//Иначе 
	//	Сообщить("Разрешение на использование привилегированного режима не получено!");
	//КонецЕсли;
	ЗаполнитьРеквизитыРФ();
	//Сообщить("Безопасный режим: " + РФ_БезопасныйРежим);
	//Сообщить("Привилегированный режим: " + РФ_ПривилегированныйРежим);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыРФ()
	//УстановитьПривилегированныйРежим(Истина);
	//УстановитьБезопасныйРежим(Истина);
	//УстановитьБезопасныйРежим(Ложь);
	РФ_ПривилегированныйРежим = ПривилегированныйРежим();
	РФ_БезопасныйРежим = БезопасныйРежим();
КонецПроцедуры
	
#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ФормированиеДокументовОтгрузки

&НаКлиенте
Процедура ЗаполнитьДокументОтгрузка(Команда)
	//+Ганьшина Е.
	Возврат;
	//-
	ВопросПользователюПередВыполнениемОперации(Команда);
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументТекущаяОтгрузка()
	ВыгруженныеЗаказы = ПолучитьСписокЗаказовДляОтгрузки();
	
	Если ВыгруженныеЗаказы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет ни одного заказа с выпуском'"));
		Возврат;
	КонецЕсли;
	
	//Вызов серверной функции из модуля объекта
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаТоваров = ТекущийОбъект.ГруппировкаЗаказовСВыпуском(ВыгруженныеЗаказы, Истина);
	
	//Получаем документ со статусом завершен или завершен с расхождениями
	СписокОтсканированныхИзделий = ПроверкаДокументаПередФормированием(Истина);
	
	Если СписокОтсканированныхИзделий.Количество() > 0 Тогда
		ТаблицаТоваров = ВыполнитьПроверкуОтсканированныхТоваров(ТаблицаТоваров, СписокОтсканированныхИзделий);
	КонецЕсли;
	
	//Получаем действующий документ со статусом в работе или к выполнению и проверяем имеющиеся комплекты таблице
	НайденныйДокумент = ПроверкаДокументаПередФормированием();
	ТаблицаТоваров = ПроверитьИУдалитьЕслиЕстьКомплекты(ТаблицаТоваров);
	
	//Если документ не найден, создаем новый и заполняем его реквизиты
	Если НайденныйДокумент = Неопределено Тогда
		СозданиеНовогоДокумента(ТаблицаТоваров);
	Иначе
	//Иначе перезаполняем существующий документ
		ПерезаполнитьСуществующийДокумент(ТаблицаТоваров, НайденныйДокумент);		
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура СозданиеНовогоДокумента(ТаблицаТоваров)
	НовыйДокумент = Документы.ТТМ_ОтгрузкаТоваров.СоздатьДокумент();
		
	Для Каждого Товар Из ТаблицаТоваров Цикл		
		Организация = Товар.Организация;
		СкладОтгрузки = Товар.Склад;
			
		ТоварСтрока = НовыйДокумент.ВыпущеннаяПродукция.Добавить();
		ТоварСтрока.Номенклатура = Товар.Номенклатура;
		ТоварСтрока.Количество = Товар.Количество;
		ТоварСтрока.ЕдиницаИзмерения = Товар.Номенклатура.ЕдиницаИзмерения;			
	КонецЦикла;
		
	НовыйДокумент.Дата = ПолучитьТекДату();
	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	НовыйДокумент.Организация = Организация;
	НовыйДокумент.Склад = СкладОтгрузки;
	НовыйДокумент.Статус = Перечисления.СтатусыТТМОтгрузка.КВыполнению;
		
	Попытка
		НачатьТранзакцию();
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		ЗафиксироватьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Формирование нового документа завершено: '") + НовыйДокумент);
	Исключение 
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Произошла ошибка при формировании нового документа: '") + ОписаниеОшибки());
		
		// Запись события в журнал регистрации для системного администратора.
    	ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Выполнение операции'"),
			УровеньЖурналаРегистрации.Ошибка,,, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    	ВызватьИсключение;

	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСуществующийДокумент(ТаблицаТоваров, НайденныйДокумент)
	ДокументСсылка = НайденныйДокумент.ПолучитьОбъект();
	ДокументСсылка.ВыпущеннаяПродукция.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаТоваров, ДокументСсылка.ВыпущеннаяПродукция);   
			
	Попытка
		НачатьТранзакцию();
		ДокументСсылка.Записать(РежимЗаписиДокумента.Запись);
		ЗафиксироватьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Документ: '") + ДокументСсылка + " успешно перезаписан");
	Исключение 
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Произошла во время записи документа: '") + ДокументСсылка + " " +  ОписаниеОшибки());
		
		// Запись события в журнал регистрации для системного администратора.
    	ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Выполнение операции'"),
			УровеньЖурналаРегистрации.Ошибка,,, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    	ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

&НаСервере
функция ВыполнитьПроверкуОтсканированныхТоваров(ТаблицаТоваров, СписокОтсканированныхИзделий)
	
	Для Каждого ТоварВыпуск Из ТаблицаТоваров Цикл
		НоменклатураНайдена = Ложь;
		
		Для Каждого ТоварИзДокумента Из СписокОтсканированныхИзделий Цикл
			
			Если ТоварВыпуск.Номенклатура = ТоварИзДокумента.Номенклатура Тогда 
			    НоменклатураНайдена = Истина;
				КоличествоТСД = ТоварИзДокумента.ТСД;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НоменклатураНайдена Тогда
			ТоварВыпуск.Количество = ТоварВыпуск.Количество - КоличествоТСД;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДляПоиска = Новый Структура("Количество", 0);
	МассивПустыхСтрок = ТаблицаТоваров.НайтиСтроки(СтруктураДляПоиска);
	
	Для каждого СтрокаКУдалению Из МассивПустыхСтрок Цикл 
     	ТаблицаТоваров.Удалить(СтрокаКУдалению); 
    КонецЦикла; 
	
	Возврат ТаблицаТоваров; 
	
КонецФункции

&НаСервереБезКонтекста
функция ПроверкаДокументаПередФормированием(Знач ПроверкаОтсканированныхИзделий = Ложь)
					
	МассивСтатусов = Новый Массив;	
	
	Если ПроверкаОтсканированныхИзделий Тогда
		МассивСтатусов.Добавить(Перечисления.СтатусыТТМОтгрузка.Завершен);
		МассивСтатусов.Добавить(Перечисления.СтатусыТТМОтгрузка.ЗавершенСРасхождениями);
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТТМ_ОтгрузкаТоваровВыпущеннаяПродукция.Номенклатура КАК Номенклатура,
		               |	СУММА(ТТМ_ОтгрузкаТоваровВыпущеннаяПродукция.ТСД) КАК ТСД
		               |ИЗ
		               |	Документ.ТТМ_ОтгрузкаТоваров.ВыпущеннаяПродукция КАК ТТМ_ОтгрузкаТоваровВыпущеннаяПродукция
		               |ГДЕ
		               |	ТТМ_ОтгрузкаТоваровВыпущеннаяПродукция.Ссылка.Статус В(&МассивСтатусов)
		               |	И НЕ ТТМ_ОтгрузкаТоваровВыпущеннаяПродукция.Ссылка.ПометкаУдаления
		               |	И ТТМ_ОтгрузкаТоваровВыпущеннаяПродукция.Ссылка.Дата МЕЖДУ &НачалоТекущегоДня И &КонецТекущегоДня
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТТМ_ОтгрузкаТоваровВыпущеннаяПродукция.Номенклатура";
		
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
		Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("КонецТекущегоДня", КонецДня(ТекущаяДата()));
		
		Выборка = Запрос.Выполнить().Выгрузить();	
	Иначе	
		МассивСтатусов.Добавить(Перечисления.СтатусыТТМОтгрузка.КВыполнению);
		МассивСтатусов.Добавить(Перечисления.СтатусыТТМОтгрузка.Начат);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ТТМ_ОтгрузкаТоваров.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ТТМ_ОтгрузкаТоваров КАК ТТМ_ОтгрузкаТоваров
		               |ГДЕ
		               |	ТТМ_ОтгрузкаТоваров.Статус В (&МассивСтатусов)
		               |	И НЕ ТТМ_ОтгрузкаТоваров.ПометкаУдаления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТТМ_ОтгрузкаТоваров.Дата УБЫВ";
		
		Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();	
		РезультатЗапроса.Следующий();
		
		Выборка = РезультатЗапроса.Ссылка;
	КонецЕсли;
	
	Возврат Выборка;
КонецФункции

&НаСервереБезКонтекста 

функция ПолучитьСписокЗаказовДляОтгрузки(Знач ЗагрузитьВоВременноеХранилище = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	               |	Назначения.Ссылка КАК Назначение,
	               |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	               |	ЗаказКлиентаТовары.Ссылка.Организация КАК Организация,
	               |	ЗаказКлиентаТовары.Ссылка.Дата КАК Дата
	               |ПОМЕСТИТЬ ТоварыОткрытыхЗаказов
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО (ЗаказКлиентаТовары.Ссылка = (ВЫРАЗИТЬ(Назначения.Заказ КАК Документ.ЗаказКлиента)))
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка.Проведен
	               |	И (ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению)
	               |			ИЛИ ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	Назначения.Ссылка,
	               |	ЗаказКлиентаТовары.Ссылка.Склад,
	               |	ЗаказКлиентаТовары.Ссылка.Организация,
	               |	ЗаказКлиентаТовары.Ссылка.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	               |	Назначения.Ссылка КАК Назначение,
	               |	РеализацияТоваровУслугТовары.Склад КАК Склад
	               |ПОМЕСТИТЬ ОтгруженоПоНазначениям
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО (РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента = (ВЫРАЗИТЬ(Назначения.Заказ КАК Документ.ЗаказКлиента)))
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	Назначения.Ссылка,
	               |	РеализацияТоваровУслугТовары.Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Номенклатура, ДвижениеПродукцииИМатериаловТовары.Номенклатура) КАК Номенклатура,
	               |	СУММА(ЕСТЬNULL(ДвижениеПродукцииИМатериаловТовары.Количество, 0)) КАК Количество,
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Назначение, ДвижениеПродукцииИМатериаловТовары.Назначение) КАК Назначение,
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Склад, ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель) КАК Склад
	               |ПОМЕСТИТЬ ВыпущенныеТоварыПоНазначениям
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	               |		ПО (ДвижениеПродукцииИМатериаловТовары.Номенклатура = ТоварыОткрытыхЗаказов.Номенклатура)
	               |			И (ДвижениеПродукцииИМатериаловТовары.Назначение = ТоварыОткрытыхЗаказов.Назначение)
	               |			И (ТоварыОткрытыхЗаказов.Склад = (ВЫРАЗИТЬ(ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель КАК Справочник.Склады)))
	               |ГДЕ
	               |	ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Назначение, ДвижениеПродукцииИМатериаловТовары.Назначение),
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Склад, ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель),
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Номенклатура, ДвижениеПродукцииИМатериаловТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Отметка,
	               |	ТоварыОткрытыхЗаказов.Дата КАК Дата,
	               |	ТоварыОткрытыхЗаказов.Номенклатура КАК Номенклатура,
	               |	ТоварыОткрытыхЗаказов.Назначение КАК Назначение,
	               |	ТоварыОткрытыхЗаказов.ЗаказКлиента КАК ЗаказКлиента,
	               |	ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0) - ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0) КАК КОтгрузке,
	               |	ТоварыОткрытыхЗаказов.Склад КАК Склад,
	               |	ТоварыОткрытыхЗаказов.Организация КАК Организация
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОтгруженоПоНазначениям КАК ОтгруженоПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ОтгруженоПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ОтгруженоПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ОтгруженоПоНазначениям.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВыпущенныеТоварыПоНазначениям КАК ВыпущенныеТоварыПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ВыпущенныеТоварыПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ВыпущенныеТоварыПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ВыпущенныеТоварыПоНазначениям.Склад
	               |ГДЕ
	               |	ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0) < ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыОткрытыхЗаказов.Номенклатура КАК Номенклатура,
	               |	ТоварыОткрытыхЗаказов.Назначение КАК Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер КАК СерийныйНомер,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер, """") = """"
	               |			ТОГДА ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0) - ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0)
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОтгруженоПоНазначениям КАК ОтгруженоПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ОтгруженоПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ОтгруженоПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ОтгруженоПоНазначениям.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВыпущенныеТоварыПоНазначениям КАК ВыпущенныеТоварыПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ВыпущенныеТоварыПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ВыпущенныеТоварыПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ВыпущенныеТоварыПоНазначениям.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки КАК ТТМ_УчетСерийныхНомеровПродукцииОстатки
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Склад
	               |ГДЕ
	               |	ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0) < ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Назначение,
	               |	Номенклатура,
	               |	СерийныйНомер
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[3].Выгрузить();
	ТабВыпущенныеТоварыЗаказов = МассивРезультатов[4].Выгрузить(); 
	
	РезультатВыгрузки = ?(ЗагрузитьВоВременноеХранилище, ПоместитьВоВременноеХранилище(Выборка), Выборка); 
	
	Возврат РезультатВыгрузки;	
	
КонецФункции

&НаСервере
Процедура ПолучитьСписокЗаказовДляОтгрузки1()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	               |	Назначения.Ссылка КАК Назначение,
	               |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	               |	ЗаказКлиентаТовары.Ссылка.Организация КАК Организация,
	               |	ЗаказКлиентаТовары.Ссылка.Дата КАК Дата
	               |ПОМЕСТИТЬ ТоварыОткрытыхЗаказов
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО (ЗаказКлиентаТовары.Ссылка = (ВЫРАЗИТЬ(Назначения.Заказ КАК Документ.ЗаказКлиента)))
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка.Проведен
	               |	И (ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению)
	               |			ИЛИ ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	Назначения.Ссылка,
	               |	ЗаказКлиентаТовары.Ссылка.Склад,
	               |	ЗаказКлиентаТовары.Ссылка.Организация,
	               |	ЗаказКлиентаТовары.Ссылка.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	               |	Назначения.Ссылка КАК Назначение,
	               |	РеализацияТоваровУслугТовары.Склад КАК Склад
	               |ПОМЕСТИТЬ ОтгруженоПоНазначениям
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО (РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента = (ВЫРАЗИТЬ(Назначения.Заказ КАК Документ.ЗаказКлиента)))
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	Назначения.Ссылка,
	               |	РеализацияТоваровУслугТовары.Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Номенклатура, ДвижениеПродукцииИМатериаловТовары.Номенклатура) КАК Номенклатура,
	               |	СУММА(ЕСТЬNULL(ДвижениеПродукцииИМатериаловТовары.Количество, 0)) КАК Количество,
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Назначение, ДвижениеПродукцииИМатериаловТовары.Назначение) КАК Назначение,
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Склад, ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель) КАК Склад
	               |ПОМЕСТИТЬ ВыпущенныеТоварыПоНазначениям
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	               |		ПО (ДвижениеПродукцииИМатериаловТовары.Номенклатура = ТоварыОткрытыхЗаказов.Номенклатура)
	               |			И (ДвижениеПродукцииИМатериаловТовары.Назначение = ТоварыОткрытыхЗаказов.Назначение)
	               |			И (ТоварыОткрытыхЗаказов.Склад = (ВЫРАЗИТЬ(ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель КАК Справочник.Склады)))
	               |ГДЕ
	               |	ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Назначение, ДвижениеПродукцииИМатериаловТовары.Назначение),
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Склад, ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель),
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Номенклатура, ДвижениеПродукцииИМатериаловТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ИСТИНА КАК Отметка,
	               |	ТоварыОткрытыхЗаказов.Дата КАК Дата,
	               |	ТоварыОткрытыхЗаказов.Назначение КАК Назначение,
	               |	ТоварыОткрытыхЗаказов.ЗаказКлиента КАК ЗаказКлиента,
	               |	ТоварыОткрытыхЗаказов.Склад КАК Склад,
	               |	ТоварыОткрытыхЗаказов.Организация КАК Организация
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОтгруженоПоНазначениям КАК ОтгруженоПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ОтгруженоПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ОтгруженоПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ОтгруженоПоНазначениям.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВыпущенныеТоварыПоНазначениям КАК ВыпущенныеТоварыПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ВыпущенныеТоварыПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ВыпущенныеТоварыПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ВыпущенныеТоварыПоНазначениям.Склад
	               |ГДЕ
	               |	ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0) < ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Отметка,
	               |	ТоварыОткрытыхЗаказов.Номенклатура КАК Номенклатура,
	               |	ТоварыОткрытыхЗаказов.Назначение КАК Назначение,
	               |	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер, """") КАК СерийныйНомер,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукцииОстатки.СерийныйНомер, """") = """"
	               |			ТОГДА ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0) - ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0)
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОтгруженоПоНазначениям КАК ОтгруженоПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ОтгруженоПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ОтгруженоПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ОтгруженоПоНазначениям.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВыпущенныеТоварыПоНазначениям КАК ВыпущенныеТоварыПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ВыпущенныеТоварыПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ВыпущенныеТоварыПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ВыпущенныеТоварыПоНазначениям.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки(, Произведено) КАК ТТМ_УчетСерийныхНомеровПродукцииОстатки
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ТТМ_УчетСерийныхНомеровПродукцииОстатки.Склад
	               |ГДЕ
	               |	ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0) < ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Назначение,
	               |	Номенклатура,
	               |	СерийныйНомер
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Заказы = МассивРезультатов[3].Выгрузить();
	Товары = МассивРезультатов[4].Выгрузить();
	
	СписокЗаказовКРеализации.Загрузить(Заказы);
	Объект.ТЧВыпущенныеТоварыЗаказов.Загрузить(Товары);
	
КонецПроцедуры

функция ПолучитьСписокЗаказовДляОтгрузки_БЕЗ_ТОВАРОВ_ЗАКАЗА(Знач ЗагрузитьВоВременноеХранилище = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	               |	Назначения.Ссылка КАК Назначение,
	               |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	               |	ЗаказКлиентаТовары.Ссылка.Организация КАК Организация,
	               |	ЗаказКлиентаТовары.Ссылка.Дата КАК Дата
	               |ПОМЕСТИТЬ ТоварыОткрытыхЗаказов
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО (ЗаказКлиентаТовары.Ссылка = (ВЫРАЗИТЬ(Назначения.Заказ КАК Документ.ЗаказКлиента)))
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка.Проведен
	               |	И (ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению)
	               |			ИЛИ ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	Назначения.Ссылка,
	               |	ЗаказКлиентаТовары.Ссылка.Склад,
	               |	ЗаказКлиентаТовары.Ссылка.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	               |	Назначения.Ссылка КАК Назначение,
	               |	РеализацияТоваровУслугТовары.Склад КАК Склад
	               |ПОМЕСТИТЬ ОтгруженоПоНазначениям
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО (РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента = (ВЫРАЗИТЬ(Назначения.Заказ КАК Документ.ЗаказКлиента)))
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	Назначения.Ссылка,
	               |	РеализацияТоваровУслугТовары.Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Номенклатура, ДвижениеПродукцииИМатериаловТовары.Номенклатура) КАК Номенклатура,
	               |	СУММА(ЕСТЬNULL(ДвижениеПродукцииИМатериаловТовары.Количество, 0)) КАК Количество,
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Назначение, ДвижениеПродукцииИМатериаловТовары.Назначение) КАК Назначение,
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Склад, ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель) КАК Склад
	               |ПОМЕСТИТЬ ВыпущенныеТоварыПоНазначениям
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	               |		ПО (ДвижениеПродукцииИМатериаловТовары.Номенклатура = ТоварыОткрытыхЗаказов.Номенклатура)
	               |			И (ДвижениеПродукцииИМатериаловТовары.Назначение = ТоварыОткрытыхЗаказов.Назначение)
	               |			И (ТоварыОткрытыхЗаказов.Склад = (ВЫРАЗИТЬ(ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель КАК Справочник.Склады)))
	               |ГДЕ
	               |	ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Назначение, ДвижениеПродукцииИМатериаловТовары.Назначение),
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Склад, ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель),
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Номенклатура, ДвижениеПродукцииИМатериаловТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Отметка,
	               |	ТоварыОткрытыхЗаказов.Дата КАК Дата,
	               |	ТоварыОткрытыхЗаказов.Номенклатура КАК Номенклатура,
	               |	ТоварыОткрытыхЗаказов.Назначение КАК Назначение,
	               |	ТоварыОткрытыхЗаказов.ЗаказКлиента КАК ЗаказКлиента,
	               |	ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0) - ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0) КАК КОтгрузке,
	               |	ТоварыОткрытыхЗаказов.Склад КАК Склад,
	               |	ТоварыОткрытыхЗаказов.Организация КАК Организация
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОтгруженоПоНазначениям КАК ОтгруженоПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ОтгруженоПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ОтгруженоПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ОтгруженоПоНазначениям.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВыпущенныеТоварыПоНазначениям КАК ВыпущенныеТоварыПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ВыпущенныеТоварыПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ВыпущенныеТоварыПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ВыпущенныеТоварыПоНазначениям.Склад
	               |ГДЕ
	               |	ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0) < ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0)";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	РезультатВыгрузки = ?(ЗагрузитьВоВременноеХранилище, ПоместитьВоВременноеХранилище(Выборка), Выборка); 
	
	Возврат РезультатВыгрузки;	
КонецФункции

&НаСервереБезКонтекста
функция ПолучитьСписокЗаказовДляОтгрузки_до_10_10_25(Знач ЗагрузитьВоВременноеХранилище = Ложь)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.Назначение КАК Назначение,
	               |	ТоварыКОтгрузкеОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	               |	ТоварыКОтгрузкеОстатки.Склад КАК Склад,
	               |	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КОтгрузке
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ТоварыКОтгрузкеОстатки.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента)
				   |	И НЕ ТоварыКОтгрузкеОстатки.ДокументОтгрузки.ПометкаУдаления
	               |	И НЕ ТоварыКОтгрузкеОстатки.Назначение.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
	               |	ТоварыКОтгрузкеОстатки.Назначение,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	РезультатВыгрузки = ?(ЗагрузитьВоВременноеХранилище, ПоместитьВоВременноеХранилище(Выборка), Выборка); 
	
	Возврат РезультатВыгрузки;	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьИУдалитьЕслиЕстьКомплекты(ТаблицаТоваров, Знач СоответствиеНаименования = "Комплект", Знач Начало = -1)
	МассивТоваровБезШтрихкода = Новый Массив;	
	ТаблицаТоваров.Колонки.Добавить("Удалить");
	
	Для Каждого ТекТовар Из ТаблицаТоваров Цикл
		НоменклатураСсылка = ТекТовар.Номенклатура;
		ДанныеПоиска = СтрНайти(НРег(НоменклатураСсылка.Наименование), НРег(СоответствиеНаименования), НаправлениеПоиска.СНачала);
		
		Если ДанныеПоиска > 0 Тогда
			Штрихкод = ТТМ_ДанныеВыбораСервер.ПолучитьШтрихкод(НоменклатураСсылка);
			
			Если Штрихкод = "" Тогда
				ТекТовар.Удалить = Истина;
				МассивТоваровБезШтрихкода.Добавить(НоменклатураСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивТоваровБезШтрихкода.Количество() > 0 Тогда
		Индекс = ТаблицаТоваров.Количество() -1;
		Пока Индекс > Начало Цикл
			ТекСтрока = ТаблицаТоваров.Получить(Индекс);
						
			Если ТекСтрока.Удалить = Истина Тогда  
				ТаблицаТоваров.Удалить(Индекс);
			КонецЕсли;
			
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаТоваров.Колонки.Удалить("Удалить");	
	Возврат ТаблицаТоваров; 
КонецФункции

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПечатьQRКодов

&НаСервере
Функция ДР_СформироватьТабДокQRПакетомНаСервере(МассивСтрок, ОдинQRНаУпаковку = Ложь) Экспорт
	Возврат ТТМ_QRПечатьСервер.СформироватьТабличныйДокументQRПакет(МассивСтрок, ОдинQRНаУпаковку);
КонецФункции

&НаКлиенте
Процедура АРМ1_ПечатьQRПосле(Команда) // N Этикеток с 1 единиц 
	// Основная кнопка: поштучно
	ДР_ПечатьQR(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура АРМ1_ПечатьQRУпаковка(Команда) // 1 Этикетка с N единиц
	// Вторая кнопка: 1 QR на упаковку
	ДР_ПечатьQR(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДР_ПечатьQR(ОдинQRНаУпаковку) // Отсюда запускается вся логика, параметр - истина или булево от кнопок
	
	МассивСтрок = ДР_ОтмеченныеДанныеЭтаповДляQR();
	
	Если МассивСтрок.Количество() > 0 Тогда
		
		ТабДок = ДР_СформироватьТабДокQRПакетомНаСервере(МассивСтрок, ОдинQRНаУпаковку);
		
		ОбъектыПечати = Новый СписокЗначений;
		Для каждого Стр Из МассивСтрок Цикл
			Если Стр.Номенклатура <> Неопределено Тогда
				ОбъектыПечати.Добавить(Стр.Номенклатура);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ДанныеСтрокиЭтапа = ДР_ТекущиеДанныеЭтапаДляQR();
		Если ДанныеСтрокиЭтапа = Неопределено Или ДанныеСтрокиЭтапа.Номенклатура = Неопределено Тогда
			Сообщить("Не отмечено ни одной строки и не выбрана текущая строка.");
			Возврат;
		КонецЕсли;
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(ДанныеСтрокиЭтапа);
		
		ТабДок = ДР_СформироватьТабДокQRПакетомНаСервере(МассивСтрок, ОдинQRНаУпаковку);
		
		ОбъектыПечати = Новый СписокЗначений;
		ОбъектыПечати.Добавить(ДанныеСтрокиЭтапа.Номенклатура);
		
	КонецЕсли;
	
	// стандартная печать БСП
	ИдентификаторФормы = "ДР_QRНоменклатуры";
	Коллекция = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторФормы);
	Описание  = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(Коллекция, ИдентификаторФормы);
	
	Описание.СинонимМакета       = НСтр("ru='QR номенклатуры'");
	Описание.ТабличныйДокумент   = ТабДок;
	Описание.Экземпляров         = 1;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(Коллекция, ОбъектыПечати, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ДР_СформироватьТабДокQRНаСервере(ДанныеСтрокиЭтапа) Экспорт
    Возврат ТТМ_QRПечатьСервер.СформироватьТабличныйДокументQR(ДанныеСтрокиЭтапа);
КонецФункции

&НаКлиенте
Функция ДР_ТекущиеДанныеЭтапаДляQR() Экспорт
	Данные = Элементы.ТаблицаЭтапов.ТекущиеДанные;
	Возврат ДР_СформироватьСтруктуруЭтапаДляQR(Данные);
КонецФункции

&НаКлиенте
Функция ДР_ОтмеченныеДанныеЭтаповДляQR() Экспорт
	Результат = Новый Массив;
	Таблица = ТаблицаЭтапов;

	Если Таблица = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для каждого Стр Из Таблица Цикл
		Если Стр.Отметка <> Истина Тогда
			Продолжить;
		КонецЕсли;

		СтруктураСтроки = ДР_СформироватьСтруктуруЭтапаДляQR(Стр);
		Если СтруктураСтроки <> Неопределено Тогда
			Результат.Добавить(СтруктураСтроки);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ПолучитьНомерЗаказаИДату(Стр) Экспорт

	Представление = "";
	Попытка
		Представление = Строка(Стр.Назначение);
	Исключение
		Представление = "";
	КонецПопытки;

	Части = СтрРазделить(Представление, ",");

	Номер = "";
	Дата  = "";

	Если Части.Количество() >= 1 Тогда
		Номер = СокрЛП(Части.Получить(0));
	КонецЕсли;

	Если Части.Количество() >= 2 Тогда
		Дата = СокрЛП(Части.Получить(1));
	КонецЕсли;

	Возврат Новый Структура("Номер,Дата", Номер, Дата);

КонецФункции

&НаКлиенте
Функция ДР_СформироватьСтруктуруЭтапаДляQR(СтрокаИсточник) Экспорт
	Если СтрокаИсточник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Рез = Новый Структура;

	// Обязательное
	Попытка
		Рез.Вставить("Номенклатура", СтрокаИсточник.Номенклатура);
	Исключение
		Рез.Вставить("Номенклатура", Неопределено);
	КонецПопытки;

	// Опциональные
	Попытка Рез.Вставить("СерийныйНомер", СтрокаИсточник.СерийныйНомер); Исключение Рез.Вставить("СерийныйНомер",""); КонецПопытки;
	Попытка Рез.Вставить("Количество", СтрокаИсточник.Количество); Исключение Рез.Вставить("Количество",1); КонецПопытки;

	// Заказ/дата
	ДатаНомер = ПолучитьНомерЗаказаИДату(СтрокаИсточник);
	Рез.Вставить("Назначение",     ДатаНомер.Номер);
	Рез.Вставить("ДатаНазначения", ДатаНомер.Дата);

	Возврат Рез;
КонецФункции

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////////////////////////////// 
#Область НеИспользуется

&НаСервере
Процедура ВыборкаЗаказаПриВводеТекста()
	Объект.ЗаказКлиента = Документы.ЗаказКлиента.ПустаяСсылка();
	НомерПоДанныеКлиента = "";
	ДатаПоДаннымКлиента  = Дата('00010101');
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусОбеспечения()	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура", Объект.Изделие);
	СтруктураПоиска.Вставить("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.КОбеспечению);	
	
	ДокОбъект = Объект.ЗаказКлиента.ПолучитьОбъект();
	НайденныеСтроки = ДокОбъект.Товары.НайтиСтроки(СтруктураПоиска);
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("ЗаполнитьДатуОтгрузкиОднойДатой", Ложь);
	ПараметрыЗаполнения.Вставить("СнятьФлагОтгружатьОднойДатой", Ложь);
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для Каждого НайденныйТовар Из НайденныеСтроки Цикл
		НайденныйТовар.Количество = НайденныйТовар.Количество - Объект.Количество;
		НайденныйТовар.КоличествоУпаковок = НайденныйТовар.КоличествоУпаковок - Объект.Количество;
		
		НоваяСтрока = ДокОбъект.Товары.Добавить();
		ИндексСтроки = НоваяСтрока.КодСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныйТовар);
		НоваяСтрока.КодСтроки = ИндексСтроки;
		НоваяСтрока.ДатаОтгрузки = ТекущаяДата();
		НоваяСтрока.Количество = Объект.Количество;
		НоваяСтрока.КоличествоУпаковок = Объект.Количество;
		НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;		
		
		НоваяСтрока = ПересчитатьИтоговыеПоказатели(НоваяСтрока);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, ПараметрыЗаполнения, КэшированныеЗначения);
		
        НайденныйТовар = ПересчитатьИтоговыеПоказатели(НайденныйТовар);		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НайденныйТовар, ПараметрыЗаполнения, КэшированныеЗначения);
	КонецЦикла;
				
	Попытка
		НачатьТранзакцию();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		ЗафиксироватьТранзакцию();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка во время записи документа: '") + ДокОбъект + " " + ОписаниеОшибки(),,,); 
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПересчитатьИтоговыеПоказатели(СтрокаТЧ)
	РазбитьСтроку = СтрЗаменить(СтрокаТЧ.СтавкаНДС, "%", "");
	ПолученныйНДС = Число(РазбитьСтроку); 
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	СтрокаТЧ.СуммаСНДС = СтрокаТЧ.Цена * СтрокаТЧ.Количество;
	СтрокаТЧ.СуммаНДС = (СтрокаТЧ.Цена * ПолученныйНДС / 120) * СтрокаТЧ.Количество;
	
	Возврат СтрокаТЧ;
КонецФункции

&НаСервереБезКонтекста
Функция ПоискЗаказаКлиентаЧерезНазначение(ПараметрыДанных)
	
	МассивОтбора = Новый Массив;
	ВводПользователя = "%" + ПараметрыДанных.СтрокаПоиска + "%";
		
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Назначения.Заказ КАК Заказ,
		|	Назначения.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Назначения КАК Назначения
		|ГДЕ
		|	Назначения.Наименование ПОДОБНО &Наименование
		|	И НЕ Назначения.ПометкаУдаления
		|	И НЕ Назначения.Заказ.ПометкаУдаления
		|	И НЕ Назначения.Заказ.Статус = &СтатусЗаказа"
	);
	
	Запрос.УстановитьПараметр("Наименование", ВводПользователя);
	Запрос.УстановитьПараметр("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.Закрыт);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			МассивОтбора.Добавить(Выборка.Заказ);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивОтбора;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗависимыеРеквизитыСтрокой()
	
	Возврат "СуммаБезВозвратнойТары, СуммаНДСБезВозвратнойТары, СуммаСНДСБезВозвратнойТары,
		|СуммаРучнойСкидкиБезВозвратнойТары, СуммаАвтоматическойСкидкиБезВозвратнойТары,
		|СуммаОтмененоБезВозвратнойТары, СуммаНДСОтмененоБезВозвратнойТары, СуммаСНДСОтмененоБезВозвратнойТары,
		|СуммаРучнойСкидкиОтмененоБезВозвратнойТары, СуммаАвтоматическойСкидкиОтмененоБезВозвратнойТары,
		|СуммаОтменено, СуммаНДСОтменено, СуммаСНДСОтменено,
		|СуммаРучнойСкидкиОтменено, СуммаАвтоматическойСкидкиОтменено";
	
КонецФункции

&НаКлиенте
Процедура ПечатьСерийныхНомеров(Команда)
	
	ПроверкаВыполнена = ПроверкаЗаполненияКлючевыхПолей(Команда);
	
	Если Не ПроверкаВыполнена Тогда 
		Возврат;
	КонецЕсли;
	
	//23.06.2025           
	
	ПараметрыПоиска = Новый Структура("Отметка",Истина);
	МассивСтрок = ТаблицаЭтапов.НайтиСтроки(ПараметрыПоиска); 
	Если МассивСтрок.Количество() = 0 Тогда    
		ДанныеТекущейСтроки = Элементы.ТаблицаЭтапов.ТекущиеДанные;
		Если не ДанныеТекущейСтроки = Неопределено Тогда 
			МассивСтрок.Добавить(ДанныеТекущейСтроки);
		КонецЕсли;
		//Сообщить("Не выбраны этапы для печати серийных номеров!");
		//Возврат;
	КонецЕсли;  
	
	МассивСН = Новый Массив;
	Для Каждого Стр из МассивСтрок Цикл 
		МассивСН.Добавить(Стр.СерийныйНомер);
	КонецЦикла; 
	Если МассивСН.Количество() = 0 Тогда 
		Сообщить("Отсутствуют Серийные номера для печати штрихкода");
		Возврат
	КонецЕсли;
		
		
		
	
	СтруктураПечати = ПолучитьСтруктуруПечати(Объект.Изделие, Объект.Количество, КоличествоЭтикетокДляПечати, МассивСН, 2);
	
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Изделие);
	ИменаМакетов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ЭтикеткаТовары");	                                      
	
	//23.06.2025
	//СтруктураПечати = ПолучитьСтруктуруПечати(МассивОбъектов, Объект.Количество, КоличествоЭтикетокДляПечати, МассивЭтапов);
	//-
		
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьЭтикетокИЦенников",
		ИменаМакетов,
		МассивОбъектов,
		ЭтаФорма,
		СтруктураПечати
	);   
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	Диалог		 						= Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период 						= Новый СтандартныйПериод(Объект.НачалоПериода, Объект.ОкончаниеПериода);        
    ОписаниеОповещенияОЗакрытииФормы 	= Новый ОписаниеОповещения("ПослеВыбораПериода", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещенияОЗакрытииФормы);  
	
	
	
КонецПроцедуры 

Процедура ПослеВыбораПериода(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если не РезультатЗакрытия = Неопределено Тогда 
		Объект.НачалоПериода = РезультатЗакрытия.ДатаНачала;
		Объект.ОкончаниеПериода = РезультатЗакрытия.ДатаОкончания;
	КонецЕсли; 
	
	ОбновитьСписокРеализаций();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокРеализаций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
				   |	РеализацияТоваровУслугТовары.Ссылка.Номер КАК НомерРеализации,
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата КАК ДатаРеализации,
	               |	РеализацияТоваровУслугТовары.Назначение КАК Назначение,
	               |	РеализацияТоваровУслугТовары.Ссылка.СуммаДокумента КАК СуммаРеализации,
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
	               |	РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				   |ГДЕ РеализацияТоваровУслугТовары.Ссылка.Проведен 
				   |#УсловиеЗапроса
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	Реализации.Организация КАК Организация,
				   |	Реализации.НомерРеализации КАК НомерРеализации,
	               |	Реализации.ДатаРеализации КАК ДатаРеализации,
	               |	Реализации.Назначение КАК Назначение,
	               |	Реализации.СуммаРеализации КАК СуммаРеализации,
	               |	Реализации.Реализация КАК Реализация
	               |ИЗ
	               |	Реализации КАК Реализации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Реализации.НомерРеализации,
	               |	Реализации.ДатаРеализации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////  
				   |ВЫБРАТЬ
				   |	Реализации.Номенклатура КАК Номенклатура,
				   |	Реализации.Количество КАК Количество,
	               |	Реализации.Реализация КАК Реализация
	               |ИЗ
	               |	Реализации КАК Реализации
	               |
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////

	               |ВЫБРАТЬ
				   |	Реализации.Реализация КАК Реализация,
	               |	Реализации.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер, """") КАК СерийныйНомер
	               |ИЗ
	               |	Реализации КАК Реализации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |		ПО (Реализации.Реализация = (ВЫРАЗИТЬ(ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК Документ.РеализацияТоваровУслуг)))
	               |			И Реализации.Номенклатура = ТТМ_УчетСерийныхНомеровПродукции.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерРеализации,
	               |	ДатаРеализации,
	               |	СерийныйНомер
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК ЭтапПроизводства,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства КАК ДатаПроизводства,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокПлан КАК Запланировано,
				   |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус КАК Статус
				   |ИЗ
				   |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
				   |		ПО (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = (ВЫРАЗИТЬ(ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК Документ.ЭтапПроизводства2_2)))
				   |ГДЕ
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
				   |	И ЭтапПроизводства2_2ВыходныеИзделия.Произведено
				   |	#УсловиеОтбораЭтапов
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	СерийныйНомер"; 
	
	ТекстНачалоУсловия = Символы.пс + "Где ";
	РазделительУсловия = Символы.ПС + "И ";
	МассивУсловийРеализации = Новый Массив;
	МассивУсловийЭтапов = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		МассивУсловийРеализации.Добавить("РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)");
		МассивУсловийЭтапов.Добавить("ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Организация В(&Организация)");
		Запрос.УстановитьПараметр("Организация",Объект.Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.НачалоПериода) Тогда 
		МассивУсловийРеализации.Добавить("РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачалоПериода");
		МассивУсловийЭтапов.Добавить("ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства >= &НачалоПериода");
		Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда 
		МассивУсловийРеализации.Добавить("РеализацияТоваровУслугТовары.Ссылка.Дата <= &ОкончаниеПериода");
		МассивУсловийЭтапов.Добавить("ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства <= &ОкончаниеПериода");
		Запрос.УстановитьПараметр("ОкончаниеПериода",Объект.ОкончаниеПериода);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Изделие) Тогда 
		МассивУсловийРеализации.Добавить("РеализацияТоваровУслугТовары.Номенклатура В(&Изделие)"); 
		МассивУсловийЭтапов.Добавить("ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура В(&Изделие)");
		Запрос.УстановитьПараметр("Изделие",Объект.Изделие);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда 
		МассивУсловийРеализации.Добавить("РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента = &ЗаказКлиента");
		МассивУсловийЭтапов.Добавить("Выразить(ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ как Документ.ЗаказКлиента) = &ЗаказКлиента");
		Запрос.УстановитьПараметр("ЗаказКлиента",Объект.ЗаказКлиента);
	КонецЕсли;
	
	ТекстУсловияРеализации = "";
	Если МассивУсловийРеализации.Количество() > 0 Тогда 
		
		Для Каждого Условие из МассивУсловийРеализации Цикл 
			ТекстУсловияРеализации = ТекстУсловияРеализации + ?(ЗначениеЗаполнено(ТекстУсловияРеализации),РазделительУсловия,"") + Условие;
		КонецЦикла;                                                     
		ТекстУсловияРеализации = РазделительУсловия + ТекстУсловияРеализации;
		
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"#УсловиеЗапроса",ТекстУсловияРеализации);
	
	ТекстУсловияЭтапы = "";
	Если МассивУсловийЭтапов.Количество() > 0 Тогда 
		
		Для Каждого Условие из МассивУсловийЭтапов Цикл  
			ТекстУсловияЭтапы = ТекстУсловияЭтапы + ?(ЗначениеЗаполнено(ТекстУсловияЭтапы),РазделительУсловия,"") + Условие;
		КонецЦикла;
		ТекстУсловияЭтапы = РазделительУсловия + ТекстУсловияЭтапы;
		
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"#УсловиеОтбораЭтапов",ТекстУсловияЭтапы);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТабРеализации = МассивРезультатов[1].Выгрузить();
	ДокументыРеализации.Загрузить(ТабРеализации); 
	
	ТабТоварыРеализации = МассивРезультатов[2].Выгрузить();
	Объект.ТЧТоварыРеализации.Загрузить(ТабТоварыРеализации);
	
	ТабТоварыРеализацииСН = МассивРезультатов[3].Выгрузить();
	Объект.ТЧТоварыРеализацииССН.Загрузить(ТабТоварыРеализацииСН);
	
	ТабВыпущенныеЭтапы = МассивРезультатов[4].Выгрузить();
	Объект.ТЧВыпущенныеЭтапы.Загрузить(ТабВыпущенныеЭтапы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиАРМПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.имя = "Администрирование" Тогда   
		
		ОтборПоИзделию = ЗначениеЗаполнено(Объект.Изделие);
		ОтборПоЗаказуКлиента = ЗначениеЗаполнено(Объект.ЗаказКлиента);
		ОтборПоПериоду = ЗначениеЗаполнено(Объект.НачалоПериода) или ЗначениеЗаполнено(Объект.ОкончаниеПериода);
		Если ОтборПоИзделию или ОтборПоЗаказуКлиента или ОтборПоПериоду Тогда 
			
		Иначе 
			Объект.НачалоПериода = НачалоДня(ТекущаяДата());
			Объект.ОкончаниеПериода = КонецДня(ТекущаяДата());
		КонецЕсли;
		
		ОбновитьСписокРеализаций();
		
	ИначеЕсли ТекущаяСтраница.имя = "СтраницаРеализация" Тогда  
		
		ПолучитьСписокЗаказовДляОтгрузки1();
		
		//АдресВоВременномХранилище = ПолучитьСписокЗаказовДляОтгрузки(Истина);
		//ЗаполнитьНеотгруженныеЗаказыНаСервере(АдресВоВременномХранилище);
		//ЗаполнитьЗаказыИТоварыКОтгрузкеНаСервере(МассивТаблиц);
	КонецЕсли;   
	
	//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Данные по реализациям получены!'"));
	
	//ОбновитьИнтерфейс();
	
КонецПроцедуры                                         

//&НаСервереБезКонтекста
//Процедура ЗаполнитьЗаказыИТоварыКОтгрузкеНаСервере(МассивТаблиц);
//	
//	СписокЗаказовКРеализации.Очистить();
//	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(МассивТаблиц[0], СписокЗаказовКРеализации);
//	тчто
//	
//КонецПроцедуры

&НаКлиенте
Процедура ДокументыРеализацииПриАктивизацииСтроки(Элемент)
	
	Если ДокументыРеализации.Количество() > 0 Тогда              
		Если Элементы.ДокументыРеализации.ТекущиеДанные <> Неопределено Тогда  
			Реализация = ?(ЗначениеЗаполнено(Элементы.ДокументыРеализации.ТекущиеДанные.Реализация),
						Элементы.ДокументыРеализации.ТекущиеДанные.Реализация,
						ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка")); 
			Если ЗначениеЗаполнено(Реализация) Тогда 
				СтруктураОтбораПоРеализации = Новый Структура("Реализация",Реализация);
				ОтборПоРеализации = Новый ФиксированнаяСтруктура(СтруктураОтбораПоРеализации); 
				Если Объект.ТЧТоварыРеализации.Количество() > 0 Тогда 
					Элементы.ТЧТоварыРеализации.ОтборСтрок = ОтборПоРеализации;
				КонецЕсли;  
				
				ТекСтрокаТоварыРеализаций = Элементы.ТЧТоварыРеализации.ТекущиеДанные;
				ПерваяСтрокаТоварыРеализаций = Объект.ТЧТоварыРеализации[0].Номенклатура;
				
				ТоварРеализации = ?(ТекСтрокаТоварыРеализаций = Неопределено, ПерваяСтрокаТоварыРеализаций, ТекСтрокаТоварыРеализаций.Номенклатура);
				Номенклатура = ?(ЗначениеЗаполнено(Объект.Изделие), Объект.Изделие, ТоварРеализации);  
				Если ЗначениеЗаполнено(Номенклатура) Тогда
					СтруктураОтботаПоНоменклатуреРеализации = Новый Структура("Номенклатура, Реализация",Номенклатура, Реализация); 
					ОтборПоНоменклатуреРеализации = Новый ФиксированнаяСтруктура(СтруктураОтботаПоНоменклатуреРеализации);
					Если Объект.ТЧТоварыРеализацииССН.Количество()> 0 Тогда 
						Элементы.ТЧТоварыРеализацииССН.ОтборСтрок = ОтборПоНоменклатуреРеализации;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Изделие1ПриИзменении(Элемент)
	ОбновитьСписокРеализаций();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	Если ЭтаФорма.ТекущийЭлемент = Элемент Тогда 
		ОбновитьСписокРеализаций();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаПриИзменении(Элемент)
	Если ЭтаФорма.ТекущийЭлемент = Элемент Тогда 
		ОбновитьСписокРеализаций();
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура ГруппаСтраницЭтаповПриСменеСтраницы(Элемент, ТекущаяСтраница)
//	
//	Если Элементы.ГруппаСтраницЭтапов.ТекущаяСтраница.Имя = "СтраницаРеализация" Тогда 
//		
//		АдресВоВременномХранилище = ПолучитьСписокЗаказовДляОтгрузки(Истина);
//		ЗаполнитьНеотгруженныеЗаказыНаСервере(АдресВоВременномХранилище);
//		
//	КонецЕсли;
//	
//КонецПроцедуры    

 &НаСервере
 Процедура ЗаполнитьНеотгруженныеЗаказыНаСервере(АдресТаблицыЗаказов)
	 
	СписокЗаказовКРеализации.Очистить();
	НеотгруженныеЗаказы = ПолучитьИзВременногоХранилища(АдресТаблицыЗаказов);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НеотгруженныеЗаказы, СписокЗаказовКРеализации);	 
	 
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовКРеализацииПриАктивизацииСтроки(Элемент)
	
	//Если Элементы.СписокЗаказовКРеализации.Количество() > 0 Тогда 
		СтруктураОтбораСтрокПоЗаказу = Новый Структура();
		Если Элементы.СписокЗаказовКРеализации.ТекущиеДанные <> Неопределено Тогда 
			Назначение = Элементы.СписокЗаказовКРеализации.ТекущиеДанные.Назначение;
		Иначе 
			Назначение = ПредопределенноеЗначение("Справочник.Назначения.ПустаяСсылка");
		КонецЕсли;
		Если ЗначениеЗаполнено(Назначение) Тогда 
			СтруктураОтбораСтрокПоЗаказу.Вставить("Назначение", Назначение);
			ОтборСтрокПоЗаказу = Новый ФиксированнаяСтруктура(СтруктураОтбораСтрокПоЗаказу);
		КонецЕсли;
		Элементы.ТЧВыпущенныеТоварыЗаказов.ОтборСтрок = ОтборСтрокПоЗаказу;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыРеализацииПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТЧТоварыРеализации.ОтборСтрок.Свойство("Реализация") Тогда
		Реализация = Элементы.ТЧТоварыРеализации.ОтборСтрок.Реализация;
		Номенклатура = ?(Элемент.ТекущиеДанные <> Неопределено,Элемент.ТекущиеДанные.Номенклатура,ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		СтруктураОтбораСН = Новый Структура();
		Если ЗначениеЗаполнено(Реализация) Тогда 
			СтруктураОтбораСН.Вставить("Реализация", Реализация);
		КонецЕсли;
		Если ЗначениеЗаполнено(Номенклатура) Тогда 
			СтруктураОтбораСН.Вставить("Номенклатура",Номенклатура);
		КонецЕсли;
		СтруктураОтбора = Новый ФиксированнаяСтруктура(СтруктураОтбораСН);
		Элементы.ТЧТоварыРеализацииССН.ОтборСтрок = СтруктураОтбора;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Организация1ПриИзменении(Элемент)
	ОбновитьСписокРеализаций();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыРеализацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда 
		ТекДок = Элемент.ТекущиеДанные.Реализация;  
		Если ЗначениеЗаполнено(ТекДок) Тогда                            
			//ПараметрыОткрытия = Новый Структура("Клдюч",ТекДок);
			//ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта",ПараметрыОткрытия,ЭтаФорма);
			ПоказатьЗначение(,ТекДок);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧВыпущенныеТоварыЗаказовОтметкаПриИзменении(Элемент)
	
	ТекСтрокаВыпущенныеТовары = Элемент.Родитель.ТекущиеДанные;
	Если ТекСтрокаВыпущенныеТовары <> Неопределено Тогда 
		Если Элемент.Родитель.ТекущиеДанные.Отметка = Ложь Тогда      
			ДопПараметры = Новый Структура("ТекСтрока",ТекСтрокаВыпущенныеТовары);
			ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаОтменитьВыпуск", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(ОповещениеПослеВопроса,"Отменить выпуск по продукции " + ТекСтрокаВыпущенныеТовары.Номенклатура, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	Иначе 
		//проверить будет ли сюда попадать
		Сообщить("Не удалось определить текущую строку");
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура ПослеВопросаОтменитьВыпуск(Результат, ДопПараметры) Экспорт
	
	Если ДопПараметры.Свойство("ТекСтрока") Тогда
		ТекСтрока = ДопПараметры.ТекСтрока;
	КонецЕсли;
	Если Результат = КодВозвратаДиалога.Нет Тогда     
		ТекСтрока.Отметка = Истина; 
		Возврат;
	КонецЕсли;  
	//отменитьВыпуск по изделию, обновить данные на форме      
	
	СтруктураДанныхСтроки = Новый Структура("Номенклатура, Назначение, Серийныйномер", ТекСтрока.Номенклатура, ТекСтрока.Назначение, Текстрока.СерийныйНомер);
	ВыполнитьОтменуВыпускаНаСервере(ТекСтрока.Номенклатура, ТекСтрока.Назначение, ТекСтрока.СерийныйНомер, Истина);
	//
	ПолучитьСписокЗаказовДляОтгрузки1();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОтменуВыпускаНаСервере(Номенклатура, Назначение, СерийныйНомер = "", УчетСерийныхНомеров = Истина)
	
	УчетСерийныхНомеров = ТТМ_СерийныйУчет.ПроверитьУстановитьУчетСерийныхНомеров(Номенклатура, Ложь); 
	
	НазначениеЗаполнено = ЗначениеЗаполнено(Назначение);
	НоменклатураЗаполнена = ЗначениеЗаполнено(Номенклатура);
	СерийныйНомерЗаполнен = ЗначениеЗаполнено(СерийныйНомер);
	
	Если не НазначениеЗаполнено 
		или не НоменклатураЗаполнена
		или (УчетСерийныхНомеров и не СерийныйНомерЗаполнен) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные для отмены выпуска не определены!!!",Объект.ТЧВыпущенныеТоварыЗаказов,,);
			Возврат;
	КонецЕсли;
	
	ДокументыДляОтмены = ПолучитьДокументыДляОтменыВыпуска(УчетСерийныхНомеров, Номенклатура, Назначение, СерийныйНомер);
	ДокЭтап = ДокументыДляОтмены.ДокЭтап.ПолучитьОбъект();
	ДокПередачаПродукции = ДокументыДляОтмены.ДокПередачаПродукции.ПолучитьОбъект();
	
	//28.04.2026 ********************
		
		НачатьТранзакцию();
		
		//Отменяем ПередачуПродукции
		Попытка                          
			//ДокПередачаПродукции = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
			//ДокПередачаПродукции.ПометкаУдаления = Истина;
			ДокПередачаПродукции.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Сообщить("Отменили документ передачи товаров");
		Исключение
			Сообщить("Не удалось отменить проведение документа передача товаров" + ДокПередачаПродукции.Ссылка);
			Пока ТранзакцияАктивна() Цикл 
				ОтменитьТранзакцию(); 
			КонецЦикла;
		КонецПопытки;
		
		//Отменяем выпуск в этапе          
		//ДокЭтап = Документы.ЭтапПроизводства2_2.СоздатьДокумент();
		ТабТовары = ДокЭтап.ВыходныеИзделия;
		Для Каждого стр из ТабТовары Цикл 
			стр.Произведено = Ложь;               
			//*****************************************************************
			СтруктураДействий = Новый Структура;
			
			ПараметрыУказанияСерий = Документы.ЭтапПроизводства2_2.ПараметрыУказанияСерий(ДокЭтап);
			
			ИмяТЧ = "ВыходныеИзделия";
			ПараметрыПроверкиСерий = Новый Структура;
			ПараметрыПроверкиСерий.Вставить("Склад", стр.Получатель);
			ПараметрыПроверкиСерий.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий[ИмяТЧ]);
			СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", ПараметрыПроверкиСерий);
			
			Если ДокЭтап.ПроизводствоОднойДатой Тогда
				ПараметрыДействия = УправлениеПроизводствомКлиентСервер.ПараметрыДействияЗаполнитьДатуПроизводства(
					ДокЭтап.ДатаПроизводства,
					ДокЭтап.ДатаПроизводства);
				СтруктураДействий.Вставить("ЗаполнитьДатуПроизводства", ПараметрыДействия);
			КонецЕсли;
			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стр, СтруктураДействий, Неопределено);
			//*********************************************************************
		КонецЦикла; 
		Попытка   
			ДокЭтап.КоличествоУпаковокФакт = 0.4;
			ДокЭтап.Записать(РежимЗаписиДокумента.Запись);
			ЗафиксироватьТранзакцию();
			Сообщить("Отменили производство единицы продукции!");
		Исключение
			Сообщить("Не удалось отменить выпуск в Этапе" + ДокЭтап.Ссылка);
			Пока ТранзакцияАктивна() Цикл  
				ОтменитьТранзакцию();
			КонецЦикла;
		КонецПопытки;
		
		//Отменяем выпуск в регистре Учет серийных номеров происходит автоматически при отмене проведения этапа
			
КонецПроцедуры
#КонецОбласти

&НаСервере
Функция ПолучитьДокументыДляОтменыВыпуска(УчетСерийныхНомеров, Номенклатура, Назначение, СерийныйНомер = "");
	
	ДокументыДляОтменыВыпуска = Новый Структура("ДокЭтап, ДокПередачаПродукции");
	
	Если УчетСерийныхНомеров Тогда              
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
		               |ГДЕ
		               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = &Номенклатура
		               |	И ТТМ_УчетСерийныхНомеровПродукции.Назначение = &Назначение
		               |	И ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = &СерийныйНомер
		               |	И ТТМ_УчетСерийныхНомеровПродукции.Произведено
		               |	И НЕ ТТМ_УчетСерийныхНомеровПродукции.Реализовано
		               |	И ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ДвижениеПродукцииИМатериаловТовары.Ссылка КАК Ссылка
		               |ИЗ
		               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		               |		ПО ТТМ_УчетСерийныхНомеровПродукции.Регистратор = ДвижениеПродукцииИМатериаловТовары.Ссылка.Распоряжение
		               |ГДЕ
		               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = &Номенклатура
		               |	И ТТМ_УчетСерийныхНомеровПродукции.Назначение = &Назначение
		               |	И ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер = &СерийныйНомер
		               |	И ТТМ_УчетСерийныхНомеровПродукции.Произведено
		               |	И НЕ ТТМ_УчетСерийныхНомеровПродукции.Реализовано
		               |	И ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
		               |	И ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен
		               |	И ДвижениеПродукцииИМатериаловТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства)";
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Назначение",Назначение);
		Запрос.УстановитьПараметр("СерийныйНомер",СерийныйНомер);
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		ЭтапПроизводства = МассивРезультатов[0].Выгрузить();
		Если ЭтапПроизводства.Количество() <> 1 Тогда 
			Сообщить("не удалось однозначно определить этап производства!");
		КонецЕсли;
		ДокументыДляОтменыВыпуска.ДокЭтап = ЭтапПроизводства[0].Регистратор;              
		
		ПередачаПродукции = МассивРезультатов[1].Выгрузить(); 
		Если ПередачаПродукции.Количество() <> 1 Тогда 
			Сообщить("не удалось однозначно определить документ передачи продукции!");
		КонецЕсли;
		ДокументыДляОтменыВыпуска.ДокПередачаПродукции = ПередачаПродукции[0].Ссылка;
		
	Иначе 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДвижениеПродукцииИМатериаловТовары.Ссылка КАК Ссылка,
		               |	ДвижениеПродукцииИМатериаловТовары.Ссылка.Распоряжение КАК Распоряжение
		               |ИЗ
		               |	Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
		               |ГДЕ
		               |	ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен
		               |	И ДвижениеПродукцииИМатериаловТовары.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства)
		               |	И ДвижениеПродукцииИМатериаловТовары.Назначение = &Назначение
		               |	И ДвижениеПродукцииИМатериаловТовары.Номенклатура = &Номенклатура
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ДвижениеПродукцииИМатериаловТовары.Ссылка.Дата УБЫВ";
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Назначение", Назначение);
		ТабДокуентыПередачи = Запрос.Выполнить().Выгрузить();
		Если ТабДокуентыПередачи.Количество() <> 1 Тогда 
			Сообщить("не удалось однозначно определить документ передачи продукции!");
		КонецЕсли;
		ДокументыДляОтменыВыпуска.ДокПередачаПродукции = ТабДокуентыПередачи[0].Ссылка;
		ДокументыДляОтменыВыпуска.ДокЭтап = ТабДокуентыПередачи[0].Распоряжение;
		
	КонецЕсли;             
	
	Возврат ДокументыДляОтменыВыпуска;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////  
#Область ТЧОстаткиСерий 
&НаКлиенте
Процедура ОтгрузкаВыбранныхСерийСХранения(Команда) //////////////////////////////// Команда, вызывает диалог подтверждения и собирает помеченные строки в массив структур

	Если ТЧОстаткиСерий = Неопределено Тогда
		Сообщить("Нет данных для отгрузки."); 
		Возврат;
	КонецЕсли;

	// Соберём выбранные строки
	Выбранные = Новый Массив;
	Для Каждого Стр Из ТЧОстаткиСерий Цикл
		Если Стр.Отметка Тогда
			Кол = ?(ЗначениеЗаполнено(Стр.Количество) И Стр.Количество > 0, Стр.Количество, 1);
			Выбранные.Добавить(Новый Структура(
				"Номенклатура,Характеристика,СерийныйНомер,Количество,ДокументРегистратор,Назначение,Склад,ТипСтроки",
				Стр.Номенклатура, Стр.Характеристика, Стр.СерийныйНомер, Кол, Стр.Ссылка, Стр.Назначение, Стр.Склад, Стр.ТипСтроки));
		КонецЕсли;
	КонецЦикла;

	Если Выбранные.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одной строки.");
		Возврат;
	КонецЕсли;

	// Подтверждение (немодально) - Параметр передаём 3-м аргументом конструктора
	ТекстВопроса = "Сформировать отгрузку по выбранным товарам?";
	Оповещение = Новый ОписаниеОповещения("Отгрузка_ПослеПодтверждения", ЭтотОбъект, Выбранные);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, "Подтверждение");

КонецПроцедуры


&НаКлиенте
Процедура Отгрузка_ПослеПодтверждения(Результат, Параметр) Экспорт //////////////// Обработка выборка диалога. В зависимости от выбора либо генерация документа либо сообщение
	
	// "Параметр" - это тот самый массив "Выбранные", переданный в ОписаниеОповещения

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Сообщить("Операция отменена пользователем.");
		Возврат;
	КонецЕсли;

	Если Параметр = Неопределено Тогда
		Сообщить("Не удалось получить выбранные строки.");
		Возврат;
	КонецЕсли;

	Выбранные = Параметр;

	// Сервер создаст непроведенный документ отгрузки
	Попытка
		СозданныеДокументы = СоздатьИПровестиОтгрузкуСХраненияСервер(Выбранные);
	Исключение
		Сообщить("Ошибка при создании отгрузки: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	Если СозданныеДокументы = Неопределено Или СозданныеДокументы.Количество() = 0 Тогда
		Сообщить("Документы отгрузки не были созданы.");
		Возврат;
	КонецЕсли;

	// соберём номера документов
	Номера = Новый Массив;
	Для Каждого ДокСсылка Из СозданныеДокументы Цикл
		Ном = "";
		Попытка
			Ном = ДокСсылка.Номер;
		Исключение
			Ном = Строка(ДокСсылка);
		КонецПопытки;
		Если ПустаяСтрока(Ном) Тогда Ном = Строка(ДокСсылка); КонецЕсли;
		Номера.Добавить(Ном);
	КонецЦикла;

	М = Новый СообщениеПользователю;
	М.Текст = "Создан документ отгрузки: № " + СтрСоединить(Номера, ", № ");
	М.Сообщить();

	Попытка
		ПараметрыОткрытия = Новый Структура("Ключ", СозданныеДокументы[0]);
		ОткрытьФорму("Документ.ОтгрузкаТоваровСХранения.ФормаДокумента", ПараметрыОткрытия, ЭтаФорма);
	Исключение
		ОписаниеОшибкиОткрытия = ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументыОтгрузкиСХранения(Команда)
	
	ОткрытьФорму("Документ.ОтгрузкаТоваровСХранения.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриСозданииНаКлиенте(Отказ) ///////////////////////////////////////////// Микропроверка чтобы гарантировать нужные колонки
    // Реквизит ТЧ гарантированно существует (мы добавили его на форме)
	// Но подстрахуем колонки, если реквизит пустой
    Если ТЧОстаткиСерий = Неопределено Тогда
        // динамический конструктор, чтобы тонкий клиент не ругался
        Попытка
            ТЧОстаткиСерий = Новый("ТаблицаЗначений");
        Исключение
            ТЧОстаткиСерий = Новый("ValueTable");
        КонецПопытки;
    КонецЕсли;

    // Колонки
    Если ТЧОстаткиСерий.Колонки.Найти("Номенклатура") = Неопределено Тогда ТЧОстаткиСерий.Колонки.Добавить("Номенклатура"); КонецЕсли;
    Если ТЧОстаткиСерий.Колонки.Найти("СерийныйНомер") = Неопределено Тогда ТЧОстаткиСерий.Колонки.Добавить("СерийныйНомер"); КонецЕсли;
    Если ТЧОстаткиСерий.Колонки.Найти("Количество") = Неопределено Тогда ТЧОстаткиСерий.Колонки.Добавить("Количество"); КонецЕсли;
    Если ТЧОстаткиСерий.Колонки.Найти("Назначение") = Неопределено Тогда ТЧОстаткиСерий.Колонки.Добавить("Назначение"); КонецЕсли;
    Если ТЧОстаткиСерий.Колонки.Найти("Склад") = Неопределено Тогда ТЧОстаткиСерий.Колонки.Добавить("Склад"); КонецЕсли;
    Если ТЧОстаткиСерий.Колонки.Найти("Характеристика") = Неопределено Тогда ТЧОстаткиСерий.Колонки.Добавить("Характеристика"); КонецЕсли;
    Если ТЧОстаткиСерий.Колонки.Найти("ТипСтроки") = Неопределено Тогда ТЧОстаткиСерий.Колонки.Добавить("ТипСтроки"); КонецЕсли;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьСерииНаОстаткеМС(НаДату = Неопределено) // Получение актуальных данных по остаткам серий номенклатуры на дату

	Если НаДату = Неопределено Тогда НаДату = ТекущаяДатаСеанса(); КонецЕсли;

    ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |    Рег.Регистратор           КАК ДокументРегистратор,
    |    Ост.Склад                 КАК Склад,
    |    Ост.Номенклатура          КАК Номенклатура,
    |    Ост.Назначение            КАК Назначение,
    |    Ост.СерийныйНомер         КАК СерийныйНомер,
    |    Ост.КоличествоОстаток     КАК Количество
    |ИЗ
    |    РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.Остатки(&НаДату) КАК Ост
    |        ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК Рег
    |        ПО Рег.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |           И Рег.Регистратор ССЫЛКА Документ.ПриемкаТоваровНаХранение
    |           И Рег.Склад = Ост.Склад
    |           И Рег.Номенклатура = Ост.Номенклатура
    |           И Рег.Назначение = Ост.Назначение
    |           И Рег.СерийныйНомер = Ост.СерийныйНомер
    |ГДЕ
    |    Ост.КоличествоОстаток > 0
    |УПОРЯДОЧИТЬ ПО
    |    Ост.Номенклатура, Ост.СерийныйНомер";

    Запрос = Новый Запрос(ТекстЗапроса);
    Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));

    ТЗ = Запрос.Выполнить().Выгрузить();

    // конвертируем в массив структур (XDTO-safe)
    Рез = Новый Массив;
	Для Каждого Р Из ТЗ Цикл
        Рез.Добавить(Новый Структура(
            "Ссылка,Номенклатура,Характеристика,СерийныйНомер,Количество,Назначение,Склад,ТипСтроки",
            Р.ДокументРегистратор, Р.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Р.СерийныйНомер, Р.Количество, Р.Назначение, Р.Склад, "Серия"));
    КонецЦикла;

	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОстаткиОбычныхТоваровСХранения()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемкаТовары.Ссылка КАК Регистратор,
	|	ПриемкаТовары.Склад КАК Склад,
	|	ПриемкаТовары.Номенклатура КАК Номенклатура,
	|	ПриемкаТовары.Характеристика КАК Характеристика,
	|	ПриемкаТовары.Назначение КАК Назначение,
	|	СУММА(ПриемкаТовары.Количество) - ЕСТЬNULL(Отгрузки.Количество, 0) КАК Количество
	|ИЗ
	|	Документ.ПриемкаТоваровНаХранение.Товары КАК ПриемкаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОтгрузкаТовары.ДокументПоступления КАК ДокументПоступления,
	|			ОтгрузкаТовары.Склад КАК Склад,
	|			ОтгрузкаТовары.Номенклатура КАК Номенклатура,
	|			ОтгрузкаТовары.Характеристика КАК Характеристика,
	|			ОтгрузкаТовары.Назначение КАК Назначение,
	|			СУММА(ОтгрузкаТовары.Количество) КАК Количество
	|		ИЗ
	|			Документ.ОтгрузкаТоваровСХранения.Товары КАК ОтгрузкаТовары
	|		ГДЕ
	|			НЕ ОтгрузкаТовары.Ссылка.ПометкаУдаления
	|			И ОтгрузкаТовары.ДокументПоступления <> ЗНАЧЕНИЕ(Документ.ПриемкаТоваровНаХранение.ПустаяСсылка)
	|			И СОКРЛП(ОтгрузкаТовары.СерийныйНомер) = """"
	|		СГРУППИРОВАТЬ ПО
	|			ОтгрузкаТовары.ДокументПоступления,
	|			ОтгрузкаТовары.Склад,
	|			ОтгрузкаТовары.Номенклатура,
	|			ОтгрузкаТовары.Характеристика,
	|			ОтгрузкаТовары.Назначение) КАК Отгрузки
	|		ПО ПриемкаТовары.Ссылка = Отгрузки.ДокументПоступления
	|			И ПриемкаТовары.Склад = Отгрузки.Склад
	|			И ПриемкаТовары.Номенклатура = Отгрузки.Номенклатура
	|			И ПриемкаТовары.Характеристика = Отгрузки.Характеристика
	|			И ПриемкаТовары.Назначение = Отгрузки.Назначение
	|ГДЕ
	|	ПриемкаТовары.Ссылка.Проведен
	|	И НЕ ПриемкаТовары.Ссылка.ПометкаУдаления
	|	И ПриемкаТовары.Количество > 0
	|	И ЕСТЬNULL(ПриемкаТовары.Номенклатура.ВидНоменклатуры.ИспользоватьСерии, ЛОЖЬ) = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	ПриемкаТовары.Ссылка,
	|	ПриемкаТовары.Склад,
	|	ПриемкаТовары.Номенклатура,
	|	ПриемкаТовары.Характеристика,
	|	ПриемкаТовары.Назначение,
	|	Отгрузки.Количество
	|ИМЕЮЩИЕ
	|	СУММА(ПриемкаТовары.Количество) - ЕСТЬNULL(Отгрузки.Количество, 0) > 0
	|УПОРЯДОЧИТЬ ПО
	|	ПриемкаТовары.Номенклатура,
	|	ПриемкаТовары.Характеристика,
	|	ПриемкаТовары.Ссылка";

	ТЗ = Запрос.Выполнить().Выгрузить();
	Рез = Новый Массив;
	Для Каждого СтрокаРезультата Из ТЗ Цикл
		Рез.Добавить(Новый Структура(
			"Ссылка,Склад,Номенклатура,Характеристика,Назначение,СерийныйНомер,Количество,ТипСтроки",
			СтрокаРезультата.Регистратор,
			СтрокаРезультата.Склад,
			СтрокаРезультата.Номенклатура,
			СтрокаРезультата.Характеристика,
			СтрокаРезультата.Назначение,
			"",
			СтрокаРезультата.Количество,
			"Товар"));
	КонецЦикла;

	Возврат Рез;
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧОстаткиСерий(ДанныеСерий)
	ТЧОстаткиСерий.Очистить();

	Для Каждого Р Из ДанныеСерий Цикл
		Стр = ТЧОстаткиСерий.Добавить();
		Стр.Ссылка = Р.Ссылка;
		Попытка
			Стр.Склад = Р.Склад;
		Исключение
			ОписаниеОшибкиСкладаТЧ = ОписаниеОшибки();
		КонецПопытки;
		Стр.Номенклатура = Р.Номенклатура;
		Попытка
			Стр.Характеристика = Р.Характеристика;
		Исключение
			ОписаниеОшибкиХарактеристикиТЧ = ОписаниеОшибки();
		КонецПопытки;
		Попытка
			Стр.Назначение = Р.Назначение;
		Исключение
			ОписаниеОшибкиНазначенияТЧ = ОписаниеОшибки();
		КонецПопытки;
		Стр.СерийныйНомер = Р.СерийныйНомер;
		Стр.Количество = Р.Количество;
		Стр.ТипСтроки = Р.ТипСтроки;
	КонецЦикла;

	Попытка
		Эл = ЭтаФорма.ЭлементыФормы.Найти("ТЧОстаткиСерий");
		Если Эл <> Неопределено Тогда
			Эл.Обновить();
		КонецЕсли;
	Исключение
		ОписаниеОшибкиОбновленияТЧОстатков = ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры


&НаСервере
Процедура ОбновитьОстаткиСерий() /////////////////////////////////////////////////// Просто обновление таблиичной части аКа "F5"
	
	ДанныеМС = ПолучитьСерииНаОстаткеМС(ТекущаяДатаСеанса());
	ОбычныеТовары = ПолучитьОстаткиОбычныхТоваровСХранения();
	Для Каждого СтрокаОбычногоТовара Из ОбычныеТовары Цикл
		ДанныеМС.Добавить(СтрокаОбычногоТовара);
	КонецЦикла;
	ЗаполнитьТЧОстаткиСерий(ДанныеМС);
		
КонецПроцедуры


&НаКлиенте
Процедура ВыделитьВсе(Команда) ///////////////////////////////////////////////////// Поставить истина на всех строках в ТЧОстаткиСерий
	
	Если ТЧОстаткиСерий = Неопределено Тогда Возврат; КонецЕсли;

	// самый быстрый способ - метод ТаблицаЗначений.ЗаполнитьЗначения
	// (заполняет указанной константой только заданную колонку)
	Попытка
		// работает и с именем колонки, и с объектом колонки
		ТЧОстаткиСерий.ЗаполнитьЗначения(Истина, "Отметка");
	Исключение
		// запасной вариант - просто цикл по строкам
		Для Каждого Стр Из ТЧОстаткиСерий Цикл
			Стр.Отметка = Истина;
		КонецЦикла;
	КонецПопытки;

	// обновим визуальный элемент (если он есть на форме)
	Попытка
		Эл = ЭтаФорма.ЭлементыФормы.Найти("ТЧОстаткиСерий");
		Если Эл <> Неопределено Тогда Эл.Обновить(); КонецЕсли;
	Исключение
		ОписаниеОшибкиОбновленияВыделения = ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры


&НаКлиенте
Процедура СнятьВыделение(Команда) ////////////////////////////////////////////////// Обратное действие к выделению

	Попытка
		ТЧОстаткиСерий.ЗаполнитьЗначения(Ложь, "Отметка");
	Исключение
		Для Каждого Стр Из ТЧОстаткиСерий Цикл
			Стр.Отметка = Ложь;
		КонецЦикла;
	КонецПопытки;

	Попытка
		Эл = ЭтаФорма.ЭлементыФормы.Найти("ТЧОстаткиСерий");
		Если Эл <> Неопределено Тогда Эл.Обновить(); КонецЕсли;
	Исключение
		ОписаниеОшибкиСнятияВыделения = ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры


&НаКлиенте
ПРоцедура ОбновитьОстаткиТоварыНаХранении(Команда) ///////////////////////////////// Обновление таблицы по кнопочке
	ОбновитьОстаткиСерий();
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьУпаковкуНоменклатуры(Ном) ////////////////////////////////// Получение "ШТ" 
	Если Ном = Неопределено Тогда Возврат Неопределено; КонецЕсли;

	// ERP может хранить упаковку по-разному - пробуем несколько вариантов
	// приоритет: упаковка (каталог УпаковкиЕдиницыИзмерения), базовая единица, единица хранения
	Попытка
		Если ЗначениеЗаполнено(Ном.ЕдиницаИзмерения) Тогда
			Возврат Ном.ЕдиницаИзмерения; // подойдет, если в ТЧ стоит реквизит Упаковка
		КонецЕсли;
	Исключение
		ОписаниеОшибкиУпаковкиНоменклатуры = ОписаниеОшибки();
	КонецПопытки;

	Возврат Неопределено;
КонецФункции

&НаСервереБезКонтекста
Функция КлючСтрокиХранения(ДокументПоступления, Номенклатура, Характеристика, Назначение)
	Возврат Строка(ДокументПоступления) + "|" + Строка(Номенклатура) + "|" + Строка(Характеристика) + "|" + Строка(Назначение);
КонецФункции

&НаСервереБезКонтекста
Функция КлючСтрокиХраненияБезРазрезов(ДокументПоступления, Номенклатура)
	Возврат Строка(ДокументПоступления) + "|" + Строка(Номенклатура);
КонецФункции


&НаСервереБезКонтекста
Процедура ЗаписатьРасходСерийВРегистр(ДокСсылка, ДокОбъект, Строки) //////// Запись расхода в регистр "ТТМ_УчетСерийныхНомеровПродукции"

	// 0) удалим предыдущие движения этого регистратора (повторное проведение и т.п.)
	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	НЗ.Отбор.Регистратор.Установить(ДокСсылка);
	НЗ.Прочитать(); НЗ.Очистить(); НЗ.Записать(Истина);

	// 1) подготовим ТЗ под загрузку
	// 1) подготовим ТЗ под загрузку
	ТЗ = Новый ТаблицаЗначений;
	
	Колонки = Новый Массив;
	Колонки.Добавить("Склад");
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Назначение");
	Колонки.Добавить("СерийныйНомер");
	Колонки.Добавить("ШильдЗаказан");
	Колонки.Добавить("Произведено");
	Колонки.Добавить("ДатаПроизводства");
	Колонки.Добавить("ДокументРеализации");
	Колонки.Добавить("Реализовано");
	Колонки.Добавить("Количество");
	
	Для Каждого ИмяКолонки Из Колонки Цикл
		ТЗ.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;

	СкладОтгр = Неопределено;
	СкладОтгр = ДокОбъект.Склад;

	Для Каждого Э Из Строки Цикл
		Новая = ТЗ.Добавить();
		Новая.Склад              = СкладОтгр;
		Новая.Номенклатура       = Э.Номенклатура;
		Новая.Назначение         = Справочники.Назначения.ПустаяСсылка(); // если не ведете назначение
		Новая.СерийныйНомер      = Э.СерийныйНомер; // уже в «реестровом» формате с дефисами
		Новая.ШильдЗаказан       = Ложь;
		Новая.Произведено        = Ложь;
		Новая.ДатаПроизводства   = Неопределено;
		Новая.ДокументРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		Новая.Реализовано        = Ложь;
		Новая.Количество         = 1; // один серийный экземпляр
	КонецЦикла;

	// 2) набор записей РН
	Набор = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Значение = ДокСсылка;
	Набор.Загрузить(ТЗ);

	Для Каждого Зап Из Набор Цикл
		Зап.Период       = ТекущаяДатаСеанса();
		Зап.ВидДвижения  = ВидДвиженияНакопления.Расход;
		Зап.Регистратор  = ДокСсылка;
	КонецЦикла;

	Набор.Записать(Истина);

КонецПроцедуры


&НаСервереБезКонтекста
Функция СоздатьИПровестиОтгрузкуСХраненияСервер(ВыбранныеМС) /////////////// Создание непроведенного "ОтгрузкаТоваровСХранения"
	
	Созданные = Новый Массив;
	Если ВыбранныеМС = Неопределено Или ВыбранныеМС.Количество() = 0 Тогда
		Возврат Созданные;
	КонецЕсли;

	ГруппыДокументов = Новый Соответствие;
	Для Каждого Э Из ВыбранныеМС Цикл
		ДокументПриемкиСтроки = Э.ДокументРегистратор;

		Если Не ЗначениеЗаполнено(ДокументПриемкиСтроки) Тогда
			ВызватьИсключение "Не удалось определить документ приемки по отмеченной строке.";
		КонецЕсли;

		СтрокиДокумента = ГруппыДокументов.Получить(ДокументПриемкиСтроки);
		Если СтрокиДокумента = Неопределено Тогда
			СтрокиДокумента = Новый Массив;
			ГруппыДокументов.Вставить(ДокументПриемкиСтроки, СтрокиДокумента);
		КонецЕсли;
		СтрокиДокумента.Добавить(Э);
	КонецЦикла;

	Для Каждого ПараДокумента Из ГруппыДокументов Цикл
		ДокументПриемкиСтроки = ПараДокумента.Ключ;
		СтрокиДокумента = ПараДокумента.Значение;

		ЦенаПоСтрокеПриемки = Новый Соответствие;
		КэшПриемок = Новый Соответствие;
		ПерваяПриемка = Неопределено;

		Для Каждого Э Из СтрокиДокумента Цикл
			Если Не ЗначениеЗаполнено(Э.ДокументРегистратор) Тогда
				Продолжить;
			КонецЕсли;

			Если ПерваяПриемка = Неопределено Тогда
				ПерваяПриемка = Э.ДокументРегистратор;
			КонецЕсли;

			Если КэшПриемок.Получить(Э.ДокументРегистратор) = Неопределено Тогда
				Попытка
					КэшПриемок.Вставить(Э.ДокументРегистратор, Э.ДокументРегистратор.ПолучитьОбъект());
				Исключение
					КэшПриемок.Вставить(Э.ДокументРегистратор, Неопределено);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;

		Для Каждого ПараПриемки Из КэшПриемок Цикл
			ОбъектПриемки = ПараПриемки.Значение;
			Если ОбъектПриемки = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Для Каждого СтрОсн Из ОбъектПриемки.Товары Цикл
				КлючЦены = КлючСтрокиХранения(ПараПриемки.Ключ, СтрОсн.Номенклатура, СтрОсн.Характеристика, СтрОсн.Назначение);
				Если ЦенаПоСтрокеПриемки.Получить(КлючЦены) = Неопределено Тогда
					ЦенаПоСтрокеПриемки.Вставить(КлючЦены, Новый Структура("Цена,НоменклатураПартнера", СтрОсн.Цена, СтрОсн.НоменклатураПартнера));
				КонецЕсли;
				КлючЦеныБезРазрезов = КлючСтрокиХраненияБезРазрезов(ПараПриемки.Ключ, СтрОсн.Номенклатура);
				Если ЦенаПоСтрокеПриемки.Получить(КлючЦеныБезРазрезов) = Неопределено Тогда
					ЦенаПоСтрокеПриемки.Вставить(КлючЦеныБезРазрезов, Новый Структура("Цена,НоменклатураПартнера", СтрОсн.Цена, СтрОсн.НоменклатураПартнера));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

		СозданнаяСсылка = Неопределено;
		НачатьТранзакцию();
		Попытка
			Док = Документы.ОтгрузкаТоваровСХранения.СоздатьДокумент();

			Попытка
				Док.Заполнить(ДокументПриемкиСтроки);
			Исключение
				ОписаниеОшибкиЗаполнения = ОписаниеОшибки();
			КонецПопытки;

			Попытка
				Док.Основание = ДокументПриемкиСтроки;
			Исключение
				ОписаниеОшибкиОснования = ОписаниеОшибки();
			КонецПопытки;

			Если ЗначениеЗаполнено(ПерваяПриемка) Тогда
				ОбъектПервойПриемки = КэшПриемок.Получить(ПерваяПриемка);
				Если ОбъектПервойПриемки <> Неопределено Тогда
					Попытка
						Если Не ЗначениеЗаполнено(Док.Организация) Тогда
							Док.Организация = ОбъектПервойПриемки.Организация;
						КонецЕсли;
					Исключение
						ОписаниеОшибкиОрганизации = ОписаниеОшибки();
					КонецПопытки;
					Попытка
						Если Не ЗначениеЗаполнено(Док.Склад) Тогда
							Док.Склад = ОбъектПервойПриемки.Склад;
						КонецЕсли;
					Исключение
						ОписаниеОшибкиСклада = ОписаниеОшибки();
					КонецПопытки;
					Попытка
						Если Не ЗначениеЗаполнено(Док.Партнер) Тогда
							Док.Партнер = ОбъектПервойПриемки.Партнер;
						КонецЕсли;
					Исключение
						ОписаниеОшибкиПартнера = ОписаниеОшибки();
					КонецПопытки;
					Попытка
						Если Не ЗначениеЗаполнено(Док.Договор) Тогда
							Док.Договор = ОбъектПервойПриемки.Договор;
						КонецЕсли;
					Исключение
						ОписаниеОшибкиДоговора = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;

			Попытка
				Док.Товары.Очистить();
			Исключение
				ОписаниеОшибкиОчистки = ОписаниеОшибки();
			КонецПопытки;

			Для Каждого Э Из СтрокиДокумента Цикл
				СтрДок = Док.Товары.Добавить();
				СтрДок.Номенклатура = Э.Номенклатура;
				Попытка
					СтрДок.Характеристика = Э.Характеристика;
				Исключение
					ОписаниеОшибкиСтрокиХарактеристики = ОписаниеОшибки();
				КонецПопытки;

				Попытка
					СтрДок.Назначение = Э.Назначение;
				Исключение
					ОписаниеОшибкиНазначения = ОписаниеОшибки();
				КонецПопытки;

				Попытка
					СтрДок.Склад = Э.Склад;
				Исключение
					ОписаниеОшибкиСтрокиСклад = ОписаниеОшибки();
				КонецПопытки;

				Попытка
					ЗаказКлиентаСтроки = Э.Назначение.Заказ;
				Исключение
					ЗаказКлиентаСтроки = Неопределено;
				КонецПопытки;
				Если ЗначениеЗаполнено(ЗаказКлиентаСтроки) Тогда
					Попытка
						СтрДок.ЗаказКлиента = ЗаказКлиентаСтроки;
					Исключение
						ОписаниеОшибкиСтрокиЗаказа = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;

				Упаковка = ПолучитьУпаковкуНоменклатуры(Э.Номенклатура);
				Если ЗначениеЗаполнено(Упаковка) Тогда
					Попытка
						СтрДок.Упаковка = Упаковка;
					Исключение
						ОписаниеОшибкиУпаковки = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;

				Кол = ?(ЗначениеЗаполнено(Э.Количество) И Э.Количество > 0, Э.Количество, 1);
				Попытка
					СтрДок.КоличествоУпаковок = Кол;
				Исключение
					ОписаниеОшибкиКоличестваУпаковок = ОписаниеОшибки();
				КонецПопытки;

				Попытка
					СтрДок.Количество = Кол;
				Исключение
					ОписаниеОшибкиКоличества = ОписаниеОшибки();
				КонецПопытки;

				КлючЦены = КлючСтрокиХранения(Э.ДокументРегистратор, Э.Номенклатура, Э.Характеристика, Э.Назначение);
				СтрЦены = ЦенаПоСтрокеПриемки.Получить(КлючЦены);
				Если СтрЦены = Неопределено Тогда
					СтрЦены = ЦенаПоСтрокеПриемки.Получить(КлючСтрокиХраненияБезРазрезов(Э.ДокументРегистратор, Э.Номенклатура));
				КонецЕсли;
				Если СтрЦены <> Неопределено Тогда
					Попытка
						СтрДок.Цена = СтрЦены.Цена;
					Исключение
						ОписаниеОшибкиЦены = ОписаниеОшибки();
					КонецПопытки;

					Попытка
						СтрДок.Сумма = СтрЦены.Цена * Кол;
					Исключение
						ОписаниеОшибкиСуммы = ОписаниеОшибки();
					КонецПопытки;

					Попытка
						СтрДок.НоменклатураПартнера = СтрЦены.НоменклатураПартнера;
					Исключение
						ОписаниеОшибкиНоменклатурыПартнера = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;

				Попытка
					СтрДок.ДокументПоступления = Э.ДокументРегистратор;
				Исключение
					ОписаниеОшибкиДокументаПоступления = ОписаниеОшибки();
				КонецПопытки;

				Если ЗначениеЗаполнено(Э.СерийныйНомер) Тогда
					Попытка
						СтрДок.СерийныйНомер = Э.СерийныйНомер;
					Исключение
						ОписаниеОшибкиСерийногоНомера = ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;

			Док.Дата = ТекущаяДатаСеанса();
			Док.Записать();
			СозданнаяСсылка = Док.Ссылка;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение ОписаниеОшибки();
		КонецПопытки;

		Если ЗначениеЗаполнено(СозданнаяСсылка) Тогда
			Созданные.Добавить(СозданнаяСсылка);
		КонецЕсли;
	КонецЦикла;

	Возврат Созданные;
КонецФункции


#КонецОбласти

