
///////////////////////////////////////////////////////////////////////////
#Область ТТМ_АРМ_ПроцессСогласования_ГлобальныеПеременные

&НаКлиенте
Перем ФормаМенеджера;

&НаКлиенте
Перем ФормаКонструкторов;

&НаКлиенте
Перем ФормаСнабжения;

&НаКлиенте
Перем КэшированныеДанныеСтроки;

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область ПроверкаПодразделенияИРолиДоступа

&НаКлиенте
Процедура ПриОткрытии(Отказ)	            
	
	УстановитьОтветственногоНаСервере();
	//Объект.Ответственный = ПользователиКлиент.ТекущийПользователь();	
	ТекущаяРольДоступна = ПроверкаРолиДоступа(Объект.Ответственный);
	ОчиститьСообщения();
	
	Если Не ТекущаяРольДоступна Тогда  
		Предупреждение(НСтр("ru = 'Текущая роль недоступна для данного пользователя: '") + Объект.Ответственный, 0, "ТТМ АРМ Процесс согласования");
		Возврат;
	КонецЕсли;
	
	ИсполнителиИРоли = ПолучитьПодразделениеОтветственногоСотрудника(Объект.Ответственный);
	РольИсполнителя = ИсполнителиИРоли["РольИсполнителя"];
	МассивРолей = ИсполнителиИРоли["МассивРолей"];
	
	Если РольИсполнителя = Неопределено Тогда
		Объект.Подразделение = ПредопределенноеЗначение("Справочник.РолиИсполнителей.ПустаяСсылка");
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Подразделение для текущего пользователя не найдено'"),, "Объект.Подразделение");
	Иначе
		Объект.Подразделение = РольИсполнителя;
	
		Если МассивРолей[0] = РольИсполнителя Тогда
			ФормаМенеджера = Истина;
			ФормаКонструкторов = Ложь;
			ФормаСнабжения = Ложь;
			
			Элементы.СтраницаПроверкиЗаказаКонструктор.Видимость = Ложь;
			СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами();
			ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
			ПолучитьНастройкиИзХранилища(ФормаПодразделения);		
			НастройкиСохраненыМенеджер = Истина;
		ИначеЕсли МассивРолей[1] = РольИсполнителя Тогда
			ФормаМенеджера = Ложь;
			ФормаКонструкторов = Истина;
			ФормаСнабжения = Ложь;
			
			Элементы.СтраницаПроверкиЗаказаМенеджер.Видимость = Ложь;
			СформироватьСписокЗаказовДляОтделаКонструкторов();
			ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
			ПолучитьНастройкиИзХранилища(ФормаПодразделения);
			НастройкиСохраненыКонструктор = Истина;
		ИначеЕсли МассивРолей[2] = РольИсполнителя Тогда
			ФормаМенеджера = Ложь;
			ФормаКонструкторов = Ложь;
			ФормаСнабжения = Истина;
		КонецЕсли;

	КонецЕсли;
	
	ПолучитьГрафическуюСхему();
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	
	Если СхемаЗагружена Тогда
		ОтрисоватьТекущийЭтапПроизводства(ФормаПодразделения, Истина);
	КонецЕсли;
	
	Если Объект.АвтоматическоеОбновлениеСписка Тогда
		ПодключитьОбработчикОжидания("АвтообновлениеСпискаЗаказов", 300);
	Иначе
		ОтключитьОбработчикОжидания("АвтообновлениеСпискаЗаказов");
	КонецЕсли;

КонецПроцедуры      

&НаСервере
Процедура УстановитьОтветственногоНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Объект.Ответственный = Пользователи.АвторизованныйПользователь();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПроверкаРолиДоступа(ТекущийПользователь)	
	Возврат Пользователи.РолиДоступны(
		"ТТМ_ПроцессСогласованияМенеджер,
		|ТТМ_ПроцессСогласованияКонструктор,
		|ТТМ_ПроцессСогласованияСнабжение,
		|ТТМ_НазначениеИсполнителяКонструктор",
		ТекущийПользователь);	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПодразделениеОтветственногоСотрудника(ТекущийСотрудник)
	МассивРолей = Новый Массив;			
	МассивРолей.Добавить(Справочники.РолиИсполнителей.НайтиПоНаименованию("Согласование отдела по работе с клиентами"));
	МассивРолей.Добавить(Справочники.РолиИсполнителей.НайтиПоНаименованию("Согласование отдела конструкторов"));
	МассивРолей.Добавить(Справочники.РолиИсполнителей.НайтиПоНаименованию("Согласование отдела снабжения"));
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя
	               |ИЗ
	               |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	               |ГДЕ
	               |	ИсполнителиЗадач.Исполнитель = &Исполнитель
	               |	И НЕ ИсполнителиЗадач.РольИсполнителя.ПометкаУдаления
	               |	И ИсполнителиЗадач.РольИсполнителя В (&МассивРолей)";
	
	Запрос.УстановитьПараметр("Исполнитель", ТекущийСотрудник);
	Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
			
	ИсполнителиИРоли = Новый Структура;
	ИсполнителиИРоли.Вставить("МассивРолей", МассивРолей);
	ИсполнителиИРоли.Вставить("РольИсполнителя", Выборка.РольИсполнителя); 	
	
	Возврат ИсполнителиИРоли;
	
КонецФункции

&НаСервере
Процедура ПолучитьГрафическуюСхему()
	ГрафСхемаСсылка = Справочники.ТТМ_ГрафическиеСхемы.НайтиПоНаименованию("ТТМ бизнес процесс производства");
	
	Если ГрафСхемаСсылка.Пустая() Тогда
		СхемаЗагружена = Ложь;
		Возврат;
	КонецЕсли;
	
	ГрафСхема = РегистрыСведений.ТТМ_РегистрГрафическиеСхемы.СоздатьМенеджерЗаписи();
	ГрафСхема.ГрафическаяСхема = ГрафСхемаСсылка;
	ГрафСхема.Прочитать();
	
	Если ГрафСхема.Выбран() Тогда
		ЗагруженнаяСхема = ГрафСхема.ФайлДанных.Получить();
		Объект.СхемаПроизводства = ЗагруженнаяСхема;
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ЗагруженнаяСхема, ЭтаФорма.УникальныйИдентификатор);
		Объект.АдресВХранилище = АдресВоВременномХранилище;	
	КонецЕсли;
	
	СхемаЗагружена = Истина;
КонецПроцедуры

&НаСервере
Процедура ОтрисоватьТекущийЭтапПроизводства(ФормаПодразделения, Знач ОткрытиеФормы = Ложь, Знач ПослеВнесенияИзменений = Ложь)
	ЭлементыГрафСхемы = Объект.СхемаПроизводства.ЭлементыГрафическойСхемы;	
	ШрифтПройденныхЭтапов = Новый Шрифт("Arial", 8, Истина,,, Истина);
	ШрифтТекущихЭтапов = Новый Шрифт("Arial", 8, Истина,, Истина); 
	ЦветФонаТекущегоЭтапа = WebЦвета.БледноЗеленый; 
	
	Если ОткрытиеФормы Тогда
		ПолеСтарта = ЭлементыГрафСхемы.Найти("Старт");
		Если ПолеСтарта <> Неопределено Тогда
			ПолеСтарта.Шрифт = ШрифтПройденныхЭтапов;
		КонецЕсли;
		
		ПолеЗагрузкаЗаказа =  ЭлементыГрафСхемы.Найти("АРМ_ЗагрузкаЗаказа");
		Если ПолеЗагрузкаЗаказа <> Неопределено Тогда
			ПолеЗагрузкаЗаказа.Шрифт = ШрифтПройденныхЭтапов;
		КонецЕсли;
		
		ПолеЖелаемаяДатаПроизводства = ЭлементыГрафСхемы.Найти("ЖелаемаяДатаПроизводства");
		Если ПолеЖелаемаяДатаПроизводства <> Неопределено Тогда
			ПолеЖелаемаяДатаПроизводства.Шрифт = ШрифтПройденныхЭтапов;
		КонецЕсли;

		ПолеСогласования = ЭлементыГрафСхемы.Найти("АРМ_СогласованиеЗаказа");
		Если ПолеСогласования <> Неопределено Тогда			
			ПолеСогласования.Шрифт = ШрифтТекущихЭтапов;
			
			Если ФормаПодразделения.ФормаМенеджеров Тогда
				ПолеСогласования.Элементы.СогласованиеМенеджер.ЦветФона = ЦветФонаТекущегоЭтапа;
			ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
				ПолеСогласования.Элементы.СогласованиеКонструктор.ЦветФона = ЦветФонаТекущегоЭтапа;
			ИначеЕсли ФормаПодразделения.ФормаСнабжения Тогда
				ПолеСогласования.Элементы.СогласованиеСнабжение.ЦветФона = ЦветФонаТекущегоЭтапа;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область ПриИзмененииПолейФормыОбщие

&НаКлиенте
Процедура ОбновитьСписокЗаказов(Команда)
	
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ОчиститьСообщения();
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда 
		СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами();
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
		СформироватьСписокЗаказовДляОтделаКонструкторов();
	ИначеЕсли ФормаПодразделения.ФормаСнабжения Тогда
		//Если потребуется доп разработка для снабжения
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеТовары(Команда)
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	УстановитьИлиСнятьФлагОтметки(ФормаПодразделения, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуПоВсемТоварам(Команда)
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	УстановитьИлиСнятьФлагОтметки(ФормаПодразделения);
КонецПроцедуры

&НаСервере
Процедура УсловныйОтборВидимости(СтруктураОтбора, ФормаПодразделения, Знач ЭлементУО_Изменен = Ложь)
	
	//------------------------Условное оформление менеджер-----------------------------------------
	Если ФормаПодразделения.ФормаМенеджеров Тогда
		НовыйОтбор = Новый Структура;
		НовыйОтбор.Вставить("ЗаказКлиента", СтруктураОтбора["ЗаказКлиента"]);
		НовыйОтбор.Вставить("ЕстьОтказ", Истина);
		
		МассивНайденныхСтрок = СписокЗаказовМенеджер.НайтиСтроки(НовыйОтбор);
		ОтобразитьДопПоляПриОтказе = ?(МассивНайденныхСтрок.Количество() = 0, Ложь, Истина);
		Элементы.ДопПоляСпискаЗаказов.Видимость = ОтобразитьДопПоляПриОтказе;	
	КонецЕсли;
	
	//------------------------Условное оформление конструктор-----------------------------------------
	Если ФормаПодразделения.ФормаКонструкторов Тогда
		НовыйОтбор = Новый Структура;
		НовыйОтбор.Вставить("ЗаказКлиента", СтруктураОтбора["ЗаказКлиента"]);
		НовыйОтбор.Вставить("Статус", Перечисления.СтатусыСпецификаций.ВРазработке);
		
		//Проверка по отбору, если имеются несколько активных спецификаций для одного изделия
		СписокВРазработке = ТоварыЗаказаСоСпецификацией.НайтиСтроки(НовыйОтбор);
		НовыйОтбор["Статус"] = Перечисления.СтатусыСпецификаций.Действует;
		СписокДействует = ТоварыЗаказаСоСпецификацией.НайтиСтроки(НовыйОтбор);
		
		Если СписокВРазработке.Количество() <> 0 Или СписокДействует.Количество() <> 0 Тогда			
			
			Для Каждого ТекТоварДействует Из СписокДействует Цикл
				СовпадениеНайдено = Ложь;
				
				Для Каждого ТекТоварВРазработке Из СписокВРазработке Цикл 
					Если ТекТоварДействует.Номенклатура = ТекТоварВРазработке.Номенклатура Тогда
						НоменклатураКОформлению = ТекТоварВРазработке.Номенклатура;
						СовпадениеНайдено = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				 				
				Если СовпадениеНайдено Тогда						
					НовыйЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
					ОформлениеЦветФона = НовыйЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветФона");
					ОформлениеЦветФона.Значение = WebЦвета.БледноЛиловый;
					ОформлениеЦветФона.Использование = Истина;
					
					НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТоварыЗаказаСоСпецификацией.Номенклатура");
					НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					НастройкаОтбора.ПравоеЗначение = НоменклатураКОформлению;
					
					ОформляемоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
					ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыЗаказаСоСпецификацией");
					ОформляемоеПоле.Использование = Истина;
					
					ЭлементУО_Изменен = Истина;	
				КонецЕсли;					
			КонецЦикла;
						
			Если ЭлементУО_Изменен Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='У некоторых товаров есть 2 или более спецификаций.'"),, "ТоварыЗаказаСоСпецификацией");
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокОтмеченныхТоваров(ФормаПользователя, Знач ПолучитьКоличество = Ложь, Знач ПолучитьДанныеПоНоменклатуре = Ложь)
	
	Если ФормаПользователя.ФормаМенеджеров Тогда 
		МассивОтмеченных = ТоварыЗаказа.НайтиСтроки(Новый Структура("Подтверждено", Истина));
	ИначеЕсли ФормаПользователя.ФормаКонструкторов Тогда
		МассивОтмеченных = ТоварыЗаказаСоСпецификацией.НайтиСтроки(Новый Структура("Подтверждено", Истина));
	КонецЕсли;		
	
	Если ПолучитьКоличество Тогда
		ПолученныйРезультат = МассивОтмеченных.Количество();
	ИначеЕсли ПолучитьДанныеПоНоменклатуре Тогда
		ПолученныйРезультат = Новый Соответствие;

		Для Каждого Товар Из МассивОтмеченных Цикл
			ПолученныйРезультат.Вставить(Товар.Номенклатура, Товар.Количество); 
		КонецЦикла;			
	КонецЕсли;
				
	Возврат ПолученныйРезультат;
КонецФункции

&НаСервере
Процедура УстановитьИлиСнятьФлагОтметки(ФормаПодразделения, Знач ФлагОтметки = Ложь)
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда 		
		Для Каждого ТекТовар Из ТоварыЗаказа Цикл
			ТекТовар.Подтверждено = ФлагОтметки;
		КонецЦикла;	
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
		Для Каждого ТекТовар Из ТоварыЗаказаСоСпецификацией Цикл
			ТекТовар.Подтверждено = ФлагОтметки;
		КонецЦикла;
	ИначеЕсли ФормаПодразделения.ФормаСнабжения Тогда
		//Если потребуется разобработка доп. формы для снабжения
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ИнформацияЭтаФормаПодразделения()
	
	ФормаПользователя = Новый Структура;
	ФормаПользователя.Вставить("ФормаМенеджеров", ФормаМенеджера);
	ФормаПользователя.Вставить("ФормаКонструкторов", ФормаКонструкторов);
	ФормаПользователя.Вставить("ФормаСнабжения", ФормаСнабжения);
	
	Возврат ФормаПользователя; 
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруОтбораПриАктивизацииСтроки(ВыбраннаяСтрока, ФормаПодразделения)
	
	СтруктураОтбора = Новый Структура;
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда 
		СтруктураОтбора.Вставить("ЗаказКлиента", ВыбраннаяСтрока.ЗаказКлиента);
		СтруктураОтбора.Вставить("Назначение", ВыбраннаяСтрока.Назначение);
		СтруктураОтбора.Вставить("Подразделение", Объект.Подразделение);	
		СтруктураОтбора.Вставить("СтатусСогласования", ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано"));
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
		СтруктураОтбора.Вставить("ЗаказКлиента", ВыбраннаяСтрока.ЗаказКлиента);
		СтруктураОтбора.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыСпецификаций.Закрыта"));
		СтруктураОтбора.Вставить("НачалоДействия", Дата(1, 1, 1));
	ИначеЕсли ФормаПодразделения.ФормаСнабжения Тогда
		//Если потребуется доп. разработка для снабжения
	КонецЕсли;
	
	Возврат СтруктураОтбора; 
КонецФункции

//Обработчик оповещения при вызове из других форм 
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		   		
	Если ИмяСобытия = "ЗакрытиеЗаказов" Тогда
		ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
		ТекущаяКоманда = "ОбработкаОповещенияПриЗакрытии";
		
		Если ФормаПодразделения.ФормаМенеджеров Тогда
			ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
			
			СтруктураДанных = Новый Структура;
			СтруктураДанных.Вставить("Команда", ТекущаяКоманда); 
			СтруктураДанных.Вставить("КоличествоОтмеченных", ПолучитьСписокОтмеченныхТоваров(ФормаПодразделения, Истина));
			СтруктураДанных.Вставить("ДанныеПоНоменклатуре", ПолучитьСписокОтмеченныхТоваров(ФормаПодразделения, Ложь, Истина));	
			СтруктураДанных.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
			СтруктураДанных.Вставить("Отказ", Отказ);
			СтруктураДанных.Вставить("ПричинаОтказа", ПричинаОтказа);
			СтруктураДанных.Вставить("СписокАдресовДляРассылки", СписокАдресовДляРассылки);
			
			ДатаОкончания = ?(Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Отказ"), ТекущаяДата(), Дата(1, 1, 1));
			ДополнитьСтруктуруДанныхПередЗаписьюВРегистр(СтруктураДанных,, ДатаОкончания);
			ОтправитьПочтовоеСообщение(СтруктураДанных);

			СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами();
			ОповеститьПользователя(ТекущаяКоманда);
		КонецЕсли;		
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеВыбораСвязаннойСпецификации" Или ИмяСобытия = "ПослеВыбораИсполнителя" Тогда
		ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
		
		Если ФормаПодразделения.ФормаКонструкторов Тогда
			ТекущаяСтрока = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
						
			Если ТекущаяСтрока.ЗаказКлиента = Неопределено Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Номер заказа не определен'"),, "ТоварыЗаказаСоСпецификацией");
				Возврат;
			ИначеЕсли ТекущаяСтрока.Спецификация = Неопределено Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Спецификация отсутствует или не была выбрана'"),, "ТоварыЗаказаСоСпецификацией");
				Возврат;				
			КонецЕсли;
			
			СвязанныеДанные = ПолучитьСвязанныеДанныеСТекущейСпецификацией(ТекущаяСтрока.ЗаказКлиента, Параметр.Спецификация);

			Если СвязанныеДанные.Количество() = 0 Или  СвязанныеДанные = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			Если ИмяСобытия = "ПослеВыбораСвязаннойСпецификации" Тогда
				ТекущаяСтрока.Спецификация = Параметр.Спецификация;
				ТекущаяСтрока.Статус = Параметр.Статус;
				ТекущаяСтрока.Исполнитель = СвязанныеДанные.Исполнитель;
			ИначеЕсли ИмяСобытия = "ПослеВыбораИсполнителя" Тогда
				ТекущаяСтрока.Исполнитель = Параметр.Пользователь;
			КонецЕсли;
						
			ТекущаяСтрока.НачалоДействия = СвязанныеДанные.НачалоДействия;
			
			Если Не ЗначениеЗаполнено(ТекущаяСтрока.СрокиРазработки) Тогда
				ТекущаяСтрока.СрокиРазработки = СвязанныеДанные.СрокиРазработки;
				ТекущаяСтрока.СрокиПереноса = СвязанныеДанные.СрокиПереноса;
			КонецЕсли;
			
			Если ТекущаяСтрока.Подтверждено Тогда
				ОбработатьСтрокиТоваровСоСпецификацийПриИзменении();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ПослеВыбораЗаказаСОтказомМенеджер" Тогда
		ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
		ТекущаяКоманда = "ВернутьЗаказНаСогласование";
		МассивЗаказовСОтказом = Параметр;
		
		Если ФормаПодразделения.ФормаМенеджеров Тогда
			Если МассивЗаказовСОтказом.Количество() = 0 Или МассивЗаказовСОтказом = Неопределено Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет заказов для обработки'"));
				Возврат;
			КонецЕсли;
			
			РезультатВыполнения = Ложь;
			
			Попытка
				ВернутьЗаказНаСогласованиеОбщее(МассивЗаказовСОтказом, ФормаПодразделения);
				КоличествоОбработанных = ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(МассивЗаказовСОтказом, "НеСогласован");
				
				Если КоличествоОбработанных > 0 Тогда
					ВнесеныИзменения = ОбработатьСтрокиТабличногоДокументаВЗаказеКлиента(МассивЗаказовСОтказом[0],,,,, Истина);
					РезультатВыполнения = ВнесеныИзменения;
				ИначеЕсли КоличествоОбработанных = 0 Тогда
					ОчиститьСообщения();
					РезультатВыполнения = Истина;
				КонецЕсли;
			Исключение
				РезультатВыполнения = Ложь;
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка записи данных: '") + ОписаниеОшибки());
			КонецПопытки;
			
			Если РезультатВыполнения Тогда
				СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами();
				ОповеститьПользователя(ТекущаяКоманда);
			Иначе
				ПоказатьПредупреждение(, "Выполнены не все действия после отмены заказа: " + МассивЗаказовСОтказом[0], 60, "Отмена действий согласования"); 				
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;                           
		
	Если ИмяСобытия = "ПослеВыбораЗаказаСОтказомКонструктор" Тогда
		ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
		ТекущаяКоманда = "ВернутьЗаказНаСогласование";
		МассивЗаказовСОтказом = Параметр;
		
		Если ФормаПодразделения.ФормаКонструкторов Тогда 
			Если МассивЗаказовСОтказом.Количество() = 0 Или МассивЗаказовСОтказом = Неопределено Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет заказов для обработки'"));
				Возврат;
			КонецЕсли;
			
			Попытка
				ВернутьЗаказНаСогласованиеОбщее(МассивЗаказовСОтказом, ФормаПодразделения);
				РезультатВыполнения = Истина;
			Исключение
				РезультатВыполнения = Ложь;
	            ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка записи данных: '") + ОписаниеОшибки());
			КонецПопытки;
			
			Если РезультатВыполнения Тогда
				СформироватьСписокЗаказовДляОтделаКонструкторов();
				ОповеститьПользователя(ТекущаяКоманда);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ТТМ_ОбработкаЗагрузкиЗаказовКлиента" Тогда		
		ТекущаяКоманда = "ЗагрузкаНовыхЗаказов";
		
		Если Параметр.ДокументыСформированы И Параметр.НовыйЗагруженныйЗаказ Тогда
			ОчиститьСообщения();
            ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
						
			Если ФормаПодразделения.ФормаМенеджеров Тогда
				ЗадатьДополнительныйВопросПользователю(ФормаПодразделения, ТекущаяКоманда, Параметр.СсылкаНаОбработанныйЗаказ);	
			ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
				ЗадатьДополнительныйВопросПользователю(ФормаПодразделения, ТекущаяКоманда, Параметр.СсылкаНаОбработанныйЗаказ);
			ИначеЕсли ФормаПодразделения.ФормаСнабжения Тогда
				//Если потребуется доп разработка для снабжения	
			КонецЕсли;		
		КонецЕсли;
		
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура АвтообновлениеСпискаЗаказов()
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();	
	КоличествоЗаказовКОбновлению = ПроверкаИзмененныхИНовыхЗаказов(ФормаПодразделения);
	
	Если КоличествоЗаказовКОбновлению = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ЗаголовокВопроса = НСтр("ru = 'Обновление по заказам'");
	ТекстВопроса = НСтр("ru = 'Есть новые или измененые заказы, обновить список?'");
	Кнопки =  РежимДиалогаВопрос.ДаНет;
	Таймаут = 20;
	
	ОповещениеЗагрузкиНовыхЗаказов = Новый ОписаниеОповещения("ЗагрузкаНовыхЗаказовПодтверждение", ЭтотОбъект, ФормаПодразделения);
	ПоказатьВопрос(ОповещениеЗагрузкиНовыхЗаказов, ЗаголовокВопроса, Кнопки, Таймаут,, ЗаголовокВопроса); 
КонецПроцедуры

&НаСервере
Функция ПроверкаИзмененныхИНовыхЗаказов(ФормаПодразделения);
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда
		 Выборка = ОбъектОбработки.ПроверитьНовыеЗаказыМенеджер(СписокЗаказовМенеджер.Выгрузить());
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
		Выборка = ОбъектОбработки.ПроверитьНовыеЗаказыКонструктор(СписокЗаказовКонструктор.Выгрузить());
	КонецЕсли;
			
	Возврат Выборка.Количество();
КонецФункции

&НаКлиенте
Процедура ЗагрузкаНовыхЗаказовПодтверждение(ОтветПользователя, ДополнительныеПараметры) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Нет Или ОтветПользователя = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ФормаМенеджеров Тогда
		ОчиститьСообщения();
		СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами();
	ИначеЕсли ДополнительныеПараметры.ФормаКонструкторов Тогда
		ОчиститьСообщения();
		СформироватьСписокЗаказовДляОтделаКонструкторов();
	КонецЕсли;
	
	ОповеститьПользователя("ЗагрузкаНовыхЗаказов");
КонецПроцедуры
	
#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область РаботаНаСтраницеМенеджеровПриИзмененииПолейФормы

 &НаКлиенте
Процедура СостояниеЗаказа(Команда)
	ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаказКлиента", ВыбраннаяСтрока.ЗаказКлиента);
	ОткрытьФорму("Обработка.ТТМ_АРМ_ПроцессСогласования.Форма.ФормаОтчета", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами()
			
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
					|	Док_ЗаказКлиента.Ссылка КАК ЗаказКлиента,
					|	Док_ЗаказКлиента.Назначение КАК Назначение,
					|	Док_ЗаказКлиента.Дата КАК ДатаЗаказа,
					|	Док_ЗаказКлиента.Организация КАК Организация,
					|	Док_ЗаказКлиента.СуммаДокумента КАК СуммаЗаказа,
					|	Док_ЗаказКлиента.Статус КАК Статус
					|ПОМЕСТИТЬ ВТ_ЗаказКлиента
					|ИЗ
					|	Документ.ЗаказКлиента КАК Док_ЗаказКлиента
					|ГДЕ
					|	Док_ЗаказКлиента.Статус = &Статус
					|	И НЕ Док_ЗаказКлиента.ПометкаУдаления
					|	И НЕ Док_ЗаказКлиента.Назначение.ПометкаУдаления
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ЗаказКлиента.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_ЗаказКлиента.Назначение КАК Назначение,
					|	ВТ_ЗаказКлиента.ДатаЗаказа КАК ДатаЗаказа,
					|	ВТ_ЗаказКлиента.Организация КАК Организация,
					|	ВТ_ЗаказКлиента.СуммаЗаказа КАК СуммаЗаказа,
					|	ВТ_ЗаказКлиента.Статус КАК Статус,
					|	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.ПричинаОтказа, &ПустаяСтрока) КАК ПричинаОтказа
					|ПОМЕСТИТЬ ВТ_СобранныеЗаказы
					|ИЗ
					|	ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_СогласованиеСводнаяИнформация КАК ТТМ_СогласованиеСводнаяИнформация
					|		ПО (ВТ_ЗаказКлиента.ЗаказКлиента = ТТМ_СогласованиеСводнаяИнформация.ЗаказКлиента
					|				И ВТ_ЗаказКлиента.Назначение = ТТМ_СогласованиеСводнаяИнформация.Назначение)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_СобранныеЗаказы.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_СобранныеЗаказы.Назначение КАК Назначение,
					|	ВТ_СобранныеЗаказы.ДатаЗаказа КАК ДатаЗаказа,
					|	ВТ_СобранныеЗаказы.Организация КАК Организация,
					|	ВТ_СобранныеЗаказы.СуммаЗаказа КАК СуммаЗаказа,
					|	ВТ_СобранныеЗаказы.Статус КАК Статус,
					|	ВЫБОР
					|		КОГДА ПОДСТРОКА(ВТ_СобранныеЗаказы.ПричинаОтказа, 0, 1) = &ПустаяСтрока
					|			ТОГДА ЛОЖЬ
					|		ИНАЧЕ ИСТИНА
					|	КОНЕЦ КАК ЕстьОтказ,
					|	ВТ_СобранныеЗаказы.ПричинаОтказа КАК ПричинаОтказа
					|ИЗ
					|	ВТ_СобранныеЗаказы КАК ВТ_СобранныеЗаказы";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокЗаказовМенеджер.Очистить();
	ТоварыЗаказа.Очистить();
		
	Пока Выборка.Следующий() Цикл
		ТекущийЗаказ = СписокЗаказовМенеджер.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущийЗаказ, Выборка);			 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПриАктивизацииСтроки(Элемент)

	ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;	
	Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.ПустаяСсылка");
	ОчиститьСообщения();
	ПричинаОтказа = "";
	Отказ = Ложь;
		
	Если ВыбраннаяСтрока <> Неопределено Тогда
		ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
		СтруктураОтбора = ПолучитьСтруктуруОтбораПриАктивизацииСтроки(ВыбраннаяСтрока, ФормаПодразделения);
			
		Если ФормаПодразделения.ФормаМенеджеров Тогда
			ПолучитьСписокТоваровДляОтделаПоРаботеСКлиентами(СтруктураОтбора);
			УсловныйОтборВидимости(СтруктураОтбора, ФормаПодразделения); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокТоваровДляОтделаПоРаботеСКлиентами(СтруктураОтбора, Знач ДетальныеЗаписи = Неопределено)
	
	Если Объект.ТаблицаОтбораЦен.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Необходимо заполнить список отбора цен'"),, "Объект.ТаблицаОтбораЦен");
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ТТМ_СогласованиеЗаказовМенеджер.ЗаказКлиента КАК ЗаказКлиента,
	               |	ТТМ_СогласованиеЗаказовМенеджер.Изделие КАК Изделие,
	               |	ВЫБОР
	               |		КОГДА ТТМ_СогласованиеЗаказовМенеджер.СтатусСогласования = &СтатусСогласования
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Подтверждено
	               |ПОМЕСТИТЬ ВТ_РегистрТТМПроцессПроизводства
	               |ИЗ
	               |	РегистрСведений.ТТМ_СогласованиеЗаказовМенеджер КАК ТТМ_СогласованиеЗаказовМенеджер
	               |ГДЕ
	               |	ТТМ_СогласованиеЗаказовМенеджер.ЗаказКлиента = &ЗаказКлиента
	               |	И ТТМ_СогласованиеЗаказовМенеджер.Подразделение = &Подразделение
	               |	И ТТМ_СогласованиеЗаказовМенеджер.Назначение = &Назначение
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_СогласованиеЗаказовМенеджер.Изделие,
	               |	ТТМ_СогласованиеЗаказовМенеджер.ЗаказКлиента,
	               |	ВЫБОР
	               |		КОГДА ТТМ_СогласованиеЗаказовМенеджер.СтатусСогласования = &СтатусСогласования
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ) КАК Подтверждено,
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаТовары.Упаковка КАК ЕдиницаИзмерения,
	               |	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ЗаказКлиентаТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	               |			ТОГДА &ПроизвольнаяЦена
	               |		ИНАЧЕ ЗаказКлиентаТовары.ВидЦены
	               |	КОНЕЦ КАК ВидЦены,
	               |	ЗаказКлиентаТовары.Цена КАК Цена,
	               |	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
	               |	ЗаказКлиентаТовары.СуммаСНДС КАК ИтоговаяСумма,
	               |	ЗаказКлиентаТовары.ДатаОтгрузки КАК ЖелаемаяДатаПРоизводства
	               |ПОМЕСТИТЬ ВТ_ТоварыЗаказаКлиентаМП
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрТТМПроцессПроизводства КАК ВТ_РегистрТТМПроцессПроизводства
	               |		ПО ЗаказКлиентаТовары.Ссылка = ВТ_РегистрТТМПроцессПроизводства.ЗаказКлиента
	               |			И ЗаказКлиентаТовары.Номенклатура = ВТ_РегистрТТМПроцессПроизводства.Изделие
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЗаказКлиентаТовары.Упаковка,
	               |	ЗаказКлиентаТовары.Цена,
	               |	ЗаказКлиентаТовары.СтавкаНДС,
	               |	ЗаказКлиентаТовары.СуммаНДС,
	               |	ЗаказКлиентаТовары.СуммаСНДС,
	               |	ЗаказКлиентаТовары.ДатаОтгрузки,
	               |	ЗаказКлиентаТовары.НомерСтроки,
	               |	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ),
	               |	ВЫБОР
	               |		КОГДА ЗаказКлиентаТовары.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	               |			ТОГДА &ПроизвольнаяЦена
	               |		ИНАЧЕ ЗаказКлиентаТовары.ВидЦены
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_РегистрТТМПроцессПроизводства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ТоварыЗаказаКлиентаМП.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ТоварыЗаказаКлиентаМП.Подтверждено КАК Подтверждено,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования, ЛОЖЬ) = &СтатусСогласования
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЕСТЬNULL(ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования, ЛОЖЬ)
	               |	КОНЕЦ КАК ПодтверждениеКБ,
	               |	ВТ_ТоварыЗаказаКлиентаМП.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_ТоварыЗаказаКлиентаМП.Номенклатура КАК Номенклатура,
	               |	ВТ_ТоварыЗаказаКлиентаМП.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВТ_ТоварыЗаказаКлиентаМП.Количество КАК Количество,
	               |	ВТ_ТоварыЗаказаКлиентаМП.ВидЦены КАК ВидЦены,
	               |	ВТ_ТоварыЗаказаКлиентаМП.Цена КАК Цена,
	               |	ВТ_ТоварыЗаказаКлиентаМП.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ТоварыЗаказаКлиентаМП.СуммаНДС КАК СуммаНДС,
	               |	ВТ_ТоварыЗаказаКлиентаМП.ИтоговаяСумма КАК ИтоговаяСумма,
	               |	ВТ_ТоварыЗаказаКлиентаМП.ЖелаемаяДатаПРоизводства КАК ЖелаемаяДатаПРоизводства
	               |ПОМЕСТИТЬ ВТ_СписокТоваровСПодтверждениемКБ
	               |ИЗ
	               |	ВТ_ТоварыЗаказаКлиентаМП КАК ВТ_ТоварыЗаказаКлиентаМП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_СогласованиеЗаказовКонструктор КАК ТТМ_СогласованиеЗаказовКонструктор
	               |		ПО ВТ_ТоварыЗаказаКлиентаМП.ЗаказКлиента = ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента
	               |			И ВТ_ТоварыЗаказаКлиентаМП.Номенклатура = ТТМ_СогласованиеЗаказовКонструктор.Изделие
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ТоварыЗаказаКлиентаМП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_СписокТоваровСПодтверждениемКБ.НомерСтроки КАК НомерСтроки,
	               |	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиРазработки, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиРазработки,
	               |	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК Спецификация,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.Подтверждено КАК Подтверждено,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.ПодтверждениеКБ КАК ПодтверждениеКБ,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.Номенклатура КАК Номенклатура,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.Количество КАК Количество,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.ВидЦены КАК ВидЦены,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.Цена КАК Цена,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.СуммаНДС КАК СуммаНДС,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.ИтоговаяСумма КАК ИтоговаяСумма,
	               |	ВТ_СписокТоваровСПодтверждениемКБ.ЖелаемаяДатаПРоизводства КАК ЖелаемаяДатаПРоизводства,
	               |	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.Спецификация.ОсновноеИзделиеЭтап.ДлительностьЭтапа, 0) КАК ДлительностьЭтапа,
	               |	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиПереноса, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиПереноса
	               |ПОМЕСТИТЬ ВТ_ИсполнителиСпецификаций
	               |ИЗ
	               |	ВТ_СписокТоваровСПодтверждениемКБ КАК ВТ_СписокТоваровСПодтверждениемКБ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_ИсполнителиСпецификаций КАК ТТМ_ИсполнителиСпецификаций
	               |		ПО ВТ_СписокТоваровСПодтверждениемКБ.ЗаказКлиента = ТТМ_ИсполнителиСпецификаций.ЗаказКлиента
	               |			И ВТ_СписокТоваровСПодтверждениемКБ.Номенклатура = ТТМ_ИсполнителиСпецификаций.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_СписокТоваровСПодтверждениемКБ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИсполнителиСпецификаций.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ИсполнителиСпецификаций.Спецификация КАК Спецификация,
	               |	ВТ_ИсполнителиСпецификаций.Подтверждено КАК Подтверждено,
	               |	ВТ_ИсполнителиСпецификаций.ПодтверждениеКБ КАК ПодтверждениеКБ,
	               |	ВТ_ИсполнителиСпецификаций.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_ИсполнителиСпецификаций.Номенклатура КАК Номенклатура,
	               |	ВТ_ИсполнителиСпецификаций.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВТ_ИсполнителиСпецификаций.Количество КАК Количество,
	               |	ВТ_ИсполнителиСпецификаций.ВидЦены КАК ВидЦены,
	               |	ВТ_ИсполнителиСпецификаций.Цена КАК Цена,
	               |	ВТ_ИсполнителиСпецификаций.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ИсполнителиСпецификаций.СуммаНДС КАК СуммаНДС,
	               |	ВТ_ИсполнителиСпецификаций.ИтоговаяСумма КАК ИтоговаяСумма,
	               |	ВТ_ИсполнителиСпецификаций.ЖелаемаяДатаПРоизводства КАК ЖелаемаяДатаПРоизводства,
	               |	ВТ_ИсполнителиСпецификаций.ДлительностьЭтапа КАК ДлительностьЭтапа,
	               |	ВЫБОР
	               |		КОГДА ВТ_ИсполнителиСпецификаций.СрокиПереноса = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ВТ_ИсполнителиСпецификаций.СрокиРазработки
	               |		ИНАЧЕ ВТ_ИсполнителиСпецификаций.СрокиПереноса
	               |	КОНЕЦ КАК СрокиРазработкиКБ
	               |ПОМЕСТИТЬ ВТ_ИтоговыеДанные
	               |ИЗ
	               |	ВТ_ИсполнителиСпецификаций КАК ВТ_ИсполнителиСпецификаций
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ИсполнителиСпецификаций
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИтоговыеДанные.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ИтоговыеДанные.Спецификация КАК Спецификация,
	               |	ВТ_ИтоговыеДанные.Подтверждено КАК Подтверждено,
	               |	ВТ_ИтоговыеДанные.ПодтверждениеКБ КАК ПодтверждениеКБ,
	               |	ВТ_ИтоговыеДанные.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ВТ_ИтоговыеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВТ_ИтоговыеДанные.Количество КАК Количество,
	               |	ВТ_ИтоговыеДанные.ВидЦены КАК ВидЦены,
	               |	ВТ_ИтоговыеДанные.Цена КАК Цена,
	               |	ВТ_ИтоговыеДанные.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ИтоговыеДанные.СуммаНДС КАК СуммаНДС,
	               |	ВТ_ИтоговыеДанные.ИтоговаяСумма КАК ИтоговаяСумма,
	               |	ВТ_ИтоговыеДанные.ЖелаемаяДатаПРоизводства КАК ЖелаемаяДатаПРоизводства,
	               |	ВТ_ИтоговыеДанные.ДлительностьЭтапа КАК ДлительностьЭтапа,
	               |	ВЫБОР
	               |		КОГДА ВТ_ИтоговыеДанные.СрокиРазработкиКБ = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ВТ_ИтоговыеДанные.СрокиРазработкиКБ
	               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ИтоговыеДанные.СрокиРазработкиКБ, ДЕНЬ, ВТ_ИтоговыеДанные.ДлительностьЭтапа)
	               |	КОНЕЦ КАК СрокиРазработкиКБ
	               |ИЗ
	               |	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", СтруктураОтбора["ЗаказКлиента"]);
	Запрос.УстановитьПараметр("Подразделение", СтруктураОтбора["Подразделение"]);
	Запрос.УстановитьПараметр("Назначение", СтруктураОтбора["Назначение"]);	
	Запрос.УстановитьПараметр("СтатусСогласования", СтруктураОтбора["СтатусСогласования"]);
	Запрос.УстановитьПараметр("ПроизвольнаяЦена", "<произвольная>");
	
	ВыгруженныйСписок = Запрос.Выполнить().Выгрузить();
	ТоварыЗаказа.Очистить();
	СчетчикСтрок = 1;
	
	Для Каждого ТекДанные Из ВыгруженныйСписок Цикл
		НоваяСтрока = ТоварыЗаказа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
		
		НоваяСтрока.НомерСтроки = СчетчикСтрок;	
		СчетчикСтрок = СчетчикСтрок + 1;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаПередНачаломИзменения(Элемент, Отказ)
	
	КэшированныеДанныеСтроки = Неопределено;
	СтрокаПередИзменением = Элементы.ТоварыЗаказа.ТекущиеДанные;
		
	Если СтрокаПередИзменением <> Неопределено ТОгда
		КэшированныеДанныеСтроки = СтрокаПередИзменением;
		ПодтвержденоПередИзменением = КэшированныеДанныеСтроки.Подтверждено;
		ДатаОтгрузкиПередИзменением = КэшированныеДанныеСтроки.ЖелаемаяДатаПроизводства;
		ВидЦеныПередИзменением = КэшированныеДанныеСтроки.ВидЦены;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаПодтвержденоПриИзменении(Элемент)
	
	Команда = "ПриИзмененииПоляПодтверждено";
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ПроверкаВыполнена = ПроверкаПередВыполнениемОперации(Команда, ФормаПодразделения);
	ТекСтрокаТовара = Элементы.ТоварыЗаказа.ТекущиеДанные;
	 	
	Если Не ПроверкаВыполнена Тогда
		ТекСтрокаТовара.Подтверждено = ?(КэшированныеДанныеСтроки <> Неопределено, ПодтвержденоПередИзменением, ТекСтрокаТовара.Подтверждено);		
		Возврат;
	КонецЕсли;
		
	Если ТекСтрокаТовара.Подтверждено Тогда
		Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано");
	Иначе
		Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.НаСогласовании");
	КонецЕсли;
	
	ДанныеПоНоменклатуре = Новый Соответствие;
	ДанныеПоНоменклатуре.Вставить(ТекСтрокаТовара.Номенклатура, ТекСтрокаТовара.Количество); 
		
	ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Команда", Команда);
	СтруктураДанных.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);; 
	СтруктураДанных.Вставить("КоличествоОтмеченных", ПолучитьСписокОтмеченныхТоваров(ФормаПодразделения, Истина));
	СтруктураДанных.Вставить("ДанныеПоНоменклатуре", ДанныеПоНоменклатуре);
	СтруктураДанных.Вставить("Отказ", Ложь);
	СтруктураДанных.Вставить("ПричинаОтказа", "");
		 
	ДополнитьСтруктуруДанныхПередЗаписьюВРегистр(СтруктураДанных, ВыбраннаяСтрока,, ТекСтрокаТовара.Номенклатура, ТекСтрокаТовара.Количество);
		
	Попытка
		ЗафиксироватьРезультатСогласованияВРегистр(СтруктураДанных);
		ИзмененияВнесены = Истина;
	Исключение
		ИзмененияВнесены = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Произошла ошибка во время записи: '") + ОписаниеОшибки());
	КонецПопытки;
	
	Если ИзмененияВнесены Тогда
		ОповеститьПользователя(СтруктураДанных.Команда);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаЖелаемаяДатаПроизводстваПриИзменении(Элемент)
	
	ТекущаяКоманда = "ИзменениеДатыОтгрузки";
	ТекущаяСтрока = Элементы.ТоварыЗаказа.ТекущиеДанные;
				
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
	СтруктураОтбора.Вставить("Количество", ТекущаяСтрока.Количество);	
	ВнесеныИзменения = ОбработатьСтрокиТабличногоДокументаВЗаказеКлиента(ТекущаяСтрока.ЗаказКлиента, СтруктураОтбора, ТекущаяСтрока.ЖелаемаяДатаПроизводства,, Истина);
		
	Если ВнесеныИзменения Тогда			
		ОповеститьПользователя(ТекущаяКоманда);
	Иначе
		ТекущаяСтрока.ЖелаемаяДатаПроизводства = ?(КэшированныеДанныеСтроки <> Неопределено, ДатаОтгрузкиПередИзменением, ТекущаяСтрока.ЖелаемаяДатаПроизводства);
	КонецЕсли;
						
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаВидЦеныПриИзменении(Элемент)
	
	ТекущаяКоманда = "ВидЦеныПриИзменении";
	ТекущаяСтрока = Элементы.ТоварыЗаказа.ТекущиеДанные;
	
	ВидЦеныДоступенКИзменению = ПроверитьДоступныеЦеныПередУстановкой(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.ВидЦены);
	
	Если Не ВидЦеныДоступенКИзменению Тогда
		ТекущаяСтрока.ВидЦены = ?(КэшированныеДанныеСтроки <> Неопределено, ВидЦеныПередИзменением, ТекущаяСтрока.ВидЦены);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Не найдена цена для номенклатуры: '") + ТекущаяСтрока.Номенклатура);
		Возврат;
	КонецЕсли;
		
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
	СтруктураОтбора.Вставить("Количество", ТекущаяСтрока.Количество);	
	ВнесеныИзменения = ОбработатьСтрокиТабличногоДокументаВЗаказеКлиента(ТекущаяСтрока.ЗаказКлиента, СтруктураОтбора,, ТекущаяСтрока.ВидЦены, Истина);
		
	Если ВнесеныИзменения Тогда	
		ОповеститьПользователя(ТекущаяКоманда);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступныеЦеныПередУстановкой(Номенклатура, ВидЦены)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
	               |	И ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ЦенаУстановлена = ?(Выборка.Количество() = 0, Ложь, Истина);
	
	Возврат ЦенаУстановлена;
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область РаботаНаСтраницеМенеджеровОткрытиеДопОбработки

&НаКлиенте
Процедура ОткрытьОбработкуУправлениеЦенами(Команда)
	
	ВыполняемаяКоманда = ПолучитьСтруктуруПараметровВнешнейОбработкиПередОткрытием(Команда.Действие);
	
	Если ВыполняемаяКоманда = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не найдена обработка: ''ТТМ: Управление ценами'''"), 30, НСтр("ru = 'Управление ценами'"));
		Возврат;
	КонецЕсли;
		
	ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(ВыполняемаяКоманда, ЭтотОбъект, ВыполняемаяКоманда.ОбъектыНазначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуПланПродаж(Команда)
	
	ВыполняемаяКоманда = ПолучитьСтруктуруПараметровВнешнейОбработкиПередОткрытием(Команда.Действие);
	
	Если ВыполняемаяКоманда = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не найдена обработка: ''ТТМ: План продаж'''"), 30, НСтр("ru = 'План продаж'"));
		Возврат;
	КонецЕсли;
		
	ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОткрытиеФормыОбработки(ВыполняемаяКоманда, ЭтотОбъект, ВыполняемаяКоманда.ОбъектыНазначения);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметровВнешнейОбработкиПередОткрытием(ТекущаяКоманда)
	
	Если ТекущаяКоманда = "ОткрытьОбработкуУправлениеЦенами" Тогда
		СтруктураПараметров = ТТМ_ДанныеВыбораСервер.ПолучитьПараметрыВнешнейОбработкиПередОткрытием("ТТМ: Управление ценами", Ложь);
	ИначеЕсли ТекущаяКоманда = "ОткрытьОбработкуПланПродаж" Тогда
		СтруктураПараметров = ТТМ_ДанныеВыбораСервер.ПолучитьПараметрыВнешнейОбработкиПередОткрытием("ТТМ: План продаж", Ложь);
	КонецЕсли;

	Возврат СтруктураПараметров
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область РаботаСНастройкамиОбщие

&НаКлиенте
Процедура СохранитьНастрокиОтбораЦен(Команда)
	
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	
	Попытка
		СохранитьНастройки(ФормаПодразделения);
		ЗаписиОбновлены = Истина;
	Исключение
		ЗаписиОбновлены = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Ошибка во время сохранения настроек: '") + ОписаниеОшибки());
	КонецПопытки;
	
	Если ЗаписиОбновлены Тогда
		НастройкиСохраненыМенеджер = Истина;
		ОповеститьПользователя(Команда.Действие);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки(ФормаПодразделения)
	КлючНастроек = "Обработка.ТТМ_АРМ_ПроцессСогласования" + ПараметрыСеанса.ТекущийПользователь;
	Настройки = Новый Соответствие;
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда
		Настройки.Вставить("ТаблицаОтбораЦен", Объект.ТаблицаОтбораЦен.Выгрузить());
		Настройки.Вставить("СписокАдресовДляРассылки", СписокАдресовДляРассылки.ВыгрузитьЗначения());
		Настройки.Вставить("ОбновлениеСпискаЗаказов", Объект.АвтоматическоеОбновлениеСписка);
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда	
		Настройки.Вставить("СписокАдресовДляРассылки", СписокАдресовДляРассылки.ВыгрузитьЗначения());
		Настройки.Вставить("ОбновлениеСпискаЗаказов", Объект.АвтоматическоеОбновлениеСписка);
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ТТМ_АРМ_ПроцессСогласования", КлючНастроек, Настройки);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиОтбораЦен(Команда)
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ПолучитьНастройкиИзХранилища(ФормаПодразделения);
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиИзХранилища(ФормаПодразделения)
	КлючНастроек = "Обработка.ТТМ_АРМ_ПроцессСогласования" + ПараметрыСеанса.ТекущийПользователь;
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.ТТМ_АРМ_ПроцессСогласования", КлючНастроек);
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда
		Если ЗначениеНастроек = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден список настроек для проверки цен'"),, "Объект.ТаблицаОтбораЦен");
			Возврат;
		КонецЕсли;
				
		Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда
			Для Каждого ТекНастройки Из ЗначениеНастроек Цикл
				Если ТекНастройки.Ключ = "ТаблицаОтбораЦен" Тогда  
					ТаблицаНастроекОтбораЦен = ТекНастройки.Значение;
					Объект.ТаблицаОтбораЦен.Загрузить(ТаблицаНастроекОтбораЦен);
				КонецЕсли;
				
				Если ТекНастройки.Ключ = "СписокАдресовДляРассылки" Тогда
					МассивПочтовыхАдресов = ТекНастройки.Значение;
					СписокАдресовДляРассылки.ЗагрузитьЗначения(МассивПочтовыхАдресов);
				КонецЕсли;
				
				Если ТекНастройки.Ключ =  "ОбновлениеСпискаЗаказов" Тогда
					Объект.АвтоматическоеОбновлениеСписка = ТекНастройки.Значение;
				КонецЕсли;		
			КонецЦикла;	
		КонецЕсли;
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
		Если ЗначениеНастроек = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден список настроек для рассылки почтовых уведомлений'"),, "СписокАдресовДляРассылки");
			Возврат;
		КонецЕсли;
				
		Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда
			Для Каждого ТекНастройки Из ЗначениеНастроек Цикл				
				Если ТекНастройки.Ключ = "СписокАдресовДляРассылки" Тогда
					МассивПочтовыхАдресов = ТекНастройки.Значение;
					СписокАдресовДляРассылки.ЗагрузитьЗначения(МассивПочтовыхАдресов);
				КонецЕсли;
				
				Если ТекНастройки.Ключ =  "ОбновлениеСпискаЗаказов" Тогда
					Объект.АвтоматическоеОбновлениеСписка = ТекНастройки.Значение;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	  КонецЕсли;	  	  
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиРассылкиКонструктор(Команда)	
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	
	Попытка
		СохранитьНастройки(ФормаПодразделения);
		ЗаписиОбновлены = Истина;
	Исключение
		ЗаписиОбновлены = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Ошибка во время сохранения настроек: '") + ОписаниеОшибки());
	КонецПопытки;
	
	Если ЗаписиОбновлены Тогда
		НастройкиСохраненыКонструктор = Истина;
		ОтключитьОбработчикОжидания("ПроверитьТекущийОбъектЭлементаФормы");
		ОповеститьПользователя(Команда.Действие);
	КонецЕсли; 
	
	Если Объект.АвтоматическоеОбновлениеСписка Тогда
		ПодключитьОбработчикОжидания("АвтообновлениеСпискаЗаказов", 300);
	Иначе
		ОтключитьОбработчикОжидания("АвтообновлениеСпискаЗаказов");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиРассылкиКонструктор(Команда)
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ПолучитьНастройкиИзХранилища(ФормаПодразделения);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтбораЦенПриИзменении(Элемент)
	НастройкиСохраненыМенеджер = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокАдресовДляРассылкиЗначениеПриИзменении(Элемент)
	НастройкиСохраненыМенеджер = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДопГруппаСтраницМенеджерПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Заголовок = "Настройки"  Тогда
		НастройкиСохраненыМенеджер = Истина;
	ИначеЕсли ТекущаяСтраница.Заголовок = "Форма согласования" И Не НастройкиСохраненыМенеджер Тогда
		ТекстВопроса = НСтр("ru = 'Настройки изменены, сохранить изменения?'");
		ЗаголовокВопроса = НСтр("ru = 'Настройки формы менеджера'");
		ФормаПодразделения = ИнформацияЭтаФормаПодразделения();

		ОповещениеНастроек = Новый ОписаниеОповещения("ПослеИзмененияНастроекПодтверждение", ЭтотОбъект, ФормаПодразделения);
		ПоказатьВопрос(ОповещениеНастроек, ТекстВопроса,РежимДиалогаВопрос.ДаНет, 60,, ЗаголовокВопроса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияНастроекПодтверждение(ОтветПользователя, ДополнительныеПараметры) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Нет Или ОтветПользователя = КодВозвратаДиалога.Таймаут Тогда		
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ФормаМенеджеров Тогда
		ТекущаяКоманда = "СохранитьНастрокиОтбораЦен"
	ИначеЕсли ДополнительныеПараметры.ФормаКонструкторов Тогда 		
		ТекущаяКоманда = "СохранитьНастройкиРассылкиКонструктор";
	ИначеЕсли ДополнительныеПараметры.ФормаСнабжения Тогда  
		ТекущаяКоманда = "СохранитьНастройкиРассылкиСнабжение";
	КонецЕсли;
	
	Попытка
		СохранитьНастройки(ДополнительныеПараметры);
		ОповеститьПользователя(ТекущаяКоманда);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка во время сохранения настроек: '") + ОписаниеОшибки());
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАдресовДляРассылкиКонструкторПриИзменении(Элемент)
	ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьТекущийОбъектЭлементаФормы", 1);
	НастройкиСохраненыКонструктор = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТекущийОбъектЭлементаФормы()
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	
	Если ФормаПодразделения.ФормаКонструкторов Тогда
		Если Не ЭтаФорма.ТекущийЭлемент.Имя = "СписокАдресовДляРассылки" И Не ЭтаФорма.ТекущийЭлемент.Имя = "АвтоматическоеОбновлениеСпискаКонструктор" И Не НастройкиСохраненыКонструктор Тогда			
			ЭтаФорма.ОтключитьОбработчикОжидания("ПроверитьТекущийОбъектЭлементаФормы");
			ТекстВопроса = НСтр("ru = 'Настройки изменены, сохранить изменения?'");
			ЗаголовокВопроса = НСтр("ru = 'Настройки формы конструктора'");
			ФормаПодразделения = ИнформацияЭтаФормаПодразделения();

			ОповещениеНастроек = Новый ОписаниеОповещения("ПослеИзмененияНастроекПодтверждение", ЭтотОбъект, ФормаПодразделения);
			ПоказатьВопрос(ОповещениеНастроек, ТекстВопроса,РежимДиалогаВопрос.ДаНет, 60,, ЗаголовокВопроса);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеНастроекРассылкиКонструктор(Команда)	
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	
	Если ФормаПодразделения.ФормаКонструкторов Тогда
		ТекущаяСтрока = Элементы.СписокАдресовДляРассылки.ТекущиеДанные;
		
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ЭлементКУдалению = СписокАдресовДляРассылки.НайтиПоЗначению(ТекущаяСтрока.Значение);
		
		Если ЭлементКУдалению <> Неопределено Тогда
			СписокАдресовДляРассылки.Удалить(ЭлементКУдалению);
			ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьТекущийОбъектЭлементаФормы", 10);
			НастройкиСохраненыКонструктор = Ложь;
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеОбновлениеСпискаМенеджерПриИзменении(Элемент)	
	НастройкиСохраненыМенеджер = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеОбновлениеСпискаКонструкторПриИзменении(Элемент)
	ЭтаФорма.ПодключитьОбработчикОжидания("ПроверитьТекущийОбъектЭлементаФормы", 1);
	НастройкиСохраненыКонструктор = Ложь;
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область РаботаНаСтраницеКонструкторовПриИзмененииПолейФормы

&НаСервере
Процедура СформироватьСписокЗаказовДляОтделаКонструкторов()
	
	ПричинаОтказа = "";
	Отказ = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Док_ЗаказКлиента.Назначение КАК Назначение,
	               |	Док_ЗаказКлиента.Ссылка КАК ЗаказаКлиента,
	               |	Док_ЗаказКлиента.Дата КАК ДатаЗаказа,
	               |	Док_ЗаказКлиента.Организация КАК Организация,
	               |	Док_ЗаказКлиента.СуммаДокумента КАК СуммаЗаказа,
	               |	Док_ЗаказКлиента.Статус КАК Статус
	               |ПОМЕСТИТЬ ВТ_ЗаказыКлиента
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК Док_ЗаказКлиента
	               |ГДЕ
	               |	НЕ Док_ЗаказКлиента.ПометкаУдаления
	               |	И НЕ Док_ЗаказКлиента.Назначение.ПометкаУдаления
	               |	И Док_ЗаказКлиента.Статус = &Статус
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.ЗаказКлиента, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК ЗаказКлиента,
	               |	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.СогласованоКонструктор, ЛОЖЬ) КАК СогласованоКонструктор
	               |ПОМЕСТИТЬ ВТ_РегистрСогласованныеЗаказы
	               |ИЗ
	               |	ВТ_ЗаказыКлиента КАК ВТ_ЗаказыКлиента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_СогласованиеСводнаяИнформация КАК ТТМ_СогласованиеСводнаяИнформация
	               |		ПО ВТ_ЗаказыКлиента.ЗаказаКлиента = ТТМ_СогласованиеСводнаяИнформация.ЗаказКлиента
	               |ГДЕ
	               |	(ТТМ_СогласованиеСводнаяИнформация.СогласованоКонструктор
	               |			ИЛИ ПОДСТРОКА(ТТМ_СогласованиеСводнаяИнформация.ПричинаОтказа, 0, 1) <> &ПричинаОтказа)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ЗаказыКлиента.Назначение КАК Назначение,
	               |	ВТ_ЗаказыКлиента.ЗаказаКлиента КАК ЗаказКлиента,
	               |	ВТ_ЗаказыКлиента.ДатаЗаказа КАК ДатаЗаказа,
	               |	ВТ_ЗаказыКлиента.Организация КАК Организация,
	               |	ВТ_ЗаказыКлиента.СуммаЗаказа КАК СуммаЗаказа,
	               |	ВТ_ЗаказыКлиента.Статус КАК Статус
	               |ИЗ
	               |	ВТ_РегистрСогласованныеЗаказы КАК ВТ_РегистрСогласованныеЗаказы,
	               |	ВТ_ЗаказыКлиента КАК ВТ_ЗаказыКлиента
	               |ГДЕ
	               |	НЕ ВТ_ЗаказыКлиента.ЗаказаКлиента В
	               |				(ВЫБРАТЬ
	               |					ВТ_РегистрСогласованныеЗаказы.ЗаказКлиента
	               |				ИЗ
	               |					ВТ_РегистрСогласованныеЗаказы
	               |				ГДЕ
	               |					НЕ ВТ_РегистрСогласованныеЗаказы.ЗаказКлиента.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	Запрос.УстановитьПараметр("ПричинаОтказа", ПричинаОтказа);
	
	ВыгруженнаяТаблица = Запрос.Выполнить().Выгрузить();	
	
	Если ВыгруженнаяТаблица.Количество() = 0 Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Док_ЗаказКлиента.Назначение КАК Назначение,
					|	Док_ЗаказКлиента.Ссылка КАК ЗаказКлиента,
					|	Док_ЗаказКлиента.Дата КАК ДатаЗаказа,
					|	Док_ЗаказКлиента.Организация КАК Организация,
					|	Док_ЗаказКлиента.СуммаДокумента КАК СуммаЗаказа,
					|	Док_ЗаказКлиента.Статус КАК Статус
					|ИЗ
					|	Документ.ЗаказКлиента КАК Док_ЗаказКлиента
					|ГДЕ
					|	НЕ Док_ЗаказКлиента.ПометкаУдаления
					|	И НЕ Док_ЗаказКлиента.Назначение.ПометкаУдаления
					|	И Док_ЗаказКлиента.Статус = &Статус";
		
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
		ВыгруженнаяТаблица = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	СписокЗаказовКонструктор.Очистить();
	ТоварыЗаказаСоСпецификацией.Очистить();	
	ЗначениеВРеквизитФормы(ВыгруженнаяТаблица, "СписокЗаказовКонструктор");
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокТоваровДляОтделаКБ(СтруктураОтбора, Организация, Знач ДетальныеЗаписи = Неопределено)
			
	ЭтоРоболабс = ИнформацияПоПроизводственномуПодразделению(Организация);
	ЗаказКлиента = СтруктураОтбора["ЗаказКлиента"];
	Статус = СтруктураОтбора["Статус"];
	
	Если ЭтоРоболабс Тогда
		ВыгруженнаяТаблица = ПолучитьСписокСпецификацийПоКомплектамДляРоболабс(ЗаказКлиента, Статус, Объект.Подразделение);
		НесколькоСвязанныхСпецификаций = ПолучитьСписокСпецификацийПоКомплектамДляРоболабс(ЗаказКлиента, Статус, Объект.Подразделение, Истина); 
	Иначе
		ВыгруженнаяТаблица = ПолучитьСписокСвязанныхСпецификацийДляТТМ(ЗаказКлиента, Статус, Объект.Подразделение);
		НесколькоСвязанныхСпецификаций = ПолучитьСписокСвязанныхСпецификацийДляТТМ(ЗаказКлиента, Статус, Объект.Подразделение, Истина);
	КонецЕсли;
	
	Если НесколькоСвязанныхСпецификаций.Количество() > 0 Тогда 
		ОбработатьСтрокиСНесколькимиСпецификациями(ВыгруженнаяТаблица, НесколькоСвязанныхСпецификаций, ЗаказКлиента, Статус, Объект.Подразделение);
	КонецЕсли;
	
	ОбъектСравнения = Новый СравнениеЗначений;
	ВыгруженнаяТаблица.Сортировать("Номенклатура", ОбъектСравнения);
	
	СчетчикСтрок = 1;
	ТоварыЗаказаСоСпецификацией.Очистить();		
	
	Для Каждого ТекДанные Из ВыгруженнаяТаблица Цикл
		НоваяСтрока = ТоварыЗаказаСоСпецификацией.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
		НоваяСтрока.НомерСтроки = СчетчикСтрок;
		
		СчетчикСтрок = СчетчикСтрок + 1; 
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовКонструкторПриАктивизацииСтроки(Элемент)
	ВыбраннаяСтрока = Элемент.ТекущиеДанные;
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		ОбновитьСписокЗаказовДляКонструкторов(ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаСпискаЗаказовСоСпецификацией(СтруктураОтбора)	
	МассивНайденныхСтрок = ТоварыЗаказаСоСпецификацией.НайтиСтроки(СтруктураОтбора);
    ЕстьСпецификацияБезУстановленнойДаты = Ложь;
	
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
		ЕстьСпецификацияБезУстановленнойДаты = Истина;
	КонецЕсли;
	
	Возврат ЕстьСпецификацияБезУстановленнойДаты;
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокЗаказовДляКонструкторов(ВыбраннаяСтрока)
	
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	СтруктураОтбора = ПолучитьСтруктуруОтбораПриАктивизацииСтроки(ВыбраннаяСтрока, ФормаПодразделения);
	ОчиститьСообщения();
	
	Если ФормаПодразделения.ФормаКонструкторов Тогда
		ПолучитьСписокТоваровДляОтделаКБ(СтруктураОтбора, ВыбраннаяСтрока.Организация);
		ЕстьСпецификацияБезУстановленнойДаты = ПроверкаСпискаЗаказовСоСпецификацией(СтруктураОтбора);
				
		Если ЕстьСпецификацияБезУстановленнойДаты Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Есть спецификации без установленной даты'"),, 
				"ТоварыЗаказаСоСпецификацией");
		КонецЕсли;
		
		Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.ПустаяСсылка");
		ПричинаОтказа = "";
		Отказ = Ложь;
		
		СтруктураОтбора.Вставить("Назначение", ВыбраннаяСтрока.Назначение);
		УсловныйОтборВидимости(СтруктураОтбора, ФормаПодразделения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСпецификацийПоКомплектамДляРоболабс(ЗаказКлиента, Статус, Подразделение, Знач ПолучитьДубли = Ложь)
	
	ЗначенияДопСведений = ПолучитьСписокДопСведенийНоменклатуры(ЗаказКлиента);
	ДопСвойствоАктуализации = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Требуется актуализация");
	
	// Передать в запрос временную таблицу в виде параметра для поиска связанных комплектов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияДопСведений.ВладелецСвойств КАК ВладелецСвойств,
	               |	ЗначенияДопСведений.Значение КАК Значение,
	               |	ЗначенияДопСведений.ТекстоваяСтрока КАК ТекстоваяСтрока,
	               |	ЗначенияДопСведений.Представление КАК Представление
	               |ПОМЕСТИТЬ ВТ_ЗначенияДопСведений
	               |ИЗ
	               |	&ЗначенияДопСведений КАК ЗначенияДопСведений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Комплекты,
	               |	ВТ_ЗначенияДопСведений.ВладелецСвойств КАК ВладелецСвойств,
	               |	ВТ_ЗначенияДопСведений.Значение КАК Значение,
	               |	ВТ_ЗначенияДопСведений.ТекстоваяСтрока КАК ТекстоваяСтрока,
	               |	ВТ_ЗначенияДопСведений.Представление КАК Представление
	               |ПОМЕСТИТЬ ВТ_Комплекты
	               |ИЗ
	               |	ВТ_ЗначенияДопСведений КАК ВТ_ЗначенияДопСведений,
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.КодДляПоиска В (ВТ_ЗначенияДопСведений.Значение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента КАК ЗаказКлиента,
	               |	ТТМ_СогласованиеЗаказовКонструктор.Изделие КАК Изделие,
	               |	ВЫБОР
	               |		КОГДА ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования = &СтатусСогласования
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Подтверждено
	               |ПОМЕСТИТЬ ВТ_РегистрТТМПроцессПроизводства
	               |ИЗ
	               |	РегистрСведений.ТТМ_СогласованиеЗаказовКонструктор КАК ТТМ_СогласованиеЗаказовКонструктор
	               |ГДЕ
	               |	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента = &ЗаказКлиентаСсылка
	               |	И ТТМ_СогласованиеЗаказовКонструктор.Подразделение = &Подразделение
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_СогласованиеЗаказовКонструктор.Изделие,
	               |	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента,
	               |	ВЫБОР
	               |		КОГДА ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования = &СтатусСогласования
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ) КАК Подтверждено,
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ ВТ_ПодтвержденныеТоварыИзЗаказа
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрТТМПроцессПроизводства КАК ВТ_РегистрТТМПроцессПроизводства
	               |		ПО ЗаказКлиентаТовары.Ссылка = ВТ_РегистрТТМПроцессПроизводства.ЗаказКлиента
	               |			И ЗаказКлиентаТовары.Номенклатура = ВТ_РегистрТТМПроцессПроизводства.Изделие
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка.Статус = &СтатусЗаказа
	               |	И ЗаказКлиентаТовары.Ссылка = &ЗаказКлиентаСсылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПодтвержденныеТоварыИзЗаказа.Подтверждено КАК Подтверждено,
	               |	ВТ_ПодтвержденныеТоварыИзЗаказа.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_ПодтвержденныеТоварыИзЗаказа.Номенклатура КАК Номенклатура,
	               |	ВТ_ПодтвержденныеТоварыИзЗаказа.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ВТ_Комплекты.Комплекты КАК Комплекты,
	               |	ВТ_Комплекты.Значение КАК Значение,
	               |	ВТ_Комплекты.ТекстоваяСтрока КАК ТекстоваяСтрока,
	               |	ВТ_Комплекты.Представление КАК Представление
	               |ПОМЕСТИТЬ ВТ_СвязанныеКомплекты
	               |ИЗ
	               |	ВТ_Комплекты КАК ВТ_Комплекты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодтвержденныеТоварыИзЗаказа КАК ВТ_ПодтвержденныеТоварыИзЗаказа
	               |		ПО ВТ_Комплекты.ВладелецСвойств = ВТ_ПодтвержденныеТоварыИзЗаказа.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_РегистрТТМПроцессПроизводства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвязанныеКомплекты.Подтверждено КАК Подтверждено,
	               |	ВТ_СвязанныеКомплекты.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_СвязанныеКомплекты.Номенклатура КАК Номенклатура,
	               |	ВТ_СвязанныеКомплекты.КоличествоУпаковок КАК Количество,
	               |	ВТ_СвязанныеКомплекты.Комплекты КАК Комплекты,
	               |	ЕСТЬNULL(РесурсныеСпецификации.Ссылка, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК Спецификация,
	               |	ЕСТЬNULL(РесурсныеСпецификации.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.ПустаяСсылка)) КАК Статус,
	               |	ЕСТЬNULL(РесурсныеСпецификации.НачалоДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоДействия
	               |ПОМЕСТИТЬ ВТ_СвязанныеСпецификации
	               |ИЗ
	               |	ВТ_СвязанныеКомплекты КАК ВТ_СвязанныеКомплекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	               |		ПО ВТ_СвязанныеКомплекты.Комплекты = РесурсныеСпецификации.ОсновноеИзделиеНоменклатура
	               |ГДЕ
	               |	РесурсныеСпецификации.Статус <> &СтатусСпецификации
	               |	И НЕ РесурсныеСпецификации.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ПодтвержденныеТоварыИзЗаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвязанныеСпецификации.Подтверждено КАК Подтверждено,
	               |	ВТ_СвязанныеСпецификации.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_СвязанныеСпецификации.Номенклатура КАК Номенклатура,
	               |	ВТ_СвязанныеСпецификации.Количество КАК Количество,
	               |	ВТ_СвязанныеСпецификации.Спецификация КАК Спецификация,
	               |	ВТ_СвязанныеСпецификации.Статус КАК Статус,
	               |	ВТ_СвязанныеСпецификации.НачалоДействия КАК НачалоДействия,
	               |	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.Исполнитель, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Исполнитель,
	               |	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиРазработки, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиРазработки,
	               |	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиПереноса, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиПереноса
	               |ПОМЕСТИТЬ ВТ_ИсполнителиСпецификаций
	               |ИЗ
	               |	ВТ_СвязанныеСпецификации КАК ВТ_СвязанныеСпецификации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_ИсполнителиСпецификаций КАК ТТМ_ИсполнителиСпецификаций
	               |		ПО ВТ_СвязанныеСпецификации.ЗаказКлиента = ТТМ_ИсполнителиСпецификаций.ЗаказКлиента
	               |			И ВТ_СвязанныеСпецификации.Номенклатура = ТТМ_ИсполнителиСпецификаций.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_СвязанныеСпецификации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИсполнителиСпецификаций.Номенклатура КАК Номенклатура,
	               |	КОЛИЧЕСТВО(*) КАК ПоискДублей,
	               |	&ЗаказКлиентаСсылка КАК ЗаказКлиента
	               |ПОМЕСТИТЬ ВТ_ОтборНаДубли
	               |ИЗ
	               |	ВТ_ИсполнителиСпецификаций КАК ВТ_ИсполнителиСпецификаций
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ИсполнителиСпецификаций.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИсполнителиСпецификаций.Подтверждено КАК Подтверждено,
	               |	ВТ_ИсполнителиСпецификаций.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_ИсполнителиСпецификаций.Номенклатура КАК Номенклатура,
	               |	ВТ_ИсполнителиСпецификаций.Количество КАК Количество,
	               |	ВТ_ИсполнителиСпецификаций.Спецификация КАК Спецификация,
	               |	ВТ_ИсполнителиСпецификаций.Статус КАК Статус,
	               |	ВТ_ИсполнителиСпецификаций.НачалоДействия КАК НачалоДействия,
	               |	ВТ_ИсполнителиСпецификаций.Исполнитель КАК Исполнитель,
	               |	ВТ_ИсполнителиСпецификаций.СрокиРазработки КАК СрокиРазработки,
	               |	ВТ_ИсполнителиСпецификаций.СрокиПереноса КАК СрокиПереноса,
	               |	ВЫБОР
	               |		КОГДА ВТ_ОтборНаДубли.ПоискДублей > 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоДубль
	               |ПОМЕСТИТЬ ВТ_ИтоговыеДанные
	               |ИЗ
	               |	ВТ_ОтборНаДубли КАК ВТ_ОтборНаДубли
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсполнителиСпецификаций КАК ВТ_ИсполнителиСпецификаций
	               |		ПО (ВТ_ИсполнителиСпецификаций.ЗаказКлиента = ВТ_ОтборНаДубли.ЗаказКлиента
	               |				И ВТ_ИсполнителиСпецификаций.Номенклатура = ВТ_ОтборНаДубли.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительныеСведения.Значение КАК ТребуетсяАктуализация,
	               |	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.РесурсныеСпецификации) КАК Спецификация
	               |ПОМЕСТИТЬ ВТ_ДопСведенияАктуализация
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДопСвойствоАктуализации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИтоговыеДанные.Подтверждено КАК Подтверждено,
	               |	ВТ_ИтоговыеДанные.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ВТ_ИтоговыеДанные.Количество КАК Количество,
	               |	ВТ_ИтоговыеДанные.Спецификация КАК Спецификация,
	               |	ВТ_ИтоговыеДанные.Статус КАК Статус,
	               |	ВТ_ИтоговыеДанные.НачалоДействия КАК НачалоДействия,
	               |	ВТ_ИтоговыеДанные.Исполнитель КАК Исполнитель,
	               |	ВТ_ИтоговыеДанные.СрокиРазработки КАК СрокиРазработки,
	               |	ВТ_ИтоговыеДанные.СрокиПереноса КАК СрокиПереноса,
	               |	ЕСТЬNULL(ВТ_ДопСведенияАктуализация.ТребуетсяАктуализация, ЛОЖЬ) КАК ТребуетсяАктуализация
	               |ИЗ
	               |	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопСведенияАктуализация КАК ВТ_ДопСведенияАктуализация
	               |		ПО (ВТ_ДопСведенияАктуализация.Спецификация = ВТ_ИтоговыеДанные.Спецификация)
	               |ГДЕ
	               |	ВТ_ИтоговыеДанные.ЭтоДубль = &ЭтоДубль";
	
	Запрос.УстановитьПараметр("ЗначенияДопСведений", ЗначенияДопСведений);
	Запрос.УстановитьПараметр("ЗаказКлиентаСсылка", ЗаказКлиента);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("СтатусСпецификации", Статус);
	Запрос.УстановитьПараметр("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	Запрос.УстановитьПараметр("СтатусСогласования", Перечисления.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано);
	Запрос.УстановитьПараметр("ДопСвойствоАктуализации", ДопСвойствоАктуализации); 
	Запрос.УстановитьПараметр("ЭтоДубль", ПолучитьДубли); 
	
	ВыгруженнаяТаблица = Запрос.Выполнить().Выгрузить();	
	Возврат ВыгруженнаяТаблица;
КонецФункции

&НаСервереБезКонтекста
функция ПолучитьСписокСвязанныхСпецификацийДляТТМ(ЗаказКлиента, Статус, Подразделение, Знач ПолучитьДубли = Ложь)
	
	ДопСвойствоАктуализации = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Требуется актуализация");
	
	Запрос = Новый Запрос;		
	Запрос.Текст = "ВЫБРАТЬ
				|	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента КАК ЗаказКлиента,
				|	ТТМ_СогласованиеЗаказовКонструктор.Изделие КАК Изделие,
				|	ВЫБОР
				|		КОГДА ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования = &СтатусСогласования
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК Подтверждено
				|ПОМЕСТИТЬ ВТ_РегистрТТМПроцессПроизводства
				|ИЗ
				|	РегистрСведений.ТТМ_СогласованиеЗаказовКонструктор КАК ТТМ_СогласованиеЗаказовКонструктор
				|ГДЕ
				|	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента = &ЗаказКлиентаСсылка
				|	И ТТМ_СогласованиеЗаказовКонструктор.Подразделение = &Подразделение
				|
				|СГРУППИРОВАТЬ ПО
				|	ТТМ_СогласованиеЗаказовКонструктор.Изделие,
				|	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента,
				|	ВЫБОР
				|		КОГДА ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования = &СтатусСогласования
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
				|	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ) КАК Подтверждено,
				|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
				|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
				|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоУпаковок
				|ПОМЕСТИТЬ ВТ_ПодтвержденныеТоварыИзЗаказа
				|ИЗ
				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрТТМПроцессПроизводства КАК ВТ_РегистрТТМПроцессПроизводства
				|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_РегистрТТМПроцессПроизводства.ЗаказКлиента
				|			И ЗаказКлиентаТовары.Номенклатура = ВТ_РегистрТТМПроцессПроизводства.Изделие
				|ГДЕ
				|	ЗаказКлиентаТовары.Ссылка.Статус = &СтатусЗаказа
				|	И ЗаказКлиентаТовары.Ссылка = &ЗаказКлиентаСсылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказКлиентаТовары.Номенклатура,
				|	ЗаказКлиентаТовары.Ссылка,
				|	ЗаказКлиентаТовары.НомерСтроки,
				|	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТ_ПодтвержденныеТоварыИзЗаказа.Номенклатура КАК Номенклатура,
				|	ЕСТЬNULL(РесурсныеСпецификации.Ссылка, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК Спецификация,
				|	ЕСТЬNULL(РесурсныеСпецификации.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.ПустаяСсылка)) КАК Статус,
				|	ЕСТЬNULL(РесурсныеСпецификации.НачалоДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоДействия,
				|	ВТ_ПодтвержденныеТоварыИзЗаказа.НомерСтроки КАК НомерСтроки,
				|	ВТ_ПодтвержденныеТоварыИзЗаказа.Подтверждено КАК Подтверждено,
				|	ВТ_ПодтвержденныеТоварыИзЗаказа.ЗаказКлиента КАК ЗаказКлиента,
				|	ВТ_ПодтвержденныеТоварыИзЗаказа.КоличествоУпаковок КАК Количество
				|ПОМЕСТИТЬ ВТ_СвязанныеСпецификации
				|ИЗ
				|	ВТ_ПодтвержденныеТоварыИзЗаказа КАК ВТ_ПодтвержденныеТоварыИзЗаказа
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
				|		ПО ВТ_ПодтвержденныеТоварыИзЗаказа.Номенклатура = РесурсныеСпецификации.ОсновноеИзделиеНоменклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТ_ПодтвержденныеТоварыИзЗаказа
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_СвязанныеСпецификации.Номенклатура КАК Номенклатура,
				|	КОЛИЧЕСТВО(*) КАК СчетчикДублей
				|ПОМЕСТИТЬ ВТ_ПроверкаНаДубли
				|ИЗ
				|	ВТ_СвязанныеСпецификации КАК ВТ_СвязанныеСпецификации
				|
				|СГРУППИРОВАТЬ ПО
				|	ВТ_СвязанныеСпецификации.Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_ПроверкаНаДубли.Номенклатура КАК Номенклатура,
				|	ВЫБОР
				|		КОГДА ВТ_ПроверкаНаДубли.СчетчикДублей > 1
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ЭтоДубль
				|ПОМЕСТИТЬ ВТ_НайденныеДубли
				|ИЗ
				|	ВТ_ПроверкаНаДубли КАК ВТ_ПроверкаНаДубли
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТ_ПроверкаНаДубли
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_СвязанныеСпецификации.Номенклатура КАК Номенклатура,
				|	ВТ_СвязанныеСпецификации.Спецификация КАК Спецификация,
				|	ВТ_СвязанныеСпецификации.Статус КАК Статус,
				|	ВТ_СвязанныеСпецификации.НачалоДействия КАК НачалоДействия,
				|	ВТ_СвязанныеСпецификации.НомерСтроки КАК НомерСтроки,
				|	ВТ_СвязанныеСпецификации.Подтверждено КАК Подтверждено,
				|	ВТ_СвязанныеСпецификации.ЗаказКлиента КАК ЗаказКлиента,
				|	ВТ_СвязанныеСпецификации.Количество КАК Количество,
				|	ВТ_НайденныеДубли.ЭтоДубль КАК ЭтоДубль
				|ПОМЕСТИТЬ ВТ_СпецификацииБезПовторяющихся
				|ИЗ
				|	ВТ_СвязанныеСпецификации КАК ВТ_СвязанныеСпецификации
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НайденныеДубли КАК ВТ_НайденныеДубли
				|		ПО ВТ_СвязанныеСпецификации.Номенклатура = ВТ_НайденныеДубли.Номенклатура
				|
				|СГРУППИРОВАТЬ ПО
				|	ВТ_СвязанныеСпецификации.Номенклатура,
				|	ВТ_СвязанныеСпецификации.Спецификация,
				|	ВТ_СвязанныеСпецификации.Статус,
				|	ВТ_СвязанныеСпецификации.НачалоДействия,
				|	ВТ_СвязанныеСпецификации.НомерСтроки,
				|	ВТ_СвязанныеСпецификации.Подтверждено,
				|	ВТ_СвязанныеСпецификации.ЗаказКлиента,
				|	ВТ_СвязанныеСпецификации.Количество,
				|	ВТ_НайденныеДубли.ЭтоДубль
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_СпецификацииБезПовторяющихся.Номенклатура КАК Номенклатура,
				|	ВТ_СпецификацииБезПовторяющихся.Спецификация КАК Спецификация,
				|	ВТ_СпецификацииБезПовторяющихся.Статус КАК Статус,
				|	ВТ_СпецификацииБезПовторяющихся.НачалоДействия КАК НачалоДействия,
				|	ВТ_СпецификацииБезПовторяющихся.НомерСтроки КАК НомерСтроки,
				|	ВТ_СпецификацииБезПовторяющихся.Подтверждено КАК Подтверждено,
				|	ВТ_СпецификацииБезПовторяющихся.ЗаказКлиента КАК ЗаказКлиента,
				|	ВТ_СпецификацииБезПовторяющихся.Количество КАК Количество,
				|	ВТ_СпецификацииБезПовторяющихся.ЭтоДубль КАК ЭтоДубль,
				|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.Исполнитель, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК Исполнитель,
				|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиРазработки, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиРазработки,
				|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиПереноса, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиПереноса
				|ПОМЕСТИТЬ ВТ_ИсполнителиСпецификаций
				|ИЗ
				|	ВТ_СпецификацииБезПовторяющихся КАК ВТ_СпецификацииБезПовторяющихся
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_ИсполнителиСпецификаций КАК ТТМ_ИсполнителиСпецификаций
				|		ПО (ВТ_СпецификацииБезПовторяющихся.ЗаказКлиента = ТТМ_ИсполнителиСпецификаций.ЗаказКлиента
				|				И ВТ_СпецификацииБезПовторяющихся.Номенклатура = ТТМ_ИсполнителиСпецификаций.Номенклатура)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДополнительныеСведения.Значение КАК ТребуетсяАктуализация,
				|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.РесурсныеСпецификации) КАК Спецификация
				|ПОМЕСТИТЬ ВТ_ДопСведенияАктуализация
				|ИЗ
				|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
				|ГДЕ
				|	ДополнительныеСведения.Свойство = &ДопСвойствоАктуализации
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_ИсполнителиСпецификаций.Подтверждено КАК Подтверждено,
				|	ВТ_ИсполнителиСпецификаций.ЗаказКлиента КАК ЗаказКлиента,
				|	ВТ_ИсполнителиСпецификаций.Номенклатура КАК Номенклатура,
				|	ВТ_ИсполнителиСпецификаций.Количество КАК Количество,
				|	ВТ_ИсполнителиСпецификаций.Спецификация КАК Спецификация,
				|	ВТ_ИсполнителиСпецификаций.НачалоДействия КАК НачалоДействия,
				|	ВТ_ИсполнителиСпецификаций.Статус КАК Статус,
				|	ЕСТЬNULL(ВТ_ДопСведенияАктуализация.ТребуетсяАктуализация, ЛОЖЬ) КАК ТребуетсяАктуализация,
				|	ВТ_ИсполнителиСпецификаций.Исполнитель КАК Исполнитель,
				|	ВТ_ИсполнителиСпецификаций.СрокиРазработки КАК СрокиРазработки,
				|	ВТ_ИсполнителиСпецификаций.СрокиПереноса КАК СрокиПереноса
				|ИЗ
				|	ВТ_ИсполнителиСпецификаций КАК ВТ_ИсполнителиСпецификаций
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДопСведенияАктуализация КАК ВТ_ДопСведенияАктуализация
				|		ПО (ВТ_ИсполнителиСпецификаций.Спецификация = ВТ_ДопСведенияАктуализация.Спецификация)
				|ГДЕ
				|	ВТ_ИсполнителиСпецификаций.ЭтоДубль = &ЭтоДубль";
	
	Запрос.УстановитьПараметр("ЗаказКлиентаСсылка", ЗаказКлиента);
	Запрос.УстановитьПараметр("СтатусСпецификации", Статус);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("СтатусСогласования", Перечисления.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано);
	Запрос.УстановитьПараметр("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	Запрос.УстановитьПараметр("ДопСвойствоАктуализации", ДопСвойствоАктуализации);
	Запрос.УстановитьПараметр("ЭтоДубль", ПолучитьДубли);
	
	ВыгруженнаяТаблица = Запрос.Выполнить().Выгрузить();
    Возврат ВыгруженнаяТаблица;
КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьСтрокиСНесколькимиСпецификациями(ВыгруженнаяТаблица, НесколькоСвязанныхСпецификаций, ЗаказКлиента, Статус, Подразделение)
	
	УникальныеЗначения = Новый ТаблицаЗначений;
	УникальныеЗначения.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	УникальныеЗначения.Колонки.Добавить("Исполнитель", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	УникальныеЗначения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));
	УникальныеЗначения.Колонки.Добавить("НачалоДействия", Новый ОписаниеТипов("Дата"));		
	УникальныеЗначения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	УникальныеЗначения.Колонки.Добавить("Подтверждено", Новый ОписаниеТипов("Булево"));
	УникальныеЗначения.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	УникальныеЗначения.Колонки.Добавить("СрокиПереноса", Новый ОписаниеТипов("Дата"));
	УникальныеЗначения.Колонки.Добавить("СрокиРазработки", Новый ОписаниеТипов("Дата"));
	УникальныеЗначения.Колонки.Добавить("Статус", Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыСпецификаций"));
		
	Для Каждого ТекДанные Из НесколькоСвязанныхСпецификаций Цикл
		ПоискУникальных = УникальныеЗначения.Найти(ТекДанные.Номенклатура, "Номенклатура");
		
		Если ПоискУникальных = Неопределено Тогда
			НоваяСтрока = УникальныеЗначения.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные); 
						
			//Заполнить пустыми ссылками, где есть дубли для выбора спецификации из списка доступных			
			НоваяСтрока.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
			НоваяСтрока.Статус = Перечисления.СтатусыСпецификаций.ПустаяСсылка();
			НоваяСтрока.Исполнитель = Справочники.Пользователи.ПустаяСсылка();
			НоваяСтрока.НачалоДействия = Дата(1, 1, 1);
			НоваяСтрока.СрокиРазработки = Дата(1, 1, 1);
			НоваяСтрока.СрокиПереноса = Дата(1, 1, 1);
		КонецЕсли;	
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ВыгруженнаяТаблица.ЗаказКлиента КАК ЗаказКлиента,
					|	ВыгруженнаяТаблица.Исполнитель КАК Исполнитель,
					|	ВыгруженнаяТаблица.Количество КАК Количество,
					|	ВыгруженнаяТаблица.НачалоДействия КАК НачалоДействия,
					|	ВыгруженнаяТаблица.Номенклатура КАК Номенклатура,
					|	ВыгруженнаяТаблица.Подтверждено КАК Подтверждено,
					|	ВыгруженнаяТаблица.Спецификация КАК Спецификация,
					|	ВыгруженнаяТаблица.СрокиПереноса КАК СрокиПереноса,
					|	ВыгруженнаяТаблица.СрокиРазработки КАК СрокиРазработки,
					|	ВыгруженнаяТаблица.Статус КАК Статус
					|ПОМЕСТИТЬ ВТ_ВыгруженныеДанные
					|ИЗ
					|	&ВыгруженнаяТаблица КАК ВыгруженнаяТаблица
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ВыгруженныеДанные.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_ВыгруженныеДанные.Количество КАК Количество,
					|	ВТ_ВыгруженныеДанные.Номенклатура КАК Номенклатура,
					|	ВТ_ВыгруженныеДанные.Подтверждено КАК Подтверждено,
					|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК Спецификация,
					|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиПереноса, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиПереноса,
					|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиРазработки, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиРазработки,
					|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.ПустаяСсылка)) КАК Статус,
					|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.Исполнитель, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Исполнитель,
					|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.НачалоДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоДействия
					|ПОМЕСТИТЬ ВТ_СвязанныеСпецификации
					|ИЗ
					|	ВТ_ВыгруженныеДанные КАК ВТ_ВыгруженныеДанные
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_ИсполнителиСпецификаций КАК ТТМ_ИсполнителиСпецификаций
					|		ПО (ВТ_ВыгруженныеДанные.Номенклатура = ТТМ_ИсполнителиСпецификаций.Номенклатура)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента КАК ЗаказКлиента,
					|	ТТМ_СогласованиеЗаказовКонструктор.Изделие КАК Изделие,
					|	ВЫБОР
					|		КОГДА ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования = &СтатусСогласования
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК Подтверждено
					|ПОМЕСТИТЬ ВТ_РегистрТТМПроцессПроизводства
					|ИЗ
					|	РегистрСведений.ТТМ_СогласованиеЗаказовКонструктор КАК ТТМ_СогласованиеЗаказовКонструктор
					|ГДЕ
					|	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента = &ЗаказКлиентаСсылка
					|	И ТТМ_СогласованиеЗаказовКонструктор.Подразделение = &Подразделение
					|
					|СГРУППИРОВАТЬ ПО
					|	ТТМ_СогласованиеЗаказовКонструктор.Изделие,
					|	ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента,
					|	ВЫБОР
					|		КОГДА ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования = &СтатусСогласования
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_СвязанныеСпецификации.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_СвязанныеСпецификации.Количество КАК Количество,
					|	ВТ_СвязанныеСпецификации.Номенклатура КАК Номенклатура,
					|	ВТ_СвязанныеСпецификации.Спецификация КАК Спецификация,
					|	ВТ_СвязанныеСпецификации.СрокиПереноса КАК СрокиПереноса,
					|	ВТ_СвязанныеСпецификации.СрокиРазработки КАК СрокиРазработки,
					|	ВТ_СвязанныеСпецификации.Статус КАК Статус,
					|	ВТ_СвязанныеСпецификации.Исполнитель КАК Исполнитель,
					|	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ) КАК Подтверждено,
					|	ВТ_СвязанныеСпецификации.НачалоДействия КАК НачалоДействия
					|ИЗ
					|	ВТ_СвязанныеСпецификации КАК ВТ_СвязанныеСпецификации
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрТТМПроцессПроизводства КАК ВТ_РегистрТТМПроцессПроизводства
					|		ПО (ВТ_СвязанныеСпецификации.ЗаказКлиента = ВТ_РегистрТТМПроцессПроизводства.ЗаказКлиента)
					|			И (ВТ_СвязанныеСпецификации.Номенклатура = ВТ_РегистрТТМПроцессПроизводства.Изделие)";
	
	Запрос.УстановитьПараметр("ВыгруженнаяТаблица", УникальныеЗначения);
	Запрос.УстановитьПараметр("ЗаказКлиентаСсылка", ЗаказКлиента);
	Запрос.УстановитьПараметр("СтатусСогласования", ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано"));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	ПриоритетнаяСпецификация = Запрос.Выполнить().Выгрузить();
	 
	Для Каждого НайденныйТовар Из ПриоритетнаяСпецификация Цикл
		НоваяСтрока = ВыгруженнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныйТовар); 
	КонецЦикла; 
	 
	Возврат ВыгруженнаяТаблица;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСвязанныеДанныеСТекущейСпецификацией(ЗаказКлиента, Спецификация)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РесурсныеСпецификации.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификации.Статус КАК Статус,
	               |	РесурсныеСпецификации.НачалоДействия КАК НачалоДействия,
	               |	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_СвязанныеСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
	               |ГДЕ
	               |	НЕ РесурсныеСпецификации.ПометкаУдаления
	               |	И РесурсныеСпецификации.Ссылка = &СвязаннаяСпецификация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТМ_ИсполнителиСпецификаций.Исполнитель КАК Исполнитель,
	               |	ТТМ_ИсполнителиСпецификаций.СрокиРазработки КАК СрокиРазработки,
	               |	ТТМ_ИсполнителиСпецификаций.СрокиПереноса КАК СрокиПереноса,
	               |	ТТМ_ИсполнителиСпецификаций.ЗаказКлиента КАК ЗаказКлиента,
	               |	ТТМ_ИсполнителиСпецификаций.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_ИсполнителиСпецификаций
	               |ИЗ
	               |	РегистрСведений.ТТМ_ИсполнителиСпецификаций КАК ТТМ_ИсполнителиСпецификаций
	               |ГДЕ
	               |	ТТМ_ИсполнителиСпецификаций.ЗаказКлиента = &ЗаказОтбора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвязанныеСпецификации.Спецификация КАК Спецификация,
	               |	ВТ_СвязанныеСпецификации.Статус КАК Статус,
	               |	ВТ_СвязанныеСпецификации.НачалоДействия КАК НачалоДействия,
	               |	ВТ_СвязанныеСпецификации.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ_ИсполнителиСпецификаций.Исполнитель, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Исполнитель,
	               |	ЕСТЬNULL(ВТ_ИсполнителиСпецификаций.СрокиРазработки, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиРазработки,
	               |	ЕСТЬNULL(ВТ_ИсполнителиСпецификаций.СрокиПереноса, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиПереноса,
	               |	ЕСТЬNULL(ВТ_ИсполнителиСпецификаций.ЗаказКлиента, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК ЗаказКлиента
	               |ПОМЕСТИТЬ ВТ_ИтоговыеДанные
	               |ИЗ
	               |	ВТ_СвязанныеСпецификации КАК ВТ_СвязанныеСпецификации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсполнителиСпецификаций КАК ВТ_ИсполнителиСпецификаций
	               |		ПО ВТ_СвязанныеСпецификации.Номенклатура = ВТ_ИсполнителиСпецификаций.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ИсполнителиСпецификаций
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ВТ_ИтоговыеДанные.ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	               |			ТОГДА &ЗаказОтбора
	               |		ИНАЧЕ ВТ_ИтоговыеДанные.ЗаказКлиента
	               |	КОНЕЦ КАК ЗаказКлиента,
	               |	ВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ВТ_ИтоговыеДанные.Спецификация КАК Спецификация,
	               |	ВТ_ИтоговыеДанные.Статус КАК Статус,
	               |	ВТ_ИтоговыеДанные.НачалоДействия КАК НачалоДействия,
	               |	ВТ_ИтоговыеДанные.Исполнитель КАК Исполнитель,
	               |	ВТ_ИтоговыеДанные.СрокиРазработки КАК СрокиРазработки,
	               |	ВТ_ИтоговыеДанные.СрокиПереноса КАК СрокиПереноса
	               |ИЗ
	               |	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные";
	  
	Запрос.УстановитьПараметр("ЗаказОтбора", ЗаказКлиента);
	Запрос.УстановитьПараметр("СвязаннаяСпецификация", Спецификация);		
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвязанныеДанные = ОбменДаннымиСлужебный.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	Возврат СвязанныеДанные;
КонецФункции

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейСпецификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанныеЗаказа = Элементы.СписокЗаказовКонструктор.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанныеЗаказа.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для данного заказа не определена организация'"),, "СписокЗаказовКонструктор");
		Возврат;
	КонецЕсли;
	
	ЭтоРоболабс = ИнформацияПоПроизводственномуПодразделению(ТекущиеДанныеЗаказа.Организация);
	ВыбраннаяСтрока = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
	
	Если ЭтоРоболабс Тогда
		СвязанныКомплект = ОтборСвязанныхКомплектовРоболабс(ВыбраннаяСтрока.ЗаказКлиента);
		
		Если СвязанныКомплект = Неопределено Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не найден связанный комплект для текущей номенклатуры РОБОЛАБС'"),, "СписокЗаказовКонструктор");
			Возврат;
		КонецЕсли;
		
		ПараметрыСвязи = Новый Структура;
		ПараметрыСвязи.Вставить("Номенклатура", СвязанныКомплект); 
	Иначе	
		ПараметрыСвязи = Новый Структура;
		ПараметрыСвязи.Вставить("Номенклатура", ВыбраннаяСтрока.Номенклатура); 
	КонецЕсли;
	
	ФормаПримененияНоменклатуры = ПолучитьФорму("ОбщаяФорма.ПрименениеНоменклатурыВПроизводстве", ПараметрыСвязи);
	КоллекцияСвязанныхСпецификаций = ФормаПримененияНоменклатуры.УправлениеСпецификациями;
	
	КоллекцияСоответствий = Новый Соответствие;
	
	Для Каждого ТекДанные Из КоллекцияСвязанныхСпецификаций Цикл
		КоллекцияСоответствий.Вставить(ТекДанные.Спецификация, ТекДанные.Статус); 	
	КонецЦикла;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ПараметрыСвязи", ПараметрыСвязи);
	ПараметрыФормыВыбора.Вставить("КоллекцияСоответствий", КоллекцияСоответствий);
	ОткрытьФормуМодально("Обработка.ТТМ_АРМ_ПроцессСогласования.Форма.ФормаВыбораСпецификаций", ПараметрыФормыВыбора);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнформацияПоПроизводственномуПодразделению(Организация)
	
	КоличествоВхождений = СтрЧислоВхождений(НРег(Организация.Наименование), "роболабс"); 
	ЭтоРоболабс = ?(КоличествоВхождений > 0, Истина, Ложь);
	
	Возврат ЭтоРоболабс;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокДопСведенийНоменклатуры(ЗаказКлиента)
	
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого ТекТовар Из ЗаказКлиента.Товары Цикл
		МассивНоменклатуры.Добавить(ТекТовар.Номенклатура);	
	КонецЦикла;
	
	ДопРеквизитСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Код комплекта ТТМ");
	МассивДопСвойств = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДопРеквизитСсылка);			
	ЗначенияДопСвойств = УправлениеСвойствами.ЗначенияСвойств(МассивНоменклатуры, Ложь, Истина, МассивДопСвойств, "ru");
	
	ЗначенияДопСведений = Новый ТаблицаЗначений;
	ЗначенияДопСведений.Колонки.Добавить("ВладелецСвойств", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ЗначенияДопСведений.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(11, ДопустимаяДлина.Фиксированная)));
	ЗначенияДопСведений.Колонки.Добавить("ТекстоваяСтрока", Новый ОписаниеТипов("Строка"));
	ЗначенияДопСведений.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	Для Каждого ДопСвойство Из ЗначенияДопСвойств Цикл
		НоваяСтрока = ЗначенияДопСведений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДопСвойство); 
	КонецЦикла;

	Возврат ЗначенияДопСведений;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтборСвязанныхКомплектовРоболабс(ЗаказКлиента, Знач СвязанныйКомплект = Неопределено)
	
	ЗначенияДопСведений = ПолучитьСписокДопСведенийНоменклатуры(ЗаказКлиента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ЗначенияДопСведений.ВладелецСвойств КАК ВладелецСвойств,
				|	ЗначенияДопСведений.Значение КАК Значение,
				|	ЗначенияДопСведений.ТекстоваяСтрока КАК ТекстоваяСтрока,
				|	ЗначенияДопСведений.Представление КАК Представление
				|ПОМЕСТИТЬ ВТ_ЗначенияДопСведений
				|ИЗ
				|	&ЗначенияДопСведений КАК ЗначенияДопСведений
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Спр_Номенклатура.Ссылка КАК Комплект
				|ИЗ
				|	ВТ_ЗначенияДопСведений КАК ВТ_ЗначенияДопСведений,
				|	Справочник.Номенклатура КАК Спр_Номенклатура
				|ГДЕ
				|	Спр_Номенклатура.КодДляПоиска В (ВТ_ЗначенияДопСведений.Значение)
				|	И НЕ Спр_Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЗначенияДопСведений", ЗначенияДопСведений);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат СвязанныйКомплект;
	КонецЕсли;
	
	Выборка.Следующий();
	СвязанныйКомплект = Выборка.Комплект; 
	
	Возврат СвязанныйКомплект;
КонецФункции

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейПередНачаломИзменения(Элемент, Отказ)
	
	КэшированныеДанныеСтроки = Неопределено;
	СтрокаПередИзменением = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
		
	Если СтрокаПередИзменением <> Неопределено ТОгда
		КэшированныеДанныеСтроки = СтрокаПередИзменением;
		ПодтвержденоПередИзменением = КэшированныеДанныеСтроки.Подтверждено;
		СрокиРазработкиПередИзменением = КэшированныеДанныеСтроки.СрокиРазработки;
		СрокиПереносаПередИзменением = КэшированныеДанныеСтроки.СрокиПереноса;
		ИсполнительПередИзменением = КэшированныеДанныеСтроки.Исполнитель;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейПодтвержденоПриИзменении(Элемент)
	ОбработатьСтрокиТоваровСоСпецификацийПриИзменении();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокиТоваровСоСпецификацийПриИзменении()
	
	Команда = "ПриИзмененииПоляПодтверждено";
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ПроверкаВыполнена = ПроверкаПередВыполнениемОперации(Команда, ФормаПодразделения);
	ТекСтрокаТовара = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
	 	
	Если Не ПроверкаВыполнена Тогда
		ТекСтрокаТовара.Подтверждено = ?(КэшированныеДанныеСтроки <> Неопределено, ПодтвержденоПередИзменением, ТекСтрокаТовара.Подтверждено);		
		Возврат;
	КонецЕсли;
		
	Если ТекСтрокаТовара.Подтверждено Тогда
		Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано");
	Иначе
		Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.НаСогласовании");
	КонецЕсли;
	
	ДанныеПоНоменклатуре = Новый Соответствие;
	ДанныеПоНоменклатуре.Вставить(ТекСтрокаТовара.Номенклатура, ТекСтрокаТовара.Количество); 
		
	ВыбраннаяСтрока = Элементы.СписокЗаказовКонструктор.ТекущиеДанные;			
		
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Команда", Команда);
	СтруктураДанных.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
	СтруктураДанных.Вставить("Спецификация", ТекСтрокаТовара.Спецификация);
	СтруктураДанных.Вставить("ИсполнительСпецификации", ТекСтрокаТовара.Исполнитель);
	СтруктураДанных.Вставить("СтатусСпецификации", ТекСтрокаТовара.Статус);
	СтруктураДанных.Вставить("ДатаНазначения", ТекущаяДата());
	СтруктураДанных.Вставить("НачалоДействия", ТекСтрокаТовара.НачалоДействия);
	СтруктураДанных.Вставить("СрокиРазработки", ТекСтрокаТовара.СрокиРазработки);
	СтруктураДанных.Вставить("СрокиПереноса", ТекСтрокаТовара.СрокиПереноса); 
	СтруктураДанных.Вставить("ОтветственныйЗаНазначение", Объект.Ответственный);
	СтруктураДанных.Вставить("КоличествоОтмеченных", ПолучитьСписокОтмеченныхТоваров(ФормаПодразделения, Истина));
	СтруктураДанных.Вставить("ДанныеПоНоменклатуре", ДанныеПоНоменклатуре);
	СтруктураДанных.Вставить("Отказ", Ложь);
	СтруктураДанных.Вставить("ПричинаОтказа", "");
		 
	ДополнитьСтруктуруДанныхПередЗаписьюВРегистр(СтруктураДанных, ВыбраннаяСтрока,, ТекСтрокаТовара.Номенклатура, ТекСтрокаТовара.Количество);

	Попытка
		ПриИзмененииПоляПодтвержденоОбработкаНаСервереКонструктор(СтруктураДанных);
		ИзмененияВнесены = Истина;
	Исключение
		ИзмененияВнесены = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Произошла ошибка во время записи: '") + ОписаниеОшибки());
	КонецПопытки;
	
	Если ИзмененияВнесены Тогда
		Если СтруктураДанных.КоличествоОтмеченных = СтруктураДанных.КоличествоВсего Тогда
			ОтветПользователя = Вопрос("Заказ полностью согласован, обновить список?", РежимДиалогаВопрос.ДаНет,,, "Согласование заказа");
			
			Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
				СформироватьСписокЗаказовДляОтделаКонструкторов();
			КонецЕсли;
		КонецЕсли;
		
		ОповеститьПользователя(СтруктураДанных.Команда);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область РаботаНаСтраницеКонструкторовОбработкаЗаписиДопСведенийСпецификации

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейТребуетсяАктуализацияПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока.Спецификация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Спецификация не выбрана'"),, "ТоварыЗаказаСоСпецификацией");
		Возврат;
	КонецЕсли;
	
	ТекущаяКоманда = "ЗаписьДополнительныхСведений";
	ЗаписьОбновлена = ЗаписатьДанныеВРегистрДополнительныхСведений(ВыбраннаяСтрока.Спецификация, ВыбраннаяСтрока.ТребуетсяАктуализация);	
	
	Если ЗаписьОбновлена Тогда
		ОповеститьПользователя(ТекущаяКоманда);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьДанныеВРегистрДополнительныхСведений(ВладелецСвойств, ЗначениеДляЗаписи, ЗаписьОбновлена = Ложь)
	
	ДопСвойствоАктуализации = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Требуется актуализация");
	
	Если ДопСвойствоАктуализации.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден дополнительный реквизит ''Требуется актуализация'' '"));
		Возврат ЗаписьОбновлена;
	КонецЕсли;
	
	ТаблицаСвойствИЗначений = Новый ТаблицаЗначений;
	ТаблицаСвойствИЗначений.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	ТаблицаСвойствИЗначений.Колонки.Добавить("Значение", Новый ОписаниеТипов("Булево"));
	ТаблицаСвойствИЗначений.Колонки.Добавить("ТекстоваяСтрока", Новый ОписаниеТипов("Строка"));
	
	СтрокаЗаписи = ТаблицаСвойствИЗначений.Добавить();
	СтрокаЗаписи.Свойство = ДопСвойствоАктуализации;
	СтрокаЗаписи.Значение = ЗначениеДляЗаписи;
	СтрокаЗаписи.ТекстоваяСтрока = "";
	
	Попытка 	
		УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ВладелецСвойств, ТаблицаСвойствИЗначений);
		ЗаписьОбновлена = Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка во время записи доп. сведений для спецификации: '") + ОписаниеОшибки());
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
	КонецПопытки;
	
	Возврат ЗаписьОбновлена;
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область РаботаНаСтраницеКонструкторовНазначениеИсполнителя

&НаКлиенте
Процедура НазначитьИсполнителя(Команда)
	ОчиститьСообщения();
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ПроверкаВыполнена = ПроверкаПередВыполнениемОперации(Команда.Действие, ФормаПодразделения);
	
	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтрока = Элементы.СписокЗаказовКонструктор.ТекущиеДанные;
	ВопросПользователюПередВыполнениемОперации(Команда, ФормаПодразделения, ВыбраннаяСтрока);	
КонецПроцедуры

&НаСервере
Процедура НазначитьИсполнителяОбработкаНаСервере()
		
	Для Каждого ТекДанные Из ТоварыЗаказаСоСпецификацией Цикл
		НоваяЗапись = РегистрыСведений.ТТМ_ИсполнителиСпецификаций.СоздатьМенеджерЗаписи();
		НоваяЗапись.ЗаказКлиента = ТекДанные.ЗаказКлиента;
		НоваяЗапись.Спецификация = ТекДанные.Спецификация;
		НоваяЗапись.Номенклатура = ТекДанные.Номенклатура;
		НоваяЗапись.Назначил = Объект.Ответственный;
		НоваяЗапись.Статус = ТекДанные.Статус;
		НоваяЗапись.ДатаНазначения = ТекущаяДатаСеанса();
		НоваяЗапись.Исполнитель = ТекДанные.Исполнитель;
		НоваяЗапись.НачалоДействия = ТекДанные.НачалоДействия;
		НоваяЗапись.СрокиРазработки = ТекДанные.СрокиРазработки;
		НоваяЗапись.СрокиПереноса = ТекДанные.СрокиПереноса;
				
		Попытка
			НачатьТранзакцию();
			НоваяЗапись.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("'Ошибка при назначении исполнителя: '") + ОписаниеОшибки());
			ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);	
		КонецПопытки;		
	КонецЦикла;		
		
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейИсполнительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("СтрокаПоиска", Текст);
	СтруктураОтбора.Вставить("ВводПоСтрокеРасширенный", Истина);
	СтруктураОтбора.Вставить("Подразделение", Объект.Подразделение);
	
	ДанныеВыбора = ПолучитьДанныеВыбораРасширенные(СтруктураОтбора);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораРасширенные(СтруктураОтбора, Знач ОтборДляФормыВыбораИсполнителей = Ложь)
	
    СписокВыбора = Новый СписокЗначений;
		
	Если СтруктураОтбора.ВводПоСтрокеРасширенный Тогда
		МассивСловПоиска = СтрРазделить(СтруктураОтбора.СтрокаПоиска, " ", Ложь); 
	
		Запрос = Новый Запрос;
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	Пользователи.Ссылка КАК ТекПользователь,
	                   |	Пользователи.Наименование КАК Наименование
	                   |ПОМЕСТИТЬ ВТ_Пользователи
	                   |ИЗ
	                   |	Справочник.Пользователи КАК Пользователи
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ
	                   |	ИсполнителиЗадач.Исполнитель КАК Исполнитель,
	                   |	ВТ_Пользователи.ТекПользователь.ПометкаУдаления КАК ТекПользовательПометкаУдаления
	                   |ИЗ
	                   |	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Пользователи КАК ВТ_Пользователи
	                   |		ПО ИсполнителиЗадач.Исполнитель = ВТ_Пользователи.ТекПользователь
	                   |ГДЕ
	                   |	ИсполнителиЗадач.РольИсполнителя = &Подразделение
	                   |	И НЕ ИсполнителиЗадач.РольИсполнителя.ПометкаУдаления
	                   |	И НЕ ВТ_Пользователи.ТекПользователь.ПометкаУдаления
					   |	&СловоПоиска";
		
		Если ОтборДляФормыВыбораИсполнителей Тогда
            Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СловоПоиска", "");
			Запрос.УстановитьПараметр("Подразделение", СтруктураОтбора.Подразделение);
			ВыгруженныйСписок = Запрос.Выполнить().Выгрузить();
			
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ВыгруженныйСписок);
			Возврат АдресВоВременномХранилище;
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&СловоПоиска", "И ВТ_Пользователи.Наименование ПОДОБНО &СловоПоиска"); 
			Запрос.УстановитьПараметр("СловоПоиска", "%" + СтруктураОтбора.СтрокаПоиска + "%");
			Запрос.УстановитьПараметр("Подразделение", СтруктураОтбора.Подразделение);
		КонецЕсли;
			
		Выборка = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
						
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Значение", ВыборкаДетальныеЗаписи.Исполнитель);
			СтруктураОтбора.Вставить("ПометкаУдаления", ВыборкаДетальныеЗаписи.ТекПользовательПометкаУдаления);
				
			СписокВыбора.Добавить(СтруктураОтбора, ТТМ_ДанныеВыбораСервер.ПодсветитьСлова(ВыборкаДетальныеЗаписи.Исполнитель, МассивСловПоиска));
		КонецЦикла;		
	КонецЕсли;
		
	Возврат СписокВыбора;
КонецФункции

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("СтрокаПоиска", "");
	СтруктураОтбора.Вставить("ВводПоСтрокеРасширенный", Истина);
	СтруктураОтбора.Вставить("Подразделение", Объект.Подразделение);
	
	АдресВоВременномХранилище = ПолучитьДанныеВыбораРасширенные(СтруктураОтбора, Истина);
	ВыбраннаяСтрока = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ответственный", Объект.Ответственный);
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("Спецификация", ВыбраннаяСтрока.Спецификация); 
	ПараметрыФормы.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);	
	
	ОткрытьФормуМодально("Обработка.ТТМ_АРМ_ПроцессСогласования.Форма.ФормаВыбораИсполнителей", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейСрокиРазработкиПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока.Номенклатура) Тогда
		ВыбраннаяСтрока.СрокиРазработки = ?(КэшированныеДанныеСтроки <> Неопределено, СрокиРазработкиПередИзменением, ВыбраннаяСтрока.СрокиРазработки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле номенклатуры не заполнено'"),, "ТоварыЗаказаСоСпецификацией");
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяСтрока.Подтверждено Тогда
		ОбработатьСтрокиТоваровСоСпецификацийПриИзменении();	
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейСрокиПереносаПриИзменении(Элемент)
	
	ВыбраннаяСтрока = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
					
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока.Номенклатура) Тогда
		ВыбраннаяСтрока.СрокиПереноса = ?(КэшированныеДанныеСтроки <> Неопределено, СрокиПереносаПередИзменением, ВыбраннаяСтрока.СрокиПереноса);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана спецификация для текущей строки'"),, "ТоварыЗаказаСоСпецификацией");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(ВыбраннаяСтрока.СрокиРазработки) Тогда
		ВыбраннаяСтрока.СрокиПереноса = ?(КэшированныеДанныеСтроки <> Неопределено, СрокиПереносаПередИзменением, ВыбраннаяСтрока.СрокиПереноса);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не установлены сроки разработки'"),, "ТоварыЗаказаСоСпецификацией");
		Возврат;
	ИначеЕсли ВыбраннаяСтрока.СрокиПереноса <= ВыбраннаяСтрока.СрокиРазработки Тогда
		ВыбраннаяСтрока.СрокиПереноса = ?(КэшированныеДанныеСтроки <> Неопределено, СрокиПереносаПередИзменением, ВыбраннаяСтрока.СрокиПереноса);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сроки переноса не могут равняться или быть меньше даты ''Сроков разработки'''"),, "ТоварыЗаказаСоСпецификацией");
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяСтрока.Подтверждено Тогда
		ОбработатьСтрокиТоваровСоСпецификацийПриИзменении();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПоляПодтвержденоОбработкаНаСервереКонструктор(СтруктураДанных)
	
	НоваяЗаписьИсполнителя = РегистрыСведений.ТТМ_ИсполнителиСпецификаций.СоздатьМенеджерЗаписи();
	НоваяЗаписьИсполнителя.ЗаказКлиента = СтруктураДанных["ЗаказКлиента"];
	НоваяЗаписьИсполнителя.Спецификация = СтруктураДанных["Спецификация"];
	НоваяЗаписьИсполнителя.Номенклатура = СтруктураДанных["Изделие"];
	НоваяЗаписьИсполнителя.Статус = СтруктураДанных["СтатусСпецификации"];
	НоваяЗаписьИсполнителя.ДатаНазначения = СтруктураДанных["ДатаНазначения"];
	НоваяЗаписьИсполнителя.Исполнитель = СтруктураДанных["ИсполнительСпецификации"];
	НоваяЗаписьИсполнителя.НачалоДействия = СтруктураДанных["НачалоДействия"];
	НоваяЗаписьИсполнителя.СрокиРазработки = СтруктураДанных["СрокиРазработки"];
	НоваяЗаписьИсполнителя.СрокиПереноса = СтруктураДанных["СрокиПереноса"];
	НоваяЗаписьИсполнителя.Назначил = СтруктураДанных["ОтветственныйЗаНазначение"];
	НоваяЗаписьИсполнителя.Активность = Истина;
	
	Попытка
		НачатьТранзакцию();
		НоваяЗаписьИсполнителя.Записать();
		ЗафиксироватьТранзакцию();		
		ЗаписьВРегистреИсполнителяОбновлена = Истина;
	Исключение 
		ОтменитьТранзакцию();
		ЗаписьВРегистреИсполнителяОбновлена = Ложь;
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
	КонецПопытки;
	
	Если ЗаписьВРегистреИсполнителяОбновлена Тогда		
		ЗафиксироватьРезультатСогласованияВРегистр(СтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаказаСоСпецификациейИсполнительПриИзменении(Элемент)
	ВыбраннаяСтрока = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока.Номенклатура) Тогда
		ВыбраннаяСтрока.Исполнитель = ?(КэшированныеДанныеСтроки <> Неопределено, ИсполнительПередИзменением, ВыбраннаяСтрока.Исполнитель);
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле номенклатуры не заполнено'"),, "ТоварыЗаказаСоСпецификацией");
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяСтрока.Подтверждено Тогда
		ОбработатьСтрокиТоваровСоСпецификацийПриИзменении();	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область ЗаписьРезультатовСогласованияВРегистр

&НаКлиенте
Процедура СогласованоМенеджер(Команда)
	Отказ = Ложь;
	ПричинаОтказа = "";
	Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано");
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ПроверкаВыполнена = ПроверкаПередВыполнениемОперации(Команда.Действие, ФормаПодразделения);
	
	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
	ВопросПользователюПередВыполнениемОперации(Команда, ФормаПодразделения, ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласованиеМенеджер(Команда)
		
	Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.НаСогласовании");
	АдресВоВременномХранилище = ПолучитьСписокЗаказовСОтказом();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	ПараметрыФормы.Вставить("Ответственный", Объект.Ответственный);
	ПараметрыФормы.Вставить("ФормаПодразделения", ИнформацияЭтаФормаПодразделения());
	ОткрытьФормуМодально("Обработка.ТТМ_АРМ_ПроцессСогласования.Форма.ФормаЗаказовСОтказом", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОтказМенеджер(Команда)
	Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Отказ");
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();		
	ЗаполнитьПолеСПричинойОтказаОтЗаказа(Команда, ФормаПодразделения);
КонецПроцедуры

&НаКлиенте
Процедура СогласованоКонструктор(Команда)
	Отказ = Ложь;
	ПричинаОтказа = "";
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано");
	ПроверкаВыполнена = ПроверкаПередВыполнениемОперации(Команда.Действие, ФормаПодразделения);
	
	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
		
	ВыбраннаяСтрока = Элементы.СписокЗаказовКонструктор.ТекущиеДанные;
	ВопросПользователюПередВыполнениемОперации(Команда, ФормаПодразделения, ВыбраннаяСтрока);	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласованиеКонструктор(Команда)
	
	Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.НаСогласовании");
	АдресВоВременномХранилище = ПолучитьСписокЗаказовСОтказом();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	ПараметрыФормы.Вставить("Ответственный", Объект.Ответственный);
	ПараметрыФормы.Вставить("ФормаПодразделения", ИнформацияЭтаФормаПодразделения());
	ОткрытьФормуМодально("Обработка.ТТМ_АРМ_ПроцессСогласования.Форма.ФормаЗаказовСОтказом", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказКонструктор(Команда)	
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Отказ");
	ЗаполнитьПолеСПричинойОтказаОтЗаказа(Команда, ФормаПодразделения);		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолеСПричинойОтказаОтЗаказа(Команда, ФормаПодразделения)
		
	ОткрытьПолеВвода = Ложь;
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда
		Если Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Отказ") Тогда
			ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
			ОткрытьПолеВвода = Истина; 
		КонецЕсли;	
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда	
		Если Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Отказ") Тогда
			ВыбраннаяСтрока = Элементы.СписокЗаказовКонструктор.ТекущиеДанные;
			ОткрытьПолеВвода = Истина;
		КонецЕсли;	
	КонецЕсли;
		
	Если ОткрытьПолеВвода Тогда
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Команда", Команда);
		ПараметрыОповещения.Вставить("ФормаПодразделения", ФормаПодразделения);
		ПараметрыОповещения.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);

		ОповещениеПослеВводаТекста = Новый ОписаниеОповещения("ПослеВводаОписанияПричины", ЭтотОбъект, ПараметрыОповещения);
		ИсходнаяСтрока = "";
		ПоказатьВводСтроки(ОповещениеПослеВводаТекста, ИсходнаяСтрока, "Опишите причину отказа",, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаОписанияПричины(ВводПользователя, ПараметрыОповещения) Экспорт
	
	Если ВводПользователя = Неопределено Тогда
		Возврат;
	ИначеЕсли ВводПользователя = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо указать причину отказа!'"));
		Возврат;
	КонецЕсли;
	
	УстановитьИлиСнятьФлагОтметки(ПараметрыОповещения.ФормаПодразделения, Истина);
	ПричинаОтказа = ВводПользователя;
	Отказ = Истина;
	
	ПроверкаВыполнена = ПроверкаПередВыполнениемОперации(ПараметрыОповещения.Команда.Действие, ПараметрыОповещения.ФормаПодразделения);

	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
		
	ВопросПользователюПередВыполнениемОперации(ПараметрыОповещения.Команда, ПараметрыОповещения.ФормаПодразделения, ПараметрыОповещения.ВыбраннаяСтрока);

КонецПроцедуры 

&НаКлиенте
Процедура ДополнитьСтруктуруДанныхПередЗаписьюВРегистр(СтруктураДанных, Знач ВыбраннаяСтрока = Неопределено, Знач ДатаОкончания = Неопределено, 
		Знач Изделие = Неопределено, Знач Количество = Неопределено)
		
	Если ВыбраннаяСтрока = Неопределено Тогда
		ВыбраннаяСтрока = СтруктураДанных["ВыбраннаяСтрока"];
	КонецЕсли;
	
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ДатаСтартаЗаказа = ПолучитьВремяСтартаЗаказа(ВыбраннаяСтрока.ЗаказКлиента);
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда	
		СтруктураДанных.Вставить("СтатусСогласования", Объект.СтатусПроверкиМенеджер);	
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда 
		СтруктураДанных.Вставить("СтатусСогласования", Объект.СтатусПроверкиКонструктор);
				
		Если Изделие <> Неопределено Тогда       
			СтруктураДанных.Вставить("Изделие", Изделие);
			//СтруктураДанных["Изделие"] = Изделие;
		КонецЕсли;
		
		Если Количество <> Неопределено Тогда  
			СтруктураДанных.Вставить("Количество", Количество);
		    //СтруктураДанных["Количество"] = Количество;
		КонецЕсли;
	КонецЕсли;

	ДатаСтартаЗаказа = ?(ДатаСтартаЗаказа = Неопределено, ВыбраннаяСтрока.ДатаЗаказа, ДатаСтартаЗаказа);	
	ВремяВыполнения = РассчитатьВремяВыполнения(ДатаСтартаЗаказа, ТекущаяДата());		
	
	СтруктураДанных.Вставить("Назначение", ВыбраннаяСтрока.Назначение);
	СтруктураДанных.Вставить("ЗаказКлиента", ВыбраннаяСтрока.ЗаказКлиента);
	СтруктураДанных.Вставить("ДатаНачала", ВыбраннаяСтрока.ДатаЗаказа);
	СтруктураДанных.Вставить("Исполнитель", Объект.Ответственный);
	СтруктураДанных.Вставить("Подразделение", Объект.Подразделение);
	СтруктураДанных.Вставить("Организация", ВыбраннаяСтрока.Организация);			
	СтруктураДанных.Вставить("ВремяВыполнения", ВремяВыполнения);
	СтруктураДанных.Вставить("ДатаИзменения", ТекущаяДата());
	СтруктураДанных.Вставить("ДатаОкончания", ДатаОкончания);
	СтруктураДанных.Вставить("ФормаПодразделения", ФормаПодразделения);
	СтруктураДанных.Вставить("Изделие");
	СтруктураДанных.Вставить("Количество");	
	
		
	СтруктураДанных["ВыбраннаяСтрока"] = Неопределено;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьВремяВыполнения(НачальноеВремя, ВремяОкончания)
	
	ВидыДнейПроизводственногоКалендаря = Новый Массив;
	ВидыДнейПроизводственногоКалендаря.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота);
	ВидыДнейПроизводственногоКалендаря.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье);
	ВидыДнейПроизводственногоКалендаря.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник);
	ВидыДнейПроизводственногоКалендаря.Добавить(Перечисления.ВидыДнейПроизводственногоКалендаря.Нерабочий);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
	               |	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
	               |	ДанныеПроизводственногоКалендаря.Год КАК Год,
	               |	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
	               |ПОМЕСТИТЬ ВТ_РабочиеКалендарныеДаты
	               |ИЗ
	               |	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	               |ГДЕ
	               |	ДанныеПроизводственногоКалендаря.Дата >= &ДатаНачала
	               |	И ДанныеПроизводственногоКалендаря.Дата <= &ДатаОкончания
	               |	И ДанныеПроизводственногоКалендаря.ВидДня В(&ВидыДнейПроизводственногоКалендаря)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(*) КАК КоличествоДней
	               |ИЗ
	               |	ВТ_РабочиеКалендарныеДаты КАК ВТ_РабочиеКалендарныеДаты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_РабочиеКалендарныеДаты.ПроизводственныйКалендарь";
		
	Запрос.УстановитьПараметр("ДатаНачала", НачальноеВремя); 
	Запрос.УстановитьПараметр("ДатаОкончания", ВремяОкончания);
	Запрос.УстановитьПараметр("ВидыДнейПроизводственногоКалендаря", ВидыДнейПроизводственногоКалендаря);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	КоличествоНеРабочихДней = ?(Выборка.Количество() <> 0, Выборка.КоличествоДней, 0);	
	Разность = Макс(ВремяОкончания, НачальноеВремя) - Мин(ВремяОкончания, НачальноеВремя);
	КоличествоОбщихЧасов = Цел(Разность / 3600);
	
	КолЧасовПоНеРабочимДнямСумма = 0;
	
	Если КоличествоОбщихЧасов >= 24 Тогда
		КолЧасовПоНеРабочимДнямСумма = (Цел(КоличествоОбщихЧасов / 24) * 8) + (КоличествоНеРабочихДней * 24);
	КонецЕсли;		
	
	КолЧасов = ?(КолЧасовПоНеРабочимДнямСумма > 0, КоличествоОбщихЧасов - КолЧасовПоНеРабочимДнямСумма, КоличествоОбщихЧасов - (КоличествоНеРабочихДней * 24));
	КолМинут = Цел((Разность % 3600) / 60);
	КолСекунд = Разность % 60;
	
	ВремяВыполнения = "" + КолЧасов + "ч. " + КолМинут + "мин. " + КолСекунд + "сек.";	
	Возврат ВремяВыполнения;
КонецФункции

&НаСервере
Процедура ЗафиксироватьРезультатСогласованияВРегистр(СтруктураДанных)
	
	ТекущаяФорма = СтруктураДанных["ФормаПодразделения"];
	
	Если СтруктураДанных["ДатаОкончания"] = Неопределено Тогда
		СтруктураДанных["ДатаОкончания"] = Дата(1, 1, 1);
	КонецЕсли;
			
	Для Каждого ТекТовар Из СтруктураДанных["ДанныеПоНоменклатуре"] Цикл
		ИзмененияВнесены = Ложь;
		СтруктураДанных["Изделие"] = ТекТовар.Ключ;
		СтруктураДанных["Количество"] = ТекТовар.Значение;
			
		Если ТекущаяФорма["ФормаМенеджеров"] Тогда
			НоваяЗапись = РегистрыСведений.ТТМ_СогласованиеЗаказовМенеджер.СоздатьМенеджерЗаписи();
			КоличествоВсего = ТоварыЗаказа.Количество();
			СтруктураДанных.Вставить("КоличествоВсего", КоличествоВсего);
		ИначеЕсли ТекущаяФорма["ФормаКонструкторов"] Тогда
			НоваяЗапись = РегистрыСведений.ТТМ_СогласованиеЗаказовКонструктор.СоздатьМенеджерЗаписи();
			КоличествоВсего = ТоварыЗаказаСоСпецификацией.Количество();
			СтруктураДанных.Вставить("КоличествоВсего", КоличествоВсего);
		ИначеЕсли ТекущаяФорма["ФормаСнабжения"] Тогда
			//Если потребуется доп. разработка для снабжения
			Возврат;
		КонецЕсли;
		
		НоваяЗапись.Назначение = СтруктураДанных["Назначение"];
		НоваяЗапись.ЗаказКлиента = СтруктураДанных["ЗаказКлиента"];
		НоваяЗапись.ДатаНачала = СтруктураДанных["ДатаНачала"];
		НоваяЗапись.ДатаОкончания = СтруктураДанных["ДатаОкончания"];
		НоваяЗапись.Организация = СтруктураДанных["Организация"];
		НоваяЗапись.Изделие = СтруктураДанных["Изделие"];
		НоваяЗапись.Подразделение = СтруктураДанных["Подразделение"];
		НоваяЗапись.Количество = СтруктураДанных["Количество"];
		НоваяЗапись.СтатусСогласования = СтруктураДанных["СтатусСогласования"];
		НоваяЗапись.ВремяВыполнения = СтруктураДанных["ВремяВыполнения"];
		НоваяЗапись.ДатаИзменения = СтруктураДанных["ДатаИзменения"];
		НоваяЗапись.Исполнитель = СтруктураДанных["Исполнитель"];
					
		Попытка
			НачатьТранзакцию();
			НоваяЗапись.Записать();
			ЗафиксироватьТранзакцию();
			ИзмененияВнесены = Истина;
		Исключение
			ОтменитьТранзакцию();	
			ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
		КонецПопытки;	
	КонецЦикла;
						
	Если ИзмененияВнесены И СтруктураДанных["КоличествоОтмеченных"] = СтруктураДанных["КоличествоВсего"] Тогда	
		ЗафиксироватьРезультатыВСводнуюТаблицуРегистра(СтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗафиксироватьРезультатыВСводнуюТаблицуРегистра(СтруктураДанных)
	
	//Чтение существующих записей и перезапись
	НаборЗаписей = РегистрыСведений.ТТМ_СогласованиеСводнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Назначение.Установить(СтруктураДанных["Назначение"]);
	НаборЗаписей.Отбор.ЗаказКлиента.Установить(СтруктураДанных["ЗаказКлиента"]);
	НаборЗаписей.Прочитать();
	
	ТекущаяФорма = СтруктураДанных["ФормаПодразделения"];
	РезультатСогласования = ?(СтруктураДанных["СтатусСогласования"] = Перечисления.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано, Истина, Ложь);
	ЗатраченноеВремя = "ВремяВыполнения"; 
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если ТекущаяФорма["ФормаМенеджеров"] Тогда
				Запись.СогласованоМенеджер = РезультатСогласования;
				Запись.ЗатраченноеВремяМенеджер = СтруктураДанных[ЗатраченноеВремя];
				Запись.ПричинаОтказа = СтруктураДанных["ПричинаОтказа"];	
			ИначеЕсли ТекущаяФорма["ФормаКонструкторов"] Тогда
				Запись.СогласованоКонструктор = РезультатСогласования;
				Запись.ЗатраченноеВремяКонструктор = СтруктураДанных[ЗатраченноеВремя];
				Запись.ПричинаОтказа = СтруктураДанных["ПричинаОтказа"];	
			ИначеЕсли ТекущаяФорма["ФормаСнабжения"] Тогда
				Запись.СогласованоСнабжение = РезультатСогласования;
				Запись.ЗатраченноеВремяСнабжение = СтруктураДанных[ЗатраченноеВремя];
			КонецЕсли;
			
		КонецЦикла;
				
		Попытка
			НачатьТранзакцию();
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
		КонецПопытки;		
	Иначе //Создание новой записи		
		НоваяЗапись = РегистрыСведений.ТТМ_СогласованиеСводнаяИнформация.СоздатьМенеджерЗаписи();
		НоваяЗапись.Назначение = СтруктураДанных["Назначение"];
		НоваяЗапись.ЗаказКлиента = СтруктураДанных["ЗаказКлиента"];	
				
		Если ТекущаяФорма["ФормаМенеджеров"] Тогда
			НоваяЗапись.СогласованоМенеджер = РезультатСогласования;
			НоваяЗапись.ЗатраченноеВремяМенеджер = СтруктураДанных[ЗатраченноеВремя];
			НоваяЗапись.ПричинаОтказа = СтруктураДанных["ПричинаОтказа"];
		ИначеЕсли ТекущаяФорма["ФормаКонструкторов"] Тогда
			НоваяЗапись.СогласованоКонструктор = РезультатСогласования;
			НоваяЗапись.ЗатраченноеВремяКонструктор = СтруктураДанных[ЗатраченноеВремя];
			НоваяЗапись.ПричинаОтказа = СтруктураДанных["ПричинаОтказа"];	
		ИначеЕсли ТекущаяФорма["ФормаСнабжения"] Тогда
			НоваяЗапись.СогласованоСнабжение = РезультатСогласования;
			НоваяЗапись.ЗатраченноеВремяСнабжение = СтруктураДанных[ЗатраченноеВремя];
		КонецЕсли;
		
		Попытка
			НачатьТранзакцию();
			НоваяЗапись.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВернутьЗаказНаСогласованиеОбщее(МассивЗаказовСОтказом, ФормаПодразделения)
	
	Для Каждого ЗаказНаОбработку Из МассивЗаказовСОтказом Цикл
		НаборЗаписей = РегистрыСведений.ТТМ_СогласованиеСводнаяИнформация.СоздатьНаборЗаписей();	
		НаборЗаписей.Отбор.ЗаказКлиента.Установить(ЗаказНаОбработку);
		НаборЗаписей.Прочитать();
				
		Для Каждого Запись Из НаборЗаписей Цикл
			Если ФормаПодразделения.ФормаМенеджеров Тогда
				Запись.СогласованоМенеджер = Ложь;
				Запись.ЗатраченноеВремяМенеджер = "";
			ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
				Запись.СогласованоКонструктор = Ложь;
				Запись.ЗатраченноеВремяКонструктор = "";
			ИначеЕсли ФормаПодразделения.Снабжение Тогда
				Запись.СогласованоСнабжение = Ложь;
				Запись.ЗатраченноеВремяСнабжение = "";
			КонецЕсли;
				
			Запись.ПричинаОтказа = "";
			Запись.Активность = Истина;
		КонецЦикла;
		
		Попытка
			НачатьТранзакцию();
			НаборЗаписей.Записать(Истина);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьЗаписиВРегистреОтменаСогласованияОбщее(СтруктураДанных)
	
	ТекущаяФорма = СтруктураДанных["ФормаПодразделения"];
	
	Если ТекущаяФорма["ФормаМенеджеров"] Тогда 
		НаборЗаписей = РегистрыСведений.ТТМ_СогласованиеЗаказовМенеджер.СоздатьНаборЗаписей();
	ИначеЕсли ТекущаяФорма["ФормаКонструкторов"] Тогда
		НаборЗаписей = РегистрыСведений.ТТМ_СогласованиеЗаказовКонструктор.СоздатьНаборЗаписей();
	ИначеЕсли ТекущаяФорма["ФормаСнабжения"] Тогда
		//Если потребуется доп. разработка для снабжения
		Возврат;
	КонецЕсли;
	
	НаборЗаписей.Отбор.ЗаказКлиента.Установить(СтруктураДанных["ЗаказКлиента"]);
	НаборЗаписей.Отбор.Назначение.Установить(СтруктураДанных["Назначение"]);
	НаборЗаписей.Отбор.Подразделение.Установить(СтруктураДанных["Подразделение"]);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.СтатусСогласования = СтруктураДанных["СтатусСогласования"];
		Запись.Исполнитель = СтруктураДанных["Исполнитель"];
		Запись.ДатаИзменения = СтруктураДанных["ДатаИзменения"];
		Запись.ВремяВыполнения = СтруктураДанных["ВремяВыполнения"];;
	КонецЦикла;
	
	Попытка
		НачатьТранзакцию();
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
	КонецПопытки;
	
	ЗафиксироватьРезультатыВСводнуюТаблицуРегистра(СтруктураДанных);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЗаказовСОтказом()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_СогласованиеСводнаяИнформация.Назначение КАК Назначение,
	               |	ТТМ_СогласованиеСводнаяИнформация.ЗаказКлиента КАК ЗаказКлиента,
	               |	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.СогласованоМенеджер, ЛОЖЬ) КАК СогласованоМенеджер,
	               |	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.СогласованоКонструктор, ЛОЖЬ) КАК СогласованоКонструктор,
	               |	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.СогласованоСнабжение, ЛОЖЬ) КАК СогласованоСнабжение,
	               |	ТТМ_СогласованиеСводнаяИнформация.ПричинаОтказа КАК ПричинаОтказа,
	               |	ВЫБОР
	               |		КОГДА ТТМ_СогласованиеСводнаяИнформация.ПричинаОтказа <> &ПустаяСтрока
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПричинаЗаполнена
	               |ПОМЕСТИТЬ ВТ_СводнаяИнформация
	               |ИЗ
	               |	РегистрСведений.ТТМ_СогласованиеСводнаяИнформация КАК ТТМ_СогласованиеСводнаяИнформация
	               |ГДЕ
	               |	НЕ ТТМ_СогласованиеСводнаяИнформация.СогласованоМенеджер
	               |	И НЕ ТТМ_СогласованиеСводнаяИнформация.СогласованоКонструктор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СводнаяИнформация.Назначение КАК Назначение,
	               |	ВТ_СводнаяИнформация.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_СводнаяИнформация.СогласованоМенеджер КАК СогласованоМенеджер,
	               |	ВТ_СводнаяИнформация.СогласованоКонструктор КАК СогласованоКонструктор,
	               |	ВТ_СводнаяИнформация.СогласованоСнабжение КАК СогласованоСнабжение,
	               |	ВТ_СводнаяИнформация.ПричинаОтказа КАК ПричинаОтказа
	               |ИЗ
	               |	ВТ_СводнаяИнформация КАК ВТ_СводнаяИнформация
	               |ГДЕ
	               |	ВТ_СводнаяИнформация.ПричинаЗаполнена = &ПричинаНеЗаполнена
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаказКлиента"; 
	
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.УстановитьПараметр("ПричинаНеЗаполнена", Истина);
	
	ВыгруженнаяТаблица = Запрос.Выполнить().Выгрузить();
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ВыгруженнаяТаблица);
				
	Возврат АдресВоВременномХранилище;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВремяСтартаЗаказа(ЗаказКлиента, Знач ДатаСтартаЗаказа = Неопределено)
		
	СвойствоОбъекта = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дата старта заказа");
	
	Если СвойствоОбъекта.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден дополнительный реквизит ''Дата старта заказа'' '"));
		Возврат ДатаСтартаЗаказа;
	КонецЕсли;
	
	ДатаСтартаЗаказа = УправлениеСвойствами.ЗначениеСвойства(ЗаказКлиента, СвойствоОбъекта);	
	
	Возврат ДатаСтартаЗаказа;
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область РаботаСДокументомЗаказКлиента

&НаКлиенте
Процедура УстановитьСтатусВДокументе(Команда)
	ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
	ПроверкаВыполнена = ПроверкаПередВыполнениемОперации(Команда.Действие, ФормаПодразделения);
	ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
	
	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	Результаты = ПроверитьРезультатыСогласованияПодразделений(ВыбраннаяСтрока.Назначение, ВыбраннаяСтрока.ЗаказКлиента);
	ТекстСОписаниемОтказа = Результаты.ПричинаОтказа;	 
	ЗаказНаОтмену = ?(СтрДлина(ТекстСОписаниемОтказа) = 0, Ложь, Истина);
	ВопросПользователюПередВыполнениемОперации(Команда, ФормаПодразделения, ВыбраннаяСтрока, ЗаказНаОтмену); 
КонецПроцедуры

&НаКлиенте
Функция ИзменитьСтатусТекущегоЗаказа(СтруктураДанных)
	
	ТекущаяСтрока = СтруктураДанных["ВыбраннаяСтрока"];
	МассивЗаказовКИзменению = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.ЗаказКлиента);
		
	Если СтруктураДанных.НовыйСтатус = "КЗакрытию" Тогда 
		СтруктураЗакрытия = Новый Структура;
		ЗаказыКЗакрытию = Новый СписокЗначений;
		ЗаказыКЗакрытию.ЗагрузитьЗначения(МассивЗаказовКИзменению);
		СтруктураЗакрытия.Вставить("Заказы", ЗаказыКЗакрытию);
		СтруктураЗакрытия.Вставить("ОтменитьНеотработанныеСтроки", Истина);
		СтруктураЗакрытия.Вставить("ЗакрыватьЗаказы", Истина);
		
		ОткрытьФорму("Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия", СтруктураЗакрытия,
						ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
		СтатусЗаказаИзменен = Ложь;				
	Иначе
		Попытка				
			ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(МассивЗаказовКИзменению, СтруктураДанных.НовыйСтатус);
			СтатусЗаказаИзменен = Истина;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Ошибка при изменения статуса заказа в документе: '") + ОписаниеОшибки());
			СтатусЗаказаИзменен = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат СтатусЗаказаИзменен; 
КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьСтрокиТабличногоДокументаВЗаказеКлиента(ЗаказКлиента, Знач СтруктураОтбора = Неопределено, Знач ДатаОтгрузки = Неопределено, 
		Знач ВидЦены = Неопределено, Знач РедактироватьСтрокиТЧ = Ложь, Знач ОбработатьСтрокиОтменено = Ложь)
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЗаказКлиента);
	ЗаполнитьСтавкуНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЗаказКлиента, Истина);
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ДокОбъект = ЗаказКлиента.ПолучитьОбъект();
	РежимЗаписи = РежимЗаписиДокумента.Проведение;
	ВнесеныИзменения = Ложь;
		
	Для Каждого СтрокаКИзменению Из ДокОбъект.Товары Цикл
		
		Если РедактироватьСтрокиТЧ Тогда 
			Если СтрокаКИзменению.Номенклатура = СтруктураОтбора.Номенклатура И СтрокаКИзменению.Количество = СтруктураОтбора.Количество Тогда
				СтрокаКИзменению.ДатаОтгрузки = ?(ДатаОтгрузки <> Неопределено, ДатаОтгрузки, СтрокаКИзменению.ДатаОтгрузки);
	            СтрокаКИзменению.ВидЦены = ?(ВидЦены <> Неопределено, ВидЦены, СтрокаКИзменению.ВидЦены);
			КонецЕсли;
		ИначеЕсли ОбработатьСтрокиОтменено Тогда
			СтрокаКИзменению.Отменено = Ложь;
			СтрокаКИзменению.ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка");
		КонецЕсли;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаКИзменению, СтруктураДействий, КэшированныеЗначения);	
	КонецЦикла;
	
	Попытка
		НачатьТранзакцию();	
		ВзаиморасчетыСервер.ПередЗаписью(ДокОбъект, Ложь, РежимЗаписи);
		ДокОбъект.Записать(РежимЗаписи);
		ЗафиксироватьТранзакцию();
		ВнесеныИзменения = Истина;
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Ошибка записи документа: '") + ОписаниеОшибки());
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Истина);
	КонецПопытки;		
	
	Возврат ВнесеныИзменения;
КонецФункции

&НаСервереБезКонтекста
функция ПроверитьРезультатыСогласованияПодразделений(Назначение, ЗаказКлиента, Знач ЗаказСогласован = Ложь)
	
	НаборЗаписей = РегистрыСведений.ТТМ_СогласованиеСводнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Назначение.Установить(Назначение);
	НаборЗаписей.Отбор.ЗаказКлиента.Установить(ЗаказКлиента);
	НаборЗаписей.Прочитать();
	
	СтруктураРезультатов = Новый Структура;
	
	Для Каждого Запись Из НаборЗаписей Цикл	
		СтруктураРезультатов.Вставить("СогласованоМенеджер", Запись.СогласованоМенеджер);
		СтруктураРезультатов.Вставить("СогласованоКонструктор", Запись.СогласованоКонструктор);
		СтруктураРезультатов.Вставить("СогласованоСнабжение", Запись.СогласованоСнабжение);
		СтруктураРезультатов.Вставить("ПричинаОтказа", Запись.ПричинаОтказа);
	КонецЦикла;
	
	Возврат СтруктураРезультатов;
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область ПроверкиИВзаимодействиеСПользователем

&НаКлиенте
Функция ПроверкаПередВыполнениемОперации(ТекущаяКоманда, ФормаПодразделения, Знач ПроверкаВыполнена = Истина)
		
	//Проверка перед внесением корректировок - Менеджер/Конструктор
	Если ТекущаяКоманда = "СогласованоМенеджер"
		Или ТекущаяКоманда = "ОтказМенеджер"
		Или ТекущаяКоманда = "СогласованоКонструктор" 
		Или ТекущаяКоманда = "ОтказКонструктор" Тогда
		
		КоличествоОтмеченных = ПолучитьСписокОтмеченныхТоваров(ФормаПодразделения, Истина);
				
		Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Не определено подразделение для текущего пользователя'"),, "Объект.Подразделение");
			ПроверкаВыполнена = Ложь;
		КонецЕсли;
				
		Если ФормаПодразделения.ФормаМенеджеров Тогда			
			Если Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано") Тогда			
				Если КоличествоОтмеченных = 0 Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Не выбран ни один товар из списка'"),, "ТоварыЗаказа");
					ПроверкаВыполнена = Ложь;	
				КонецЕсли;
			КонецЕсли;	
		ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда		
			Если Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Согласовано") Тогда
				ЕстьТоварыСоСпецификациейВРазработке = ПроверитьСписокСПолямиВРазработке(ФормаПодразделения);
				
				Если КоличествоОтмеченных = 0 Тогда
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Не выбран ни один товар из списка'"),, "ТоварыЗаказаСоСпецификацией");
					ПроверкаВыполнена = Ложь;
				//ИначеЕсли ЕстьТоварыСоСпецификациейВРазработке Тогда
				//	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Нельзя согласовать заказ у спецификаций со статусом ''В разработке'''"),, "ТоварыЗаказаСоСпецификацией");
				//	ПроверкаВыполнена = Ложь;
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	//Проверка перед установкой назначения исполнителя - Конструктор
	Если ТекущаяКоманда = "НазначитьИсполнителя" Тогда		
		ПолученныйРезультат = ПроверитьСтрокиТоваровНаЗаполнение();
		
		Если ПолученныйРезультат["ОтсутствуетНоменклатура"] Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'В списке есть товары без номенклатуры'"),, "ТоварыЗаказаСоСпецификацией");
			ПроверкаВыполнена = Ложь;
		ИначеЕсли ПолученныйРезультат["НеНазначенИсполнитель"] Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для спецификаций со статусом ''В разработке нужно назначить исполнителя'''"),, "ТоварыЗаказаСоСпецификацией");
			ПроверкаВыполнена = Ложь;
		ИначеЕсли ПолученныйРезультат["НеУстановленыСрокРазработки"] Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для спецификаций со статусом ''В разработке нужно установить сроки'''"),, "ТоварыЗаказаСоСпецификацией");
			ПроверкаВыполнена = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Проверка перед внесением изменений в документ
	Если ТекущаяКоманда = "УстановитьСтатусВДокументе" Тогда
		ТекущиеДанные = Элементы.СписокЗаказов.ТекущиеДанные;
		СтруктураРезультатов = ПроверитьРезультатыСогласованияПодразделений(ТекущиеДанные.Назначение, ТекущиеДанные.ЗаказКлиента);
		
		Если СтруктураРезультатов.Количество() = 0 Тогда
			ПроверкаВыполнена = Ложь;
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Согласование получено не на всех подразделениях!'"),, "ТоварыЗаказа");
			Возврат ПроверкаВыполнена;
		КонецЕсли;
		
		ЗаказСогласован = ?(СтруктураРезультатов["СогласованоМенеджер"] И СтруктураРезультатов["СогласованоКонструктор"], Истина, Ложь);	
		
		Если Не ЗаказСогласован Тогда
			ТекстОтказа = СтруктураРезультатов["ПричинаОтказа"];
			
			Если СтрДлина(ТекстОтказа) <> 0 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Есть отказ с причиной: '") + СтруктураРезультатов["ПричинаОтказа"]);
				ПроверкаВыполнена = Ложь;
			Иначе 			
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Согласование получено не на всех подразделениях!'"),, "ТоварыЗаказа");
				ПроверкаВыполнена = Ложь;				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяКоманда = "ПриИзмененииПоляПодтверждено" Тогда		
		Если ФормаПодразделения.ФормаМенеджеров Тогда
			ТекущиеДанные = Элементы.ТоварыЗаказа.ТекущиеДанные;
			
			Если Не ЗначениеЗаполнено(ТекущиеДанные.Цена) Или Не ЗначениеЗаполнено(ТекущиеДанные.ИтоговаяСумма) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Не установлена цена!'"),, "ТоварыЗаказа");
				ПроверкаВыполнена = Ложь;
			КонецЕсли;	
		ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
			ТекущиеДанные = Элементы.ТоварыЗаказаСоСпецификацией.ТекущиеДанные;
			
			Если Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Отсутствует изделие для назначения!'"),, "ТоварыЗаказаСоСпецификацией");
				ПроверкаВыполнена = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	Возврат ПроверкаВыполнена;
КонецФункции

&НаКлиенте
Процедура ВопросПользователюПередВыполнениемОперации(Команда, ФормаПодразделения, ВыбраннаяСтрока, Знач ЗаказНаОтмену = Ложь, Знач ЗаказыСОтказом = Неопределено)
	
	////////////////////////////////////////////////////////////////////////
	Если Команда.Действие = "СогласованоМенеджер"
		Или Команда.Действие = "ОтказМенеджер" 
		Или Команда.Действие = "СогласованоКонструктор"
		Или Команда.Действие = "ОтказКонструктор" Тогда
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Команда", Команда.Действие); 
		СтруктураДанных.Вставить("КоличествоОтмеченных", ПолучитьСписокОтмеченныхТоваров(ФормаПодразделения, Истина));
		СтруктураДанных.Вставить("ДанныеПоНоменклатуре", ПолучитьСписокОтмеченныхТоваров(ФормаПодразделения, Ложь, Истина));	
		СтруктураДанных.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		СтруктураДанных.Вставить("Отказ", Отказ);
		СтруктураДанных.Вставить("ПричинаОтказа", ПричинаОтказа);
		СтруктураДанных.Вставить("СписокАдресовДляРассылки", СписокАдресовДляРассылки);
		
		ТекстВопроса = "Зафиксировать изменения по данному заказу?";
		ЗаголовокВопроса = "Согласование заказов";		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////
	Если Команда.Действие = "НазначитьИсполнителя" Тогда
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Команда", Команда.Действие);
		СтруктураДанных.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		
		ТекстВопроса = "Назначить исполнителя для текущих спецификаций?";
		ЗаголовокВопроса = "Назначение исполнителя";		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////
	Если Команда.Действие = "УстановитьСтатусВДокументе" Тогда	
		НовыйСтатусЗаказа = ?(ЗаказНаОтмену, "КЗакрытию", "КОбеспечению"); 
			
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Команда", Команда.Действие);
		СтруктураДанных.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		СтруктураДанных.Вставить("ЗаказНаОтмену", ЗаказНаОтмену);
		СтруктураДанных.Вставить("НовыйСтатус", НовыйСтатусЗаказа);
		
		ТекстВопроса = "Присвоить статус ""К выполнению"" для текущего заказа: " + ВыбраннаяСтрока.Назначение + " ?";
		ЗаголовокВопроса = "Изменение статуса в заказе клиента";
	КонецЕсли;
					
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, СтруктураДанных);     
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0,, ЗаголовокВопроса);
КонецПроцедуры

&НаКлиенте 
Процедура ПослеЗакрытияВопроса(ОтветПользователя, СтруктураДанных) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = Ложь;
	
	////////////////////////////////////////////////////////////////////////
	Если СтруктураДанных.Команда = "СогласованоМенеджер" Или СтруктураДанных.Команда = "ОтказМенеджер" Тогда
		ДатаОкончания = ?(Объект.СтатусПроверкиМенеджер = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Отказ"), ТекущаяДата(), Дата(1, 1, 1));
		
		Попытка
			ДополнитьСтруктуруДанныхПередЗаписьюВРегистр(СтруктураДанных,, ДатаОкончания);
			ЗафиксироватьРезультатСогласованияВРегистр(СтруктураДанных);
			РезультатВыполнения = Истина;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка записи данных: '") + ОписаниеОшибки());
		КонецПопытки;
		
		Если Отказ Тогда
			ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
			НовыйСтатусЗаказа = ?(Отказ, "КЗакрытию", "КОбеспечению"); 
			
			ДанныеОтмены = Новый Структура;
			ДанныеОтмены.Вставить("Команда", СтруктураДанных.Команда);
			ДанныеОтмены.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
			ДанныеОтмены.Вставить("ЗаказНаОтмену", Отказ);
			ДанныеОтмены.Вставить("НовыйСтатус", НовыйСтатусЗаказа);
			СтатусИзменен = ИзменитьСтатусТекущегоЗаказа(ДанныеОтмены);
			
			Если Не СтатусИзменен Тогда
				Возврат;
			КонецЕсли;
			
			СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами();
			ОповеститьПользователя(СтруктураДанных.Команда);
		КонецЕсли;
		
		Если Не Отказ Тогда	
			Если РезультатВыполнения Тогда		
				ВыбраннаяСтрока = Элементы.СписокЗаказов.ТекущиеДанные;
				СтруктураОтбора = ПолучитьСтруктуруОтбораПриАктивизацииСтроки(ВыбраннаяСтрока, СтруктураДанных.ФормаПодразделения);
				ПолучитьСписокТоваровДляОтделаПоРаботеСКлиентами(СтруктураОтбора);
				ОповеститьПользователя(СтруктураДанных.Команда);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////
	Если СтруктураДанных.Команда = "НазначитьИсполнителя" Тогда
		ФормаПодразделения = ИнформацияЭтаФормаПодразделения();
		СтруктураОтбора = ПолучитьСтруктуруОтбораПриАктивизацииСтроки(СтруктураДанных.ВыбраннаяСтрока, ФормаПодразделения);
		
		Попытка
			НазначитьИсполнителяОбработкаНаСервере();
			РезультатВыполнения = Истина;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка записи данных: '") + ОписаниеОшибки());
		КонецПопытки;
		
		Если РезультатВыполнения Тогда			
			ПолучитьСписокТоваровДляОтделаКБ(СтруктураОтбора, СтруктураДанных.ВыбраннаяСтрока.Организация, Истина);
			ОповеститьПользователя(СтруктураДанных.Команда);
		КонецЕсли;
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////
	Если СтруктураДанных.Команда = "СогласованоКонструктор" Или СтруктураДанных.Команда = "ОтказКонструктор" Тогда
		ДатаОкончания = ?(Объект.СтатусПроверкиКонструктор = ПредопределенноеЗначение("Перечисление.ТТМ_СтатусыПроверокПроцессСогласования.Отказ"), ТекущаяДата(), Дата(1, 1, 1));	
		
		Попытка		
			ДополнитьСтруктуруДанныхПередЗаписьюВРегистр(СтруктураДанных,, ДатаОкончания);
			ЗафиксироватьРезультатСогласованияВРегистр(СтруктураДанных);
			РезультатВыполнения = Истина;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка записи данных: '") + ОписаниеОшибки());
		КонецПопытки;
		
		Если РезультатВыполнения Тогда
			ВыбраннаяСтрока = Элементы.СписокЗаказовКонструктор.ТекущиеДанные;
			
			Если СтруктураДанных.КоличествоОтмеченных = СтруктураДанных.КоличествоВсего Тогда
				СформироватьСписокЗаказовДляОтделаКонструкторов();
			Иначе
				ОбновитьСписокЗаказовДляКонструкторов(ВыбраннаяСтрока);
			КонецЕсли;
			
			Если СтруктураДанных.Команда = "ОтказКонструктор" Тогда
				ОтправитьПочтовоеСообщение(СтруктураДанных);  //Создать рассылку на электронную почту при отказе
			КонецЕсли;
			
			ОповеститьПользователя(СтруктураДанных.Команда);
		КонецЕсли;
	КонецЕсли;
		
	////////////////////////////////////////////////////////////////////////
	Если СтруктураДанных.Команда = "УстановитьСтатусВДокументе" Тогда
		СтатусИзменен = ИзменитьСтатусТекущегоЗаказа(СтруктураДанных);
		
		Если СтатусИзменен Тогда
			СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами();
			ОповеститьПользователя(СтруктураДанных.Команда);
		КонецЕсли;			
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПользователя(ТекущаяКоманда)
	
	Если ТекущаяКоманда = "СогласованоМенеджер"
		Или ТекущаяКоманда = "ОтказМенеджер"
		Или ТекущаяКоманда = "ОбработкаОповещенияПриЗакрытии" 
		Или ТекущаяКоманда = "СогласованоКонструктор" 
		Или ТекущаяКоманда = "ВернутьЗаказНаСогласование" 
		Или ТекущаяКоманда = "ОтказКонструктор" Тогда
		
		ЗаголовокОповещения = НСтр("ru = 'Процедура согласования'");
		ТекстСОписанием = НСтр("ru = 'Статус заказа именен!'");
//*******************************************************************************************//
	ИначеЕсли ТекущаяКоманда = "ИзменениеДатыОтгрузки" Или ТекущаяКоманда = "ВидЦеныПриИзменении" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Заказ клиента'");
		ТекстСОписанием = НСтр("ru = 'Запись обновлена!'"); 
//*******************************************************************************************//
	ИначеЕсли ТекущаяКоманда = "НазначитьИсполнителя" Тогда
		ЗаголовокОповещения = НСтр("ru = 'АРМ Процесс согласования'");
		ТекстСОписанием = НСтр("ru = 'Исполнитель изменен!'");  
//*******************************************************************************************//
	ИначеЕсли ТекущаяКоманда = "УстановитьСтатусВДокументе" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Изменения в документе'");
		ТекстСОписанием = НСтр("ru = 'Статус заказа именен!'");  
//*******************************************************************************************//
	ИначеЕсли ТекущаяКоманда = "ЗаписьДополнительныхСведений" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Изменения в спецификации'");
		ТекстСОписанием = НСтр("ru = 'Запись обновлена!'"); 
//*******************************************************************************************//
	ИначеЕсли ТекущаяКоманда = "СохранитьНастрокиОтбораЦен" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Настройки отбора цен'");
		ТекстСОписанием = НСтр("ru = 'Запись обновлена!'"); 
//*******************************************************************************************//
	ИначеЕсли ТекущаяКоманда = "ПриИзмененииПоляПодтверждено" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Согласование заказа'");
		ТекстСОписанием = НСтр("ru = 'Запись обновлена!'");
//*******************************************************************************************//
	ИначеЕсли ТекущаяКоманда = "СохранитьНастройкиРассылкиКонструктор" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Настройки рассылки электронных писем'");
		ТекстСОписанием = НСтр("ru = 'Запись обновлена!'");
//*******************************************************************************************//
    ИначеЕсли ТекущаяКоманда = "ЗагрузкаНовыхЗаказов" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Список заказов'");
		ТекстСОписанием = НСтр("ru = 'Записи обновлены!'");
//*******************************************************************************************//
	КонецЕсли;
		
	ПоказатьОповещениеПользователя(
		ЗаголовокОповещения,, 
		ТекстСОписанием,
		БиблиотекаКартинок.Информация48БЗК, 
		СтатусОповещенияПользователя.Информация);	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(Знач ВызваноИсключение = Ложь)
	
	Если ВызваноИсключение Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), 
			УровеньЖурналаРегистрации.Ошибка,,, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПроверитьСтрокиТоваровНаЗаполнение()
	ПолученныйРезультат = Новый Структура;	
	ПолученныйРезультат.Вставить("ОтсутствуетНоменклатура", Ложь);
	ПолученныйРезультат.Вставить("НеУстановленыСрокРазработки", Ложь);
	ПолученныйРезультат.Вставить("НеНазначенИсполнитель", Ложь);
	
	Для Каждого ТекДанные Из ТоварыЗаказаСоСпецификацией Цикл
		Если Не ЗначениеЗаполнено(ТекДанные.Номенклатура)   Тогда
			ПолученныйРезультат["ОтсутствуетНоменклатура"] = Истина;
		ИначеЕсли ЗначениеЗаполнено(ТекДанные.Спецификация) И ТекДанные.Статус = Перечисления.СтатусыСпецификаций.ВРазработке Тогда 
			Если ТекДанные.СрокиРазработки = Дата(1, 1, 1) Тогда
				ПолученныйРезультат["НеУстановленыСрокРазработки"] = Истина;				
			ИначеЕсли ЗначениеЗаполнено(ТекДанные.Спецификация) И Не ЗначениеЗаполнено(ТекДанные.Исполнитель) Тогда
				ПолученныйРезультат["НеНазначенИсполнитель"] = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ПолученныйРезультат;
КонецФункции

&НаСервере
Функция ПроверитьСписокСПолямиВРазработке(ФормаПодразделения)
	
	Если ФормаПодразделения.ФормаМенеджеров Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Подтверждено", Истина);
		СтруктураОтбора.Вставить("ПодтверждениеКБ", Ложь);
		
		МассивНайденыхСтрок = ТоварыЗаказа.НайтиСтроки(СтруктураОтбора);
	ИначеЕсли ФормаПодразделения.ФормаКонструкторов Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Подтверждено", Истина);
		СтруктураОтбора.Вставить("Статус", Перечисления.СтатусыСпецификаций.ВРазработке);
		
		МассивНайденыхСтрок = ТоварыЗаказаСоСпецификацией.НайтиСтроки(СтруктураОтбора);
	ИначеЕсли ФормаПодразделения.ФормаСнабжения Тогда
		//Если появится необходимость доп. разработки для снабжения	
	КонецЕсли;
	
	ЕстьТоварыСоСпецификациейВРазработке = ?(МассивНайденыхСтрок.Количество() = 0, Ложь, Истина);
	Возврат ЕстьТоварыСоСпецификациейВРазработке;
КонецФункции

&НаКлиенте
Процедура ЗадатьДополнительныйВопросПользователю(ПользовательскаяФорма, ТекущаяКоманда, НовыйЗаказСсылка)
	
	ЗаголовокВопроса = НСтр("ru = 'Новый заказ: '") + НовыйЗаказСсылка;
	ОписаниеВопроса = НСтр("ru = 'Загружен новый заказ, обновить текущий список?'");
	Режим = РежимДиалогаВопрос.ДаНет;
	Таймаут = 60;
	
	ОтветПользователя = Вопрос(ОписаниеВопроса, Режим, Таймаут,, ЗаголовокВопроса);
				
	Если ОтветПользователя = КодВозвратаДиалога.Нет Или ОтветПользователя = КодВозвратаДиалога.Таймаут Тогда
		Возврат;
	КонецЕсли;
	
	Если ПользовательскаяФорма.ФормаМенеджеров Тогда
		СформироватьСписокЗаказовДляОтделаПоРаботеСКлиентами();
		ОповеститьПользователя(ТекущаяКоманда);
	ИначеЕсли ПользовательскаяФорма.ФормаКонструкторов Тогда
		СформироватьСписокЗаказовДляОтделаКонструкторов();
		ОповеститьПользователя(ТекущаяКоманда);
	ИначеЕсли ПользовательскаяФорма.ФормаСнабжения Тогда	
		//Если потребуется доп разработка для снабжения
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область ОтправкаПочтовыхУведомлений

&НаСервере
Процедура ОтправитьПочтовоеСообщение(СтруктураДанных)
	
	СписокАдресов = СтруктураДанных["СписокАдресовДляРассылки"];
	
	Если СписокАдресов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены адреса для рассылки электронных писем!'"),, "СписокАдресовДляРассылки");
	    Возврат;
	КонецЕсли;
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ТабДок = ОбъектОбработки.ПодготовитьТабличныйДокументДляОтправкиРассылки(СтруктураДанных);
	
	УчетнаяЗаписьОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Системная учетная запись");
	
	Если УчетнаяЗаписьОтправителя.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найдена учетная запись рассылки'"));
		Возврат;
	КонецЕсли;
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = "Уведомление из 1С";
	
	Для Каждого ВыбранныйАдрес Из СписокАдресов Цикл 
		Письмо.Получатели.Добавить(ВыбранныйАдрес.Значение);
	КонецЦикла;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
	ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML5);
	
	Файл = Новый ЧтениеТекста(ИмяВременногоФайла);
	Текст = Файл.Прочитать();
	Письмо.Тексты.Добавить(Текст, ТипТекстаПочтовогоСообщения.HTML);
	Письмо.ОбработатьТексты();
	
    РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗаписьОтправителя, Письмо);	
КонецПроцедуры

#КонецОбласти