
&НаСервере
&ИзменениеИКонтроль("ОбработатьИзменениеСтатусаНаСервере")
Процедура АРМ1_ОбработатьИзменениеСтатусаНаСервере()

	ДанныеЗаполнения = ДанныеЗаполненияПриИзмененииСтатуса();

	ИзмененныеРеквизиты = УправлениеПроизводством.ЗаполнитьРеквизитыЭтапаПриИзмененииСтатуса(
	Объект, 
	ТекущийСтатус, 
	ДанныеЗаполнения);

	ПослеИзмененияСтатусаНаСервере(ИзмененныеРеквизиты);
	ОбновитьКолонкуДоступноСервер();
	#Вставка
	Если Объект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат Тогда
		ТЗ = Объект.Распоряжение.Продукция.Выгрузить(,"Номенклатура,ДатаПотребности");
		Для каждого стр из Объект.ВыходныеИзделия Цикл
			Если Не стр.Произведено Тогда
				стрТЗ = ТЗ.НайтиСтроки(Новый Структура("Номенклатура",стр.Номенклатура));
				стр.ДатаПроизводства = стрТЗ[0].ДатаПотребности;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#КонецВставки

КонецПроцедуры
