Функция ПолучитьОстаток_2_5(Номенклатура, Склад) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
	               |	РаспределениеЗапасов.Склад КАК Склад,
	               |	РаспределениеЗапасов.ВНаличии КАК ВНаличии,
	               |	РаспределениеЗапасов.Резерв КАК ВРезервеСоСклада,
	               |	0 КАК КОтгрузке
	               |ПОМЕСТИТЬ ВТ_СвободныеОстатки
	               |ИЗ
	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |ГДЕ
	               |	РаспределениеЗапасов.Состояние = &Состояние
	               |	И РаспределениеЗапасов.Номенклатура = &Номенклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.Характеристика,
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	0,
	               |	0,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
	               |ГДЕ
	               |	ТоварыКОтгрузкеОстатки.Номенклатура = &Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвободныеОстатки.Номенклатура КАК Номенклатура,
	               |	ВТ_СвободныеОстатки.Характеристика КАК Характеристика,
	               |	ВТ_СвободныеОстатки.Склад КАК Склад,
	               |	СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0)) КАК ВНаличии,
	               |	СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВРезервеСоСклада, 0)) КАК ВРезервеСоСклада,
	               |	ВЫБОР
	               |		КОГДА СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0)) >= СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.КОтгрузке, 0))
	               |			ТОГДА СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.КОтгрузке, 0))
	               |		ИНАЧЕ СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0))
	               |	КОНЕЦ КАК КОтгрузке
	               |ИЗ
	               |	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СвободныеОстатки.Номенклатура,
	               |	ВТ_СвободныеОстатки.Склад,
	               |	ВТ_СвободныеОстатки.Характеристика";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Вналичии - Выборка.ВРезервеСоСклада - Выборка.КОтгрузке;
	Иначе                   
		Сообщить("Остаток на складе отсутствует! ",СтатусСообщения.Информация);
		Возврат 0;
	КонецЕсли;    
	
КонецФункции        