
///////////////////////////////////////////////////////////////////////////
#Область ФормированиеОтчетаПриОткрытии

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодготовитьПараметрыДляФормирования();
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьПараметрыДляФормирования()
	
	Если ДокументОтчета.Пустая() Или ДокументОтчета = Неопределено Тогда
		Предупреждение("Не найден документ для формирования отчета", 15, "Текущее состояние заказа");
		Возврат;
	КонецЕсли;
	
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументОтчета = Параметры.ЗаказКлиента;
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТабДок = ТекущийОбъект.СформироватьОтчетСостояниеВыполнения(ДокументОтчета);
	
	Объект.ТаблицаОтчета.Очистить();
	Объект.ТаблицаОтчета = ТабДок;
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область ДополнительныеКомандыИДействия

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Переформировать(Команда)
	ПодготовитьПараметрыДляФормирования();
КонецПроцедуры

#КонецОбласти