Функция ПолучитьОстаток_2_5(Номенклатура, Склад, МассивЭтапов) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировано,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отгружено
	               |ПОМЕСТИТЬ ЗарезервированоИОтружено
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В(&МассивЭтапов)
	               |	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
	               |	РаспределениеЗапасов.Склад КАК Склад,
	               |	РаспределениеЗапасов.ВНаличии КАК ВНаличии,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЗарезервированоИОтружено.Зарезервировано, 0) < РаспределениеЗапасов.Резерв
	               |			ТОГДА РаспределениеЗапасов.Резерв - ЕСТЬNULL(ЗарезервированоИОтружено.Зарезервировано, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВРезервеСоСклада,
	               |	0 КАК КОтгрузке
	               |ПОМЕСТИТЬ ВТ_СвободныеОстатки
	               |ИЗ
	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗарезервированоИОтружено КАК ЗарезервированоИОтружено
	               |		ПО (РаспределениеЗапасов.Номенклатура = ЕСТЬNULL(ЗарезервированоИОтружено.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |ГДЕ
	               |	РаспределениеЗапасов.Состояние = &Состояние
	               |	И РаспределениеЗапасов.Номенклатура = &Номенклатура
	               |	И РаспределениеЗапасов.Склад = &Склад
	               |	И НЕ РаспределениеЗапасов.ЗаказНаОтгрузку В (&МассивЭтапов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.Характеристика,
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	0,
	               |	0,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
	               |ГДЕ
	               |	ТоварыКОтгрузкеОстатки.Номенклатура = &Номенклатура
	               |	И ТоварыКОтгрузкеОстатки.Склад = &Склад
	               |	И НЕ ТоварыКОтгрузкеОстатки.ДокументОтгрузки В (&МассивЭтапов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвободныеОстатки.Номенклатура КАК Номенклатура,
	               |	ВТ_СвободныеОстатки.Характеристика КАК Характеристика,
	               |	ВТ_СвободныеОстатки.Склад КАК Склад,
	               |	СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0)) КАК ВНаличии,
	               |	СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВРезервеСоСклада, 0)) КАК ВРезервеСоСклада,
	               |	ВЫБОР
	               |		КОГДА СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0)) >= СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.КОтгрузке, 0))
	               |			ТОГДА СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.КОтгрузке, 0))
	               |		ИНАЧЕ СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0))
	               |	КОНЕЦ КАК КОтгрузке
	               |ИЗ
	               |	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СвободныеОстатки.Номенклатура,
	               |	ВТ_СвободныеОстатки.Склад,
	               |	ВТ_СвободныеОстатки.Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
	//Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе);
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда 
	//Выборка = Запрос.Выполнить().Выбрать(); 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	//Если Выборка.Следующий() Тогда 
		Возврат Выборка.Вналичии - Выборка.ВРезервеСоСклада - Выборка.КОтгрузке;
	Иначе                   
		//Сообщить("Остаток на складе отсутствует! " + Номенклатура,СтатусСообщения.Информация);
		Возврат 0;
	КонецЕсли;    
	
КонецФункции        

Функция ПолучитьКатегориюМатериала(Номенклатура,ДР_КатегорияМатериала) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Владелец КАК Свойство,
	               |	ЗначенияСвойствОбъектов.Ссылка КАК КатегорияМатериала,
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |		ПО НоменклатураДополнительныеРеквизиты.Свойство = ЗначенияСвойствОбъектов.Владелец
	               |			И НоменклатураДополнительныеРеквизиты.Значение = ЗначенияСвойствОбъектов.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство",ДР_КатегорияМатериала);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КатегорияМатериала;
	Иначе 
		Возврат Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

Функция УпаковкаШтуки(Упаковка) Экспорт
	
	Если Упаковка.ЕдиницаИзмерения  = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(796) Тогда 
		Возврат  Истина;
	Иначе 
		Возврат Ложь;   
	КонецЕсли;
	
КонецФункции
//Функция ПолучитьОстаток_2_5(Номенклатура, Склад, МассивЭтапов) Экспорт
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
//	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Зарезервировано,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
//	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Отгружено
//	               |ПОМЕСТИТЬ ЗарезервированоИОтружено
//	               |ИЗ
//	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
//	               |ГДЕ
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В(&МассивЭтапов)
//	               |	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = &Номенклатура
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
//	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
//	               |	РаспределениеЗапасов.Склад КАК Склад,
//	               |	РаспределениеЗапасов.ВНаличии КАК ВНаличии,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(ЗарезервированоИОтружено.Зарезервировано, 0) < РаспределениеЗапасов.Резерв
//	               |			ТОГДА РаспределениеЗапасов.Резерв - ЕСТЬNULL(ЗарезервированоИОтружено.Зарезервировано, 0)
//	               |		ИНАЧЕ 0
//	               |	КОНЕЦ КАК ВРезервеСоСклада,
//	               |	0 КАК КОтгрузке
//	               |ПОМЕСТИТЬ ВТ_СвободныеОстатки
//	               |ИЗ
//	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗарезервированоИОтружено КАК ЗарезервированоИОтружено
//	               |		ПО (РаспределениеЗапасов.Номенклатура = ЕСТЬNULL(ЗарезервированоИОтружено.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
//	               |ГДЕ
//	               |	РаспределениеЗапасов.Состояние = &Состояние
//	               |	И РаспределениеЗапасов.Номенклатура = &Номенклатура
//	               |	И РаспределениеЗапасов.Склад = &Склад
//	               |	И НЕ РаспределениеЗапасов.ЗаказНаОтгрузку В (&МассивЭтапов)
//	               |
//	               |ОБЪЕДИНИТЬ ВСЕ
//	               |
//	               |ВЫБРАТЬ
//	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
//	               |	ТоварыКОтгрузкеОстатки.Характеристика,
//	               |	ТоварыКОтгрузкеОстатки.Склад,
//	               |	0,
//	               |	0,
//	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
//	               |ИЗ
//	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
//	               |ГДЕ
//	               |	ТоварыКОтгрузкеОстатки.Номенклатура = &Номенклатура
//	               |	И ТоварыКОтгрузкеОстатки.Склад = &Склад
//	               |	И НЕ ТоварыКОтгрузкеОстатки.ДокументОтгрузки В (&МассивЭтапов)
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВТ_СвободныеОстатки.Номенклатура КАК Номенклатура,
//	               |	ВТ_СвободныеОстатки.Характеристика КАК Характеристика,
//	               |	ВТ_СвободныеОстатки.Склад КАК Склад,
//	               |	СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0)) КАК ВНаличии,
//	               |	СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВРезервеСоСклада, 0)) КАК ВРезервеСоСклада,
//	               |	ВЫБОР
//	               |		КОГДА СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0)) >= СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.КОтгрузке, 0))
//	               |			ТОГДА СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.КОтгрузке, 0))
//	               |		ИНАЧЕ СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0))
//	               |	КОНЕЦ КАК КОтгрузке
//	               |ИЗ
//	               |	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВТ_СвободныеОстатки.Номенклатура,
//	               |	ВТ_СвободныеОстатки.Склад,
//	               |	ВТ_СвободныеОстатки.Характеристика";
//	
//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//	Запрос.УстановитьПараметр("Склад", Склад);
//	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
//	//Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
//	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе);
//	РезультатЗапроса = Запрос.Выполнить();
//	Если не РезультатЗапроса.Пустой() Тогда 
//	//Выборка = Запрос.Выполнить().Выбрать(); 
//		Выборка = РезультатЗапроса.Выбрать();
//		Выборка.Следующий();
//	//Если Выборка.Следующий() Тогда 
//		Возврат Выборка.Вналичии - Выборка.ВРезервеСоСклада - Выборка.КОтгрузке;
//	Иначе                   
//		//Сообщить("Остаток на складе отсутствует! " + Номенклатура,СтатусСообщения.Информация);
//		Возврат 0;
//	КонецЕсли;    
//	
//КонецФункции        

