
&ИзменениеИКонтроль("УстановитьСтатус")
Функция АРМ1_УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры)

	СтатусДоИзменения = Статус;

	ЗначениеНовогоСтатуса = Перечисления.СтатусыЭтаповПроизводства2_2[НовыйСтатус];

	Статус = ЗначениеНовогоСтатуса;

	ДанныеЗаполнения = УправлениеПроизводством.ДанныеЗаполненияПриИзмененииСтатуса(ЭтотОбъект);

	УправлениеПроизводством.ЗаполнитьРеквизитыЭтапаПриИзмененииСтатуса(
	ЭтотОбъект,
	СтатусДоИзменения,
	ДанныеЗаполнения);

	Если ДополнительныеПараметры <> Неопределено Тогда // дополнительные действия

		ЗаказыСервер.СкорректироватьСтрокиЗаказа(ЭтотОбъект, ДополнительныеПараметры);

		ЗаполнитьОбеспечениеПриУстановкеСтатуса(ДополнительныеПараметры); 

		НазначитьИсполнителяПриУстановкеСтатуса(ДополнительныеПараметры);

	КонецЕсли;
	
	#Вставка
	Если ЗначениеНовогоСтатуса = Перечисления.СтатусыЭтаповПроизводства2_2.Начат Тогда
		ТЗ = Распоряжение.Продукция.Выгрузить(,"Номенклатура,ДатаПотребности");
		Для каждого стр из ВыходныеИзделия Цикл
			Если Не стр.Произведено Тогда
				стрТЗ = ТЗ.НайтиСтроки(Новый Структура("Номенклатура",стр.Номенклатура));
				стр.ДатаПроизводства = стрТЗ[0].ДатаПотребности;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#КонецВставки


	Возврат ПроверитьЗаполнение();

КонецФункции
