///////////////////////////////////////////////////////////////////////////
#Область АРМ_ПроцессСогласованияФормированиеМакетов

Функция СформироватьОтчетСостояниеВыполнения(ДокументОтчета) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	МакетОтчета = ПолучитьМакет("СостояниеВыполненияДокумента_MXL");
	
	ОбластьЗаголовок = МакетОтчета.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ИмяДокумента = ДокументОтчета.Назначение;
	ТабДок.Вывести(ОбластьЗаголовок);
		
	ОбластьЗаголовокТаблицы = МакетОтчета.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьЗаголовокТаблицы.Параметры.Заголовок = "Обеспечение";
	ТабДок.Вывести(ОбластьЗаголовокТаблицы);
	
	ОбластьШапкаТаблицыОбеспечение = МакетОтчета.ПолучитьОбласть("ШапкаТаблицыОбеспечение");
	ТабДок.Вывести(ОбластьШапкаТаблицыОбеспечение);
	
	ОбластьСтрокаТаблицыОбеспечение = МакетОтчета.ПолучитьОбласть("СтрокаТаблицыОбеспечение");
	ОбластьПодвалИтогиОбеспечение = МакетОтчета.ПолучитьОбласть("ПодвалИтогиОбеспечение");
		
	Для Каждого ТекДанные Из ДокументОтчета.Товары Цикл
		ОбластьСтрокаТаблицыОбеспечение.Параметры.НомерСтроки = ТекДанные.НомерСтроки;
		ОбластьСтрокаТаблицыОбеспечение.Параметры.Товар = ТекДанные.Номенклатура;
		ОбластьСтрокаТаблицыОбеспечение.Параметры.Действие = ТекДанные.ВариантОбеспечения;
		ОбластьСтрокаТаблицыОбеспечение.Параметры.ДатаОтгрузки = ТекДанные.ДатаОтгрузки;
		ОбластьСтрокаТаблицыОбеспечение.Параметры.Количество = ТекДанные.КоличествоУпаковок;
		ОбластьСтрокаТаблицыОбеспечение.Параметры.Упаковка = ТекДанные.Упаковка;
		ОбластьСтрокаТаблицыОбеспечение.Параметры.Сумма = ТекДанные.Сумма;
		ТабДок.Вывести(ОбластьСтрокаТаблицыОбеспечение);
	КонецЦикла;
	
	ОбластьПодвалИтогиОбеспечение.Параметры.СуммаИтоги = ДокументОтчета.СуммаДокумента;
	ТабДок.Вывести(ОбластьПодвалИтогиОбеспечение);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ЗакончитьАвтоГруппировкуСтрок();
	
	Возврат ТабДок;
	
КонецФункции

Функция ПодготовитьТабличныйДокументДляОтправкиРассылки(СтруктураДанных) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	МакетРассылки = ПолучитьМакет("РассылкаПриОтказе_MXL");
	ОбластьШапкиРассылки = МакетРассылки.ПолучитьОбласть("ШапкаРассылки");
	ТабДок.Вывести(ОбластьШапкиРассылки);
	
	ОбластьРеквизитыТаблицыРассылки = МакетРассылки.ПолучитьОбласть("РеквизитыТаблицыРассылки");
	ТабДок.Вывести(ОбластьРеквизитыТаблицыРассылки);
	
	ОбластьЗначенияРеквизитовТаблицыРассыки = МакетРассылки.ПолучитьОбласть("ЗначенияРеквизитовТаблицыРассыки");
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Для Каждого ТекДанные Из СтруктураДанных["ДанныеПоНоменклатуре"] Цикл
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.Назначение = СтруктураДанных["ЗаказКлиента"].НомерПоДаннымКлиента;
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.ЗаказКлиента = СтруктураДанных["ЗаказКлиента"];
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.ДатаЗаказа = Формат(СтруктураДанных["ДатаНачала"], "ДЛФ=DD");
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.Организация = СтруктураДанных["Организация"];
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.Изделие = ТекДанные.Ключ;
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.Количество = ТекДанные.Значение;
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.Подразделение = СтруктураДанных["Подразделение"];
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.Исполнитель = СтруктураДанных["Исполнитель"];
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.ДатаОтказа = СтруктураДанных["ДатаОкончания"];	
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.ПричинаОтказа = СтруктураДанных["ПричинаОтказа"];
		ОбластьЗначенияРеквизитовТаблицыРассыки.Параметры.СтатусСогласования = СтруктураДанных["СтатусСогласования"];
		
		ТабДок.Вывести(ОбластьЗначенияРеквизитовТаблицыРассыки);
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ЗакончитьАвтоГруппировкуСтрок();
	
	Возврат ТабДок;

КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область АРМ_ПроцессСогласованияПолучениеСебестоимости

&НаСервере
Функция ПолучитьСписокТоваровССебестоимостьюДляОтделаПоРаботеСКлиентами(СтруктураОтбора, Знач ДетальныеЗаписи = Неопределено) Экспорт
	
	//Если Объект.ТаблицаОтбораЦен.Количество() = 0 Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Необходимо заполнить список отбора цен'"),, "Объект.ТаблицаОтбораЦен");
	//	Возврат ;
	//КонецЕсли;
		
	ВидПродукцияРоболабс = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продукция Роболабс");
	ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Фоб", Истина);
	СвойствоДопРеквизита = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Код комплекта ТТМ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
					|	ТТМ_СогласованиеЗаказовМенеджер.ЗаказКлиента КАК ЗаказКлиента,
					|	ТТМ_СогласованиеЗаказовМенеджер.Изделие КАК Изделие,
					|	ВЫБОР
					|		КОГДА ТТМ_СогласованиеЗаказовМенеджер.СтатусСогласования = &СтатусСогласования
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК Подтверждено
					|ПОМЕСТИТЬ ВТ_РегистрТТМПроцессПроизводства
					|ИЗ
					|	РегистрСведений.ТТМ_СогласованиеЗаказовМенеджер КАК ТТМ_СогласованиеЗаказовМенеджер
					|ГДЕ
					|	ТТМ_СогласованиеЗаказовМенеджер.ЗаказКлиента = &ЗаказКлиента
					|	И ТТМ_СогласованиеЗаказовМенеджер.Подразделение = &Подразделение
					|	И ТТМ_СогласованиеЗаказовМенеджер.Назначение = &Назначение
					|
					|СГРУППИРОВАТЬ ПО
					|	ТТМ_СогласованиеЗаказовМенеджер.Изделие,
					|	ТТМ_СогласованиеЗаказовМенеджер.ЗаказКлиента,
					|	ВЫБОР
					|		КОГДА ТТМ_СогласованиеЗаказовМенеджер.СтатусСогласования = &СтатусСогласования
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
					|	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ) КАК Подтверждено,
					|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
					|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
					|	ЗаказКлиентаТовары.Упаковка КАК ЕдиницаИзмерения,
					|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК Количество,
					|	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
					|	ЗаказКлиентаТовары.Цена КАК Цена,
					|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
					|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
					|	ЗаказКлиентаТовары.СуммаСНДС КАК ИтоговаяСумма,
					|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ЖелаемаяДатаПРоизводства
					|ПОМЕСТИТЬ ВТ_ТоварыЗаказаКлиентаМП
					|ИЗ
					|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрТТМПроцессПроизводства КАК ВТ_РегистрТТМПроцессПроизводства
					|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_РегистрТТМПроцессПроизводства.ЗаказКлиента
					|			И ЗаказКлиентаТовары.Номенклатура = ВТ_РегистрТТМПроцессПроизводства.Изделие
					|ГДЕ
					|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
					|
					|СГРУППИРОВАТЬ ПО
					|	ЗаказКлиентаТовары.Номенклатура,
					|	ЗаказКлиентаТовары.Ссылка,
					|	ЗаказКлиентаТовары.Упаковка,
					|	ЗаказКлиентаТовары.ВидЦены,
					|	ЗаказКлиентаТовары.Цена,
					|	ЗаказКлиентаТовары.СтавкаНДС,
					|	ЗаказКлиентаТовары.СуммаНДС,
					|	ЗаказКлиентаТовары.СуммаСНДС,
					|	ЗаказКлиентаТовары.ДатаОтгрузки,
					|	ЗаказКлиентаТовары.НомерСтроки,
					|	ЕСТЬNULL(ВТ_РегистрТТМПроцессПроизводства.Подтверждено, ЛОЖЬ)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_РегистрТТМПроцессПроизводства
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ВТ_ТоварыЗаказаКлиентаМП.НомерСтроки КАК НомерСтроки,
					|	ВТ_ТоварыЗаказаКлиентаМП.Подтверждено КАК Подтверждено,
					|	ВЫБОР
					|		КОГДА ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования = &СтатусСогласования
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЕСТЬNULL(ТТМ_СогласованиеЗаказовКонструктор.СтатусСогласования, ЛОЖЬ)
					|	КОНЕЦ КАК ПодтверждениеКБ,
					|	ВТ_ТоварыЗаказаКлиентаМП.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_ТоварыЗаказаКлиентаМП.Номенклатура КАК Номенклатура,
					|	ВТ_ТоварыЗаказаКлиентаМП.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_ТоварыЗаказаКлиентаМП.Количество КАК Количество,
					|	ВТ_ТоварыЗаказаКлиентаМП.ВидЦены КАК ВидЦены,
					|	ВТ_ТоварыЗаказаКлиентаМП.Цена КАК Цена,
					|	ВТ_ТоварыЗаказаКлиентаМП.СтавкаНДС КАК СтавкаНДС,
					|	ВТ_ТоварыЗаказаКлиентаМП.СуммаНДС КАК СуммаНДС,
					|	ВТ_ТоварыЗаказаКлиентаМП.ИтоговаяСумма КАК ИтоговаяСумма,
					|	ВТ_ТоварыЗаказаКлиентаМП.ЖелаемаяДатаПРоизводства КАК ЖелаемаяДатаПРоизводства
					|ПОМЕСТИТЬ ВТ_СписокТоваровСПодтверждениемКБ
					|ИЗ
					|	ВТ_ТоварыЗаказаКлиентаМП КАК ВТ_ТоварыЗаказаКлиентаМП
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_СогласованиеЗаказовКонструктор КАК ТТМ_СогласованиеЗаказовКонструктор
					|		ПО ВТ_ТоварыЗаказаКлиентаМП.ЗаказКлиента = ТТМ_СогласованиеЗаказовКонструктор.ЗаказКлиента
					|			И ВТ_ТоварыЗаказаКлиентаМП.Номенклатура = ТТМ_СогласованиеЗаказовКонструктор.Изделие
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_ТоварыЗаказаКлиентаМП
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(РесурсныеСпецификации.Ссылка, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК Спецификация,
					|	ВТ_СписокТоваровСПодтверждениемКБ.НомерСтроки КАК НомерСтроки,
					|	ВТ_СписокТоваровСПодтверждениемКБ.Подтверждено КАК Подтверждено,
					|	ВТ_СписокТоваровСПодтверждениемКБ.ПодтверждениеКБ КАК ПодтверждениеКБ,
					|	ВТ_СписокТоваровСПодтверждениемКБ.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_СписокТоваровСПодтверждениемКБ.Номенклатура КАК Номенклатура,
					|	ВТ_СписокТоваровСПодтверждениемКБ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_СписокТоваровСПодтверждениемКБ.Количество КАК Количество,
					|	ВТ_СписокТоваровСПодтверждениемКБ.ВидЦены КАК ВидЦены,
					|	ВТ_СписокТоваровСПодтверждениемКБ.Цена КАК Цена,
					|	ВТ_СписокТоваровСПодтверждениемКБ.СтавкаНДС КАК СтавкаНДС,
					|	ВТ_СписокТоваровСПодтверждениемКБ.СуммаНДС КАК СуммаНДС,
					|	ВТ_СписокТоваровСПодтверждениемКБ.ИтоговаяСумма КАК ИтоговаяСумма,
					|	ВТ_СписокТоваровСПодтверждениемКБ.ЖелаемаяДатаПРоизводства КАК ЖелаемаяДатаПРоизводства
					|ПОМЕСТИТЬ ВТ_СписокСоСвязаннымиСпецификациями
					|ИЗ
					|	ВТ_СписокТоваровСПодтверждениемКБ КАК ВТ_СписокТоваровСПодтверждениемКБ
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
					|		ПО ВТ_СписокТоваровСПодтверждениемКБ.Номенклатура = РесурсныеСпецификации.ОсновноеИзделиеНоменклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_СписокТоваровСПодтверждениемКБ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ЕСТЬNULL(ТТМ_ИсполнителиСпецификаций.СрокиРазработки, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокиРазработки,
					|	ВТ_СписокСоСвязаннымиСпецификациями.Спецификация КАК Спецификация,
					|	ВТ_СписокСоСвязаннымиСпецификациями.НомерСтроки КАК НомерСтроки,
					|	ВТ_СписокСоСвязаннымиСпецификациями.Подтверждено КАК Подтверждено,
					|	ВТ_СписокСоСвязаннымиСпецификациями.ПодтверждениеКБ КАК ПодтверждениеКБ,
					|	ВТ_СписокСоСвязаннымиСпецификациями.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_СписокСоСвязаннымиСпецификациями.Номенклатура КАК Номенклатура,
					|	ВТ_СписокСоСвязаннымиСпецификациями.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_СписокСоСвязаннымиСпецификациями.Количество КАК Количество,
					|	ВТ_СписокСоСвязаннымиСпецификациями.ВидЦены КАК ВидЦены,
					|	ВТ_СписокСоСвязаннымиСпецификациями.Цена КАК Цена,
					|	ВТ_СписокСоСвязаннымиСпецификациями.СтавкаНДС КАК СтавкаНДС,
					|	ВТ_СписокСоСвязаннымиСпецификациями.СуммаНДС КАК СуммаНДС,
					|	ВТ_СписокСоСвязаннымиСпецификациями.ИтоговаяСумма КАК ИтоговаяСумма,
					|	ВТ_СписокСоСвязаннымиСпецификациями.ЖелаемаяДатаПРоизводства КАК ЖелаемаяДатаПРоизводства
					|ПОМЕСТИТЬ ВТ_ИтоговыеДанные
					|ИЗ
					|	ВТ_СписокСоСвязаннымиСпецификациями КАК ВТ_СписокСоСвязаннымиСпецификациями
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_ИсполнителиСпецификаций КАК ТТМ_ИсполнителиСпецификаций
					|		ПО ВТ_СписокСоСвязаннымиСпецификациями.Спецификация = ТТМ_ИсполнителиСпецификаций.Спецификация
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ВТ_ИтоговыеДанные.НомерСтроки КАК НомерСтроки,
					|	ВТ_ИтоговыеДанные.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_ИтоговыеДанные.Подтверждено КАК Подтверждено,
					|	ВТ_ИтоговыеДанные.ПодтверждениеКБ КАК ПодтверждениеКБ,
					|	ВТ_ИтоговыеДанные.СрокиРазработки КАК СрокиРазработкиКБ,
					|	ВТ_ИтоговыеДанные.Номенклатура КАК Номенклатура,
					|	ВТ_ИтоговыеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_ИтоговыеДанные.Количество КАК Количество,
					|	ВТ_ИтоговыеДанные.ВидЦены КАК ВидЦены,
					|	ВТ_ИтоговыеДанные.Цена КАК Цена,
					|	ВТ_ИтоговыеДанные.СтавкаНДС КАК СтавкаНДС,
					|	ВТ_ИтоговыеДанные.СуммаНДС КАК СуммаНДС,
					|	ВТ_ИтоговыеДанные.ИтоговаяСумма КАК ИтоговаяСумма,
					|	ВТ_ИтоговыеДанные.ЖелаемаяДатаПРоизводства КАК ЖелаемаяДатаПроизводства,
					|	ЕСТЬNULL(ВТ_ИтоговыеДанные.Спецификация.ОсновноеИзделиеЭтап.ДлительностьЭтапа, 0) КАК ДлительностьЭтапа
					|ПОМЕСТИТЬ ВТ_ИтогиБезСебестоимости
					|ИЗ
					|	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ГраницыИЦены.Порог КАК Граница,
					|	ГраницыИЦены.ВидЦены КАК ВидЦены,
					|	ГраницыИЦены.ОсновнаяЦена КАК ОсновнаяЦена
					|ПОМЕСТИТЬ ВТ_ГраницыИЦены
					|ИЗ
					|	&ГраницыИЦены КАК ГраницыИЦены
					|ГДЕ
					|	ГраницыИЦены.ОсновнаяЦена = &ВидЦены
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	Номенклатура.Ссылка КАК Номенклатура,
					|	ЕСТЬNULL(ДополнительныеСведения.Значение, &ПустаяСтрока) КАК Значение
					|ПОМЕСТИТЬ ВТ_НоменклатураСДопСвед
					|ИЗ
					|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
					|		ПО ДополнительныеСведения.Объект = Номенклатура.Ссылка
					|ГДЕ
					|	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
					|	И ДополнительныеСведения.Свойство = &Свойство
					|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_НоменклатураСДопСвед.Номенклатура КАК НоменклатураРобо,
					|	ВТ_НоменклатураСДопСвед.Значение КАК Значение,
					|	ЕСТЬNULL(спрНоменклатура.Ссылка, НоменклатураВыхИзд.Ссылка) КАК Номенклатура
					|ПОМЕСТИТЬ ВТ_НоменклатураСУчетомКомплектов
					|ИЗ
					|	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные,
					|	ВТ_ИтогиБезСебестоимости КАК ВТ_ИтогиБезСебестоимости,
					|	Справочник.Номенклатура КАК НоменклатураВыхИзд
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НоменклатураСДопСвед КАК ВТ_НоменклатураСДопСвед
					|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
					|			ПО (ЕСТЬNULL(ВТ_НоменклатураСДопСвед.Значение, &ПустаяСтрока) = спрНоменклатура.КодДляПоиска)
					|		ПО НоменклатураВыхИзд.Ссылка = ВТ_НоменклатураСДопСвед.Номенклатура
					|ГДЕ
					|	НоменклатураВыхИзд.Ссылка В (ВТ_ИтогиБезСебестоимости.Номенклатура)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_НоменклатураСДопСвед
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Спецификация,
					|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура
					|ПОМЕСТИТЬ Спецификации
					|ИЗ
					|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
					|ГДЕ
					|	РесурсныеСпецификацииВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
					|	И РесурсныеСпецификацииВыходныеИзделия.Номенклатура В
					|			(ВЫБРАТЬ
					|				Т.Номенклатура
					|			ИЗ
					|				ВТ_НоменклатураСУчетомКомплектов КАК Т)
					|	И РесурсныеСпецификацииВыходныеИзделия.Ссылка.ВариантПодбораВДокументы = ЗНАЧЕНИЕ(Перечисление.ВариантыподбораСпецификацииВДокументы.Автоматически)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК СсылкаНаСпецификацию,
					|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(РесурсныеСпецификацииВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА РесурсныеСпецификацииВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ РесурсныеСпецификацииВыходныеИзделия.Упаковка
					|	КОНЕЦ КАК УпаковкаЕдиницаИзмерения,
					|	РесурсныеСпецификацииВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковокЕдиницИзмерения,
					|	ВЫРАЗИТЬ(РесурсныеСпецификацииВыходныеИзделия.КоличествоУпаковок * ЕСТЬNULL(ВЫБОР
					|				КОГДА ЕСТЬNULL(РесурсныеСпецификацииВыходныеИзделия.Упаковка.Знаменатель, 1) <> 0
					|						И ЕСТЬNULL(РесурсныеСпецификацииВыходныеИзделия.Упаковка.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|					ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(РесурсныеСпецификацииВыходныеИзделия.Упаковка.Числитель, 1) / ЕСТЬNULL(РесурсныеСпецификацииВыходныеИзделия.Упаковка.Знаменатель, 1) КАК ЧИСЛО(17, 7))
					|				ИНАЧЕ NULL
					|			КОНЕЦ, 1) КАК ЧИСЛО(15, 3)) КАК Количество
					|ПОМЕСТИТЬ ВТ_ВыходныеИзделия
					|ИЗ
					|	Спецификации КАК Спецификации
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
					|		ПО Спецификации.Спецификация = РесурсныеСпецификацииВыходныеИзделия.Ссылка
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_ИтоговыеДанные
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК СсылкаНаСпецификацию,
					|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Материал,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
					|	КОНЕЦ КАК УпаковкаЕдиницаИзмерения,
					|	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок) КАК КоличествоУпаковокЕдиницИзмерения,
					|	СУММА(ВЫРАЗИТЬ(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок * ЕСТЬNULL(ВЫБОР
					|					КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель, 1) <> 0
					|							И ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Ссылка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|						ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель, 1) / ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель, 1) КАК ЧИСЛО(17, 7))
					|					ИНАЧЕ NULL
					|				КОНЕЦ, 1) КАК ЧИСЛО(15, 3))) КАК Количество
					|ПОМЕСТИТЬ ВТ_Материалы
					|ИЗ
					|	Спецификации КАК Спецификации
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
					|		ПО Спецификации.Спецификация = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
					|
					|СГРУППИРОВАТЬ ПО
					|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
					|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
					|	КОНЕЦ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ Спецификации
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_Материалы.Материал КАК Материал,
					|	ВТ_Материалы.УпаковкаЕдиницаИзмерения КАК УпаковкаЕдиницаИзмерения,
					|	ВТ_Материалы.КоличествоУпаковокЕдиницИзмерения КАК КоличествоУпаковокЕдиницИзмерения,
					|	ВТ_ВыходныеИзделия.СсылкаНаСпецификацию КАК СсылкаНаСпецификацию
					|ПОМЕСТИТЬ ВТ_МатериалыСпецификации
					|ИЗ
					|	ВТ_ВыходныеИзделия КАК ВТ_ВыходныеИзделия
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Материалы КАК ВТ_Материалы
					|		ПО ВТ_ВыходныеИзделия.СсылкаНаСпецификацию = ВТ_Материалы.СсылкаНаСпецификацию
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ВыходныеИзделия.СсылкаНаСпецификацию КАК СсылкаНаСпецификацию,
					|	ВТ_ВыходныеИзделия.ВыходноеИзделие КАК ВыходноеИзделие,
					|	ВТ_ВыходныеИзделия.УпаковкаЕдиницаИзмерения КАК УпаковкаЕдиницаИзмерения,
					|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК УпаковкаЦены,
					|	ВТ_ВыходныеИзделия.Количество КАК Количество,
					|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
					|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
					|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
					|	ЦеныНоменклатурыСрезПоследних.Цена * ВТ_ВыходныеИзделия.Количество КАК Стоимость,
					|	ВЫБОР
					|		КОГДА &СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
					|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * ВТ_ВыходныеИзделия.Количество / 120 * 100
					|		КОГДА &СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
					|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * ВТ_ВыходныеИзделия.Количество / 118 * 100
					|		КОГДА &СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
					|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * ВТ_ВыходныеИзделия.Количество / 110 * 100
					|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена * ВТ_ВыходныеИзделия.Количество
					|	КОНЕЦ КАК СтоимостьБезНДС,
					|	ЦеныНоменклатурыСрезПоследних.Период КАК Период
					|ПОМЕСТИТЬ ВТ_ЦенаНоменклатурыВыходногоИзделия
					|ИЗ
					|	ВТ_ВыходныеИзделия КАК ВТ_ВыходныеИзделия
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(КОНЕЦПЕРИОДА(&ТекущийПериод, ДЕНЬ), ) КАК ЦеныНоменклатурыСрезПоследних
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГраницыИЦены КАК ВТ_ГраницыИЦены
					|			ПО ЦеныНоменклатурыСрезПоследних.ВидЦены = ВТ_ГраницыИЦены.ОсновнаяЦена
					|		ПО ВТ_ВыходныеИзделия.ВыходноеИзделие = ЦеныНоменклатурыСрезПоследних.Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_ГраницыИЦены
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
					|	МАКСИМУМ(ЦеныНоменклатурыПоставщиковСрезПоследних.Период) КАК Период,
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.Наименование КАК НоменклатураНаименование
					|ПОМЕСТИТЬ ВТ_МаксимальныеПериодыЦен
					|ИЗ
					|	ВТ_МатериалыСпецификации КАК ВТ_МатериалыСпецификации
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ТекущийПериод, ДЕНЬ), МЕСЯЦ, 0), ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
					|		ПО ВТ_МатериалыСпецификации.Материал = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура
					|
					|СГРУППИРОВАТЬ ПО
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура,
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.Наименование
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
					|	МАКСИМУМ(ЦеныНоменклатурыПоставщиковСрезПоследних.Период) КАК Период,
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.Наименование КАК НоменклатураНаименование
					|ПОМЕСТИТЬ ВТ_МаксимальныеПериодыЦен2
					|ИЗ
					|	ВТ_МатериалыСпецификации КАК ВТ_МатериалыСпецификации
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ТекущийПериод, ДЕНЬ), МЕСЯЦ, -1), ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
					|		ПО ВТ_МатериалыСпецификации.Материал = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура
					|
					|СГРУППИРОВАТЬ ПО
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура,
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.Наименование
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура КАК Номенклатура,
					|	МАКСИМУМ(ЦеныНоменклатурыПоставщиковСрезПоследних.Период) КАК Период,
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.Наименование КАК НоменклатураНаименование
					|ПОМЕСТИТЬ ВТ_МаксимальныеПериодыЦен3
					|ИЗ
					|	ВТ_МатериалыСпецификации КАК ВТ_МатериалыСпецификации
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ТекущийПериод, ДЕНЬ), МЕСЯЦ, -2), ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
					|		ПО ВТ_МатериалыСпецификации.Материал = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура
					|
					|СГРУППИРОВАТЬ ПО
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура,
					|	ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.Наименование
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_МатериалыСпецификации
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_МаксимальныеПериодыЦен.Номенклатура КАК Номенклатура,
					|	ВТ_МаксимальныеПериодыЦен.Период КАК Период,
					|	ВТ_МаксимальныеПериодыЦен.НоменклатураНаименование КАК НоменклатураНаименование,
					|	СРЕДНЕЕ(ЦеныНоменклатурыПоставщиковСрезПоследних.Цена) КАК Цена,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка
					|	КОНЕЦ КАК УпаковкаЦены,
					|	ВЫРАЗИТЬ(СРЕДНЕЕ(ВЫБОР
					|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|					ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Цена
					|				ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Цена / ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка.Числитель * ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка.Знаменатель
					|			КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК ЦенаЗаЕдХр
					|ПОМЕСТИТЬ ВТ_ПоследниеЦеныМатериаловВЕдХр
					|ИЗ
					|	ВТ_МаксимальныеПериодыЦен КАК ВТ_МаксимальныеПериодыЦен
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ТекущийПериод, ДЕНЬ), МЕСЯЦ, 0), ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
					|		ПО ВТ_МаксимальныеПериодыЦен.Период = ЦеныНоменклатурыПоставщиковСрезПоследних.Период
					|			И ВТ_МаксимальныеПериодыЦен.Номенклатура = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ_МаксимальныеПериодыЦен.Номенклатура,
					|	ВТ_МаксимальныеПериодыЦен.Период,
					|	ВТ_МаксимальныеПериодыЦен.НоменклатураНаименование,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка
					|	КОНЕЦ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_МаксимальныеПериодыЦен
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_МаксимальныеПериодыЦен2.Номенклатура КАК Номенклатура,
					|	ВТ_МаксимальныеПериодыЦен2.Период КАК Период,
					|	ВТ_МаксимальныеПериодыЦен2.НоменклатураНаименование КАК НоменклатураНаименование,
					|	СРЕДНЕЕ(ЦеныНоменклатурыПоставщиковСрезПоследних.Цена) КАК Цена,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка
					|	КОНЕЦ КАК УпаковкаЦены,
					|	ВЫРАЗИТЬ(СРЕДНЕЕ(ВЫБОР
					|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|					ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Цена
					|				ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Цена / ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка.Числитель * ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка.Знаменатель
					|			КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК ЦенаЗаЕдХр
					|ПОМЕСТИТЬ ВТ_ПоследниеЦеныМатериаловВЕдХр2
					|ИЗ
					|	ВТ_МаксимальныеПериодыЦен2 КАК ВТ_МаксимальныеПериодыЦен2
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ТекущийПериод, ДЕНЬ), МЕСЯЦ, -1), ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
					|		ПО ВТ_МаксимальныеПериодыЦен2.Период = ЦеныНоменклатурыПоставщиковСрезПоследних.Период
					|			И ВТ_МаксимальныеПериодыЦен2.Номенклатура = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ_МаксимальныеПериодыЦен2.Номенклатура,
					|	ВТ_МаксимальныеПериодыЦен2.Период,
					|	ВТ_МаксимальныеПериодыЦен2.НоменклатураНаименование,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка
					|	КОНЕЦ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_МаксимальныеПериодыЦен2
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_МаксимальныеПериодыЦен3.Номенклатура КАК Номенклатура,
					|	ВТ_МаксимальныеПериодыЦен3.Период КАК Период,
					|	ВТ_МаксимальныеПериодыЦен3.НоменклатураНаименование КАК НоменклатураНаименование,
					|	СРЕДНЕЕ(ЦеныНоменклатурыПоставщиковСрезПоследних.Цена) КАК Цена,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка
					|	КОНЕЦ КАК УпаковкаЦены,
					|	ВЫРАЗИТЬ(СРЕДНЕЕ(ВЫБОР
					|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|					ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Цена
					|				ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Цена / ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка.Числитель * ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка.Знаменатель
					|			КОНЕЦ) КАК ЧИСЛО(15, 2)) КАК ЦенаЗаЕдХр
					|ПОМЕСТИТЬ ВТ_ПоследниеЦеныМатериаловВЕдХр3
					|ИЗ
					|	ВТ_МаксимальныеПериодыЦен3 КАК ВТ_МаксимальныеПериодыЦен3
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ТекущийПериод, ДЕНЬ), МЕСЯЦ, -2), ) КАК ЦеныНоменклатурыПоставщиковСрезПоследних
					|		ПО ВТ_МаксимальныеПериодыЦен3.Период = ЦеныНоменклатурыПоставщиковСрезПоследних.Период
					|			И ВТ_МаксимальныеПериодыЦен3.Номенклатура = ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ_МаксимальныеПериодыЦен3.Номенклатура,
					|	ВТ_МаксимальныеПериодыЦен3.Период,
					|	ВТ_МаксимальныеПериодыЦен3.НоменклатураНаименование,
					|	ВЫБОР
					|		КОГДА ЕСТЬNULL(ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
					|			ТОГДА ЦеныНоменклатурыПоставщиковСрезПоследних.Номенклатура.ЕдиницаИзмерения
					|		ИНАЧЕ ЦеныНоменклатурыПоставщиковСрезПоследних.Упаковка
					|	КОНЕЦ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_МаксимальныеПериодыЦен3
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_Материалы.СсылкаНаСпецификацию КАК Спецификация,
					|	ВТ_Материалы.Материал.Код КАК Код,
					|	ВТ_Материалы.Материал КАК Материал,
					|	ВЫРАЗИТЬ((ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр.ЦенаЗаЕдХр, 0) + ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр2.ЦенаЗаЕдХр, ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр.ЦенаЗаЕдХр, 0)) + ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр3.ЦенаЗаЕдХр, ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр.ЦенаЗаЕдХр, 0))) / 3 КАК ЧИСЛО(15, 2)) КАК ЦенаЗаЕдХр,
					|	ВТ_Материалы.УпаковкаЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_Материалы.Количество КАК Количество,
					|	ЦеныНоменклатурыПоставщиков.Партнер КАК Поставщик
					|ПОМЕСТИТЬ ВТ_ПоследниеЦеныУсреднённые
					|ИЗ
					|	ВТ_Материалы КАК ВТ_Материалы
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦеныМатериаловВЕдХр КАК ВТ_ПоследниеЦеныМатериаловВЕдХр
					|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков КАК ЦеныНоменклатурыПоставщиков
					|			ПО ВТ_ПоследниеЦеныМатериаловВЕдХр.Номенклатура = ЦеныНоменклатурыПоставщиков.Номенклатура
					|				И ВТ_ПоследниеЦеныМатериаловВЕдХр.Период = ЦеныНоменклатурыПоставщиков.Период
					|				И ВТ_ПоследниеЦеныМатериаловВЕдХр.Цена = ЦеныНоменклатурыПоставщиков.Цена
					|		ПО (ВЫБОР
					|				КОГДА ВТ_ПоследниеЦеныМатериаловВЕдХр.Номенклатура = NULL
					|					ТОГДА ИСТИНА
					|				ИНАЧЕ ВТ_Материалы.Материал = ВТ_ПоследниеЦеныМатериаловВЕдХр.Номенклатура
					|			КОНЕЦ)
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенаНоменклатурыВыходногоИзделия КАК ВТ_ЦенаНоменклатурыВыходногоИзделия
					|		ПО ВТ_Материалы.СсылкаНаСпецификацию = ВТ_ЦенаНоменклатурыВыходногоИзделия.СсылкаНаСпецификацию
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦеныМатериаловВЕдХр2 КАК ВТ_ПоследниеЦеныМатериаловВЕдХр2
					|		ПО (ВЫБОР
					|				КОГДА ВТ_ПоследниеЦеныМатериаловВЕдХр2.Номенклатура = NULL
					|					ТОГДА ИСТИНА
					|				ИНАЧЕ ВТ_Материалы.Материал = ВТ_ПоследниеЦеныМатериаловВЕдХр2.Номенклатура
					|			КОНЕЦ)
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦеныМатериаловВЕдХр3 КАК ВТ_ПоследниеЦеныМатериаловВЕдХр3
					|		ПО (ВЫБОР
					|				КОГДА ВТ_ПоследниеЦеныМатериаловВЕдХр3.Номенклатура = NULL
					|					ТОГДА ИСТИНА
					|				ИНАЧЕ ВТ_Материалы.Материал = ВТ_ПоследниеЦеныМатериаловВЕдХр3.Номенклатура
					|			КОНЕЦ)
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ_Материалы.СсылкаНаСпецификацию,
					|	ВТ_Материалы.Материал.Код,
					|	ВТ_Материалы.Материал,
					|	ВТ_Материалы.УпаковкаЕдиницаИзмерения,
					|	ВТ_Материалы.Количество,
					|	ЦеныНоменклатурыПоставщиков.Партнер,
					|	ВЫРАЗИТЬ((ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр.ЦенаЗаЕдХр, 0) + ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр2.ЦенаЗаЕдХр, ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр.ЦенаЗаЕдХр, 0)) + ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр3.ЦенаЗаЕдХр, ЕСТЬNULL(ВТ_ПоследниеЦеныМатериаловВЕдХр.ЦенаЗаЕдХр, 0))) / 3 КАК ЧИСЛО(15, 2))
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_ПоследниеЦеныМатериаловВЕдХр
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_ПоследниеЦеныМатериаловВЕдХр2
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_ПоследниеЦеныМатериаловВЕдХр3
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ВТ_Материалы.СсылкаНаСпецификацию КАК Спецификация,
					|	ВТ_Материалы.Материал.Код КАК Код,
					|	ВТ_Материалы.Материал КАК Материал,
					|	ВТ_ПоследниеЦеныУсреднённые.Поставщик КАК Поставщик,
					|	ВТ_ПоследниеЦеныУсреднённые.ЦенаЗаЕдХр КАК Цена,
					|	ВТ_ПоследниеЦеныУсреднённые.ЦенаЗаЕдХр КАК ЦенаЗаЕдХр,
					|	ВТ_Материалы.УпаковкаЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_Материалы.Материал.ЕдиницаИзмерения КАК МатериалЕдиницаИзмерения,
					|	ВТ_Материалы.КоличествоУпаковокЕдиницИзмерения КАК КоличествоУпаковокСпецификации,
					|	ВТ_Материалы.Количество КАК Количество,
					|	ТИПЗНАЧЕНИЯ(ВТ_Материалы.УпаковкаЕдиницаИзмерения) КАК ТипКолУп,
					|	ВЫРАЗИТЬ(ВТ_ПоследниеЦеныУсреднённые.ЦенаЗаЕдХр * ВТ_Материалы.Количество КАК ЧИСЛО(15, 2)) КАК Сумма,
					|	ВЫРАЗИТЬ(ВЫБОР
					|			КОГДА &СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
					|				ТОГДА ВТ_ПоследниеЦеныУсреднённые.ЦенаЗаЕдХр * ВТ_Материалы.Количество * 1.2
					|			КОГДА &СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
					|				ТОГДА ВТ_ПоследниеЦеныУсреднённые.ЦенаЗаЕдХр * ВТ_Материалы.Количество * 1.1
					|			КОГДА &СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
					|				ТОГДА ВТ_ПоследниеЦеныУсреднённые.ЦенаЗаЕдХр * ВТ_Материалы.Количество * 1.18
					|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаСНДС,
					|	ВТ_ЦенаНоменклатурыВыходногоИзделия.СтоимостьБезНДС КАК СтоимостьБезНДС,
					|	ВТ_ЦенаНоменклатурыВыходногоИзделия.Стоимость КАК Стоимость,
					|	ВТ_ЦенаНоменклатурыВыходногоИзделия.Период КАК Период,
					|	ВТ_ВыходныеИзделия.ВыходноеИзделие КАК Номенклатура
					|ПОМЕСТИТЬ ВТ_ПодготовленныеИтоговыеДанные
					|ИЗ
					|	ВТ_Материалы КАК ВТ_Материалы
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенаНоменклатурыВыходногоИзделия КАК ВТ_ЦенаНоменклатурыВыходногоИзделия
					|		ПО ВТ_Материалы.СсылкаНаСпецификацию = ВТ_ЦенаНоменклатурыВыходногоИзделия.СсылкаНаСпецификацию
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеЦеныУсреднённые КАК ВТ_ПоследниеЦеныУсреднённые
					|		ПО (ВЫБОР
					|				КОГДА ВТ_ПоследниеЦеныУсреднённые.Материал = NULL
					|					ТОГДА ИСТИНА
					|				ИНАЧЕ ВТ_Материалы.Материал = ВТ_ПоследниеЦеныУсреднённые.Материал
					|			КОНЕЦ)
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыходныеИзделия КАК ВТ_ВыходныеИзделия
					|		ПО ВТ_Материалы.СсылкаНаСпецификацию = ВТ_ВыходныеИзделия.СсылкаНаСпецификацию
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ПодготовленныеИтоговыеДанные.Номенклатура КАК Номенклатура,
					|	СУММА(ВТ_ПодготовленныеИтоговыеДанные.Сумма) КАК Себестоимость,
					|	СУММА(ВТ_ПодготовленныеИтоговыеДанные.СуммаСНДС) КАК СебестоимостьСНДС
					|ПОМЕСТИТЬ ВТ_ИтогиСебестоимостьПоМатериалам
					|ИЗ
					|	ВТ_ПодготовленныеИтоговыеДанные КАК ВТ_ПодготовленныеИтоговыеДанные
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ_ПодготовленныеИтоговыеДанные.Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_ПодготовленныеИтоговыеДанные
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(ВТ_НоменклатураСУчетомКомплектов.НоменклатураРобо, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураРобо,
					|	ЕСТЬNULL(ВТ_НоменклатураСУчетомКомплектов.Значение, &ПустаяСтрока) КАК Значение,
					|	ВТ_НоменклатураСУчетомКомплектов.Номенклатура КАК Номенклатура
					|ПОМЕСТИТЬ ВТ_ГруппировкаДляОтбора
					|ИЗ
					|	ВТ_НоменклатураСУчетомКомплектов КАК ВТ_НоменклатураСУчетомКомплектов
					|
					|СГРУППИРОВАТЬ ПО
					|	ВТ_НоменклатураСУчетомКомплектов.Номенклатура,
					|	ЕСТЬNULL(ВТ_НоменклатураСУчетомКомплектов.НоменклатураРобо, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
					|	ЕСТЬNULL(ВТ_НоменклатураСУчетомКомплектов.Значение, &ПустаяСтрока)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_НоменклатураСУчетомКомплектов
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ИтогиБезСебестоимости.НомерСтроки КАК НомерСтроки,
					|	ВТ_ИтогиБезСебестоимости.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_ИтогиБезСебестоимости.Подтверждено КАК Подтверждено,
					|	ВТ_ИтогиБезСебестоимости.ПодтверждениеКБ КАК ПодтверждениеКБ,
					|	ВЫБОР
					|		КОГДА ВТ_ИтогиБезСебестоимости.СрокиРазработкиКБ = ДАТАВРЕМЯ(1, 1, 1)
					|			ТОГДА ВТ_ИтогиБезСебестоимости.СрокиРазработкиКБ
					|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ВТ_ИтогиБезСебестоимости.СрокиРазработкиКБ, ДЕНЬ, ВТ_ИтогиБезСебестоимости.ДлительностьЭтапа)
					|	КОНЕЦ КАК СрокиРазработкиКБ,
					|	ВТ_ИтогиБезСебестоимости.Номенклатура КАК Номенклатура,
					|	ВТ_ИтогиБезСебестоимости.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_ИтогиБезСебестоимости.Количество КАК Количество,
					|	ВТ_ИтогиБезСебестоимости.ВидЦены КАК ВидЦены,
					|	ВТ_ИтогиБезСебестоимости.Цена КАК Цена,
					|	ВТ_ИтогиБезСебестоимости.СтавкаНДС КАК СтавкаНДС,
					|	ВТ_ИтогиБезСебестоимости.СуммаНДС КАК СуммаНДС,
					|	ВТ_ИтогиБезСебестоимости.ИтоговаяСумма КАК ИтоговаяСумма,
					|	ВТ_ИтогиБезСебестоимости.ЖелаемаяДатаПроизводства КАК ЖелаемаяДатаПроизводства,
					|	ЕСТЬNULL(ВТ_ГруппировкаДляОтбора.НоменклатураРобо, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураРобо,
					|	ЕСТЬNULL(ВТ_ГруппировкаДляОтбора.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК КомплектСвязи
					|ПОМЕСТИТЬ ВТ_СвязанныеДанныеСКомплектамиОтбора
					|ИЗ
					|	ВТ_ИтогиБезСебестоимости КАК ВТ_ИтогиБезСебестоимости
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппировкаДляОтбора КАК ВТ_ГруппировкаДляОтбора
					|		ПО ВТ_ИтогиБезСебестоимости.Номенклатура = ВТ_ГруппировкаДляОтбора.НоменклатураРобо
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_ГруппировкаДляОтбора
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.НомерСтроки КАК НомерСтроки,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.Подтверждено КАК Подтверждено,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.ПодтверждениеКБ КАК ПодтверждениеКБ,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.СрокиРазработкиКБ КАК СрокиРазработкиКБ,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.Номенклатура КАК Номенклатура,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.Количество КАК Количество,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.ВидЦены КАК ВидЦены,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.Цена КАК Цена,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.СтавкаНДС КАК СтавкаНДС,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.СуммаНДС КАК СуммаНДС,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.ИтоговаяСумма КАК ИтоговаяСумма,
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора.ЖелаемаяДатаПроизводства КАК ЖелаемаяДатаПроизводства,
					|	ВЫБОР
					|		КОГДА ВТ_СвязанныеДанныеСКомплектамиОтбора.НоменклатураРобо = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
					|			ТОГДА ВТ_СвязанныеДанныеСКомплектамиОтбора.Номенклатура
					|		ИНАЧЕ ВТ_СвязанныеДанныеСКомплектамиОтбора.КомплектСвязи
					|	КОНЕЦ КАК СсылкаСвязанныхКомплектов
					|ПОМЕСТИТЬ ВТ_СвязкаСобранныхДанных
					|ИЗ
					|	ВТ_СвязанныеДанныеСКомплектамиОтбора КАК ВТ_СвязанныеДанныеСКомплектамиОтбора
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ ВТ_Материалы
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_СвязкаСобранныхДанных.ЗаказКлиента КАК ЗаказКлиента,
					|	ВТ_СвязкаСобранныхДанных.Подтверждено КАК Подтверждено,
					|	ВТ_СвязкаСобранныхДанных.ПодтверждениеКБ КАК ПодтверждениеКБ,
					|	ВТ_СвязкаСобранныхДанных.СрокиРазработкиКБ КАК СрокиРазработкиКБ,
					|	ВТ_СвязкаСобранныхДанных.Номенклатура КАК Номенклатура,
					|	ВТ_СвязкаСобранныхДанных.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	ВТ_СвязкаСобранныхДанных.Количество КАК Количество,
					|	ВТ_СвязкаСобранныхДанных.ВидЦены КАК ВидЦены,
					|	ВТ_СвязкаСобранныхДанных.Цена КАК Цена,
					|	ЕСТЬNULL(ВТ_ИтогиСебестоимостьПоМатериалам.Себестоимость, 0) КАК Себестоимость,
					|	ВТ_СвязкаСобранныхДанных.СтавкаНДС КАК СтавкаНДС,
					|	ВТ_СвязкаСобранныхДанных.СуммаНДС КАК СуммаНДС,
					|	ВТ_СвязкаСобранныхДанных.ИтоговаяСумма КАК ИтоговаяСумма,
					|	ВТ_СвязкаСобранныхДанных.ЖелаемаяДатаПроизводства КАК ЖелаемаяДатаПроизводства
					|ИЗ
					|	ВТ_СвязкаСобранныхДанных КАК ВТ_СвязкаСобранныхДанных
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиСебестоимостьПоМатериалам КАК ВТ_ИтогиСебестоимостьПоМатериалам
					|		ПО (ВТ_СвязкаСобранныхДанных.СсылкаСвязанныхКомплектов = ВТ_ИтогиСебестоимостьПоМатериалам.Номенклатура)";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", СтруктураОтбора["ЗаказКлиента"]);
	Запрос.УстановитьПараметр("Подразделение", СтруктураОтбора["Подразделение"]);
	Запрос.УстановитьПараметр("Назначение", СтруктураОтбора["Назначение"]);	
	Запрос.УстановитьПараметр("СтатусСогласования", СтруктураОтбора["СтатусСогласования"]);
	Запрос.УстановитьПараметр("СтатусСпецификации", Перечисления.СтатусыСпецификаций.Закрыта);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидПродукцияРоболабс);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ГраницыИЦены", ТаблицаОтбораЦен.Выгрузить());
	Запрос.УстановитьПараметр("Свойство", СвойствоДопРеквизита);
	Запрос.УстановитьПараметр("СтавкаНДС", Перечисления.СтавкиНДС.НДС20);
	Запрос.УстановитьПараметр("ТекущийПериод", ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	ВыгруженныйСписок = Запрос.Выполнить().Выгрузить();
	ВыгруженныйСписок = ОбработатьЗаписиПередЗаполнением(ВыгруженныйСписок);
	
	Возврат ВыгруженныйСписок;	
КонецФункции

Функция ОбработатьЗаписиПередЗаполнением(ВыгруженныйСписок)
	
	УникальныеЗначения = Новый ТаблицаЗначений;
	УникальныеЗначения.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	УникальныеЗначения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));	
	УникальныеЗначения.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	УникальныеЗначения.Колонки.Добавить("Подтверждено", Новый ОписаниеТипов("Булево"));
	УникальныеЗначения.Колонки.Добавить("ПодтверждениеКБ", Новый ОписаниеТипов("Булево"));
	УникальныеЗначения.Колонки.Добавить("СрокиРазработкиКБ", Новый ОписаниеТипов("Дата"));
	УникальныеЗначения.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	УникальныеЗначения.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	УникальныеЗначения.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	УникальныеЗначения.Колонки.Добавить("Себестоимость", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	УникальныеЗначения.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	УникальныеЗначения.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	УникальныеЗначения.Колонки.Добавить("ИтоговаяСумма", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	УникальныеЗначения.Колонки.Добавить("ЖелаемаяДатаПроизводства", Новый ОписаниеТипов("Дата"));
	
	Для Каждого ТекДанные Из ВыгруженныйСписок Цикл
		ПоискУникальных = УникальныеЗначения.Найти(ТекДанные.Номенклатура, "Номенклатура");
		
		Если ПоискУникальных = Неопределено Тогда
			НоваяСтрока = УникальныеЗначения.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные); 						
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Значение Из УникальныеЗначения Цикл
		НоменклатураНайдена = Ложь;
		
		Для Каждого СтрокаВыгрузки Из ВыгруженныйСписок  Цикл
			Если Значение.Номенклатура = СтрокаВыгрузки.Номенклатура Тогда
				ПолученнаяСтрока = СтрокаВыгрузки;
				НоменклатураНайдена = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НоменклатураНайдена Тогда
			Если ПолученнаяСтрока.СрокиРазработкиКБ <> Дата(1, 1, 1) Тогда
				Значение.СрокиРазработкиКБ = ПолученнаяСтрока.СрокиРазработкиКБ;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	Возврат УникальныеЗначения;
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////
#Область АРМ_ПроцессСогласованияАвтообновлениеСпискаЗаказов

Функция ПроверитьНовыеЗаказыМенеджер(ТекущиеЗаказы) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ВыгруженныеЗаказы.ЗаказКлиента КАК ЗаказКлиента,
				|	ВыгруженныеЗаказы.Назначение КАК Назначение
				|ПОМЕСТИТЬ ВТ_ТекущиеЗаказы
				|ИЗ
				|	&ТекущиеЗаказы КАК ВыгруженныеЗаказы
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
				|	ЗаказКлиента.Назначение КАК Назначение,
				|	ЗаказКлиента.Дата КАК ДатаЗаказа,
				|	ЗаказКлиента.Организация КАК Организация,
				|	ЗаказКлиента.СуммаДокумента КАК СуммаЗаказа,
				|	ЗаказКлиента.Статус КАК Статус
				|ПОМЕСТИТЬ ВТ_ЗаказыДокумента
				|ИЗ
				|	Документ.ЗаказКлиента КАК ЗаказКлиента
				|ГДЕ
				|	ЗаказКлиента.Статус = &Статус
				|	И НЕ ЗаказКлиента.ПометкаУдаления
				|	И НЕ ЗаказКлиента.Назначение.ПометкаУдаления
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ВТ_ЗаказыДокумента.ЗаказКлиента КАК ЗаказКлиента,
				|	ВТ_ЗаказыДокумента.Назначение КАК Назначение,
				|	ВТ_ЗаказыДокумента.ДатаЗаказа КАК ДатаЗаказа,
				|	ВТ_ЗаказыДокумента.Организация КАК Организация,
				|	ВТ_ЗаказыДокумента.СуммаЗаказа КАК СуммаЗаказа,
				|	ВТ_ЗаказыДокумента.Статус КАК Статус
				|ПОМЕСТИТЬ ВТ_НовыеЗаказы
				|ИЗ
				|	ВТ_ТекущиеЗаказы КАК ВТ_ТекущиеЗаказы,
				|	ВТ_ЗаказыДокумента КАК ВТ_ЗаказыДокумента
				|ГДЕ
				|	НЕ ВТ_ЗаказыДокумента.ЗаказКлиента В
				|				(ВЫБРАТЬ
				|					ВТ_ТекущиеЗаказы.ЗаказКлиента
				|				ИЗ
				|					ВТ_ТекущиеЗаказы)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ВТ_ЗаказыДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_НовыеЗаказы.ЗаказКлиента КАК ЗаказКлиента,
				|	ВТ_НовыеЗаказы.Назначение КАК Назначение,
				|	ВТ_НовыеЗаказы.ДатаЗаказа КАК ДатаЗаказа,
				|	ВТ_НовыеЗаказы.Организация КАК Организация,
				|	ВТ_НовыеЗаказы.СуммаЗаказа КАК СуммаЗаказа,
				|	ВТ_НовыеЗаказы.Статус КАК Статус,
				|	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.ПричинаОтказа, &ПустаяСтрока) КАК ПричинаОтказа
				|ПОМЕСТИТЬ ВТ_СобранныеЗаказы
				|ИЗ
				|	ВТ_НовыеЗаказы КАК ВТ_НовыеЗаказы
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_СогласованиеСводнаяИнформация КАК ТТМ_СогласованиеСводнаяИнформация
				|		ПО (ВТ_НовыеЗаказы.ЗаказКлиента = ТТМ_СогласованиеСводнаяИнформация.ЗаказКлиента
				|				И ВТ_НовыеЗаказы.Назначение = ТТМ_СогласованиеСводнаяИнформация.Назначение)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_СобранныеЗаказы.ЗаказКлиента КАК ЗаказКлиента,
				|	ВТ_СобранныеЗаказы.Назначение КАК Назначение,
				|	ВТ_СобранныеЗаказы.ДатаЗаказа КАК ДатаЗаказа,
				|	ВТ_СобранныеЗаказы.Организация КАК Организация,
				|	ВТ_СобранныеЗаказы.СуммаЗаказа КАК СуммаЗаказа,
				|	ВТ_СобранныеЗаказы.Статус КАК Статус,
				|	ВЫБОР
				|		КОГДА ПОДСТРОКА(ВТ_СобранныеЗаказы.ПричинаОтказа, 0, 1) = &ПустаяСтрока
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ КАК ЕстьОтказ,
				|	ВТ_СобранныеЗаказы.ПричинаОтказа КАК ПричинаОтказа
				|ИЗ
				|	ВТ_СобранныеЗаказы КАК ВТ_СобранныеЗаказы";
	
	Запрос.УстановитьПараметр("ТекущиеЗаказы", ТекущиеЗаказы);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Выборка = ПроверитьЗаказыСОтказомОбщее(ТекущиеЗаказы);
	КонецЕсли;

	Возврат Выборка;
КонецФункции

Функция ПроверитьНовыеЗаказыКонструктор(ТекущиеЗаказы) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
			               |	ВыгруженныеЗаказы.ЗаказКлиента КАК ЗаказКлиента,
			               |	ВыгруженныеЗаказы.Назначение КАК Назначение
			               |ПОМЕСТИТЬ ВТ_ТекущиеЗаказы
			               |ИЗ
			               |	&ТекущиеЗаказы КАК ВыгруженныеЗаказы
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
			               |	ЗаказКлиента.Назначение КАК Назначение,
			               |	ЗаказКлиента.Дата КАК ДатаЗаказа,
			               |	ЗаказКлиента.Организация КАК Организация,
			               |	ЗаказКлиента.СуммаДокумента КАК СуммаЗаказа,
			               |	ЗаказКлиента.Статус КАК Статус
			               |ПОМЕСТИТЬ ВТ_ЗаказыДокумента
			               |ИЗ
			               |	Документ.ЗаказКлиента КАК ЗаказКлиента
			               |ГДЕ
			               |	ЗаказКлиента.Статус = &Статус
			               |	И НЕ ЗаказКлиента.ПометкаУдаления
			               |	И НЕ ЗаказКлиента.Назначение.ПометкаУдаления
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ВТ_ЗаказыДокумента.ЗаказКлиента КАК ЗаказКлиента,
			               |	ВТ_ЗаказыДокумента.Назначение КАК Назначение,
			               |	ВТ_ЗаказыДокумента.ДатаЗаказа КАК ДатаЗаказа,
			               |	ВТ_ЗаказыДокумента.Организация КАК Организация,
			               |	ВТ_ЗаказыДокумента.СуммаЗаказа КАК СуммаЗаказа,
			               |	ВТ_ЗаказыДокумента.Статус КАК Статус
			               |ПОМЕСТИТЬ ВТ_НовыеЗаказы
			               |ИЗ
			               |	ВТ_ТекущиеЗаказы КАК ВТ_ТекущиеЗаказы,
			               |	ВТ_ЗаказыДокумента КАК ВТ_ЗаказыДокумента
			               |ГДЕ
			               |	НЕ ВТ_ЗаказыДокумента.ЗаказКлиента В
			               |				(ВЫБРАТЬ
			               |					ВТ_ТекущиеЗаказы.ЗаказКлиента
			               |				ИЗ
			               |					ВТ_ТекущиеЗаказы)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |УНИЧТОЖИТЬ ВТ_ЗаказыДокумента
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_НовыеЗаказы.ЗаказКлиента КАК ЗаказКлиента,
			               |	ВТ_НовыеЗаказы.Назначение КАК Назначение,
			               |	ВТ_НовыеЗаказы.ДатаЗаказа КАК ДатаЗаказа,
			               |	ВТ_НовыеЗаказы.Организация КАК Организация,
			               |	ВТ_НовыеЗаказы.СуммаЗаказа КАК СуммаЗаказа,
			               |	ВТ_НовыеЗаказы.Статус КАК Статус,
			               |	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.ПричинаОтказа, &ПустаяСтрока) КАК ПричинаОтказа
			               |ПОМЕСТИТЬ ВТ_СобранныеЗаказы
			               |ИЗ
			               |	ВТ_НовыеЗаказы КАК ВТ_НовыеЗаказы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_СогласованиеСводнаяИнформация КАК ТТМ_СогласованиеСводнаяИнформация
			               |		ПО ВТ_НовыеЗаказы.ЗаказКлиента = ТТМ_СогласованиеСводнаяИнформация.ЗаказКлиента
			               |			И ВТ_НовыеЗаказы.Назначение = ТТМ_СогласованиеСводнаяИнформация.Назначение
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_СобранныеЗаказы.ЗаказКлиента КАК ЗаказКлиента,
			               |	ВТ_СобранныеЗаказы.Назначение КАК Назначение,
			               |	ВТ_СобранныеЗаказы.ДатаЗаказа КАК ДатаЗаказа,
			               |	ВТ_СобранныеЗаказы.Организация КАК Организация,
			               |	ВТ_СобранныеЗаказы.СуммаЗаказа КАК СуммаЗаказа,
			               |	ВТ_СобранныеЗаказы.Статус КАК Статус
			               |ИЗ
			               |	ВТ_СобранныеЗаказы КАК ВТ_СобранныеЗаказы
			               |ГДЕ
			               |	ВТ_СобранныеЗаказы.ПричинаОтказа = &ПустаяСтрока";
			
	Запрос.УстановитьПараметр("ТекущиеЗаказы", ТекущиеЗаказы);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Выборка = ПроверитьЗаказыСОтказомОбщее(ТекущиеЗаказы);
	КонецЕсли;
	
	Возврат Выборка;
КонецФункции

Функция ПроверитьЗаказыСОтказомОбщее(ТекущиеЗаказы)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
			               |	ТекущиеЗаказы.Назначение КАК Назначение,
			               |	ТекущиеЗаказы.ЗаказКлиента КАК ЗаказКлиента
			               |ПОМЕСТИТЬ ВТ_ТекущиеЗаказы
			               |ИЗ
			               |	&ТекущиеЗаказы КАК ТекущиеЗаказы
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ТекущиеЗаказы.Назначение КАК Назначение,
			               |	ВТ_ТекущиеЗаказы.ЗаказКлиента КАК ЗаказКлиента,
			               |	ЕСТЬNULL(ТТМ_СогласованиеСводнаяИнформация.ПричинаОтказа, &ПустаяСтрока) КАК ПричинаОтказа
			               |ПОМЕСТИТЬ ВТ_ЗаказыСОтказом
			               |ИЗ
			               |	ВТ_ТекущиеЗаказы КАК ВТ_ТекущиеЗаказы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_СогласованиеСводнаяИнформация КАК ТТМ_СогласованиеСводнаяИнформация
			               |		ПО ВТ_ТекущиеЗаказы.Назначение = ТТМ_СогласованиеСводнаяИнформация.Назначение
			               |			И ВТ_ТекущиеЗаказы.ЗаказКлиента = ТТМ_СогласованиеСводнаяИнформация.ЗаказКлиента
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_ЗаказыСОтказом.Назначение КАК Назначение,
			               |	ВТ_ЗаказыСОтказом.ЗаказКлиента КАК ЗаказКлиента,
			               |	ВТ_ЗаказыСОтказом.ПричинаОтказа КАК ПричинаОтказа,
			               |	ВЫБОР
			               |		КОГДА ПОДСТРОКА(ВТ_ЗаказыСОтказом.ПричинаОтказа, 0, 1) <> &ПустаяСтрока
			               |			ТОГДА ИСТИНА
			               |		ИНАЧЕ ЛОЖЬ
			               |	КОНЕЦ КАК ЕстьОтказ
			               |ПОМЕСТИТЬ ВТ_СобранныеДанные
			               |ИЗ
			               |	ВТ_ЗаказыСОтказом КАК ВТ_ЗаказыСОтказом
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТ_СобранныеДанные.Назначение КАК Назначение,
			               |	ВТ_СобранныеДанные.ЗаказКлиента КАК ЗаказКлиента,
			               |	ВТ_СобранныеДанные.ПричинаОтказа КАК ПричинаОтказа
			               |ИЗ
			               |	ВТ_СобранныеДанные КАК ВТ_СобранныеДанные
			               |ГДЕ
			               |	ВТ_СобранныеДанные.ЕстьОтказ";
	
	Запрос.УстановитьПараметр("ТекущиеЗаказы", ТекущиеЗаказы);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");		
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
КонецФункции

#КонецОбласти