
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
//_____________________________________________Расширение ТТМ_АРМ___________________________________________//

//Алгоритм работы АРМ Резерв и списание

//1. При загрузке АРМ отображается список этапов с установленными отборами по номенклатуре, номеру заказа клиента и Дате отгрузки (если списание)
//2. При перехеде на страницу Материалы спецификации отображаются материалы из Этапов из ТЧ Обеспечение  (загружаются в Регистр ТТМ_АРМ_РезервированиеСписаниеМатериалов)
//3. На первом этапе резервирования для актуализации данных в этапах по действующей спецификации пользователи перезаполняют материалы по спецификации этапа (по произвольной спецификации пока не реализовали)
//4. Далее выгружают данные на ТСД (формируется документ Подбор материалов по спецификации в статусе СОБИРАЕТСЯ) и производят сборку с терминалом сбора данных.
//5. При завершении сборки на ТСД документ переходит в статус СОБРАН и доступен для загрузки данных сборки в АРМ
//6. Склад загружает данные сборки в АРМ (даные загружаются в регистр) и корректирует из при необходимости (Замена номенклатуры, количества, варианта обеспечения)
//7. Далее при Зафиксировать корректировки Этапы заполняются по данным регистра, при списании дополнительно создаетя документ Передача материалов


//__________________________________________________________________________________________________________//

//***Список изменений 05.09.2023:
//1.	Обработка «АРМ Выпуск и Реализация»
	//1.1 Изменена логика поиска заказа клиента в поле «Заказ клиента».
	//1.2 Изменен отбор этапов по спецификациям. Теперь отбор осуществляется при условии, если одно из полей заполнено значением «Изделие» или «Заказ клиента».
	//1.3 Изменена обработка команды «Выпуск». 
		//Теперь перед формированием выпуска происходит проверка на заполнение важных полей. 
		//Если поля не заполнены, пользователь получает уведомление и нужные поля подсвечиваются.
		//При успешном формирования выпуска, пользователь получает уведомление об успешном формировании выпуска.
		//После формирования выпуска, в документе «Заказ клиента» у полей с выбранным ранее изделием меняется статус с «Обособлено» на «Готов к отгрузке». 
	//1.4 Добавлена команда «Сформировать документ отгрузки». После выполнения команды идет отбор изделий по всем заказам со статусом «Готов к отгрузке».
		//Табличная часть «Выпущенная продукция» документа «ТТМ_Отгрузка товаров» заполняется списком отобранных изделий и устанавливает первоначальный статус "К выполнению".
	//1.5 Добавлена возможность печати этикеток с произвольным количеством, при условии, что поле "Изделие" заполнено пользователем.
	
//2.	Документ «ТТМ_Отгрузка товаров»
	//2.1 Табличная часть "Выпущенная продукция" заполненная изделиями публикуется на Web-сервере: "http://172.17.16.174/ERP".
	//2.2 Пользователь ТСД загружает сформированный документ на оборудование и сканирует список изделий при отгрузке.
		//При успешном совпадении количества отсканированных и реализованных изделий, оборудование ТСД отправляет пользователю уведомление об успешной процедуре.
		//При начале работы с документом, статус документа изменяется на "Начат".
		//После успешного сканирования статус документа перезаписывается и изменяет его статус на "Завершен".
		//При неуспешном сканировании статус документа перезаписывается и изменяет его статус на "Заверешен с ошибками".
				
///////////////////////////////////////////////////////////////////////////////////////////////////////////// 


//***Список изменений 11.09.2023:
//1.	Обработка «АРМ Выпуск и Реализация»
	//1.1 Изменена процедура действия выполнения команд: "Выпуск", "Реализация".
	//Теперь пользователю не нужно ждать, пока в серверной процедуре будет выполнена проверка заполненных полей и найденных ссылок.
	//Проверках ключевых полей вынесена в отдельную функцию, во избежании лишнего обращения к БД.
	//Если ключевые поля не заполнены, пользователь получит сообщение с подсвечивающимся полем, которое необходимо заполнить. Запрос к серверной процедуре не будет выполнен.
	//1.2 Изменена процедура автоподбора при вводе текста.
	//Теперь вызывается процедура "ОбработкаПолученияДанныхВыбора" из модуля менеджера "ЗаказКлиента", далее идет обращение к экспортной функции в общим модуле "ТТМ_ДанныеВыбораСервер".
	//После окончания подбора пользователю подсвечиваются все найденные значения.
	//1.3 Изменен отбор поиска во время автоподбора. 
	//Теперь заказы отбираются которые соответствуют условиям: Назначение - нет пометки удаления, ЗаказКлиента - нет пометки удаления, ЗаказКлиента - статус не закрыт.
	//1.4 Изменена процедура "АРМ1_ОбработкаПолученияДанныхВыбора" в модуле менеджера "ЗаказКлиента". Код отрефакторинг согласно официальной документации ИТС.
	
//2. Общий модуль «ТТМ_ДанныеВыбораСервер»
	//2.1 Функция "Подсветить слова" перенесена из модуля менеджера "ЗаказКлиента" в общий модуль "ТТМ_ДанныеВыбораСервер".
	//Теперь к функции можно обращаться из других документов и справочников.
	
	
//***Список изменений 19.09.2023:
//1.	Обработка «АРМ Выпуск и Реализация»
	//1.1 Изменена логика формирования документм "ТТМ_ОтгрузкаТоваров".
	//Теперь перед формированием нового документа идет проверка, что документ ранее был создан. Если документ не найден, то формируем новый документ.
	//Теперь все строки группируются по номенклатуре, ранее было по заказу. Если есть одинаковая номенклатура из разных заказов, то количество суммируется.
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////


//***Список изменений 26.09.2023:
//1.	Обработка «АРМ Выпуск и Реализация»
	//1.1 Добавлена команда: "Реализациям по всем заказам".
	//Реализация по всем заказам выполняется по условии, что имеются выпуски.
	//Добавлена проверка на наличии документа с не отсканированными товарами.
	//Если товары не отсканированы в документе "ТТМ_Отгрузка товаров", пользователь получит уведомление о необходимости отсканировать изделия.
	//1.2 Добавлена команда: "Список заказов для реализации".
	//При нажатии на кнопку открывается произвольная форма со списком заказов, которые были выпущены.
	//Передача данных происходит через оповещение для другой формы. Выбор из списка доступен при нажатии на кнопку "Выбор" и при двойном клике мыши.
	//1.3 Запрос на получение выпускаемой продукции вынесен в отдельную функцию с возможностью поместить данные во временное хранилище для передачи в другие управляемые формы.
	//1.4 Добавлены картинки к описанию на всех кнопках формы в обработке.
	//1.5 Добавлена Функция "ГруппировкаЗаказовСВыпуском" в модуль объекта.
	//Логика функции: 
		//Объеденить заказы с общей номенклатурой для переноса данных в документ "ТТМ_Отгрузка товаров";
		//Объеденить заказы с общим номером для формировании реализаций по всем заказам;
	//1.6 Добавлена проверка на кол-во этикеток перед печатью.
	//Если не выбран этап или не указано количество этикеток, вызов к обработке "ПечатьЭтикетокИЦенников" не будет выполен.
	//Пользователь теперь не будет получать типовое сообщение с просьбой обратиться к администратору 1С.
	
//2.   Документ «ТТМ_Отгрузка товаров»
	//2.1 Установлено ограничение на редактирование полей в табличной части и некоторых реквизитов на форме.
	//Документ теперь редактируется только с помощью ТСД.
		
/////////////////////////////////////////////////////////////////////////////////////////////////////////////


//***Список изменений 09.10.2023:
//1.	Обработка «АРМ Выпуск и Реализация»
	//1.1 Функция печати этикеток вынесена в общий модуль ТТМ_ДанныеВыбораСервер, с возможностью вызова из других справочников и документов
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

//***Список изменений 24.11.2023:
//1.	Обработка «АРМ Выпуск и Реализация»
	//1.1 Добавлена страница с формой настроек для проверки установленных цен в заказах клиента.
	//Добавлена возможность сохранения настроек пользователя в хранилище общих настроек.
	//Добавлена возможность восстановления настроек пользователя из хранилища общих настроек.
	//1.2 Добавлен функционал проверки установленных цен в заказе клиента и в сформированных документах реализации.
	//После формирования реализации, если установленные цены в заказах не совпадают с ценой в реализации, направляется почтовое уведомление.
	//Письма отправляются на следующие адреса: toeskina@trapeza.ru, kuzmina.n@npo-ttm.ru
	//Формат письма HTML в виде табличного документа.
	//1.3 Внесены изменения при сканировании ТСД.
	//При формировании документа для ТСД дополнительно идет проверка отсканированных изделий на текущую дату. 
	//Если в день отгрузки пользователь сформировал несколько реализаций по совпадающим изделиям, ранее отсканированные изделия больше не будут попадать в документ.
	//1.4 Добавлена дополнительная проверка на работу с присоединенными файлами номенклатуры.
	//Проверка вынесена в общий модуль "ТТМ_ДанныеВыбораСервер"
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

//***Список изменений 18.12.2023:
//1.	Обработка «АРМ Выпуск и Реализация»
	//1.1 Добавлена дополнительная проверка, которая исключает попадания комплектов при выгрузке в документ для ТСД.
	//1.2 Исправлены дубли при отправке писем с ценами расхождений в реализациях. Проверка происходит через записи в регистр сведений "ТТМ_РассылкаЭлектронныхПисем".
	//1.3 Исправлены кол-во товаров на уже отсканированных товарах, при условии, что пользователь мог создать более чем 3 документов на 1 дату.
//2.	Обработка «АРМ Резервирование и Списание»
 	//2.1 Добавлена доп. проверка на корректное заполнение полей формы
	//2.2 Изменен ввод заказа, ранее было по строке, теперь через ссылку "Назначение"
	//Если пользователь во время отбора ввел неверный заказ, будет отправлено сообщение
	//2.3 Добавлена сортировка по номеру этапа (Возврастание) на странице "Этапы к списанию"
	//2.4 Изменен запрос по отбору материалов спецификации. Уменьшено время ожидания на 3 сек. на каждый этап.
	//2.5 Изменена логика перехода на страницу "Материалы спецификации. Теперь вопрос будет задаваться после открытия страницы с предложением заполнить форму материалами.
	//2.6 Добалена возможность устанавливать произвольное кол-во для всех строк во время добавления новой номенклатуры.
	//2.7 Исправлена проверка при закрытии формы во время добавления новой номенклатуры.
	//Теперь больше нет случайных записей в регистр.
	//2.8 Добавлена загрузка на ТСД (Новый вариант)
	//Изменены статусы при отображении и после выполнения операции на ТСД
	//2.9 Добавлена проверка во время резерва.
	//Теперь для поля "КоличествоУпаковокФакт = 0" в этапе, будет установлено то значение, которое было задано текущим пользователем.
	//Параметры настроек сохраняются в хранилище с уникальным ключом от каждого пользователя. Перед резервированием установлена проверка, что поле настроек корректно заполнено.
	
	//2.9.1 Исправлен запрос на выгрузку данных с ТСД после успешного сканирования. Теперь отбираются только те материалы, которые имеют значение "Подборано" <> 0
	//2.9.2 Добавлен поиск документа "Подбор материалов по спецификации" с ручным вводом номера.
	//2.9.3 Добавлена проверка перед подбором о необходимости указания корректной ссылки на документ.
	//2.9.4 Изменены статусы в перечислении "ТТМ_СтатусыПодбораМатериалов". ВыгруженНаТСД -> Собирается, ЗагруженНаТСД - Собран
	//2.9.5 Исправлено ограничение на установку пометки удаления в "Диспетчирование этапов".
	//Ранее для регистра сведений "СостоянияЭтаповПроизводства" предоставлялось только чтение.
	
	
//***Список изменений 24.01.2024:
//1.	Обработка «АРМ Резервирование и Списание»
	//1.1 Изменена логика переходов между страницами при формировании материалов.
	//Теперь запрос на получение материалов выполняется в фоне. Данные записываются временно во временный регистр "ТТМ_АРМ_ФоновыеЗаданияРезервированиеСписаниеМатериалов".
	//При обработке получения материалов окно пользователя в 1С больше не блокируется.
	//1.2 Изменена логика записи корректировок при резервировании и списании материалов.
	//Теперь обработка выполняется в фоне. Во время выполнения процедуры окно пользователя больше не блокируется.
	//При обработке большого количества этапов, пользователь видит прогресс выполнения в процентах и примерное время выполнения.
	
	//Процедуры и функции для записи корректировок были перенесены из модуля формы "АРМ Резервирование и списание материалов 2_2" в общий модуль "ТТМ_ДанныеВыбораСервер".
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

//***Список изменений 16.02.2024:
//1.	Обработка «АРМ Процесс согласования»
	//1.1 Создана форма для отдела по работе с клиентами и отдела КБ.
	//Настроено согласование для данных подразделений.
	//1.2 Созданы 3 регистра сведений: "ТТМ_СогласованиеЗаказовМенеджер, ТТМ_СогласованиеЗаказовКонструктор, ТТМ_СогласованиеСводнаяИнформация".
	//Регистр ТТМ_СогласованиеСводнаяИнформация собирает сводную информу с регистров: "ТТМ_СогласованиеЗаказовМенеджер, ТТМ_СогласованиеЗаказовКонструктор".
	//После получения соответствующих статусов, менеджер может изменить статус в действующем документе "Заказ клиента".
	//1.3 Добавлена возможность назначать исполнителей для спецификаций в разработке.
	//Теперь перед изменением менеджер видит статус согласования от отдела КБ по текущей номенклатуре, а также сроки разработки (если они установлены).
	//1.4 Добавлен типовой отчет по текущему состоянию заказа, удалены лишние области.
	//1.5 Добавлена графическая схема на форму подразделений.
	//При открытии формы генерируется схема и выделяются текущие поля бизнес процесса.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

//***Список изменений 12.03.2024:
//1.	Обработка «АРМ Процесс согласования»
	//1.1 Форма менеджеров.
	//1.1.1 Добавлена выгрузка себестоимости изделия по материалам.
	//1.1.2 Добавлена возможность согласовывать и отменять согласование при изменении поля подтверждено.
	//1.1.3 Изменена логика обработки "При изменении желаемой даты производства"
	//1.1.4 Добавлен макет "Текущее состояние выполнения документа".
	//1.1.5 Сроки разработки теперь высчитываются: Срок разработки от КБ + Кол-во дней по срокам производства в спецификации.
	//При формировании отчета убраны лишние поля и группировки.
	
	//1.2 Форма конструкторов.
	//1.2.1 Добавлена форма выбора спецификаций.
	//1.2.2 Добавлена форма выбора исполнителей.
	//1.2.3 Добавлена форма выбора заказов с отказом.
	//1.2.4 Исправлены установки сроков разработки.
	//1.2.5 Добавлена проверка перед установкой сроков переноса.
	//1.2.6 Добавлена возможность согласовывать и отменять согласование при изменении поля подтверждено.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

//***Список изменений 18.03.2024:
//1.	Обработка «АРМ Процесс согласования»
	//1.1 Форма менеджеров.
	//1.1.1 Таблица ТоварыЗаказа - Изменена видимость полей: СтавкаНДС, СуммаНДС.
	//1.1.2 Изменен запрос при формировании списка товаров. Исключен отбор на список материалов и себестоимость изделия.
	//1.1.3 Добавлена кнопка открытия дополнительной внешней обработки "ТТМ: Управление ценами".
	//Открытие доп. внешних обработок перенеса в общий модуль ТТМ_ДанныеВыбораСервер
	//1.1.4 Изменена видимость кнопки отчета "Текущее состояние заказа".
	//1.1.5 При выгрузке данных со списком товаров и сроками разработки КД. Поле сроки разработки теперь является основным.
	//Если были установлены сроки переноса, тогда вместо сроков разработки будет использоваться сроки переноса.
	//1.1.6 Добавлена сортировка строк в списке товаров. (Возр, Убыв).
	//1.1.7 Добавлена возможность вернуть отмененный заказ, при условиях если заказ был закрыт и строки в ТЧ Товары имеют статус "Отменено".
	//1.1.8 Добалены поля с причиной отказа, если заказ был отменен другим подразделением. Причина отображается в подвале Таблицы СписокЗаказовМенеджер.
	//1.1.9 Добавлен список для заполнения электронных адресов для рассылки.
	//1.1.1.1 Добавлена рассылка почтовых уведомлений.
	// Теперь при отказе со стороны подразделения Менеджеров отправляется рассылка на электронную почту всем участникам рассылки.
	//1.1.1.2 Добавлен макет рассылки
	//1.1.1.3 Добавлена загрузка и сохранение настроек рассылки в хранилище конфигурации.
	// В качестве ключа используется обработка + текущий сеанс пользователя.
	// В качестве значения используется список значений "ЭлектронныеАдресаРассылки".
	// Добавлен вопрос, если пользователь внес изменения в настройки отбора цен или рассылки электронных писем, но не применил изменение с сохранением.
	
	//1.2 Форма конструкторов.
	//1.2.1 Исправлено уведомление на форме конструкторов. Теперь оповещение пользователя будет отображаться, даже если заказ был частично согласован.
	//1.2.2 Регистр "ИсполнителиСпецификаци". Добавлены дополнительные измерения: ЗаказКлиента, Номенклатура.
	//Теперь можно согласовать заказ при отсутствующей спецификации или той которая находится на этапе в разработке.
	//1.2.3 Добавлена сортировка строк в списке товаров со спецификацией. (Возр, Убыв).
	//1.2.4 Добавлен список для заполнения электронных адресов для рассылки
	//1.2.5 Добавлена рассылка почтовых уведомлений.
	// Теперь при отказе со стороны подразделения "Конструкторов" отправляется рассылка на электронную почту всем участникам рассылки.
	//1.2.6 Добавлен макет рассылки
	//1.2.7 Добавлена загрузка и сохранение настроек рассылки в хранилище конфигурации.
	// В качестве ключа используется обработка + текущий сеанс пользователя.
	// В качестве значения используется список значений "ЭлектронныеАдресаРассылки"
	//1.2.8 Добавлен обработчик ожидания, если пользователь внес изменения в настройки рассылки, но не применил изменение с сохранением.
	// Логика обработчика ожидания.
	//Внесены изменения? Да -> Настройки сохранены? -> Да -> Отключить обработчик | Иначе -> Подключить обработчик и задать вопрос пользователю с предложением сохранить настройки.
	
//2. Автообновление списка текущих заказов
	//2.1.1 Добавлены настройки автообновления списка заказов
	//Автообновление - включить/отключить
	//Настройки сохраняются индивидуально для каждого пользователя.
    	//2.1.2 Подключен обработчик ожидания.
	//Если Автообновление  включено, то включается обработчик обновления списка заказов с периодом в 300 секунд (5 минут).
	//Если были загружены новые заказы или появились заказы с отказом, тогда пользователю выдается вопрос с предложением обновить текущий список.
	//Автообновление работает в обе стороны как и для Менеджеров, так и для Конструкторов.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

 //***Список изменений 13.05.2024:
//1.	Обработка «АРМ Выпуск и реализаци»
	//1.1 Изменена обработка при изменении колонки отметка в таблице Этапы.
	//Теперь при установке флага данные в поле заказ клиента и изделие автоматически подтягивается.
	//Если поля были уже заполнены и сформирован отбор, повторное заполнение выполняться не будет.
	//При снятии флагов подчищаются поля: заказ клиента, изделие. И также формируется новый отбор с обновлением списка этапов.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

 //***Список изменений 23.05.2024:
 //1.	Обработка «АРМ Процесс согласования»
 	//1.1 Добавлена возможность открытия доп. обработки "ТТМ_ПланПродаж".
	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
 //***Список изменений 14.06.2024:	
 //1.	Обработка «ТТМ_План продаж»
 	//1.1 Создан общий модуль «ТТМ_ОбработкаАрмовКлиент».
	//Добавлена процедура обработки новой строки после разбиения.
	//1.2 Добавлена функция «ОбработатьСтрокиТабличногоДокументаВЗаказеКлиента».
	//Теперь изменение или смещение даты отгрузки в заказах выполняется в фоновом режиме.
