//Функция условного оформления при автоподборе
#Область УсловноеОформлениеПриАвтоПодборе

Функция ПодсветитьСлова(ИсходнаяСтрока, МассивСловПодсветки, Знач ШрифтПодсветки = Неопределено, Знач ЦветПодсветки = Неопределено) Экспорт
	
	МассивРезультирующихСтрок = Новый Массив;
	
	Если ШрифтПодсветки = Неопределено Тогда
		ШрифтПодсветки = Новый Шрифт(,, Истина); // жирный
	КонецЕсли;
	
	Если ЦветПодсветки = Неопределено Тогда
		ЦветПодсветки = Новый Цвет(0, 153, 0); // светло-зеленый из стандартной подсветки ввода по строке
	КонецЕсли;
	
	ИсходнаяСтрокаНормализованная = НРег(ИсходнаяСтрока); // нормализация
	ДлинаИсходнойСтроки = СтрДлина(ИсходнаяСтрокаНормализованная);
	
	// получим список диапазонов символов для подсветки
	СписокДиапазонов = Новый СписокЗначений;
	
	Для НомерСлова = 1 По МассивСловПодсветки.Количество() Цикл
		СловоПодсветки = НРег(МассивСловПодсветки[НомерСлова - 1]); // нормализация
		ПозицияНачалаСлова = 1;
		ДлинаСлова = СтрДлина(СловоПодсветки);
		
		Пока ПозицияНачалаСлова <> 0 И ПозицияНачалаСлова <= ДлинаИсходнойСтроки Цикл
			ПозицияНачалаСлова = СтрНайти(ИсходнаяСтрокаНормализованная, СловоПодсветки, , ПозицияНачалаСлова);
			
			Если ПозицияНачалаСлова > 0 Тогда
				МассивДиапазона = Новый Массив;
				МассивДиапазона.Добавить(ПозицияНачалаСлова);
				МассивДиапазона.Добавить(ПозицияНачалаСлова + ДлинаСлова - 1);
				СписокДиапазонов.Добавить(МассивДиапазона, Формат(ПозицияНачалаСлова, "ЧЦ=3; ЧВН="));
				ПозицияНачалаСлова = ПозицияНачалаСлова + ДлинаСлова;
			КонецЕсли;		
		КонецЦикла;
		
	КонецЦикла;
	
	// отсортируем список диапазонов по возрастанию начал диапазонов
	СписокДиапазонов.СортироватьПоПредставлению();
	
	// сформируем массив результирующих строк с разным оформлением (подсветкой)
	СтартоваяПозиция = 1;
	
	Для Каждого ЭлементДиапазона Из СписокДиапазонов Цикл
		НачалоДиапазона = ЭлементДиапазона.Значение[0];
		КонецДиапазона = ЭлементДиапазона.Значение[1];
		
		Если НачалоДиапазона > СтартоваяПозиция Тогда // часть строки без подсветки
			ЧастьБезВыделения = Сред(ИсходнаяСтрока, СтартоваяПозиция, НачалоДиапазона - СтартоваяПозиция);
			МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(ЧастьБезВыделения));
			СтартоваяПозиция = НачалоДиапазона;
		КонецЕсли;
		
		Если КонецДиапазона >= СтартоваяПозиция Тогда // часть строки с подсветкой
			ЧастьВыделяемая = Сред(ИсходнаяСтрока, СтартоваяПозиция, КонецДиапазона - СтартоваяПозиция + 1);
			МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(ЧастьВыделяемая, ШрифтПодсветки, ЦветПодсветки));
			СтартоваяПозиция = КонецДиапазона + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если СтартоваяПозиция <= ДлинаИсходнойСтроки Тогда // "хвост" без выделения
		Хвост = Сред(ИсходнаяСтрока, СтартоваяПозиция, ДлинаИсходнойСтроки - СтартоваяПозиция + 1);
		МассивРезультирующихСтрок.Добавить(Новый ФорматированнаяСтрока(Хвост));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивРезультирующихСтрок);
	
КонецФункции

#КонецОбласти

//Создание структуры для печати этикеток 
#Область ПечатьЭтикетокИДокументов

Функция СформироватьСтруктуруПечатиЭтикеток(НоменклатураСсылка, Знач КоличествоДляПечати = Неопределено, МассивСН = Неопределено, ВариантПечати = 1) Экспорт
		
	//// Подготовка данных для заполенения табличной части обработки печати ценников и этикеток.
	//Если ТипЗнч(НоменклатураСсылка) = Тип("СправочникСсылка.Номенклатура") Тогда 
		
	//24.06.2025
	АдресВоВременномХранилище = ЗаполнитьТоварыНаСервере(НоменклатураСсылка, КоличествоДляПечати, МассивСН, ВариантПечати);		
	//-
		
	//	//Печать ШК из АРМ Выпуск и Реализация
	//	
	//	Если КоличествоДляПечати <> Неопределено Тогда
	//	 	АдресВоВременномХранилище = ЗаполнитьТоварыНаСервере(НоменклатураСсылка, КоличествоДляПечати);
	// 	Иначе
	//	    АдресВоВременномХранилище = ЗаполнитьТоварыНаСервере(НоменклатураСсылка);
	//	КонецЕсли;
	//ИначеЕсли ТипЗнч(НоменклатураСсылка) = Тип("Массив") Тогда 
	//	
	//	//Печать серийных номеров
	//	
	//	Если КоличествоДляПечати <> 0 Тогда 
		
	//КонецЕсли;
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", АдресВоВременномХранилище);
	СтруктураРезультат.Вставить("Организация");
	СтруктураРезультат.Вставить("ПравилоОбмена");
	СтруктураРезультат.Вставить("МаксимальныйКодВесовогоТовара");
	СтруктураРезультат.Вставить("ПравилоВыгрузкиВВесы");
	СтруктураРезультат.Вставить("ВидЦены");
	СтруктураРезультат.Вставить("Дата");
	СтруктураРезультат.Вставить("ВидЦеныДополнительно");
	СтруктураРезультат.Вставить("ДатаДополнительно");

	Возврат СтруктураРезультат;	
	
КонецФункции
//ВариантПечати = 1 - печать ШК товара
//ВариантПечати = 2 - печать Серийного номера товара
Функция ЗаполнитьТоварыНаСервере(ДанныеДляПечати, Знач КоличествоДляПечати = Неопределено, МассивСерийныхНомеров = Неопределено, ВариантПечати = 1)
	
	ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Порядок",                ТипЧисло);
	Товары.Колонки.Добавить("Номенклатура",           Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Упаковка",               Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Товары.Колонки.Добавить("Характеристика",         Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("Штрихкод",               Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ШаблонЭтикетки",         Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЭтикеток",     ТипЧисло);
	Товары.Колонки.Добавить("ШаблонЦенника",          Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЦенников",     ТипЧисло);
	
	//Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда 
	//Если ТипЗнч(ДанныеДляПечати) = Тип("СправочникСсылка.Номенклатура") и ЗначениеЗаполнено(ДанныеДляПечати) Тогда 
	
	Если ВариантПечати = 1 Тогда 	
		
		//Печать ШК из АРМ Выпуск и Реализация
		
		ШаблонЭтикеткиТТМ = Справочники.ШаблоныЭтикетокИЦенников.НайтиПоНаименованию("Этикетка ТТМ", Истина);
	
		Если ШаблонЭтикеткиТТМ.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден шаблон этикетки для печати");
			Возврат Неопределено;
		КонецЕсли;
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Порядок = 1;
		НоваяСтрока.Номенклатура = ДанныеДляПечати;
		НоваяСтрока.КоличествоЭтикеток = ?(КоличествоДляПечати = Неопределено, 1, КоличествоДляПечати);
		НоваяСтрока.Штрихкод  = ПолучитьШтрихкод(ДанныеДляПечати);
		НоваяСтрока.ШаблонЭтикетки  = ШаблонЭтикеткиТТМ;
		
	//ИначеЕсли ТипЗнч(ДанныеДляПечати) = Тип("Массив") Тогда 
	ИначеЕсли ВариантПечати = 2 Тогда  
		
		//Печать серийных номеров   
		
		ШаблонЭтикеткиСН = Справочники.ШаблоныЭтикетокИЦенников.НайтиПоНаименованию("Этикетка СН", Истина);
	
		Если ШаблонЭтикеткиСН.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден шаблон этикетки для печати");
			Возврат Неопределено;
		КонецЕсли;
		
		Т =1;
		Для Каждого СерийныйНомер из МассивСерийныхНомеров Цикл 
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Порядок = Т;
			НоваяСтрока.Номенклатура = ДанныеДляПечати;
			НоваяСтрока.КоличествоЭтикеток = ?(ЗначениеЗаполнено(КоличествоДляПечати), КоличествоДляПечати, 1);
			НоваяСтрока.Штрихкод  = СтрЗаменить(СерийныйНомер,"-","");
			//ПолучитьСерийныйНомер(ДанныеДляПечати, ЭтапПроизводства);
			НоваяСтрока.ШаблонЭтикетки  = ШаблонЭтикеткиСН;
			Т = Т+1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Товары);
	
КонецФункции

Функция ПолучитьШтрихкод(НоменклатураСсылка) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
	                |ИЗ
	                |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                |ГДЕ
	                |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура ";
	
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Результат = Запрос.Выполнить().Выгрузить();
    
    ШК = "";
    Если Результат.Количество() > 0 Тогда
        ШК = Результат[0].Штрихкод;
    КонецЕсли;
    
    Возврат ШК; 
	
КонецФункции

Функция ПолучитьСерийныйНомер(ДанныеСтроки, ЭтапПроизводства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	Запрос.УстановитьПараметр("Номенклатура",ДанныеСтроки.Номенклатура);
	Запрос.УстановитьПараметр("ЭтапПроизводства",ДанныеСтроки.ЭтапПроизводства);
	Запрос.УстановитьПараметр("СерийныйНомер",ДанныеСтроки.СерийныйНомер);
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
	КонецЕсли;
	Возврат СтрЗаменить(Выборка.СерийныйНомер,"-","");
	
КонецФункции

#КонецОбласти

//Проверка прав на редактирование полей у справочника "Номенклатура"
#Область РаботаСНоменклатуройПроверкаПравДоступа

функция ПроверкаРолиДоступа(Знач ДоступНаРаботуСФайлами = Ложь, Знач ТекущаяРольДоступна = Ложь) Экспорт
		
	Если ДоступНаРаботуСФайлами Тогда		
		
		Если РольДоступна("ДобавлениеИзменениеНоменклатуры") ИЛИ РольДоступна("ПолныеПрава") Тогда
			ТекущаяРольДоступна = Истина;
		КонецЕсли;
	Иначе
		Если РольДоступна("ПолныеПрава") Тогда 
			ТекущаяРольДоступна = Истина;
		КонецЕсли;	
	КонецЕсли;
			
	Возврат ТекущаяРольДоступна;  
	
КонецФункции

#КонецОбласти


#Область ТТМ_АРМ_РезервированиеИСписаниеМатериалов     

//+ Ганьшина Е. 15.04.2025         
//27.05.2025
Функция ПолучитьОстаток_2_5(Номенклатура, Склад, МассивЭтапов, ТаблицаВыбранныхЭтапов, ЭтоСписание) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	Таб_ЭтапыДляОбработки.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ СпецификацииЭтапов
	               |ИЗ
	               |	&Таб_ЭтапыДляОбработки КАК Таб_ЭтапыДляОбработки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК СсылкаНаНоменклатуру
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура В(&Номенклатура)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	СсылкаНаНоменклатуру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок) КАК Норматив,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи КАК КлючСвязи
	               |ПОМЕСТИТЬ НормативыпоСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииЭтапов КАК СпецификацииЭтапов
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = СпецификацииЭтапов.Спецификация
	               |ГДЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура В(&Номенклатура)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	               |	&Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	               |	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0)) КАК Резерв,
	               |	СУММА(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК Отгружается
	               |ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов_v1
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			,
	               |			Номенклатура В (&Номенклатура)
	               |				И Склад В (&Склад)) КАК ТоварыНаСкладахОстатки
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(
	               |				,
	               |				Номенклатура В (&Номенклатура)
	               |					И Склад В (&Склад)) КАК ЗапасыИПотребностиОстатки
	               |		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗапасыИПотребностиОстатки.Номенклатура
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(
	               |				,
	               |				Номенклатура В (&Номенклатура)
	               |					И Склад В (&Склад)) КАК ТоварыКОтгрузкеОстатки
	               |		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)),
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировано,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РезервироватьПоМереПоступления,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отгружено
	               |ПОМЕСТИТЬ ЗарезервированоИОтружено
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В(&МассивЭтапов)
	               |	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура В (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |		ИНАЧЕ 0
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура КАК Номенклатура,
	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Характеристика КАК Характеристика,
	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Склад КАК Склад,
	               |	ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии КАК ВНаличии,
	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Резерв КАК ВРезервеСоСклада,
	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Отгружается КАК КОтгрузке
	               |ИЗ
	               |	ВТ_НовыеОстаткиИзЗапасов_v1 КАК ВТ_НовыеОстаткиИзЗапасов_v1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗарезервированоИОтружено КАК ЗарезервированоИОтружено
	               |		ПО ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура = ЗарезервированоИОтружено.Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
	Запрос.УстановитьПараметр("Таб_ЭтапыДляОбработки", ТаблицаВыбранныхЭтапов); 
	Запрос.УстановитьПараметр("Пользователь",Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе);
	Запрос.УстановитьПараметр("ЭтоСписание", ЭтоСписание);
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Вналичии - Выборка.ВРезервеСоСклада - Выборка.КОтгрузке;
	Иначе                   
		Возврат 0;
	КонецЕсли;    
	
КонецФункции        

Функция ПолучитьКатегориюМатериала(Номенклатура,ДР_КатегорияМатериала) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Владелец КАК Свойство,
	               |	ЗначенияСвойствОбъектов.Ссылка КАК КатегорияМатериала,
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |		ПО НоменклатураДополнительныеРеквизиты.Свойство = ЗначенияСвойствОбъектов.Владелец
	               |			И НоменклатураДополнительныеРеквизиты.Значение = ЗначенияСвойствОбъектов.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство",ДР_КатегорияМатериала);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КатегорияМатериала;
	Иначе 
		Возврат Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 
//-

//Получение материалов при переходе на страницу материалы спецификации.
//Временная запись в регистр сведений для получения результата запроса
Функция ПолучитьМатериалыПоДаннымЭтаповДляРегистра(Период, Склад, ЭтоСписание, ТаблицаВыбранныхЭтапов, КатегорияМатериала, 
		Знач ОтборПоКатегориямМатериалов = Ложь, Знач ОтборПоВариантамОбеспечения = Ложь) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЭтапы.Обрабатывать КАК Обрабатывать,
	|	ТабЭтапы.Статус КАК Статус,
	|	ТабЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
	|	ТабЭтапы.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	|	ТабЭтапы.Назначение КАК Назначение,
	|	ТабЭтапы.Спецификация КАК Спецификация,
	|	ТабЭтапы.Запланировано КАК Запланировано
	|ПОМЕСТИТЬ Таб_ЭтапыДляОбработки
	|ИЗ
	|	&ТабЭтапы КАК ТабЭтапы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Таб_ЭтапыДляОбработки.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ СпецификацииЭтапов
	|ИЗ
	|	Таб_ЭтапыДляОбработки КАК Таб_ЭтапыДляОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК ЭтапПроизводства
	|ПОМЕСТИТЬ МатериалыЭтапов
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Таб_ЭтапыДляОбработки КАК Таб_ЭтапыДляОбработки
	|		ПО (Таб_ЭтапыДляОбработки.ЭтапПроизводства = ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатериалыЭтапов.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТабМатериалы
	|ИЗ
	|	МатериалыЭтапов КАК МатериалыЭтапов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	|	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок) КАК Норматив,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	|	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие,
	|	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи КАК КлючСвязи
	|ПОМЕСТИТЬ НормативыпоСпецификации
	|ИЗ
	|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	|		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииЭтапов КАК СпецификацииЭтапов
	|		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = СпецификацииЭтапов.Спецификация
	|
	|СГРУППИРОВАТЬ ПО
	|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	|	КОНЕЦ,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	|	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура,
	|	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатериалыЭтапов.Номенклатура КАК Номенклатура,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК КатегорияМатериала
	|ПОМЕСТИТЬ ВТ_КатегорииНоменклатуры
	|ИЗ
	|	МатериалыЭтапов КАК МатериалыЭтапов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО МатериалыЭтапов.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	|				ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Зарезервировано,
	|	СУММА(ВЫБОР
	|			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	|				ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Отгружено
	|ПОМЕСТИТЬ КоличествоРезервИОтгрузка
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.ЭтапПроизводства
	|			ИЗ
	|				Таб_ЭтапыДляОбработки КАК Т)
	|	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПРоизводства2_2.Начат)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(РаспределениеЗапасов.Склад, 0) КАК Склад,
	|	СУММА(ЕСТЬNULL(РаспределениеЗапасов.Зарезервировано, 0)) КАК ЗарезервированоПоМереПоступления
	|ПОМЕСТИТЬ ВТ_ЗарезервированоПоМереПоступления
	|ИЗ
	|	МатериалыЭтапов КАК МатериалыЭтапов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	|		ПО МатериалыЭтапов.Номенклатура = РаспределениеЗапасов.Номенклатура
	|			И МатериалыЭтапов.ЭтапПроизводства = РаспределениеЗапасов.ЗаказНаОтгрузку
	|ГДЕ
	|	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
	|	И РаспределениеЗапасов.Склад В(&Склад)
	|	И РаспределениеЗапасов.ЗаказНаОтгрузку ССЫЛКА Документ.ЭтапПроизводства2_2
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(РаспределениеЗапасов.Склад, 0),
	|	РаспределениеЗапасов.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	|	ТабМатериалы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличии,
	|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) КАК Резерв,
	|	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) КАК Отгружается,
	|	ВТ_ЗарезервированоПоМереПоступления.ЗарезервированоПоМереПоступления КАК ЗарезервированоПриПоступления,
	|	ЗапасыИПотребностиОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов_v1
	|ИЗ
	|	ТабМатериалы КАК ТабМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(, Склад В (&Склад)) КАК ЗапасыИПотребностиОстатки
	|		ПО ТабМатериалы.Номенклатура = ЗапасыИПотребностиОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад В (&Склад)) КАК ТоварыКОтгрузкеОстатки
	|		ПО ТабМатериалы.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&Склад)) КАК ТоварыНаСкладахОстатки
	|		ПО ТабМатериалы.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗарезервированоПоМереПоступления КАК ВТ_ЗарезервированоПоМереПоступления
	|		ПО ТабМатериалы.Номенклатура = ВТ_ЗарезервированоПоМереПоступления.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)),
	|	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|	ВТ_ЗарезервированоПоМереПоступления.ЗарезервированоПоМереПоступления,
	|	ТабМатериалы.Номенклатура,
	|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0),
	|	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0),
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0),
	|	ЗапасыИПотребностиОстатки.ВНаличииОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК ИсходнаяНоменклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК Характеристика,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Серия КАК Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	|	КОНЕЦ КАК Упаковка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	|	КОНЕЦ КАК ИсходнаяЕдиницаИзмерения,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Обособленно КАК Обособленно,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Производится КАК Производится,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация КАК Спецификация,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение КАК Назначение,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НазначениеОбеспечения КАК НазначениеОбеспечения,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КодСтроки КАК КодСтроки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	|	ВЫРАЗИТЬ(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СведенияАвтовыбора КАК СТРОКА(250)) КАК СведенияАвтовыбора,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПрименениеМатериала КАК ПрименениеМатериала,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(справочник.статьиКалькуляции.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПУстаяСсылка)
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции
	|		ИНАЧЕ НормативыпоСпецификации.СтатьяКалькуляции
	|	КОНЕЦ КАК СтатьяКалькуляции,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Период КАК ПериодЗатрат,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок, 0) = 0
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	|		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НормативыпоСпецификации.Упаковка, НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения) <> НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения
	|			ТОГДА ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0) / НормативыпоСпецификации.Упаковка.Числитель * НормативыпоСпецификации.Упаковка.Знаменатель
	|		ИНАЧЕ ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0)
	|	КОНЕЦ КАК Норматив,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КоличествоУпаковокПлан КАК Запланировано,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК ЭтапПроизводства,
	|	НормативыпоСпецификации.Спецификация КАК СпецификацияЭтапа,
	|	&Пользователь КАК Пользователь,
	|	&ЭтоСписание КАК ЭтоСписание,
	|	ВЫБОР
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	|				ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Обеспечить,
	|	ЕСТЬNULL(ВТ_КатегорииНоменклатуры.КатегорияМатериала, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)) КАК КатегорияМатериала,
	|	ВЫБОР
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|			ТОГДА 1
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	|			ТОГДА 2
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	|			ТОГДА 3
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	|			ТОГДА 4
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(перечисление.ВариантыОбеспечения.Отгрузить)
	|			ТОГДА 5
	|	КОНЕЦ КАК ОтборПоВариантамОбеспечения,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Подразделение КАК Подразделение,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено КАК Отменено,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПричинаОтмены КАК ПричинаОтмены,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиНабор КАК КлючСвязиНабор,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючНоменклатура КАК КлючНоменклатура,
	|	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Отгружается, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Резерв, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ЗарезервированоПриПоступления, 0) КАК Остаток
	|ПОМЕСТИТЬ ПредварительныеОстатки
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	|			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация = ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)))
	|			И (ВЫБОР
	|				КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация = &ПустойИД
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация = НормативыпоСпецификации.КлючСвязи
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КатегорииНоменклатуры КАК ВТ_КатегорииНоменклатуры
	|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(ВТ_КатегорииНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НовыеОстаткиИзЗапасов_v1 КАК ВТ_НовыеОстаткиИзЗапасов_v1
	|		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура
	|			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика = ВТ_НовыеОстаткиИзЗапасов_v1.Характеристика
	|			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад = ВТ_НовыеОстаткиИзЗапасов_v1.Склад
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.ЭтапПроизводства
	|			ИЗ
	|				Таб_ЭтапыДляОбработки КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	|	КОНЕЦ,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ДатаОтгрузки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Производится,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерий,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийОтправитель,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийПолучатель,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КодСтроки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИспользуетсяАвтовыбор,
	|	ВЫРАЗИТЬ(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СведенияАвтовыбора КАК СТРОКА(250)),
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПрименениеМатериала,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(справочник.статьиКалькуляции.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПУстаяСсылка)
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции
	|		ИНАЧЕ НормативыпоСпецификации.СтатьяКалькуляции
	|	КОНЕЦ,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Период,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.АналитикаУчетаНоменклатуры,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КорАналитикаУчетаНоменклатуры,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка,
	|	НормативыпоСпецификации.Спецификация,
	|	ЕСТЬNULL(ВТ_КатегорииНоменклатуры.КатегорияМатериала, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)),
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Обособленно,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИдентификаторСтроки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Подразделение,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПричинаОтмены,
	|	ВЫБОР
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	|				ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|			ТОГДА 1
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	|			ТОГДА 2
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	|			ТОГДА 4
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(перечисление.ВариантыОбеспечения.Отгрузить)
	|			ТОГДА 5
	|	КОНЕЦ,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КоличествоУпаковокПлан,
	|	ВЫБОР
	|		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	|				ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НормативыпоСпецификации.Упаковка, НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения) <> НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения
	|			ТОГДА ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0) / НормативыпоСпецификации.Упаковка.Числитель * НормативыпоСпецификации.Упаковка.Знаменатель
	|		ИНАЧЕ ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок, 0) = 0
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	|		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок
	|	КОНЕЦ,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НазначениеОбеспечения,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиНабор,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючНоменклатура,
	|	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Отгружается, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Резерв, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ЗарезервированоПриПоступления, 0),
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НормативыпоСпецификации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_КатегорииНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НовыеОстаткиИзЗапасов_v1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныеОстатки.Номенклатура.КодДляПоиска КАК КодНоменклатуры,
	|	ПредварительныеОстатки.Номенклатура КАК Номенклатура,
	|	ПредварительныеОстатки.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	|	ПредварительныеОстатки.Характеристика КАК Характеристика,
	|	ПредварительныеОстатки.Серия КАК Серия,
	|	ПредварительныеОстатки.Упаковка КАК Упаковка,
	|	ПредварительныеОстатки.ИсходнаяЕдиницаИзмерения КАК ИсходнаяЕдиницаИзмерения,
	|	ПредварительныеОстатки.ВариантОбеспечения КАК ВариантОбеспечения,
	|	ПредварительныеОстатки.Обособленно КАК Обособленно,
	|	ПредварительныеОстатки.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ПредварительныеОстатки.Склад КАК Склад,
	|	ПредварительныеОстатки.Производится КАК Производится,
	|	ПредварительныеОстатки.Спецификация КАК Спецификация,
	|	ПредварительныеОстатки.Назначение КАК Назначение,
	|	ПредварительныеОстатки.НазначениеОбеспечения КАК НазначениеОбеспечения,
	|	ПредварительныеОстатки.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	ПредварительныеОстатки.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	|	ПредварительныеОстатки.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	|	ПредварительныеОстатки.КодСтроки КАК КодСтроки,
	|	ПредварительныеОстатки.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	|	ПредварительныеОстатки.СведенияАвтовыбора КАК СведенияАвтовыбора,
	|	ПредварительныеОстатки.ПрименениеМатериала КАК ПрименениеМатериала,
	|	ПредварительныеОстатки.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	|	ПредварительныеОстатки.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ПредварительныеОстатки.ПериодЗатрат КАК ПериодЗатрат,
	|	ПредварительныеОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ПредварительныеОстатки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	ПредварительныеОстатки.Количество КАК Количество,
	|	ПредварительныеОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ПредварительныеОстатки.Норматив * ПредварительныеОстатки.Запланировано КАК Норматив,
	|	ПредварительныеОстатки.Остаток + ЕСТЬNULL(КоличествоРезервИОтгрузка.Зарезервировано, 0) + ЕСТЬNULL(КоличествоРезервИОтгрузка.Отгружено, 0) КАК Остаток,
	|	КоличествоРезервИОтгрузка.Зарезервировано КАК Зарезервировано,
	|	ПредварительныеОстатки.Запланировано КАК Запланировано,
	|	ПредварительныеОстатки.ЭтапПроизводства КАК ЭтапПроизводства,
	|	ПредварительныеОстатки.СпецификацияЭтапа КАК СпецификацияЭтапа,
	|	ПредварительныеОстатки.Пользователь КАК Пользователь,
	|	ПредварительныеОстатки.ЭтоСписание КАК ЭтоСписание,
	|	ПредварительныеОстатки.Обеспечить КАК Обеспечить,
	|	ПредварительныеОстатки.КатегорияМатериала КАК КатегорияМатериала,
	|	ПредварительныеОстатки.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	|	ПредварительныеОстатки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПредварительныеОстатки.Подразделение КАК Подразделение,
	|	ПредварительныеОстатки.КлючСвязиНабор КАК КлючСвязиНабор,
	|	ПредварительныеОстатки.КлючНоменклатура КАК КлючНоменклатура
	|ИЗ
	|	ПредварительныеОстатки КАК ПредварительныеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоРезервИОтгрузка КАК КоличествоРезервИОтгрузка
	|		ПО ПредварительныеОстатки.Номенклатура = КоличествоРезервИОтгрузка.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтапПроизводства,
	|	Номенклатура";
	
	#Область СтарыйЗапрос
	//"ВЫБРАТЬ
	//               |	ТабЭтапы.Обрабатывать КАК Обрабатывать,
	//               |	ТабЭтапы.Статус КАК Статус,
	//               |	ТабЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
	//               |	ТабЭтапы.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	//               |	ТабЭтапы.Назначение КАК Назначение,
	//               |	ТабЭтапы.Спецификация КАК Спецификация,
	//               |	ТабЭтапы.Запланировано КАК Запланировано
	//               |ПОМЕСТИТЬ Таб_ЭтапыДляОбработки
	//               |ИЗ
	//               |	&ТабЭтапы КАК ТабЭтапы
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	//               |	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок) КАК Норматив,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	//               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	//               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	//               |	КОНЕЦ КАК Упаковка,
	//               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	//               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	//               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие,
	//               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи КАК КлючСвязи
	//               |ПОМЕСТИТЬ НормативыпоСпецификации
	//               |ИЗ
	//               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	//               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	//			   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Таб_ЭтапыДляОбработки КАК Таб_ЭтапыДляОбработки
	//			   |		ПО (РесурсныеСпецификацииВыходныеИзделия.Ссылка = Таб_ЭтапыДляОбработки.Спецификация)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	//               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	//               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	//               |	КОНЕЦ,
	//               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	//               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	//               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура,
	//               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	НормативыпоСпецификации.Номенклатура КАК Номенклатура,
	//               |	НоменклатураДополнительныеРеквизиты.Значение КАК КатегорияМатериала
	//               |ПОМЕСТИТЬ ВТ_КатегорииНоменклатуры
	//               |ИЗ
	//               |	НормативыпоСпецификации КАК НормативыпоСпецификации
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	//               |		ПО НормативыпоСпецификации.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	//               |ГДЕ
	//               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	//               |	СУММА(ВЫБОР
	//               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//               |					ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	//               |				ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	//               |			ИНАЧЕ 0
	//               |		КОНЕЦ) КАК Зарезервировано,
	//               |	СУММА(ВЫБОР
	//               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	//               |				ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	//               |			ИНАЧЕ 0
	//               |		КОНЕЦ) КАК Отгружено
	//               |ПОМЕСТИТЬ КоличествоРезервИОтгрузка
	//               |ИЗ
	//               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	//               |ГДЕ
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	//               |			(ВЫБРАТЬ
	//               |				Т.ЭтапПроизводства
	//               |			ИЗ
	//               |				Таб_ЭтапыДляОбработки КАК Т)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	РаспределениеЗапасов.Склад КАК Склад,
	//               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	//               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
	//               |	СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
	//               |	СУММА(РаспределениеЗапасов.Резерв) КАК Резерв
	//               |ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов
	//               |ИЗ
	//               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	//               |ГДЕ
	//               |	РаспределениеЗапасов.Номенклатура В
	//               |			(ВЫБРАТЬ
	//               |				КоличествоРезервИОтгрузка.Номенклатура КАК Номенклатура
	//               |			ИЗ
	//               |				КоличествоРезервИОтгрузка КАК КоличествоРезервИОтгрузка)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	РаспределениеЗапасов.Номенклатура,
	//               |	РаспределениеЗапасов.Склад,
	//               |	РаспределениеЗапасов.Характеристика
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК ИсходнаяНоменклатура,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК Характеристика,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Серия КАК Серия,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	//               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	//               |	КОНЕЦ КАК Упаковка,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	//               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	//               |	КОНЕЦ КАК ИсходнаяЕдиницаИзмерения,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения КАК ВариантОбеспечения,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Обособленно КАК Обособленно,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ДатаОтгрузки КАК ДатаОтгрузки,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Производится КАК Производится,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация КАК Спецификация,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение КАК Назначение,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НазначениеОбеспечения КАК НазначениеОбеспечения,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерий КАК СтатусУказанияСерий,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КодСтроки КАК КодСтроки,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	//               |	ВЫРАЗИТЬ(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СведенияАвтовыбора КАК СТРОКА(250)) КАК СведенияАвтовыбора,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПрименениеМатериала КАК ПрименениеМатериала,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(справочник.статьиКалькуляции.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПУстаяСсылка)
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции
	//               |		ИНАЧЕ НормативыпоСпецификации.СтатьяКалькуляции
	//               |	КОНЕЦ КАК СтатьяКалькуляции,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Период КАК ПериодЗатрат,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество КАК Количество,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок, 0) = 0
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	//               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок
	//               |	КОНЕЦ КАК КоличествоУпаковок,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(НормативыпоСпецификации.Упаковка, НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения) <> НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения
	//               |			ТОГДА ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0) / НормативыпоСпецификации.Упаковка.Числитель * НормативыпоСпецификации.Упаковка.Знаменатель
	//               |		ИНАЧЕ ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0)
	//               |	КОНЕЦ КАК Норматив,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КоличествоУпаковокПлан КАК Запланировано,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК ЭтапПроизводства,
	//               |	НормативыпоСпецификации.Спецификация КАК СпецификацияЭтапа,
	//               |	&Пользователь КАК Пользователь,
	//               |	&ЭтоСписание КАК ЭтоСписание,
	//               |	ВЫБОР
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	//               |				ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК Обеспечить,
	//               |	ЕСТЬNULL(ВТ_КатегорииНоменклатуры.КатегорияМатериала, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)) КАК КатегорияМатериала,
	//               |	ВЫБОР
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	//               |			ТОГДА 1
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	//               |			ТОГДА 2
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	//               |			ТОГДА 3
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//               |			ТОГДА 4
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(перечисление.ВариантыОбеспечения.Отгрузить)
	//               |			ТОГДА 5
	//               |	КОНЕЦ КАК ОтборПоВариантамОбеспечения,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспеченияДоИзмененияОбновлениемИБ КАК ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Подразделение КАК Подразделение,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено КАК Отменено,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПричинаОтмены КАК ПричинаОтмены,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиНабор КАК КлючСвязиНабор,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючНоменклатура КАК КлючНоменклатура,
	//               |	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов.ВНаличии, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов.Резерв, 0) КАК Остаток
	//               |ПОМЕСТИТЬ ПредварительныеОстатки
	//               |ИЗ
	//               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	//               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	//               |			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация = ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)))
	//               |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация = НормативыпоСпецификации.КлючСвязи
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КатегорииНоменклатуры КАК ВТ_КатегорииНоменклатуры
	//               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(ВТ_КатегорииНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НовыеОстаткиИзЗапасов КАК ВТ_НовыеОстаткиИзЗапасов
	//               |		ПО ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад = ВТ_НовыеОстаткиИзЗапасов.Склад
	//               |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ВТ_НовыеОстаткиИзЗапасов.Номенклатура
	//               |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика = ВТ_НовыеОстаткиИзЗапасов.Характеристика
	//               |ГДЕ
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	//               |			(ВЫБРАТЬ
	//               |				Т.ЭтапПроизводства
	//               |			ИЗ
	//               |				Таб_ЭтапыДляОбработки КАК Т)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Серия,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	//               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	//               |	КОНЕЦ,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ДатаОтгрузки,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Производится,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерий,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийОтправитель,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатусУказанияСерийПолучатель,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КодСтроки,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИспользуетсяАвтовыбор,
	//               |	ВЫРАЗИТЬ(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СведенияАвтовыбора КАК СТРОКА(250)),
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПрименениеМатериала,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиСпецификация,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(справочник.статьиКалькуляции.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПУстаяСсылка)
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции
	//               |		ИНАЧЕ НормативыпоСпецификации.СтатьяКалькуляции
	//               |	КОНЕЦ,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Период,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.АналитикаУчетаНоменклатуры,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КорАналитикаУчетаНоменклатуры,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка,
	//               |	НормативыпоСпецификации.Спецификация,
	//               |	ЕСТЬNULL(ВТ_КатегорииНоменклатуры.КатегорияМатериала, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)),
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Обособленно,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ИдентификаторСтроки,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Подразделение,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ПричинаОтмены,
	//               |	ВЫБОР
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	//               |				ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	//               |			ТОГДА 1
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	//               |			ТОГДА 2
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
	//               |			ТОГДА 4
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(перечисление.ВариантыОбеспечения.Отгрузить)
	//               |			ТОГДА 5
	//               |	КОНЕЦ,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КоличествоУпаковокПлан,
	//               |	ВЫБОР
	//               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	//               |				ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(НормативыпоСпецификации.Упаковка, НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения) <> НормативыпоСпецификации.Номенклатура.ЕдиницаИзмерения
	//               |			ТОГДА ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0) / НормативыпоСпецификации.Упаковка.Числитель * НормативыпоСпецификации.Упаковка.Знаменатель
	//               |		ИНАЧЕ ЕСТЬNULL(НормативыпоСпецификации.Норматив, 0)
	//               |	КОНЕЦ,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок, 0) = 0
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	//               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок
	//               |	КОНЕЦ,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НазначениеОбеспечения,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючСвязиНабор,
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КлючНоменклатура,
	//               |	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов.ВНаличии, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов.Резерв, 0),
	//               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	//               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	//               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	//               |	КОНЕЦ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |УНИЧТОЖИТЬ НормативыпоСпецификации
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |УНИЧТОЖИТЬ ВТ_КатегорииНоменклатуры
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |УНИЧТОЖИТЬ ВТ_НовыеОстаткиИзЗапасов
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	ПредварительныеОстатки.Номенклатура КАК Номенклатура,
	//               |	ПредварительныеОстатки.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	//               |	ПредварительныеОстатки.Характеристика КАК Характеристика,
	//               |	ПредварительныеОстатки.Серия КАК Серия,
	//               |	ПредварительныеОстатки.Упаковка КАК Упаковка,
	//               |	ПредварительныеОстатки.ИсходнаяЕдиницаИзмерения КАК ИсходнаяЕдиницаИзмерения,
	//               |	ПредварительныеОстатки.ВариантОбеспечения КАК ВариантОбеспечения,
	//               |	ПредварительныеОстатки.Обособленно КАК Обособленно,
	//               |	ПредварительныеОстатки.ДатаОтгрузки КАК ДатаОтгрузки,
	//               |	ПредварительныеОстатки.Склад КАК Склад,
	//               |	ПредварительныеОстатки.Производится КАК Производится,
	//               |	ПредварительныеОстатки.Спецификация КАК Спецификация,
	//               |	ПредварительныеОстатки.Назначение КАК Назначение,
	//               |	ПредварительныеОстатки.НазначениеОбеспечения КАК НазначениеОбеспечения,
	//               |	ПредварительныеОстатки.СтатусУказанияСерий КАК СтатусУказанияСерий,
	//               |	ПредварительныеОстатки.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	//               |	ПредварительныеОстатки.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	//               |	ПредварительныеОстатки.КодСтроки КАК КодСтроки,
	//               |	ПредварительныеОстатки.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	//               |	ПредварительныеОстатки.СведенияАвтовыбора КАК СведенияАвтовыбора,
	//               |	ПредварительныеОстатки.ПрименениеМатериала КАК ПрименениеМатериала,
	//               |	ПредварительныеОстатки.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	//               |	ПредварительныеОстатки.СтатьяКалькуляции КАК СтатьяКалькуляции,
	//               |	ПредварительныеОстатки.ПериодЗатрат КАК ПериодЗатрат,
	//               |	ПредварительныеОстатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	//               |	ПредварительныеОстатки.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	//               |	ПредварительныеОстатки.Количество КАК Количество,
	//               |	ПредварительныеОстатки.КоличествоУпаковок КАК КоличествоУпаковок,
	//               |	ПредварительныеОстатки.Норматив КАК Норматив,
	//               |	ПредварительныеОстатки.Остаток + ЕСТЬNULL(КоличествоРезервИОтгрузка.Зарезервировано, 0) + ЕСТЬNULL(КоличествоРезервИОтгрузка.Отгружено, 0) КАК Остаток,
	//               |	ПредварительныеОстатки.Запланировано КАК Запланировано,
	//               |	ПредварительныеОстатки.ЭтапПроизводства КАК ЭтапПроизводства,
	//               |	ПредварительныеОстатки.СпецификацияЭтапа КАК СпецификацияЭтапа,
	//               |	ПредварительныеОстатки.Пользователь КАК Пользователь,
	//               |	ПредварительныеОстатки.ЭтоСписание КАК ЭтоСписание,
	//               |	ПредварительныеОстатки.Обеспечить КАК Обеспечить,
	//               |	ПредварительныеОстатки.КатегорияМатериала КАК КатегорияМатериала,
	//               |	ПредварительныеОстатки.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	//               |	ПредварительныеОстатки.ВариантОбеспеченияДоИзмененияОбновлениемИБ КАК ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	//               |	ПредварительныеОстатки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//               |	ПредварительныеОстатки.Подразделение КАК Подразделение,
	//               |	ПредварительныеОстатки.КлючСвязиНабор КАК КлючСвязиНабор,
	//               |	ПредварительныеОстатки.КлючНоменклатура КАК КлючНоменклатура
	//               |ИЗ
	//               |	ПредварительныеОстатки КАК ПредварительныеОстатки
	//               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоРезервИОтгрузка КАК КоличествоРезервИОтгрузка
	//               |		ПО ПредварительныеОстатки.Номенклатура = КоличествоРезервИОтгрузка.Номенклатура
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	ЭтапПроизводства,
	//               |	Номенклатура";  
	
	#КонецОбласти
	
	ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Период));
	Запрос.УстановитьПараметр("ТабЭтапы", ТаблицаВыбранныхЭтапов);
	Запрос.УстановитьПараметр("ЭтоСписание", ЭтоСписание);
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.УстановитьПараметр("Свойство", КатегорияМатериала);       
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Запрос.УстановитьПараметр("Склад", Склад);           
		
	//ДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	ДетальныеЗаписи = Запрос.Выполнить().Выгрузить();
	//Табэтапы = ДетальныеЗаписи.Скопировать(,"ЭтапПроизводства");
	//ВсегоОбъектов = ДетальныеЗаписи.Количество();
	ВсегоОбъектов = ДетальныеЗаписи.Количество(); //ТаблицаВыбранныхЭтапов.Количество() * 
	
	ОбработанныйОбъект = 1;
		
	//+Ганьшина Е
	НаборЗаписей = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НаборЗаписей.Прочитать();
	ТабРезерв = НаборЗаписей.Выгрузить();
	НаборЗаписей.Очистить();
	//-Ганьшина Е
	
	НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ТекЭтап = Неопределено;
	СтатусВыполнения = Ложь;
	//Пока ДетальныеЗаписи.Следующий() Цикл 
	//ВремяНачалаЗаписиДанных = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Для Каждого Стр из ДетальныеЗаписи Цикл 
							
		Если Стр.ЭтапПроизводства <> ТекЭтап Тогда //и ТекЭтап <> Неопределено
			ТекЭтап = Стр.ЭтапПроизводства; 
			//ОбработанныйОбъект = ОбработанныйОбъект + 1;
			Если НаборЗаписей.Количество() > 0 Тогда 
				Попытка
					НаборЗаписей.Записать(Истина);
					СтатусВыполнения = Истина;
				Исключение    
					
					//ОтменитьТранзакцию();     
					
					//+Ганьшина Е
					НаборЗаписей.Загрузить(ТабРезерв);
					НаборЗаписей.Записать();
					//-Ганьшина Е
					
					ДлительныеОперации.СообщитьПрогресс(-1, "Ошибка при формировании материалов " + ОписаниеОшибки());
					СтатусВыполнения = Ложь;
					Возврат СтатусВыполнения;
				КонецПопытки;     
			КонецЕсли;
			
		КонецЕсли;   
			
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Стр); 
		
		ВремяЗаписиОбъекта = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
		//+ Ганьшина Е. 26.12.2025
		ОставшеесВремяОбработаки = (ВремяЗаписиОбъекта - НачалоЗамера) / ОбработанныйОбъект * (ВсегоОбъектов - ОбработанныйОбъект);
		//-
		СообщениеОбОставшемсяВремени = ПодсчетОставшегосяВремени(НачалоЗамера, ВремяЗаписиОбъекта, ВсегоОбъектов, ОбработанныйОбъект);
		
		ДлительныеОперации.СообщитьПрогресс(
			Формат(ОбработанныйОбъект / ВсегоОбъектов * 100, "ЧЦ=3; ЧДЦ="), 
			СообщениеОбОставшемсяВремени);
				
		////+ Ганьшина Е //25.12.25
		//Если Стр.ЭтапПроизводства<>ТекЭтап Тогда
		//	ТекЭтап = Стр.ЭтапПроизводства;    
		//КонецЕсли;
		////-      
		
		ОбработанныйОбъект = ОбработанныйОбъект + 1;
			
	КонецЦикла;  
	
	//Если НаборЗаписей.Количество() > 0 и не СтатусВыполнения Тогда 
	//	СтатусВыполнения = Истина;
	//КонецЕсли;
	
	Если НаборЗаписей.Количество() > 0  Тогда 
		Попытка
			НаборЗаписей.Записать(Истина);
			СтатусВыполнения = Истина;
		Исключение
			//ОтменитьТранзакцию();
			ДлительныеОперации.СообщитьПрогресс(-1, "Ошибка при формировании материалов");
			СтатусВыполнения = Ложь;
			Возврат СтатусВыполнения;
		КонецПопытки;
	КонецЕсли;
	
	ДлительныеОперации.СообщитьПрогресс(
		Формат(ОбработанныйОбъект / ВсегоОбъектов * 100, "ЧЦ=3; ЧДЦ="), 
		СообщениеОбОставшемсяВремени);

	Возврат СтатусВыполнения;
	
КонецФункции

Функция ПолучитьПереченьКолонокТЧМатериалыЭтапа()
	
	//++Дарвин А.А. 12.12.2023
	ПереченьКолонок = 
	"Номенклатура,
	|Характеристика,
	|Серия,
	|Упаковка,
	|КоличествоУпаковок,
	|Количество,
	|ВариантОбеспечения,
	|Обособленно,
	|ДатаОтгрузки,
	|Склад,
	|Производится,
	|Спецификация,
	|Назначение,
	|НазначениеОбеспечения,
	|СтатусУказанияСерий,
	|СтатусУказанияСерийОтправитель,
	|СтатусУказанияСерийПолучатель,
	|КодСтроки,
	|ИспользуетсяАвтовыбор,
	|СведенияАвтовыбора,
	|ПрименениеМатериала,
	|КлючСвязиСпецификация,
	|СтатьяКалькуляции,
	|Отменено,
	|ПричинаОтмены,
	|Период,
	|АналитикаУчетаНоменклатуры,
	|КорАналитикаУчетаНоменклатуры,
	|Подразделение,
	//|ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	|ИдентификаторСтроки,
	|КлючСвязиНабор,
	|КлючНоменклатура";
	//Дарвин А.А.

	Возврат ПереченьКолонок;
	
КонецФункции

Процедура ВыгрузитьПодготовленныеМатериалыИзРегистра(ПараметрыДляОбработки, ЭтапПроизводства, ПереченьКолонок)		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика КАК Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия КАК Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад КАК Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится КАК Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки КАК КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Отменено КАК Отменено,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПричинаОтмены КАК ПричинаОтмены,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат КАК Период,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение КАК Подразделение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь КАК Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание КАК ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска КАК ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяЕдиницаИзмерения КАК ИсходнаяЕдиницаИзмерения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодОтгрузки КАК ПериодОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала КАК КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество КАК Количество,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Остаток КАК Остаток,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обеспечить КАК Обеспечить,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура КАК КлючНоменклатура
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства = &ЭтапПроизводства
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь";
	
	
	Запрос.УстановитьПараметр("ЭтапПроизводства", ЭтапПроизводства);
	Запрос.УстановитьПараметр("ЭтоСписание", Не ПараметрыДляОбработки.Резерв);  
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	ТЗСкорректированныеСтрокиЭтапа = ТЗ.Скопировать(,ПереченьКолонок);
	ТЗСкорректированныеСтрокиЭтапа.Сортировать("Номенклатура Возр");  
	
	ПараметрыДляОбработки.Вставить("ВыгруженнаяТаблицаМатериалов", ТЗСкорректированныеСтрокиЭтапа);
	
КонецПроцедуры 

//Резервирование и списание материалов по этапам
Функция ЗафиксироватьКорректировкиВЭтапахСписаниеИРезервированиеВФоне(ПараметрыДляОбработки) Экспорт
		
	ВсегоОбъектов = ПараметрыДляОбработки.МассивЭтаповКИзменению.Количество();
	ОбработанныйОбъект = 1;
	НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Для Каждого Этап Из ПараметрыДляОбработки.МассивЭтаповКИзменению Цикл
		ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапа();
		ВыгрузитьПодготовленныеМатериалыИзРегистра(ПараметрыДляОбработки, Этап, ПереченьКолонок);
		
		ОбъектЭтапа = Этап.ПолучитьОбъект();
		ТЧОбеспечение = ОбъектЭтапа.ОбеспечениеМатериаламиИРаботами;
		ТЧОбеспечение.Очистить();
		
		ЕстьРезервИлиМягкийРезерв = Ложь;
		
		Для Каждого СтрокаМатериала из ПараметрыДляОбработки.ВыгруженнаяТаблицаМатериалов Цикл //МатериалыСпецификации Цикл 
			НоваяСтрока = ТЧОбеспечение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериала);   
			НоваяСтрока.ДатаОтгрузки = ПараметрыДляОбработки.ПериодОтгрузки;
			НоваяСтрока.Назначение = СтрокаМатериала.НазначениеОбеспечения;
			НоваяСтрока.НазначениеОбеспечения = СтрокаМатериала.НазначениеОбеспечения;
			
			Если НоваяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада")
				ИЛИ НоваяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления") 
				ИЛИ НоваяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить") Тогда 
				ЕстьРезервИлиМягкийРезерв = Истина;
			КонецЕсли;
		КонецЦикла;  
		
		ОбъектЭтапа.НеОтгружатьЧастями = Истина;
		ОбъектЭтапа.ДатаОтгрузки = ПараметрыДляОбработки.ПериодОтгрузки;
		
		Если ОбъектЭтапа.КоличествоУпаковокФакт < ПараметрыДляОбработки.ПроцентВыполнения Тогда	
			Если ЕстьРезервИлиМягкийРезерв Тогда
				ОбъектЭтапа.КоличествоУпаковокФакт = ПараметрыДляОбработки.ПроцентВыполнения;
			КонецЕсли;
		КонецЕсли;
	
		Попытка
			НачатьТранзакцию();
			ОбъектЭтапа.Записать(РежимЗаписиДокумента.Проведение);
			ЗафиксироватьТранзакцию();
			ЭтапыОбработаны = Истина;
		Исключение
			ОтменитьТранзакцию();
			ЭтапыОбработаны = Ложь;
			
			ДлительныеОперации.СообщитьПрогресс(-1, "Ошибка при записи объекта: " + ОбъектЭтапа);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Ошибка при изменении этапа: '") + ОписаниеОшибки());
			
			Если Не ПараметрыДляОбработки.ЭтоСписание Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Проверьте остатки материалов'"));
			КонецЕсли;
			
			ВызватьИсключение ОписаниеОшибки();
		КонецПопытки;
		
		//ОбработатьСтрокиЭтапаИспользуяПараметрыВстраивания(Этап, ПараметрыДляОбработки.ЭтоСписание);
		
		Если ПараметрыДляОбработки.ЭтоСписание Тогда
			СформировалиПередачуМатериалов = СформироватьПередачуМатериаловНаСервере(Этап, ПараметрыДляОбработки.ПериодОтгрузки);;
			
			Если Не СформировалиПередачуМатериалов Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Ошибка при формировании передачи: '") + ОписаниеОшибки());
				ВызватьИсключение ОписаниеОшибки();		
			КонецЕсли;
			
		КонецЕсли;	
					
		ВремяЗаписиОбъекта = ТекущаяУниверсальнаяДатаВМиллисекундах();
		СообщениеОбОставшемсяВремени = ПодсчетОставшегосяВремени(НачалоЗамера, ВремяЗаписиОбъекта, ВсегоОбъектов, ОбработанныйОбъект);
		
		Если Не (ОбработанныйОбъект % 10) Тогда
			ДлительныеОперации.СообщитьПрогресс(
				Формат(ОбработанныйОбъект / ВсегоОбъектов * 100, "ЧЦ=3; ЧДЦ="), 
				СообщениеОбОставшемсяВремени);
		КонецЕсли;
		
		ОбработанныйОбъект = ОбработанныйОбъект + 1;
	КонецЦикла;

	Возврат ЭтапыОбработаны;  
	
КонецФункции

Функция СформироватьПередачуМатериаловНаСервере(Этап, ПериодОтгрузки)
	
	МассивСсылок = Новый Массив();
	МассивСсылок.Добавить(Этап);
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивСсылок,
		"ДвижениеПродукцииИМатериалов", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство"));
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	Документ = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	Документ.Заполнить(ДанныеЗаполнения);
	Документ.Дата = ПериодОтгрузки;
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Истина;
	Исключение
		Сообщить("Ошибка формирования Передачи материалов " + Этап + " " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ПодсчетОставшегосяВремени(НачалоЗамера, ВремяЗаписиОбъекта, ВсегоОбъектов, ОбработанныйОбъект) Экспорт
	
	ПодсчетМиллисекундСекундНаЗаписьОбъекта = (ВремяЗаписиОбъекта - НачалоЗамера);
   	СреднеВремяНаЗаписьОбъекта = ПодсчетМиллисекундСекундНаЗаписьОбъекта / ОбработанныйОбъект;
   	ОставшееВремя = СреднеВремяНаЗаписьОбъекта * (ВсегоОбъектов - ОбработанныйОбъект);
   	ОставшееВремяВМинутах = ОставшееВремя / (1000 * 60);
	ИтоговоеОставшеесяВремяВМинутах = Цел(ОставшееВремяВМинутах);
	
	Если ИтоговоеОставшеесяВремяВМинутах = 1 Или ИтоговоеОставшеесяВремяВМинутах = 21 
		Или ИтоговоеОставшеесяВремяВМинутах = 31 Или ИтоговоеОставшеесяВремяВМинутах = 41 Или ИтоговоеОставшеесяВремяВМинутах = 51 Тогда
		КонтекстОВремени = " минута!";
	ИначеЕсли (ИтоговоеОставшеесяВремяВМинутах >= 2 И ИтоговоеОставшеесяВремяВМинутах <= 4) 
		Или (ИтоговоеОставшеесяВремяВМинутах >= 22 И  ИтоговоеОставшеесяВремяВМинутах <= 24)
		Или (ИтоговоеОставшеесяВремяВМинутах >= 32 И  ИтоговоеОставшеесяВремяВМинутах <= 34) 
		Или (ИтоговоеОставшеесяВремяВМинутах >= 42 И  ИтоговоеОставшеесяВремяВМинутах <= 44)
		Или (ИтоговоеОставшеесяВремяВМинутах >= 52 И  ИтоговоеОставшеесяВремяВМинутах <= 54) Тогда
		КонтекстОВремени = " минуты!";
	Иначе
		КонтекстОВремени = " минут!";	
	КонецЕсли;
		
	Если ИтоговоеОставшеесяВремяВМинутах >= 0 И ИтоговоеОставшеесяВремяВМинутах <= 1 Тогда
		ИтоговоеОставшеесяВремяВМинутах = 1;
		СообщениеОбОставшемсяВремени = "Примерное время выполнения: менее " + ИтоговоеОставшеесяВремяВМинутах + " минуты!";
	ИначеЕсли ИтоговоеОставшеесяВремяВМинутах >= 60 Тогда
		СообщениеОбОставшемсяВремени = "Примерное время выполнения: более часа!";
	Иначе
		СообщениеОбОставшемсяВремени = "Примерное время выполнения: " + ИтоговоеОставшеесяВремяВМинутах + КонтекстОВремени;
	КонецЕсли;

	Возврат СообщениеОбОставшемсяВремени;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////

//Выполняет действие по заполнению обеспечения в заказе из списка заказов после задания вопроса об отгрузке одной датой.
//
// Параметры:
//  Параметры - Структура - структура параметров:
//   * КодДействия - Строка - условное обозначение команды "ДЕЙСТВИЕ_КОБЕСПЕЧЕНИЮ" или "ДЕЙСТВИЕ_ОТГРУЗИТЬ"
//                   или "ДЕЙСТВИЕ_РЕЗЕРВИРОВАТЬ" или "ДЕЙСТВИЕ_НЕОБЕСПЕЧИВАТЬ"
//   * ПараметрыЗаполнения - Структура - структура параметров:
//     ** СнятьФлагОтгружатьОднойДатой - Булево - результат ответа на вопрос об отгрузке одной датой.
//     ** ЗаполнитьДатуОтгрузкиОднойДатой - Булево - результат ответа на вопрос об отгрузке одной датой.
//   * Заказы - Массив из ЛюбаяСсылка - заказы для установки действия.
//   * ПараметрыВстраивания - см. ДоступныеОстаткиПараметрыВстраивания
//   * МассивСтрок - Массив отобранных строк - при отсутствии будут обработаны все строки объекта
//
// Возвращаемое значение:
//  Структура - структура с полями:
//   * СписокОшибок - Массив - массив содержащий тексты ошибок обработки документов.
//   * КоличествоОбработано - Число - количество обработанных документов.
//
Функция ВыполнитьДействиеДляЗаказовПослеВопроса(Параметры, Знач МассивСтрок = Неопределено) Экспорт
	
	Заказы = Параметры.Заказы;
	ПараметрыВстраивания = Параметры.ПараметрыВстраивания;
	Если ПараметрыВстраивания = Неопределено И Заказы.Количество() > 0 Тогда
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Заказы[0]);
		ПараметрыВстраивания = МенеджерОбъекта.ДоступныеОстаткиПараметрыВстраивания();
		
	КонецЕсли;
	
	КодДействия = Параметры.КодДействия;
	ПараметрыЗаполнения = Параметры.ПараметрыЗаполнения;
	Результат = Новый Структура("СписокОшибок,КоличествоОбработано", Новый Массив);
		
	Для Каждого Ссылка Из Заказы Цикл
		
		ТекстОшибки = "";
		
		НачатьТранзакцию();
		Попытка
			
			ТекстОшибки = НСтр("ru = 'Не удалось заблокировать объект, возможно он редактируется. Для %1 установка действия не выполнена.';
								|en = 'Cannot lock the object, it may be being edited. Cannot set action for %1.'");
			
			ЗаблокироватьДанныеДляРедактирования(Ссылка);
			
			Блокировка = Новый БлокировкаДанных();
			
			ЭлементБлокировки = Блокировка.Добавить(Ссылка.Метаданные().ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			ТекстОшибки = НСтр("ru = 'Не удалось установить блокировку объекта. Для %1 установка действия не выполнена.';
								|en = 'Cannot set object lock. Cannot set action for %1.'");
			
			Блокировка.Заблокировать();
			
			ТекстОшибки = НСтр("ru = 'Не удалось обработать объект. Для %1 установка действия не выполнена.';
								|en = 'Cannot process object. Cannot set action for %1.'");
			
			ДокументОбъект = Ссылка.ПолучитьОбъект();
			
			Если ДокументОбъект.Проведен Тогда			
				Если МассивСтрок = Неопределено Тогда
					ТаблицаИзменений = ОбеспечениеВДокументахСервер.ЗаполнитьВариантОбеспеченияПоОстаткамДляВыделенныхСтрокОбъекта(
						ДокументОбъект,
						КодДействия,
						ПараметрыЗаполнения,
						Неопределено,
						ПараметрыВстраивания);
				Иначе
					ТаблицаИзменений = ОбеспечениеВДокументахСервер.ЗаполнитьВариантОбеспеченияПоОстаткамДляВыделенныхСтрокОбъекта(
						ДокументОбъект,
						КодДействия,
						ПараметрыЗаполнения, 
						МассивСтрок,
						ПараметрыВстраивания);
				КонецЕсли;
					
				Если КодДействия = "ДЕЙСТВИЕ_ОТГРУЗИТЬ" И ТаблицаИзменений.Количество() > 0 Тогда
					
					ВопросБылЗадан = ПараметрыЗаполнения <> Неопределено;
					НуженВопрос = ПараметрыВстраивания.ВыражениеДляВопросаПриВыполненииДействияВСпискеЗаказов <> "НЕОПРЕДЕЛЕНО"
						И НуженВопросОбОтгрузкеОднойДатой(ПараметрыВстраивания, Ссылка);
					
					Если ВопросБылЗадан <> НуженВопрос Тогда
						Текст = НСтр("ru = 'Ошибка заполнения действия в списке документов. Изменились данные документов.';
									|en = 'Action population error in the documents list. The documents data has been changed.'");
						ВызватьИсключение Текст;
					КонецЕсли;
						
				КонецЕсли;
				
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
				
				ТекстОшибки = НСтр("ru = 'Не удалось записать/провести объект. Для %1 установка действия не выполнена.';
									|en = 'Cannot save/post object. Cannot set action for %1.'");
				
				Если ДокументОбъект.ПроверитьЗаполнение() Тогда
					ДокументОбъект.Записать(РежимЗаписи);
				Иначе
					
					Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
					
					Для Каждого ТекОшибка Из ПолучитьСообщенияПользователю(Истина) Цикл
						
						Ошибка = Новый Структура;
						Ошибка.Вставить("Ссылка", Ссылка);
						Ошибка.Вставить("Текст",  ТекОшибка.Текст);
						Ошибка.Вставить("Поле",   ТекОшибка.Поле);
						Ошибка.Вставить("ПутьКДанным", ТекОшибка.ПутьКДанным);
						
						Результат.СписокОшибок.Добавить(Ошибка);
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				ТекстОшибки = НСтр("ru = 'Документ %1 не проведен и не будет обработан.';
									|en = 'Document %1 has not been posted and will not be processed.'");
				Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПараметрыЖурнала = Новый Структура("ГруппаСобытий, Метаданные, Данные");
			ПараметрыЖурнала.ГруппаСобытий = НСтр("ru = 'Заполнение действий в заказе';
													|en = 'Action population in order'");
			ПараметрыЖурнала.Метаданные    = Ссылка.Метаданные();
			ПараметрыЖурнала.Данные        = Ссылка;
			ОбщегоНазначенияУТ.ЗаписатьВЖурналСообщитьПользователю(
				ПараметрыЖурнала,
				УровеньЖурналаРегистрации.Информация,
				НСтр("ru = 'Заполнение действий в заказе';
					|en = 'Action population in order'"),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
			
		КонецПопытки;
		
	КонецЦикла;
	Результат.КоличествоОбработано = Заказы.Количество() - Результат.СписокОшибок.Количество();
	
	Возврат Результат;
	
КонецФункции

Функция НуженВопросОбОтгрузкеОднойДатой(ПараметрыВстраивания, Заказы)
	
			Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Заказы.Номенклатура КАК Номенклатура,
				|	Заказы.Характеристика КАК Характеристика,
				|	Заказы.Склад КАК Склад,
				|	Заказы.Назначение КАК Назначение
				|ПОМЕСТИТЬ Товары
				|ИЗ
				|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Заказ В(&Заказы)) КАК Заказы
				|ГДЕ
				|	Заказы.РезервироватьНаСкладеОстаток > 0
				|		ИЛИ Заказы.РезервироватьПоМереПоступленияОстаток > 0
				|		ИЛИ Заказы.КОбеспечениюОстаток > 0
				|		ИЛИ Заказы.НеОбеспечиватьОстаток > 0";
	
	Если РаспределениеЗапасов.ЭтоПроизводительныйРежим() Тогда
		Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК НуженВопрос
			|ИЗ
			|	РегистрНакопления.ЗапасыИПотребности.Остатки(,
			|		Заказ В(
			|			ВЫБРАТЬ
			|				Таблица.Ссылка КАК Заказ
			|			ИЗ
			|				&Таблица КАК Таблица
			|			ГДЕ
			|				Таблица.Ссылка В(&Заказы)
			|					И Таблица.Проведен
			|					И (&Выражение) <> НЕОПРЕДЕЛЕНО
			|					И (&Выражение) < &ДатаОтгрузкиНовыхСтрок)) КАК Заказы
			|ГДЕ
			|	Заказы.РезервироватьНаСкладеОстаток > 0
			|		ИЛИ Заказы.РезервироватьПоМереПоступленияОстаток > 0
			|		ИЛИ Заказы.КОбеспечениюОстаток > 0
			|		ИЛИ Заказы.НеОбеспечиватьОстаток > 0";
	Иначе
		Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК НуженВопрос
			|ИЗ
			|	&Таблица КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка В(&Заказы)
			|		И Таблица.Проведен
			|		И (&Выражение) <> НЕОПРЕДЕЛЕНО
			|		И (&Выражение) < &ДатаОтгрузкиНовыхСтрок
			|		И ИСТИНА В(
			|			ВЫБРАТЬ ПЕРВЫЕ 1
			|				ИСТИНА КАК ЕстьЗаписи
			|			ИЗ
			|				РегистрСведений.РаспределениеЗапасов КАК ЗаписиЗаказа
			|			ГДЕ
			|				ЗаписиЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОжидаемаяОтгрузка)
			|					И ЗаписиЗаказа.ЗаказНаОтгрузку = Таблица.Ссылка)";
	КонецЕсли;
	Текст = СтрЗаменить(Текст, "&Таблица", ПараметрыВстраивания.ИмяОбъекта);
	Текст = СтрЗаменить(Текст, "&Выражение", ПараметрыВстраивания.ВыражениеДляВопросаПриВыполненииДействияВСпискеЗаказов);
	
	Запрос = Новый Запрос(Текст);
	
	ДатаОтгрузкиНовыхСтрок = НачалоДня(ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаОтгрузкиНовыхСтрок", ДатаОтгрузкиНовыхСтрок);
	Запрос.УстановитьПараметр("Заказы", Заказы);
	НуженВопрос = Не Запрос.Выполнить().Пустой();
	
	Возврат НуженВопрос;
	
КонецФункции

//Изменение даты отгрузки в документе Заказ клиента
//
// Параметры:
//   * МассивСтрокКИзменению - Массив структур:
//		- Назначение - СправочникСсылка.Назначения
//		- ЗаказКлиента - ДокументСсылка.ЗаказКлиента
//		- ПлановаяДатаОтгрузки - Дата
//		- НоваяДатаОтгрузки - Дата
//		- ИдентификаторСтроки - Строка(36)
//		- Номенклатура - СправочникСсылка.Номенклатура
//		- Количество - Число(15, 3)
//		- КоличествоУпаковок - Число(15, 3)
//
// Возвращаемое значение:
//	Результат выполнения операции - Булево
Функция ОбработатьСтрокиТабличногоДокументаВЗаказеКлиента(МассивСтрокКИзменению, Знач РедактироватьСтрокиТЧ = Ложь) Экспорт
	
	ИерархияЗаказов = ПолучитьИерархиюЗаказовПередИзменением(МассивСтрокКИзменению);
	ВсегоОбъектов = ИерархияЗаказов.Строки.Количество();
	ОбработанныйОбъект = 1;
	
	НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Для Каждого СтрокаВерхнегоУровня Из ИерархияЗаказов.Строки Цикл
		
		СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(СтрокаВерхнегоУровня.ЗаказКлиента);
		ЗаполнитьСтавкуНДС = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(СтрокаВерхнегоУровня.ЗаказКлиента, Истина);
		КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		
		ДокОбъект = СтрокаВерхнегоУровня.ЗаказКлиента.ПолучитьОбъект();
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		СтрокиОбработаны = Ложь;
		
		Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл
			СтрокаТЧНайдена = Ложь;
			
			Для Каждого СтрокаНижнегоУровня Из СтрокаВерхнегоУровня.Строки Цикл
				Если СтрокаТЧ.Номенклатура = СтрокаНижнегоУровня.Номенклатура И СтрокаТЧ.ИдентификаторСтроки = СтрокаНижнегоУровня.ИдентификаторСтроки Тогда
					СтрокаТЧНайдена = Истина;
					ЗначениеКИзменению = СтрокаНижнегоУровня.НоваяДатаОтгрузки; 
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если СтрокаТЧНайдена Тогда
				СтрокаТЧ.ДатаОтгрузки = ЗначениеКИзменению;					
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧ, СтруктураДействий, КэшированныеЗначения);
				СтрокиОбработаны = Истина;	
			КонецЕсли; 
		КонецЦикла;
			
		Если РедактироватьСтрокиТЧ И СтрокиОбработаны Тогда
			Попытка
				НачатьТранзакцию();	
				ВзаиморасчетыСервер.ПередЗаписью(ДокОбъект, Ложь, РежимЗаписи);
				ДокОбъект.Записать(РежимЗаписи);
				ЗафиксироватьТранзакцию();
				СтатусВыполнения = Истина; 
			Исключение
				ОтменитьТранзакцию();
				ДлительныеОперации.СообщитьПрогресс(-1, "Ошибка при записи документа");
				СтатусВыполнения = Ложь;
				ВызватьИсключение ОписаниеОшибки();
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), 
					УровеньЖурналаРегистрации.Ошибка,,, 
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
		
		ВремяЗаписиОбъекта = ТекущаяУниверсальнаяДатаВМиллисекундах();
		СообщениеОбОставшемсяВремени = ПодсчетОставшегосяВремени(НачалоЗамера, ВремяЗаписиОбъекта, ВсегоОбъектов, ОбработанныйОбъект);
						
		Если Не (ОбработанныйОбъект % 10) Тогда
			ДлительныеОперации.СообщитьПрогресс(
				Формат(ОбработанныйОбъект / ВсегоОбъектов * 100, "ЧЦ=3; ЧДЦ="), 
				СообщениеОбОставшемсяВремени);
		КонецЕсли;
			
		ОбработанныйОбъект = ОбработанныйОбъект + 1;
	КонецЦикла;
								
	Возврат СтатусВыполнения;
	
КонецФункции

функция ПолучитьИерархиюЗаказовПередИзменением(МассивСтрокКИзменению)
	
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	ТаблицаВыгрузки.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ТаблицаВыгрузки.Колонки.Добавить("ЗаказКлиента", Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	ТаблицаВыгрузки.Колонки.Добавить("ПлановаяДатаОтгрузки", Новый ОписаниеТипов("Дата"));
    ТаблицаВыгрузки.Колонки.Добавить("НоваяДатаОтгрузки", Новый ОписаниеТипов("Дата"));
	ТаблицаВыгрузки.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(36)));
	ТаблицаВыгрузки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаВыгрузки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));
	ТаблицаВыгрузки.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3)));	
	
	Для Каждого ТекДанные Из МассивСтрокКИзменению Цикл
		НоваяСтрока = ТаблицаВыгрузки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные); 
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеВыгрузки.Назначение КАК Назначение,
	               |	ДанныеВыгрузки.ЗаказКлиента КАК ЗаказКлиента,
	               |	ДанныеВыгрузки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ДанныеВыгрузки.Номенклатура КАК Номенклатура,
	               |	ДанныеВыгрузки.ПлановаяДатаОтгрузки КАК ПлановаяДатаОтгрузки,
	               |	ДанныеВыгрузки.НоваяДатаОтгрузки КАК НоваяДатаОтгрузки,
	               |	ДанныеВыгрузки.Количество КАК Количество,
	               |	ДанныеВыгрузки.КоличествоУпаковок КАК КоличествоУпаковок
	               |ПОМЕСТИТЬ ВТ_ДанныеВыгрузки
	               |ИЗ
	               |	&ДанныеВыгрузки КАК ДанныеВыгрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеВыгрузки.Назначение КАК Назначение,
	               |	ВТ_ДанныеВыгрузки.ЗаказКлиента КАК ЗаказКлиента,
	               |	ВТ_ДанныеВыгрузки.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ВТ_ДанныеВыгрузки.Номенклатура КАК Номенклатура,
	               |	ВТ_ДанныеВыгрузки.ПлановаяДатаОтгрузки КАК ДатаОтгрузки,
	               |	ВТ_ДанныеВыгрузки.НоваяДатаОтгрузки КАК НоваяДатаОтгрузки,
	               |	ВТ_ДанныеВыгрузки.Количество КАК Количество,
	               |	ВТ_ДанныеВыгрузки.КоличествоУпаковок КАК КоличествоУпаковок
	               |ИЗ
	               |	ВТ_ДанныеВыгрузки КАК ВТ_ДанныеВыгрузки
	               |ИТОГИ ПО
	               |	ЗаказКлиента";
	
	Запрос.УстановитьПараметр("ДанныеВыгрузки", ТаблицаВыгрузки);
	ИерархияЗаказов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Возврат ИерархияЗаказов;
	
КонецФункции 

//Функция ПолучитьОстаток_2_5_ДО_27_05_25(Номенклатура, Склад, МассивЭтапов, ТаблицаВыбранныхЭтапов) Экспорт
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	               |	Таб_ЭтапыДляОбработки.Спецификация КАК Спецификация
//	               |ПОМЕСТИТЬ СпецификацииЭтапов
//	               |ИЗ
//	               |	Таб_ЭтапыДляОбработки КАК Таб_ЭтапыДляОбработки
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
//	               |	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок) КАК Норматив,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
//	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
//	               |	КОНЕЦ КАК Упаковка,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
//	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи КАК КлючСвязи
//	               |ПОМЕСТИТЬ НормативыпоСпецификации
//	               |ИЗ
//	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
//	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииЭтапов КАК СпецификацииЭтапов
//	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = СпецификацииЭтапов.Спецификация
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
//	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
//	               |	КОНЕЦ,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
//	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.КлючСвязи
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
//	               |	ЕСТЬNULL(РаспределениеЗапасов.Склад, 0) КАК Склад,
//	               |	СУММА(ЕСТЬNULL(РаспределениеЗапасов.Зарезервировано, 0)) КАК ЗарезервированоПоМереПоступления
//	               |ПОМЕСТИТЬ ВТ_ЗарезервированоПоМереПоступления
//	               |ИЗ
//	               |	НормативыпоСпецификации КАК НормативыпоСпецификации
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
//	               |		ПО НормативыпоСпецификации.Номенклатура = РаспределениеЗапасов.Номенклатура
//	               |ГДЕ
//	               |	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
//	               |	И РаспределениеЗапасов.Склад В(&Склад)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ЕСТЬNULL(РаспределениеЗапасов.Склад, 0),
//	               |	РаспределениеЗапасов.Номенклатура
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
//	               |	НормативыпоСпецификации.Номенклатура КАК Номенклатура,
//	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
//	               |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
//	               |	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0)) КАК Резерв,
//	               |	СУММА(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК Отгружается,
//	               |	ВТ_ЗарезервированоПоМереПоступления.ЗарезервированоПоМереПоступления КАК ЗарезервироватьПриПоступлении
//	               |ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов_v1
//	               |ИЗ
//	               |	НормативыпоСпецификации КАК НормативыпоСпецификации
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(
//	               |				,
//	               |				Номенклатура В
//	               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |							Таб.Номенклатура
//	               |						ИЗ
//	               |							НормативыпоСпецификации КАК Таб)
//	               |					И Склад В (&Склад)) КАК ЗапасыИПотребностиОстатки
//	               |		ПО НормативыпоСпецификации.Номенклатура = ЗапасыИПотребностиОстатки.Номенклатура
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
//	               |		ПО НормативыпоСпецификации.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
//	               |				,
//	               |				Номенклатура В
//	               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |							Таб.Номенклатура
//	               |						ИЗ
//	               |							НормативыпоСпецификации КАК Таб)
//	               |					И Склад ССЫЛКА Справочник.Склады
//	               |					И Склад В (&Склад)) КАК ТоварыНаСкладахОстатки
//	               |		ПО НормативыпоСпецификации.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗарезервированоПоМереПоступления КАК ВТ_ЗарезервированоПоМереПоступления
//	               |		ПО НормативыпоСпецификации.Номенклатура = ВТ_ЗарезервированоПоМереПоступления.Номенклатура
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	НормативыпоСпецификации.Номенклатура,
//	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)),
//	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
//	               |	ВТ_ЗарезервированоПоМереПоступления.ЗарезервированоПоМереПоступления
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
//	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Зарезервировано,
//	               |	ВЫБОР
//	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
//	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |		ИНАЧЕ 0
//	               |	КОНЕЦ КАК РезервироватьПоМереПоступления,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
//	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Отгружено
//	               |ПОМЕСТИТЬ ЗарезервированоИОтружено
//	               |ИЗ
//	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
//	               |ГДЕ
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В(&МассивЭтапов)
//	               |	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = &Номенклатура
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
//	               |	ВЫБОР
//	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
//	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |		ИНАЧЕ 0
//	               |	КОНЕЦ
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
//	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
//	               |	РаспределениеЗапасов.Склад КАК Склад,
//	               |	РаспределениеЗапасов.ВНаличии КАК ВНаличии,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(ЗарезервированоИОтружено.Зарезервировано, 0) < РаспределениеЗапасов.Резерв
//	               |			ТОГДА РаспределениеЗапасов.Резерв - ЕСТЬNULL(ЗарезервированоИОтружено.Зарезервировано, 0)
//	               |		ИНАЧЕ 0
//	               |	КОНЕЦ КАК ВРезервеСоСклада,
//	               |	0 КАК КОтгрузке
//	               |ПОМЕСТИТЬ ВТ_СвободныеОстатки
//	               |ИЗ
//	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗарезервированоИОтружено КАК ЗарезервированоИОтружено
//	               |		ПО (РаспределениеЗапасов.Номенклатура = ЕСТЬNULL(ЗарезервированоИОтружено.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
//	               |ГДЕ
//	               |	РаспределениеЗапасов.Состояние = &Состояние
//	               |	И РаспределениеЗапасов.Номенклатура = &Номенклатура
//	               |	И РаспределениеЗапасов.Склад = &Склад
//	               |	И НЕ РаспределениеЗапасов.ЗаказНаОтгрузку В (&МассивЭтапов)
//	               |
//	               |ОБЪЕДИНИТЬ ВСЕ
//	               |
//	               |ВЫБРАТЬ
//	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
//	               |	ТоварыКОтгрузкеОстатки.Характеристика,
//	               |	ТоварыКОтгрузкеОстатки.Склад,
//	               |	0,
//	               |	0,
//	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
//	               |ИЗ
//	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
//	               |ГДЕ
//	               |	ТоварыКОтгрузкеОстатки.Номенклатура = &Номенклатура
//	               |	И ТоварыКОтгрузкеОстатки.Склад = &Склад
//	               |	И НЕ ТоварыКОтгрузкеОстатки.ДокументОтгрузки В (&МассивЭтапов)
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВТ_СвободныеОстатки.Номенклатура КАК Номенклатура,
//	               |	ВТ_СвободныеОстатки.Характеристика КАК Характеристика,
//	               |	ВТ_СвободныеОстатки.Склад КАК Склад,
//	               |	СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0)) КАК ВНаличии,
//	               |	СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВРезервеСоСклада, 0)) КАК ВРезервеСоСклада,
//	               |	ВЫБОР
//	               |		КОГДА СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0)) >= СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.КОтгрузке, 0))
//	               |			ТОГДА СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.КОтгрузке, 0))
//	               |		ИНАЧЕ СУММА(ЕСТЬNULL(ВТ_СвободныеОстатки.ВНаличии, 0))
//	               |	КОНЕЦ КАК КОтгрузке
//	               |ИЗ
//	               |	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВТ_СвободныеОстатки.Номенклатура,
//	               |	ВТ_СвободныеОстатки.Склад,
//	               |	ВТ_СвободныеОстатки.Характеристика
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура КАК Номенклатура,
//	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Характеристика КАК Характеристика,
//	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Склад КАК Склад,
//	               |	ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии КАК ВНаличии,
//	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Резерв КАК ВРезервеСоСклада,
//	               |	ВТ_НовыеОстаткиИзЗапасов_v1.Отгружается КАК КОтгрузке
//	               |ИЗ
//	               |	ВТ_НовыеОстаткиИзЗапасов_v1 КАК ВТ_НовыеОстаткиИзЗапасов_v1
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗарезервированоИОтружено КАК ЗарезервированоИОтружено
//	               |		ПО ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура = ЗарезервированоИОтружено.Номенклатура";
//	
//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//	Запрос.УстановитьПараметр("Склад", Склад);
//	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
//	Запрос.УстановитьПараметр("Таб_ЭтапыДляОбработки", ТаблицаВыбранныхЭтапов);
//	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе);
//	РезультатЗапроса = Запрос.Выполнить();
//	Если не РезультатЗапроса.Пустой() Тогда 
//		Выборка = РезультатЗапроса.Выбрать();
//		Выборка.Следующий();
//		Возврат Выборка.Вналичии - Выборка.ВРезервеСоСклада - Выборка.КОтгрузке;
//	Иначе                   
//		Возврат 0;
//	КонецЕсли;    
//	
//КонецФункции        

#КонецОбласти

#Область ТТМ_АРМ_ВыпускИРеализация

функция ПолучитьСписокЗаказовДляОтгрузки(Знач ЗагрузитьВоВременноеХранилище = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	               |	Назначения.Ссылка КАК Назначение,
	               |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад
	               |ПОМЕСТИТЬ ТоварыОткрытыхЗаказов
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО (ЗаказКлиентаТовары.Ссылка = (ВЫРАЗИТЬ(Назначения.Заказ КАК Документ.ЗаказКлиента)))
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка.Проведен
	               |	И (ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению)
	               |			ИЛИ ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	Назначения.Ссылка,
	               |	ЗаказКлиентаТовары.Ссылка.Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
	               |	Назначения.Ссылка КАК Назначение,
	               |	РеализацияТоваровУслугТовары.Склад КАК Склад
	               |ПОМЕСТИТЬ ОтгруженоПоНазначениям
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	               |		ПО (РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента = (ВЫРАЗИТЬ(Назначения.Заказ КАК Документ.ЗаказКлиента)))
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	Назначения.Ссылка,
	               |	РеализацияТоваровУслугТовары.Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Номенклатура, ДвижениеПродукцииИМатериаловТовары.Номенклатура) КАК Номенклатура,
	               |	СУММА(ЕСТЬNULL(ДвижениеПродукцииИМатериаловТовары.Количество, 0)) КАК Количество,
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Назначение, ДвижениеПродукцииИМатериаловТовары.Назначение) КАК Назначение,
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Склад, ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель) КАК Склад
	               |ПОМЕСТИТЬ ВыпущенныеТоварыПоНазначениям
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДвижениеПродукцииИМатериалов.Товары КАК ДвижениеПродукцииИМатериаловТовары
	               |		ПО (ДвижениеПродукцииИМатериаловТовары.Номенклатура = ТоварыОткрытыхЗаказов.Номенклатура)
	               |			И (ДвижениеПродукцииИМатериаловТовары.Назначение = ТоварыОткрытыхЗаказов.Назначение)
	               |			И (ТоварыОткрытыхЗаказов.Склад = (ВЫРАЗИТЬ(ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель КАК Справочник.Склады)))
	               |ГДЕ
	               |	ДвижениеПродукцииИМатериаловТовары.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Назначение, ДвижениеПродукцииИМатериаловТовары.Назначение),
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Склад, ДвижениеПродукцииИМатериаловТовары.Ссылка.Получатель),
	               |	ЕСТЬNULL(ТоварыОткрытыхЗаказов.Номенклатура, ДвижениеПродукцииИМатериаловТовары.Номенклатура)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Отметка,
	               |	ТоварыОткрытыхЗаказов.Номенклатура КАК Номенклатура,
	               |	ТоварыОткрытыхЗаказов.Назначение КАК Назначение,
	               |	ТоварыОткрытыхЗаказов.ЗаказКлиента КАК ДокументОтгрузки,
	               |	ЕСТЬNULL(ВыпущенныеТоварыПоНазначениям.Количество, 0) - ЕСТЬNULL(ОтгруженоПоНазначениям.Количество, 0) КАК КОтгрузке,
	               |	ТоварыОткрытыхЗаказов.Склад КАК Склад
	               |ИЗ
	               |	ТоварыОткрытыхЗаказов КАК ТоварыОткрытыхЗаказов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОтгруженоПоНазначениям КАК ОтгруженоПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ОтгруженоПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ОтгруженоПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ОтгруженоПоНазначениям.Склад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВыпущенныеТоварыПоНазначениям КАК ВыпущенныеТоварыПоНазначениям
	               |		ПО ТоварыОткрытыхЗаказов.Номенклатура = ВыпущенныеТоварыПоНазначениям.Номенклатура
	               |			И ТоварыОткрытыхЗаказов.Назначение = ВыпущенныеТоварыПоНазначениям.Назначение
	               |			И ТоварыОткрытыхЗаказов.Склад = ВыпущенныеТоварыПоНазначениям.Склад
	               |ГДЕ
	               |	ОтгруженоПоНазначениям.Количество < ВыпущенныеТоварыПоНазначениям.Количество";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	РезультатВыгрузки = ?(ЗагрузитьВоВременноеХранилище, ПоместитьВоВременноеХранилище(Выборка), Выборка); 
	
	Возврат РезультатВыгрузки;	
	
КонецФункции

Функция СформироватьРеализациюПоЗаказу(ЗаказКлиента, ДатаРеализации) Экспорт
	
	//Изменим статус обеспечения
	ЗаказОбъект = ЗаказКлиента;
	
	ПереченьВариантов = Новый Массив();
	ПереченьВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));  
	
	Результат = Новый Структура("ПереченьВариантов, ЗаполнятьЦелымиУпаковками");
	Результат.ПереченьВариантов = ПереченьВариантов;
	Результат.ЗаполнятьЦелымиУпаковками = Ложь;
	
	ЗаказИзменен = Ложь; 
	
	ПараметрыВстраивания = Документы.ЗаказКлиента.ДоступныеОстаткиПараметрыВстраивания();
	
	МассивДок = Новый Массив();
	МассивДок.Добавить(ЗаказОбъект);
	
	ПараметрыПроцедуры = Новый Структура();
	
	ПараметрыПроцедуры.Вставить("КодДействия", "ДЕЙСТВИЕ_ОТГРУЗИТЬ");
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("СнятьФлагОтгружатьОднойДатой", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьДатуОтгрузкиОднойДатой", Ложь );
	ПараметрыПроцедуры.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);        
	
	ПараметрыПроцедуры.Вставить("Заказы", МассивДок);
	ПараметрыПроцедуры.Вставить("ПараметрыВстраивания", ПараметрыВстраивания);
	
	ДокументРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	РезультатВыполненияДействий = ОбеспечениеВДокументахСервер.ВыполнитьДействиеДляЗаказовПослеВопроса(ПараметрыПроцедуры);
	Если РезультатВыполненияДействий.СписокОшибок.Количество() = 0 Тогда  
		ДокументРеализации = СоздатьРеализациюПоЗаказу(ЗаказКлиента, ДатаРеализации);  
	Иначе 
		Сообщить("Не удалось проставить действике ""Отгрузить"" в строках Заказа клиента: " + ЗаказОбъект);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецЕсли;
	
	Возврат ДокументРеализации
	
КонецФункции

Функция СоздатьРеализациюПоЗаказу(Основание, ДатаРеализации)
	
	МассивСсылок = Новый Массив();
	МассивСсылок.Добавить(Основание);
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.РеализацияТоваровУслугПараметрыОткрытияФормы(МассивСсылок);
	ДанныеЗаполнения = ПараметрыОткрытия.Основание;
	
	Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	Документ.Заполнить(ДанныеЗаполнения);
	Документ.Дата = ?(ДатаРеализации = НачалоДня(ТекущаяДата()), ТекущаяДата(), ДатаРеализации + 60*60*17);
	
	//***************************************  
	//Если заполнено поле продукция, 
	//удалим из ТЧ Товары строки не соответствующие отбору	
	//Если ЗначениеЗаполнено(Объект.Изделие) и ЗначениеЗаполнено(Объект.Количество) Тогда 
	//	ТЗ_Товары = Документ.Товары.Выгрузить();
	//	КоличествоРеализовано = 0;
	//	
	//	Для Каждого СтрТовары из ТЗ_Товары Цикл 
	//		Если СтрТовары.Номенклатура <> Объект.Изделие Тогда 
	//			ТЗ_Товары.Удалить(СтрТовары);
	//		Иначе  
	//			//уточнить количество и выполнить обработку строки
	//			//Если СтрТовары.Количество < КоличествоРеализовано Тогда 
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Документ.Товары.Загрузить(ТЗ_Товары);
	//КонецЕсли;
	//**************************
	
	Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	СоздатьСчетФактуру = Ложь;
	Если Документ.Товары.Количество() > 0 Тогда
		Попытка
			
			НачатьТранзакцию();      
			
			НовыйНомер = ПолучитьСледующийНомерРеализации(Документ.Организация, ДатаРеализации);  
			Если НовыйНомер = 0 Тогда 
				Документ.УстановитьНовыйНомер();                
			Иначе 
				Документ.Номер = НовыйНомер;
			КонецЕсли;
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗафиксироватьТранзакцию();
			
			СоздатьСчетФактуру = Истина;
			
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
    		ВызватьИсключение;
		КонецПопытки;
		
		Если СоздатьСчетФактуру Тогда
			НовыйСчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(НовыйСчетФактура, Документ.Ссылка);
			
			НовыйСчетФактура.ДокументОснование 	= Документ.Ссылка;
			СтрокаОснований = НовыйСчетФактура.ДокументыОснования.Добавить();  
			СтрокаОснований.ДокументОснование 	= Документ.Ссылка;   
			
			НовыйСчетФактура.ЗаполнитьПараметрыСчетаФактурыПоОснованию(Документ.Ссылка);
			// <+ Вахненко 15.04.2026
			ДанныеЗаполнения = Новый Структура("ДокументОснование,Корректировочный,Исправление",Документ.Ссылка,Ложь,Ложь);
			НовыйСчетФактура.АРМ1_ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
			// +>

						
			НовыйСчетФактура.КодВидаОперацииНаУменьшение = "18";
			НовыйСчетФактура.Дата 				= ДатаРеализации;
			НовыйСчетФактура.ДатаВыставления 	= ДатаРеализации;
			
			НовыйСчетФактура.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Реализация = Документ.Ссылка;
	Иначе
		Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сформировать реализацию по заказу " + Основание + ". Табличная часть товары пустая.'"));
	КонецЕсли;  
	
	Возврат Реализация;
		
КонецФункции

Функция ПолучитьСледующийНомерРеализации(Организация, ДатаРеализации)
	
	НовыйНомер = 0;
	Запрос= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВЫБОР
	               |		КОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 0, 2) = ""ЦБ""
	               |			ТОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 4, 6)
	               |		КОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 0, 4) = ""00ЦБ""
	               |			ТОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 7)
	               |		КОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 0, 4) = ""РБЦБ""
	               |			ТОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 7)
				   |		КОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 0, 4) = ""0РЦБ""
	               |			ТОГДА ПОДСТРОКА(СчетФактураВыданный.Номер, 6, 7)
	               |		ИНАЧЕ ""0""
	               |	КОНЕЦ КАК НомерЧисловой,
	               |	СчетФактураВыданный.Номер КАК Номер
	               |ИЗ
	               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |ГДЕ
	               |	СчетФактураВыданный.Организация = &Организация
	               |	И СчетФактураВыданный.Дата >= НАЧАЛОПЕРИОДА(&ДатаОтгрузки, ГОД)
	               |	И СчетФактураВыданный.Дата <= КОНЕЦПЕРИОДА(&ДатаОтгрузки, ГОД)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерЧисловой УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";    
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаРеализации);
	
	//Попытка
	Выборка = Запрос.Выполнить().Выбрать(); 
	//исключение 
	//	сообщить("" + ОписаниеОшибки());
	//КонецПопытки;
	
	Если Выборка.Следующий() Тогда 
		МаксНомер = Выборка.Номер;  
		НомерЧисловой = Выборка.НомерЧисловой;
	Иначе 
		МаксНомер = "0";                       
		НомерЧисловой = "0";
	КонецЕсли;
	
	Если МаксНомер = "0" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Максимальный номер не определён! Нумерация начнётся сначала!'"),,,,);
		Возврат Число(МаксНомер);
	КонецЕсли;
	
	НовыйНомерЧисло = Формат(Число(НомерЧисловой) + 1,"ЧГ=0");
	НовыйНомерСтрока = Строка(НовыйНомерЧисло);
	НовыйНомер = Лев(МаксНомер,СтрДлина(МаксНомер) - СтрДлина(НовыйНомерСтрока)-1) + НовыйНомерСтрока;
	
	Возврат НовыйНомер; 
КонецФункции

Функция НайтиВПФ() Экспорт

   Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("УПД с комментарием"); 
    
КонецФункции

#КонецОбласти

#Область ЗамерВремениВыполненияПакетныхЗапросов

// Выполняет аналитику по текущему запросу с замером.
//
//Параметры: 
//	*Входящий запрос - Запрос без выборки и результата запроса
//
//Возвращаемое значение:
//	ТаблицаЗначений с результатом выполнения каждого из пакетов
//	*НомерСтроки - Тип: Число
//	*Тип - Тип: Строка
//	*ИмяТаблицы - Наименование временном таблицы
//	*Миллисекунды - Время выполнения запроса в миллисекундах
//	*Записей - Количество записей
//	*ЕстьДанные - Тип: Булево
// 	*Данные - Временная таблица
//
Функция ВыполнитьЗапросСАналитикой(ВходящийЗапрос) Экспорт
	
	ДанныеПакетов = Новый ТаблицаЗначений;
	
	ДанныеПакетов.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
	ДанныеПакетов.Колонки.Добавить("Тип"         , Новый ОписаниеТипов("Строка"));
	ДанныеПакетов.Колонки.Добавить("ИмяТаблицы"  , Новый ОписаниеТипов("Строка"));
	ДанныеПакетов.Колонки.Добавить("Миллисекунды", Новый ОписаниеТипов("Число"));
	ДанныеПакетов.Колонки.Добавить("Записей"     , Новый ОписаниеТипов("Число"));
	ДанныеПакетов.Колонки.Добавить("ЕстьДанные"  , Новый ОписаниеТипов("Булево"));
	ДанныеПакетов.Колонки.Добавить("Данные"      , Новый ОписаниеТипов("ТаблицаЗначений"));
	
	ДанныеПакетов.Индексы.Добавить("ИмяТаблицы");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ВходящийЗапрос.МенеджерВременныхТаблиц <> Неопределено Тогда
		
		Для Каждого ВременнаяТаблица Из ВходящийЗапрос.МенеджерВременныхТаблиц.Таблицы Цикл
			
			ВыбираемыеПоля = Новый Массив;
			Для Каждого ОписаниеКолонки Из ВременнаяТаблица.Колонки Цикл
				ВыбираемыеПоля.Добавить(ОписаниеКолонки.Имя);
			КонецЦикла;
			
			Запрос.Текст = СтрШаблон("ВЫБРАТЬ %1 ПОМЕСТИТЬ %2 ИЗ &ВременнаяТаблица КАК ВТ", 
			СтрСоединить(ВыбираемыеПоля, ","), ВременнаяТаблица.ПолноеИмя);
			
			ДанныеВременнойТаблицы = ВременнаяТаблица.ПолучитьДанные().Выгрузить();
			Запрос.УстановитьПараметр("ВременнаяТаблица", ДанныеВременнойТаблицы);
			
			Запрос.Выполнить();
			
			ОписаниеПакета = ДанныеПакетов.Добавить();
			ОписаниеПакета.ИмяТаблицы  = ВременнаяТаблица.ПолноеИмя;
			ОписаниеПакета.Данные      = ДанныеВременнойТаблицы;
			ОписаниеПакета.ЕстьДанные  = Истина;
			ОписаниеПакета.Тип = "Таблица менеджера";
			
			Запрос.Текст = "";
			Запрос.Параметры.Удалить("ВременнаяТаблица");
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ВходящийЗапрос.Параметры Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ВходящийЗапрос.Текст);
	Для Каждого ПакетЗапроса Из СхемаЗапроса.ПакетЗапросов Цикл
		
		ОписаниеПакета = ДанныеПакетов.Добавить();
		
		Если ТипЗнч(ПакетЗапроса) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда
			
			Запрос.Текст = "УНИЧТОЖИТЬ " + ПакетЗапроса.ИмяТаблицы;
			ОписаниеПакета.ЕстьДанные  = Ложь;
			ОписаниеПакета.ИмяТаблицы = Запрос.Текст;
			ОписаниеПакета.Тип = "Уничтожение";
			
		Иначе
			
			ОписаниеПакета.ЕстьДанные  = Истина;
			Если ПустаяСтрока(ПакетЗапроса.ТаблицаДляПомещения) Тогда
				ОписаниеПакета.Тип = "Выборка";
			Иначе
				ОписаниеПакета.Тип = "Помещение";
				СуществующийПакет  = ДанныеПакетов.Найти(ПакетЗапроса.ТаблицаДляПомещения, "ИмяТаблицы");
				Если СуществующийПакет <> Неопределено Тогда
					Запрос.Текст = "УНИЧТОЖИТЬ " + ПакетЗапроса.ТаблицаДляПомещения;
					Запрос.Выполнить();
					ДанныеПакетов.Удалить(СуществующийПакет);
				КонецЕсли;
			КонецЕсли;
			
			ОписаниеПакета.ИмяТаблицы = ПакетЗапроса.ТаблицаДляПомещения;
			
			Запрос.Текст = ПакетЗапроса.ПолучитьТекстЗапроса();
			
		КонецЕсли;
		
		НачалоЗамера    = ТекущаяУниверсальнаяДатаВМиллисекундах();
		РезультатЗапрос = Запрос.Выполнить();
		КонецЗамера     = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ОписаниеПакета.Данные       = ДанныеВременнойТаблицы;
		ОписаниеПакета.Миллисекунды = КонецЗамера-НачалоЗамера;
		
		Если ОписаниеПакета.ЕстьДанные Тогда
			Если ОписаниеПакета.Тип = "Выборка" Тогда
				ДанныеПакета = РезультатЗапрос.Выгрузить();
			Иначе
				ДанныеПакета = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ОписаниеПакета.ИмяТаблицы).ПолучитьДанные().Выгрузить();
			КонецЕсли;
			ОписаниеПакета.Данные = ДанныеПакета;
		КонецЕсли;
		
	КонецЦикла;
	
	Для НомерСтроки = 1 По ДанныеПакетов.Количество() Цикл
		ОписаниеПакета = ДанныеПакетов[НомерСтроки-1];
		ОписаниеПакета.НомерСтроки = НомерСтроки;
		Если ОписаниеПакета.ЕстьДанные Тогда
			ОписаниеПакета.Записей = ОписаниеПакета.Данные.Количество();
			Если ОписаниеПакета.Записей = 0 Тогда
				ОписаниеПакета.ЕстьДанные = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеПакетов;
	
КонецФункции

#КонецОбласти


#Область ОткрытиеДополнительныхОбработокИОтчетов

// Выполняет открытие дополнительной внешней обработки с вариантом публикации "Используется".
//
// Параметры:
//  * Наименование - Имя внешней обработки или отчета | Тип: Строка 
//	* ТочноеСоответствие - Определяет режим поиска по полному соответствию | Тип: Булево - Необязательный параметр 
// 	* ОбъектНазначения - Объект ссылка при передачи на форму при открытии
//
// Возвращаемое значение:
//  Структура - структура с полями:
//   * Ссылка - Ссылка внешней обработки.
//   * Вид - Вид внешней обработки.
//   * ЭтоОтчет - Тип: Булево.
//   * ОбъектыНазначения - Табличная часть "Объекты назначения" ДополнительныеОтчетыИОбработки - Необязательный параметр для открытия.
//   * Идентификатор - Идентификатор внешней обработки.
//   * ВариантЗапуска - Вариант запуска внешней обработки.
//   * Модификатор - Модификатор внешней обработки.
//   * ПоказыватьОповещение - Тип: Булево.
//
Функция ПолучитьПараметрыВнешнейОбработкиПередОткрытием(Наименование, Знач ТочноеСоответствие = Ложь, Знач ОбъектНазначения = Неопределено) Экспорт
	
	ПубликацияИспользуется = ПредопределенноеЗначение("Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется");
	ВариантОткрытияОбработки = ПредопределенноеЗначение("Перечисление.СпособыВызоваДополнительныхОбработок.ОткрытиеФормы");
	ВидДополнительныйОтчет = ПредопределенноеЗначение("Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет");
	ВидОтчет = ПредопределенноеЗначение("Перечисление.ВидыДополнительныхОтчетовИОбработок.Отчет"); 

	ВнешняяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование, ТочноеСоответствие);
	
	Если ВнешняяОбработка.Пустая() Тогда
		Возврат Неопределено;
	ИначеЕсли ВнешняяОбработка.Публикация = ПубликацияИспользуется Тогда
		
		ВыполняемаяКоманда = Новый Структура(
			"Ссылка, Представление,
			|Идентификатор, ВариантЗапуска, ПоказыватьОповещение, 
			|Модификатор, ОбъектыНазначения, ЭтоОтчет, Вид"); 
				
		Для Каждого СтрокаТаблицыКоманд Из ВнешняяОбработка.Команды Цикл
			
			Если СтрокаТаблицыКоманд.ВариантЗапуска = ВариантОткрытияОбработки Тогда
				ВыполняемаяКоманда.Ссылка = ВнешняяОбработка.Ссылка;
				ВыполняемаяКоманда.Вид = ВнешняяОбработка.Вид;		
				ВыполняемаяКоманда.ЭтоОтчет = (ВнешняяОбработка.Вид = ВидДополнительныйОтчет Или ВнешняяОбработка.Вид = ВидОтчет);
				ВыполняемаяКоманда.ОбъектыНазначения = ОбъектНазначения;
				
				ВыполняемаяКоманда.Идентификатор = СтрокаТаблицыКоманд.Идентификатор;
				ВыполняемаяКоманда.ВариантЗапуска = СтрокаТаблицыКоманд.ВариантЗапуска;
				ВыполняемаяКоманда.Представление = СтрокаТаблицыКоманд.Представление;
				ВыполняемаяКоманда.Модификатор = СтрокаТаблицыКоманд.Модификатор;
				ВыполняемаяКоманда.ПоказыватьОповещение = СтрокаТаблицыКоманд.ПоказыватьОповещение;
			КонецЕсли;
						
		КонецЦикла;
	КонецЕсли;
	
	Возврат ВыполняемаяКоманда;   
	
КонецФункции

#КонецОбласти      


/////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////

#Область НЕиспользуемое 
 
//06.06.2025
//Закомментировала по результатам проверки модулей - сылок на данную процедуру не обнружено
//Процедура ОбработатьСтрокиЭтапаИспользуяПараметрыВстраивания(ЭтапПроизводства, ЭтоСписание)
//	
//	МассивЭтапов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭтапПроизводства);
//	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ЭтапПроизводства);
//	//ПараметрыВстраивания = МенеджерОбъекта.ДоступныеОстаткиПараметрыВстраивания();
//	ПараметрыВстраивания = ОбеспечениеВДокументахСервер.ДоступныеОстаткиПараметрыВстраивания();
//	
//	Если ЭтоСписание Тогда
//		КодДействия = "ДЕЙСТВИЕ_ОТГРУЗИТЬ";
//		СтруктураОтбора = Новый Структура("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));
//	Иначе
//		КодДействия = "ДЕЙСТВИЕ_РЕЗЕРВИРОВАТЬ";
//		СтруктураОтбора = Новый Структура("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"))
//	КонецЕсли;
//	
//	СтруктураОтбора = Новый Структура("ВариантОбеспечения", ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"));
//	МассивСтрок = ЭтапПроизводства.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураОтбора);
//		
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("КодДействия", КодДействия);
//	СтруктураПараметров.Вставить("ПараметрыЗаполнения", Неопределено);
//	СтруктураПараметров.Вставить("СнятьФлагОтгружатьОднойДатой", Истина);
//    СтруктураПараметров.Вставить("ЗаполнитьДатуОтгрузкиОднойДатой", Ложь);
//	СтруктураПараметров.Вставить("Заказы", МассивЭтапов);
//	СтруктураПараметров.Вставить("ПараметрыВстраивания", ПараметрыВстраивания);
//	
//	ВыполнитьДействиеДляЗаказовПослеВопроса(СтруктураПараметров, МассивСтрок);
//КонецПроцедуры

#КонецОбласти 
