#Область ФормаВыбораСпецификацийОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоменклатураОтбор = Параметры.ПараметрыСвязи["Номенклатура"];		
	Объект.ДоступныеСпецификации.Очистить();
	
	Для Каждого ТекДанные Из Параметры.КоллекцияСоответствий Цикл
		НоваяСтрока = Объект.ДоступныеСпецификации.Добавить();
		НоваяСтрока.Спецификация = ТекДанные.Ключ;
		НоваяСтрока.Статус = ТекДанные.Значение; 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСпецификацию(Команда)
	ВыборОбработан = ОбработкаИзФормыВыбораСпецификаций();
	
	Если НЕ ВыборОбработан Тогда
		Возврат;
	КонецЕсли;

	ЭтаФорма.Закрыть();
КонецПроцедуры

//Обработка выбора спецификации при двойном клике мыши
&НаКлиенте
Процедура ДоступныеСпецификацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборОбработан = ОбработкаИзФормыВыбораСпецификаций();
	
	Если НЕ ВыборОбработан Тогда
		Возврат;
	КонецЕсли;

	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
функция ОбработкаИзФормыВыбораСпецификаций(Знач ВыборОбработан = Ложь)
	МассивВыбранныхСтрок = Элементы.ДоступныеСпецификации.ВыделенныеСтроки;
	
	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
	    Возврат ВыборОбработан;		
	ИначеЕсли МассивВыбранныхСтрок.Количество() > 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбор из списка доступен только в количестве 1 спецификации'"));
		Возврат ВыборОбработан;
	КонецЕсли;
	
	ВыбраннаяСтрока = Элементы.ДоступныеСпецификации.ТекущиеДанные;
	Оповестить("ПослеВыбораСвязаннойСпецификации", ВыбраннаяСтрока);	
	ВыборОбработан = Истина;
	
	Возврат ВыборОбработан;
КонецФункции

#КонецОбласти