&ИзменениеИКонтроль("УстановитьДействияИзТаблицы")
Процедура АРМ1_УстановитьДействияИзТаблицы(Форма, ТаблицаИзменений, ПараметрыВстраивания)

	Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
		ПараметрыВстраивания = Форма.ДоступныеОстаткиПараметрыВстраивания;
		Коллекция = ОбеспечениеВДокументахКлиентСервер.КоллекцияНаФорме(Форма, ПараметрыВстраивания);
	Иначе
		Коллекция = Форма;
	КонецЕсли;
	ОчищаемыеРеквизиты = Новый Структура(ПараметрыВстраивания.ОчищаемыеРеквизиты);    
	
	#Вставка
	ОчищаемыеРеквизиты.Вставить("ДатаОтгрузки",ТекущаяДатаСеанса());
	#КонецВставки
	
	ЗаполняемыеРеквизиты = Новый Структура(ПараметрыВстраивания.ОчищаемыеРеквизиты);

	Идентификатор = Неопределено;
	ЭтоДанныеФормыКоллекция = ТипЗнч(Коллекция) = Тип("ДанныеФормыКоллекция");
	ДобавленоСтрок = 0;
	Для Индекс = 0 По ТаблицаИзменений.Количество() - 1 Цикл

		СтрокаОбеспечения = ТаблицаИзменений[Индекс];

		// Выбор существующей, либо добавление новой строки.
		Если Идентификатор <> СтрокаОбеспечения.Идентификатор Тогда

			Идентификатор = СтрокаОбеспечения.Идентификатор;
			Если ЭтоДанныеФормыКоллекция Тогда
				СтрокаТовары = Коллекция.НайтиПоИдентификатору(Идентификатор);
			Иначе
				СтрокаТовары = Коллекция[Идентификатор - 1 + ДобавленоСтрок];
			КонецЕсли;
			СтрокаОбеспечения.Строка = СтрокаТовары;
			ЗаполнитьЗначенияСвойств(ЗаполняемыеРеквизиты, СтрокаТовары);

		Иначе

			ДобавленоСтрок = ДобавленоСтрок + 1;
			НоваяСтрока = Коллекция.Вставить(Коллекция.Индекс(СтрокаТовары) + 1);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
			СтрокаОбеспечения.Строка = НоваяСтрока;
			СтрокаТовары = НоваяСтрока;

		КонецЕсли;

		ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаОбеспечения);
		Если СтрокаОбеспечения.ЭтоНоваяСтрока Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТовары, ОчищаемыеРеквизиты);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаТовары, ЗаполняемыеРеквизиты);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

//&ИзменениеИКонтроль("ВыполнитьДействиеДляЗаказовПослеВопроса")

// Выполняет действие по заполнению обеспечения в заказе из списка заказов после задания вопроса об отгрузке одной датой.
//
// Параметры:
//  Параметры - Структура - структура параметров:
//   * КодДействия - Строка - условное обозначение команды "ДЕЙСТВИЕ_КОБЕСПЕЧЕНИЮ" или "ДЕЙСТВИЕ_ОТГРУЗИТЬ"
//                   или "ДЕЙСТВИЕ_РЕЗЕРВИРОВАТЬ" или "ДЕЙСТВИЕ_НЕОБЕСПЕЧИВАТЬ" или "ОТКАТ_ДЕЙСТВИЯ_ОТГРУЗИТЬ".
//   * ПараметрыЗаполнения - Структура - структура параметров:
//     ** СнятьФлагОтгружатьОднойДатой - Булево - результат ответа на вопрос об отгрузке одной датой.
//     ** ЗаполнитьДатуОтгрузкиОднойДатой - Булево - результат ответа на вопрос об отгрузке одной датой.
//   * Заказы - Массив из ЛюбаяСсылка - заказы для установки действия.
//   * ПараметрыВстраивания - см. ДоступныеОстаткиПараметрыВстраивания
//  ЗаполнитьДатуОтгрузкиПринудительно - Булево - Истина, если нужно заполнить дату отгрузки даже если нет изменений в документе.
//  Загрузка - Булево - Истина, если нужно объект необходимо записывать в режиме ОбменДанными.Загрузка.
//
// Возвращаемое значение:
//  Структура - структура с полями:
//   * СписокОшибок - Массив - массив содержащий тексты ошибок обработки документов.
//   * КоличествоОбработано - Число - количество обработанных документов.
//

//11.11.2024 Закомментировала
//+Ганьшина Е.
//Функция АРМ1_ВыполнитьДействиеДляЗаказовПослеВопроса(Параметры, ЗаполнитьДатуОтгрузкиПринудительно = Ложь, Загрузка = Ложь) Экспорт
//	
//	Заказы = Параметры.Заказы;
//	СообщенияПользователю = Новый Массив();
//	ПараметрыВстраивания = Параметры.ПараметрыВстраивания;
//	КодДействия = Параметры.КодДействия;
//	Если Заказы.Количество() > 0 Тогда
//		
//		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Заказы[0]);
//		Если ПараметрыВстраивания = Неопределено Тогда
//			ПараметрыВстраивания = МенеджерОбъекта.ДоступныеОстаткиПараметрыВстраивания();
//		КонецЕсли;
//		Если ПараметрыВстраивания.ИспользоватьПодпискиНаСобытия.ПередВыполнениемДействийВСпискеЗаказов Тогда
//			МенеджерОбъекта.ПередВыполнениемДействийВСпискеЗаказов(Заказы, КодДействия, СообщенияПользователю);
//		КонецЕсли;
//		
//	КонецЕсли;
//	ПараметрыЗаполнения = Параметры.ПараметрыЗаполнения;
//	Результат = Новый Структура("СписокОшибок,КоличествоОбработано", Новый Массив(), 0);
//	Для Каждого Элемент Из СообщенияПользователю Цикл
//		Результат.СписокОшибок.Добавить(Элемент);
//	КонецЦикла;
//	СообщенияПользователю.Очистить();
//	Обработано = 0;
//	
//	Для Каждого Ссылка Из Заказы Цикл
//		
//		ТекстОшибки = "";
//		
//		НачатьТранзакцию();
//		Попытка
//			
//			ТекстОшибки = НСтр("ru = 'Не удалось заблокировать объект, возможно он редактируется. Для %1 установка действия не выполнена.';
//								|en = 'Cannot lock the object, it may be being edited. Cannot set action for %1.'");
//			
//			ЗаблокироватьДанныеДляРедактирования(Ссылка);
//			
//			Блокировка = Новый БлокировкаДанных();
//			
//			ЭлементБлокировки = Блокировка.Добавить(Ссылка.Метаданные().ПолноеИмя());
//			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
//			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//			
//			ТекстОшибки = НСтр("ru = 'Не удалось установить блокировку объекта. Для %1 установка действия не выполнена.';
//								|en = 'Cannot set object lock. Cannot set action for %1.'");
//			
//			Блокировка.Заблокировать();
//			
//			ТекстОшибки = НСтр("ru = 'Не удалось обработать объект. Для %1 установка действия не выполнена.';
//								|en = 'Cannot process object. Cannot set action for %1.'");
//			
//			ДокументОбъект = Ссылка.ПолучитьОбъект();
//			#Вставка
//			//ЗаполнитьДатуОтгрузкиПринудительно = Истина;
//			#КонецВставки
//			Если ЗаполнитьДатуОтгрузкиПринудительно Тогда
//				ДокументОбъект.ДополнительныеСвойства.Вставить("ЗаполнитьДатуОтгрузкиПринудительно");
//			КонецЕсли;
//			Если ДокументОбъект.Проведен И (КодДействия = "ДЕЙСТВИЕ_ОТГРУЗИТЬ" Или КодДействия = "ДЕЙСТВИЕ_ОТГРУЗИТЬ_ПРИОРИТЕТНО_ОБОСОБЛЕННО") Тогда
//				
//				ВопросБылЗадан = ПараметрыЗаполнения <> Неопределено;
//				НуженВопрос = ПараметрыВстраивания.ВыражениеДляВопросаПриВыполненииДействияВСпискеЗаказов <> "НЕОПРЕДЕЛЕНО"
//					И НуженВопросОбОтгрузкеОднойДатой(ПараметрыВстраивания, Ссылка);
//				
//				Если Не ВопросБылЗадан И НуженВопрос Тогда
//					ТекстОшибки = НСтр("ru = 'Изменились данные документа %1. Установка действия не выполнена.';
//										|en = 'The %1 document data is changed. The action setup failed.'");
//					ВызватьИсключение ТекстОшибки;
//				КонецЕсли;
//					
//			КонецЕсли;
//			
//			Если ДокументОбъект.Проведен Тогда
//				
//				РезультатЗаполнения = ЗаполнитьВариантОбеспеченияПоОстаткамДляВыделенныхСтрокОбъекта(
//					ДокументОбъект,
//					КодДействия,
//					ПараметрыЗаполнения,
//					Неопределено,
//					ПараметрыВстраивания);
//				ТаблицаИзменений = РезультатЗаполнения.ТаблицаИзменений;
//				ЕстьСтрокиСНезаполненнымСкладом = РезультатЗаполнения.Предупреждения.ЕстьСтрокиСНезаполненнымСкладом;
//				Если ЕстьСтрокиСНезаполненнымСкладом Тогда
//					ТекстОшибки = НСтр("ru = 'В документе %1 есть товары для которых не указан склад отгрузки. Установка действия для таких товаров не выполнялась.';
//										|en = 'In the %1 document, there are goods without the specified origin warehouse. Cannot set the action for such goods.'");
//					Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
//				КонецЕсли;
//				
//				РежимЗаписи = РежимЗаписиДокумента.Проведение;
//				
//				ТекстОшибки = НСтр("ru = 'Не удалось записать/провести объект. Для %1 установка действия не выполнена.';
//									|en = 'Cannot save/post object. Cannot set action for %1.'");
//				
//				Если Загрузка Тогда
//					ДокументОбъект.ОбменДанными.Загрузка = Истина;
//					ДокументОбъект.Записать();
//				ИначеЕсли ДокументОбъект.ПроверитьЗаполнение() Тогда
//					ДокументОбъект.Записать(РежимЗаписи);
//				Иначе
//					
//					Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
//					
//					Для Каждого ТекОшибка Из ПолучитьСообщенияПользователю(Истина) Цикл
//						
//						Ошибка = Новый Структура;
//						Ошибка.Вставить("Ссылка", Ссылка);
//						Ошибка.Вставить("Текст",  ТекОшибка.Текст);
//						Ошибка.Вставить("Поле",   ТекОшибка.Поле);
//						Ошибка.Вставить("ПутьКДанным", ТекОшибка.ПутьКДанным);
//						
//						Результат.СписокОшибок.Добавить(Ошибка);
//						
//					КонецЦикла;
//					
//				КонецЕсли;
//				
//			Иначе
//				ТекстОшибки = НСтр("ru = 'Документ %1 не проведен и не будет обработан.';
//									|en = 'Document %1 has not been posted and will not be processed.'");
//				Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
//			КонецЕсли;
//			
//			Обработано = Обработано + ?(ТаблицаИзменений.Количество() > 0, 1, 0);
//			ЗафиксироватьТранзакцию();
//			
//		Исключение
//			
//			ОтменитьТранзакцию();
//			
//			ПараметрыЖурнала = Новый Структура("ГруппаСобытий, Метаданные, Данные");
//			ПараметрыЖурнала.ГруппаСобытий = НСтр("ru = 'Заполнение действий в заказе';
//													|en = 'Action population in order'");
//			ПараметрыЖурнала.Метаданные    = Ссылка.Метаданные();
//			ПараметрыЖурнала.Данные        = Ссылка;
//			ОбщегоНазначенияУТ.ЗаписатьВЖурналСообщитьПользователю(
//				ПараметрыЖурнала,
//				УровеньЖурналаРегистрации.Информация,
//				НСтр("ru = 'Заполнение действий в заказе';
//					|en = 'Action population in order'"),
//				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//			
//			Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
//			
//		КонецПопытки;
//		
//	КонецЦикла;
//	Результат.КоличествоОбработано = Обработано;
//	
//	Возврат Результат;
//	
//КонецФункции
//- Ганьшина Е.


//Функция АРМ1_ВыполнитьДействиеДляЗаказовПослеВопроса(Параметры)

//	Заказы = Параметры.Заказы;
//	СообщенияПользователю = Новый Массив();
//	ПараметрыВстраивания = Параметры.ПараметрыВстраивания;
//	КодДействия = Параметры.КодДействия;
//	Если Заказы.Количество() > 0 Тогда

//		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Заказы[0]);
//		Если ПараметрыВстраивания = Неопределено Тогда
//			ПараметрыВстраивания = МенеджерОбъекта.ДоступныеОстаткиПараметрыВстраивания();
//		КонецЕсли;
//		Если ПараметрыВстраивания.ИспользоватьПодпискиНаСобытия.ПередВыполнениемДействийВСпискеЗаказов Тогда
//			МенеджерОбъекта.ПередВыполнениемДействийВСпискеЗаказов(Заказы, КодДействия, СообщенияПользователю);
//		КонецЕсли;

//	КонецЕсли;
//	ПараметрыЗаполнения = Параметры.ПараметрыЗаполнения;
//	Результат = Новый Структура("СписокОшибок,КоличествоОбработано", Новый Массив, 0);
//	КоличествоПредупреждений = СообщенияПользователю.Количество();
//	Для Каждого Элемент Из СообщенияПользователю Цикл
//		Результат.СписокОшибок.Добавить(Элемент);
//	КонецЦикла;
//	СообщенияПользователю.Очистить();

//	Для Каждого Ссылка Из Заказы Цикл

//		ТекстОшибки = "";

//		НачатьТранзакцию();
//		Попытка

//			ТекстОшибки = НСтр("ru = 'Не удалось заблокировать объект, возможно он редактируется. Для %1 установка действия не выполнена.';
//			|en = 'Cannot lock the object, it may be being edited. Cannot set action for %1.'");

//			ЗаблокироватьДанныеДляРедактирования(Ссылка);

//			Блокировка = Новый БлокировкаДанных();

//			ЭлементБлокировки = Блокировка.Добавить(Ссылка.Метаданные().ПолноеИмя());
//			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
//			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

//			ТекстОшибки = НСтр("ru = 'Не удалось установить блокировку объекта. Для %1 установка действия не выполнена.';
//			|en = 'Cannot set object lock. Cannot set action for %1.'");

//			Блокировка.Заблокировать();

//			ТекстОшибки = НСтр("ru = 'Не удалось обработать объект. Для %1 установка действия не выполнена.';
//			|en = 'Cannot process object. Cannot set action for %1.'");

//			ДокументОбъект = Ссылка.ПолучитьОбъект();
//			Если ДокументОбъект.Проведен Тогда

//				РезультатЗаполнения = ЗаполнитьВариантОбеспеченияПоОстаткамДляВыделенныхСтрокОбъекта(
//				ДокументОбъект,
//				КодДействия,
//				ПараметрыЗаполнения,
//				Неопределено,
//				ПараметрыВстраивания);
//				ТаблицаИзменений = РезультатЗаполнения.ТаблицаИзменений;
//				ЕстьСтрокиСНезаполненнымСкладом = РезультатЗаполнения.Предупреждения.ЕстьСтрокиСНезаполненнымСкладом;
//				Если ЕстьСтрокиСНезаполненнымСкладом Тогда
//					ТекстОшибки = НСтр("ru = 'В документе %1 есть товары для которых не указан склад отгрузки. Установка действия для таких товаров не выполнялась.';
//					|en = 'In the %1 document, there are goods without the specified origin warehouse. Cannot set the action for such goods.'");
//					Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
//					КоличествоПредупреждений = КоличествоПредупреждений + 1;
//				КонецЕсли;

//				Если КодДействия = "ДЕЙСТВИЕ_ОТГРУЗИТЬ" И ТаблицаИзменений.Количество() > 0 Тогда

//					ВопросБылЗадан = ПараметрыЗаполнения <> Неопределено;

//					#Вставка
//					//Не надо изменять даты отгрузки в ЗаказеКлиента
//					Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
//						НуженВопрос = ПараметрыВстраивания.ВыражениеДляВопросаПриВыполненииДействияВСпискеЗаказов <> "НЕОПРЕДЕЛЕНО";
//					Иначе 
//					#КонецВставки 
//					
//					НуженВопрос = ПараметрыВстраивания.ВыражениеДляВопросаПриВыполненииДействияВСпискеЗаказов <> "НЕОПРЕДЕЛЕНО"
//					И НуженВопросОбОтгрузкеОднойДатой(ПараметрыВстраивания, Ссылка);
//					
//					#Вставка
//					КонецЕсли;
//					#КонецВставки

//					Если ВопросБылЗадан <> НуженВопрос Тогда
//						Текст = НСтр("ru = 'Ошибка заполнения действия в списке документов. Изменились данные документов.';
//						|en = 'Action population error in the documents list. The documents data has been changed.'");
//						ВызватьИсключение Текст;
//					КонецЕсли;

//				КонецЕсли;

//				РежимЗаписи = РежимЗаписиДокумента.Проведение;

//				ТекстОшибки = НСтр("ru = 'Не удалось записать/провести объект. Для %1 установка действия не выполнена.';
//				|en = 'Cannot save/post object. Cannot set action for %1.'");

//				Если ДокументОбъект.ПроверитьЗаполнение() Тогда
//					ДокументОбъект.Записать(РежимЗаписи);
//				Иначе

//					Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));

//					Для Каждого ТекОшибка Из ПолучитьСообщенияПользователю(Истина) Цикл

//						Ошибка = Новый Структура;
//						Ошибка.Вставить("Ссылка", Ссылка);
//						Ошибка.Вставить("Текст",  ТекОшибка.Текст);
//						Ошибка.Вставить("Поле",   ТекОшибка.Поле);
//						Ошибка.Вставить("ПутьКДанным", ТекОшибка.ПутьКДанным);

//						Результат.СписокОшибок.Добавить(Ошибка);

//					КонецЦикла;

//				КонецЕсли;

//			Иначе
//				ТекстОшибки = НСтр("ru = 'Документ %1 не проведен и не будет обработан.';
//				|en = 'Document %1 has not been posted and will not be processed.'");
//				Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));
//			КонецЕсли;

//			ЗафиксироватьТранзакцию();

//		Исключение

//			ОтменитьТранзакцию();

//			ПараметрыЖурнала = Новый Структура("ГруппаСобытий, Метаданные, Данные");
//			ПараметрыЖурнала.ГруппаСобытий = НСтр("ru = 'Заполнение действий в заказе';
//			|en = 'Action population in order'");
//			ПараметрыЖурнала.Метаданные    = Ссылка.Метаданные();
//			ПараметрыЖурнала.Данные        = Ссылка;
//			ОбщегоНазначенияУТ.ЗаписатьВЖурналСообщитьПользователю(
//			ПараметрыЖурнала,
//			УровеньЖурналаРегистрации.Информация,
//			НСтр("ru = 'Заполнение действий в заказе';
//			|en = 'Action population in order'"),
//			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

//			Результат.СписокОшибок.Добавить(Новый Структура("Текст,Ссылка", СтрШаблон(ТекстОшибки, Ссылка), Ссылка));

//		КонецПопытки;

//	КонецЦикла;
//	Результат.КоличествоОбработано = Заказы.Количество() - Результат.СписокОшибок.Количество() + КоличествоПредупреждений;

//	Возврат Результат;

//КонецФункции
