#Область ФормаВыбораИсполнителейОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыгруженныйСписок = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
	Объект.Исполнители.Очистить();
	
	Для Каждого ТекДанные Из ВыгруженныйСписок Цикл
		НоваяСтрока = Объект.Исполнители.Добавить();
		НоваяСтрока.Пользователь = ТекДанные.Исполнитель;
		НоваяСтрока.Подразделение = Параметры.Подразделение;
		НоваяСтрока.Спецификация = Параметры.Спецификация;
	КонецЦикла;
	
	Объект.Ответственный = Параметры.Ответственный;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИсполнителя(Команда)	
	ВыборОбработан = ОбработкаИзФормыВыбораИсполнителей();
	
	Если НЕ ВыборОбработан Тогда
		Возврат;
	КонецЕсли;

	ЭтаФорма.Закрыть();
КонецПроцедуры

//Обработка выбора исполнителя при двойном клике мыши
&НаКлиенте
Процедура ИсполнителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборОбработан = ОбработкаИзФормыВыбораИсполнителей();
	
	Если НЕ ВыборОбработан Тогда
		Возврат;
	КонецЕсли;

	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
функция ОбработкаИзФормыВыбораИсполнителей(Знач ВыборОбработан = Ложь)
	МассивВыбранныхСтрок = Элементы.Исполнители.ВыделенныеСтроки;
	
	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
	    Возврат ВыборОбработан;	
	ИначеЕсли МассивВыбранныхСтрок.Количество() > 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбор из списка доступен только для 1 исполнителя'"));
		Возврат ВыборОбработан;
	КонецЕсли;
	
	ВыбраннаяСтрока = Элементы.Исполнители.ТекущиеДанные;
	Оповестить("ПослеВыбораИсполнителя", ВыбраннаяСтрока);	
	ВыборОбработан = Истина;
	
	Возврат ВыборОбработан;
КонецФункции

#КонецОбласти