&НаСервере
Функция ДанныеИзХОН(КлючОбъекта,КлючНастроек = "") Экспорт
	//Формула = СтрШаблон("ХранилищеОбщихНастроек.Загрузить(%2%1%2,%2%3%2,%2%1%2)",КлючОбъекта,"""",КлючНастроек);
	УстановитьПривилегированныйРежим(Истина);
	ДанныеИзХОН =  ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек,,КлючОбъекта);
	//ДанныеИзХОН =  Вычислить(Формула);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ДанныеИзХОН;
КонецФункции

&НаСервере
Процедура ПоместитьДанныеВ_ХОН(КлючОбъекта,Данные,КлючНастроек = "") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,КлючНастроек,Данные,,КлючОбъекта);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

// Функция - Рабочий день отсчет от даты
//
// Параметры:
//  Дата	 - Дата от которой будет отсчёт	 - Дата
//  График	 - Рабочий график по которому ведётся отсчет - Справочник.ПроизводственныеКалендари
//  Дельта	 - Количество рабочих дней, для отсчета от даты, модуль не больше 365 - число со знаком
// 
// Возвращаемое значение:
//   Рабочий день - Дата, рабочий день про данным графика, отстоящий от указанной даты на дельту рабочих дней
//	
//
Функция РабочийДеньОтсчетОтДаты(Дата,Дельта,ПроизводственныйКалендарь = Неопределено) Экспорт
	
	РабочаяДата = Дата(1,1,1);
	Если ПроизводственныйКалендарь = Неопределено Тогда
		ПроизводственныйКалендарь = Справочники.ПроизводственныеКалендари.НайтиПоНаименованию("Российская Федерация");
	КонецЕсли;
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.Год КАК Год,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня,
		|	ДанныеПроизводственногоКалендаря.ДатаПереноса КАК ДатаПереноса
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И ДанныеПроизводственногоКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
		|	И ВЫБОР
		|			КОГДА &Дельта >= 0
		|				ТОГДА ДанныеПроизводственногоКалендаря.Дата >= &Дата
		|						И ДанныеПроизводственногоКалендаря.Дата <= ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, &Дельта + 118 * (1 + &ЧислоЛет))
		|			ИНАЧЕ ДанныеПроизводственногоКалендаря.Дата < &Дата
		|					И ДанныеПроизводственногоКалендаря.Дата >= ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, &Дельта - 118 * (1 + &ЧислоЛет))
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ЧислоЛет", Цел(Дельта/365));
	Запрос.УстановитьПараметр("Дельта", Дельта);
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	мДата = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Дата");
	Если Дельта>=0 Тогда
		РабочаяДата = мДата[Дельта];
	Иначе
		РабочаяДата = мДата[мДата.Количество()+Дельта];
	КонецЕсли;

	Возврат РабочаяДата;
КонецФункции


// Функция - Есть реквизит
//
// Параметры:
//  ИмяРеквизита - Имя реквизита формы - Строка 
//  Форма		 - Форма - 
// 
// Возвращаемое значение:
//   Если у формы есть реквизит с таким именем  - Истина, Иначе Ложь 
//
Функция ЕстьРеквизит(ИмяРеквизита,Форма) Экспорт
	тмп = Новый Структура(ИмяРеквизита,Null);
	ЗаполнитьЗначенияСвойств(тмп,Форма);
	Возврат Не тмп[ИмяРеквизита] = Null;
КонецФункции