		  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЭтоСписание = Параметры.ЭтоСписание;
	ИмяДерева = Параметры.ИмяДерева;
	ВыбраннаяНоменклатура = Параметры.Номенклатура;
	ЗакрытьФорму = Ложь;
	ЗаписатьСтрокиВРегистр = Ложь;
	ТабНоменклатуры = РеквизитФормыВЗначение("ТабНовойНоменклатуры",Тип("ТаблицаЗначений"));
	Если Параметры.Свойство("МассивЭтапов") Тогда 
		Для Каждого СтрЭтап из Параметры.МассивЭтапов Цикл 
			НоваяСтрока = ТабНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = ?(Параметры.Свойство("Номенклатура"),Параметры.Номенклатура,Справочники.Номенклатура.ПустаяСсылка());
			НоваяСтрока.Упаковка = Параметры.Номенклатура.ЕдиницаИзмерения;
			НоваяСтрока.ЭтапПроизводства = СтрЭтап;
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
			НоваяСтрока.Обособленно = Истина;
			НоваяСтрока.ОтборПоВариантамОбеспечения = 1;
			НоваяСтрока.КоличествоУпаковок = 1;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.КатегорияМатериала = ПолучитьКатегориюМатериала(НоваяСтрока.Номенклатура, Параметры.ДР_КатегорияМатериала);
			НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(НоваяСтрока.Номенклатура, Параметры.Склад);
			НоваяСтрока.Склад = Параметры.Склад; ////?(Параметры.Свойство("Склад"),Параметры.Склад,Справочники.Склады.ПустаяСсылка());
			НоваяСтрока.Назначение = ПолучитьНазначение(НоваяСтрока.ЭтапПроизводства);
			НоваяСтрока.СтатьяКалькуляции = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные материалы");
			НоваяСтрока.ДатаОтгрузки = Параметры.ДатаОтгрузки;
			НоваяСтрока.КлючСвязиСпецификация = Параметры.КлючСвязиСпецификация;
			НоваяСтрока.Подразделение = Параметры.Склад.Подразделение;  
			//НоваяСтрока.Спецификация = СтрЭтап.Спецификация;
		КонецЦикла;
	КонецЕсли;  
	ЗначениеВРеквизитФормы(ТабНоменклатуры,"ТабНовойНоменклатуры");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКатегориюМатериала(Номенклатура, ДопСвойство) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Владелец КАК Свойство,
	               |	ЗначенияСвойствОбъектов.Ссылка КАК КатегорияМатериала,
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |		ПО НоменклатураДополнительныеРеквизиты.Свойство = ЗначенияСвойствОбъектов.Владелец
	               |			И НоменклатураДополнительныеРеквизиты.Значение = ЗначенияСвойствОбъектов.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство",ДопСвойство);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КатегорияМатериала;
	Иначе 
		Возврат Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

//&НаСервере 
//Функция ПолучитьОстаток(Номенклатура, Склад)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
//	               |	СвободныеОстаткиОстатки.ВНаличииОстаток КАК Остаток
//	               |ИЗ
//	               |	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
//	               |ГДЕ
//	               |	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
//	               |	И СвободныеОстаткиОстатки.Склад = &Склад";
//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//	Запрос.УстановитьПараметр("Склад", Склад);
//	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДатаСеанса()));
//	Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда 
//		Возврат Выборка.Остаток;   
//	Иначе 
//		Возврат 0;
//	КонецЕсли;
//	
//КонецФункции

&НаСервере 
Функция ПолучитьНазначение(ЭтапПроизводства) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Ссылка = &Этап";
	Запрос.УстановитьПараметр("Этап",ЭтапПроизводства);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Назначение;
	Иначе 
		Возврат Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли; 
	Если ЗакрытьФорму Тогда
		Если ЗаписатьСтрокиВРегистр Тогда 
			ПараметрыЗакрытия = Новый Структура;
			ПараметрыЗакрытия.Вставить("ИмяДерева",ИмяДерева); //Параметры.ИмяДерева);
			ПараметрыЗакрытия.Вставить("ЭтоСписание",ЭтоСписание); //Параметры.ЭтоСписание);
			ПараметрыЗакрытия.Вставить("Номенклатура", ВыбраннаяНоменклатура);
			МассивСтрок = Новый Массив;
			Для Каждого СтрТаб из ТабНовойНоменклатуры Цикл 
				МассивСтрок.Добавить(СтрТаб);
			КонецЦикла;
			ПараметрыЗакрытия.Вставить(МассивСтрок); 
			ЗакрытьФорму = Истина;
			Закрыть(ПараметрыЗакрытия); 
		Иначе 
			ПараметрыЗакрытия = Неопределено;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	Если не ЗакрытьФорму Тогда 
		Отказ = Истина;
		ОповещениеВопросПродолжение = Новый ОписаниеОповещения("ПередЗакрытиемВопросПродолжение",ЭтаФорма,);
		ПоказатьВопрос(ОповещениеВопросПродолжение,"Сохранить изменения?",РежимДиалогаВопрос.ДаНет,);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемВопросПродолжение(Результат,ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ЗаписатьСтрокиВРегистр = Истина;
	Иначе 
		ЗаписатьСтрокиВРегистр = Ложь;     
	КонецЕсли; 
	ЗакрытьФорму = Истина; 
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗаписатьСтрокиВРегистр",Ложь);
	ПараметрыЗакрытия.Вставить("ЭтоСписание",ЭтоСписание);
	ПараметрыЗакрытия.Вставить("ИмяДерева",ИмяДерева);
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьСтроки(Команда)       
	
	СтруктураДанныхСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, ВариантОбеспечения, Количество, КоличествоУпаковок, Назначение, КатегорияМатериала, Остаток, Склад, СтатьяКалькуляции, Упаковка, ДатаОтгрузки, КлючСвязиСпецификация, Подразделение");
	
	Для Каждого СтрТаб из ТабНовойНоменклатуры Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки,СтрТаб);
		ДобавитьСтрокуВРегистр(СтруктураДанныхСтроки, ЭтоСписание);
	КонецЦикла; 
	ЗаписатьСтрокиВРегистр = Ложь;  
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗаписатьСтрокиВРегистр",ЗаписатьСтрокиВРегистр);
	ПараметрыЗакрытия.Вставить("ЭтоСписание",ЭтоСписание);
	ПараметрыЗакрытия.Вставить("ИмяДерева",ИмяДерева); 
	ПараметрыЗакрытия.Вставить("Номенклатура", ВыбраннаяНоменклатура);
	ЗакрытьФорму = Истина;
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры  

&НаСервере
Процедура ДобавитьСтрокуВРегистр(СтрокаДерева,ЭтоСписание)
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Номенклатура.Установить(СтрокаДерева.Номенклатура); 
	НЗ.Отбор.ЭтапПроизводства.Установить(СтрокаДерева.ЭтапПроизводства);
	НЗ.Отбор.ВариантОбеспечения.Установить(СтрокаДерева.ВариантОбеспечения);
	НЗ.Отбор.КлючСвязиСпецификация.Установить(СтрокаДерева.КлючСвязиСпецификация);
	НЗ.Прочитать();
	НоваяСтрока = НЗ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДерева);
	НоваяСтрока.Пользователь = Пользователи.АвторизованныйПользователь();   
	НоваяСтрока.ЭтоСписание = ЭтоСписание;
	НоваяСтрока.ЕдиницаИзмерения = СтрокаДерева.Номенклатура.ЕдиницаИзмерения;
	НоваяСтрока.Обеспечить = СтрокаДерева.Количество;
	Если НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению или НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда 
		НоваяСтрока.Назначение = СтрокаДерева.Назначение;
		НоваяСтрока.Обособленно = Истина;
	КонецЕсли;     
	//+22.08.22
	НоваяСтрока.ДатаОтгрузки = СтрокаДерева.ДатаОтгрузки;
	НоваяСтрока.ПериодЗатрат = КонецМесяца(СтрокаДерева.ДатаОтгрузки);    
	//-22.08.22
	//НоваяСтрока.Количество = СтрокаДерева.Количество;
	//НоваяСтрока.КоличествоУпаковок = СтрокаДерева.КоличествоУпаковок;
	
	//НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;
	НоваяСтрока.ОтборПоВариантамОбеспечения = УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(НоваяСтрока.ВариантОбеспечения);
	НЗ.Записать();
	
КонецПроцедуры      

&НаСервере
Функция УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспечения)
	Если ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению или ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда 
		Возврат 1; //3;
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
		Возврат 2;
	//ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно Тогда 
	//	Возврат 1;	
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда 
		Возврат 4;
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
		Возврат 5;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ТабНовойНоменклатурыКоличествоПриИзменении(Элемент)
	ТекСтр = Элементы.ТабНовойНоменклатуры.ТекущиеДанные;      
	ТекСтр.КоличествоУпаковок = ТекСтр.Количество; 
КонецПроцедуры
