//////////////////////////////////////////////////////////////////////
#Область ОбработчикСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЭтоСписание = Параметры.ЭтоСписание;
	//ИмяДерева = Параметры.ИмяДерева;    
	Для Каждого Этап из Параметры.МассивЭтапов Цикл 
		МассивЭтапов.Добавить(Этап);
	КонецЦикла;            
	
	ТабЭтапы = Неопределено;
	Если Параметры.Свойство("АдресХранилищаТабЭтапы") Тогда 
		ТабЭтапы = ПолучитьИзВременногоХранилища(Параметры.АдресХранилищаТабЭтапы);
		Если не ТабЭтапы.Количество() > 0 Тогда 
			ТабЭтапы = Неопределено;
		КонецЕсли; 
	КонецЕсли;   
	
	Если ТабЭтапы = Неопределено Тогда 
		Сообщить("Таблица этапов не заполнена!");
		Возврат;
	КонецЕсли;
		
	
	ВыбраннаяНоменклатура = Параметры.Номенклатура;
	ЗакрытьФорму = Ложь;
	ЗаписатьСтрокиВРегистр = Ложь;
	ТабНоменклатуры = РеквизитФормыВЗначение("ТабНовойНоменклатуры", Тип("ТаблицаЗначений"));
	
	Если Параметры.Свойство("МассивЭтапов") Тогда 
		Для Каждого СтрЭтап из Параметры.МассивЭтапов Цикл 
			НоваяСтрока = ТабНоменклатуры.Добавить();  
			НоваяСтрока.Отметка = Истина;
			НоваяСтрока.Номенклатура = ?(Параметры.Свойство("Номенклатура"),Параметры.Номенклатура,Справочники.Номенклатура.ПустаяСсылка());
			НоваяСтрока.Упаковка = Параметры.Номенклатура.ЕдиницаИзмерения;
			НоваяСтрока.ЭтапПроизводства = СтрЭтап;
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
			НоваяСтрока.Обособленно = Истина;
			НоваяСтрока.ОтборПоВариантамОбеспечения = 1;
			НоваяСтрока.КоличествоУпаковок = 1;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.КатегорияМатериала = ПолучитьКатегориюМатериала(НоваяСтрока.Номенклатура, Параметры.ДР_КатегорияМатериала);
			
			
			//НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(НоваяСтрока.Номенклатура, Параметры.Склад, МассивЭтапов);
			НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(НоваяСтрока.Номенклатура, Параметры.Склад, МассивЭтапов, ТабЭтапы, Объект.Резерв);
			
			НоваяСтрока.Склад = Параметры.Склад; ////?(Параметры.Свойство("Склад"),Параметры.Склад,Справочники.Склады.ПустаяСсылка());
			НоваяСтрока.Назначение = ПолучитьНазначение(НоваяСтрока.ЭтапПроизводства);
			НоваяСтрока.НазначениеОбеспечения = ПолучитьНазначение(НоваяСтрока.ЭтапПроизводства);
			НоваяСтрока.СтатьяКалькуляции = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные материалы");
			НоваяСтрока.ДатаОтгрузки = Параметры.ДатаОтгрузки;
			НоваяСтрока.КлючСвязиСпецификация = Параметры.КлючСвязиСпецификация;
			НоваяСтрока.Подразделение = Параметры.Склад.Подразделение;  
			НоваяСтрока.Запланировано = ПолучитьКоличествоЗапланировано(НоваяСтрока.ЭтапПроизводства);
			//НоваяСтрока.Спецификация = СтрЭтап.Спецификация;
		КонецЦикла;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТабНоменклатуры,"ТабНовойНоменклатуры");
	УстановитьЦветДекорации();
КонецПроцедуры


//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)    
//	
//	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
//	ЭтоСписание = Параметры.ЭтоСписание;
//	//ИмяДерева = Параметры.ИмяДерева;    
//	Для Каждого Этап из Параметры.МассивЭтапов Цикл 
//		МассивЭтапов.Добавить(Этап);
//	КонецЦикла;
//	
//	ВыбраннаяНоменклатура = Параметры.Номенклатура;
//	ЗакрытьФорму = Ложь;
//	ЗаписатьСтрокиВРегистр = Ложь;
//	ТабНоменклатуры = РеквизитФормыВЗначение("ТабНовойНоменклатуры", Тип("ТаблицаЗначений"));
//	
//	//11.06.2025
//	Если Параметры.Свойство("СпецификацииЭтапов") Тогда 
//		СпецификацииЭтапов = Параметры.СпецификацииЭтапов;
//	Иначе     
//		СпецификацииЭтапов = Новый Массив;
//		СпецификацииЭтапов.Добавить(ПредопределенноеЗначение("Справочник.РесурсныеСпецификации.ПустаяСсылка"));
//		Сообщить("Спецификация не указана! Нормативы не будут рассчитаны!");
//		//Возврат;
//	КонецЕсли;
//	//-
//	
//	Если Параметры.Свойство("МассивЭтапов") Тогда 
//		Для Каждого СтрЭтап из Параметры.МассивЭтапов Цикл 
//			НоваяСтрока = ТабНоменклатуры.Добавить();  
//			НоваяСтрока.Отметка = Истина;
//			НоваяСтрока.Номенклатура = ?(Параметры.Свойство("Номенклатура"),Параметры.Номенклатура,Справочники.Номенклатура.ПустаяСсылка());
//			НоваяСтрока.Упаковка = Параметры.Номенклатура.ЕдиницаИзмерения;
//			НоваяСтрока.ЭтапПроизводства = СтрЭтап;
//			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
//			НоваяСтрока.Обособленно = Истина;
//			НоваяСтрока.ОтборПоВариантамОбеспечения = 1;
//			НоваяСтрока.КоличествоУпаковок = 1;
//			НоваяСтрока.Количество = 1;
//			НоваяСтрока.КатегорияМатериала = ПолучитьКатегориюМатериала(НоваяСтрока.Номенклатура, Параметры.ДР_КатегорияМатериала);
//			//11.06.2025
//			//НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(НоваяСтрока.Номенклатура, Параметры.Склад, МассивЭтапов);
//			НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(НоваяСтрока.Номенклатура, Параметры.Склад, Параметры.МассивЭтапов, Параметры.СпецификацииЭтапов, ЭтоСписание);
//			//-
//			НоваяСтрока.Склад = Параметры.Склад; ////?(Параметры.Свойство("Склад"),Параметры.Склад,Справочники.Склады.ПустаяСсылка());
//			НоваяСтрока.Назначение = ПолучитьНазначение(НоваяСтрока.ЭтапПроизводства);
//			НоваяСтрока.НазначениеОбеспечения = ПолучитьНазначение(НоваяСтрока.ЭтапПроизводства);
//			НоваяСтрока.СтатьяКалькуляции = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Покупные материалы");
//			НоваяСтрока.ДатаОтгрузки = Параметры.ДатаОтгрузки;
//			НоваяСтрока.КлючСвязиСпецификация = Параметры.КлючСвязиСпецификация;
//			НоваяСтрока.Подразделение = Параметры.Склад.Подразделение;  
//			НоваяСтрока.Запланировано = ПолучитьКоличествоЗапланировано(НоваяСтрока.ЭтапПроизводства);
//			//НоваяСтрока.Спецификация = СтрЭтап.Спецификация;
//		КонецЦикла;
//	КонецЕсли;
//	
//	ЗначениеВРеквизитФормы(ТабНоменклатуры,"ТабНовойНоменклатуры");
//	УстановитьЦветДекорации();
//КонецПроцедуры

&НаКлиенте
Процедура ТабНовойНоменклатурыПриИзменении(Элемент)
	УстановитьЦветДекорации();
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветДекорации()
	ЦветОтображения = ?(ТабНовойНоменклатуры.Количество() = 0, WebЦвета.Красный, WebЦвета.Зеленый);
	Элементы.МатериалПодобран.ЦветТекста = ЦветОтображения;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемВопросПродолжение(ОтветПользователя, ДополнительныеПараметры) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗаписатьСтрокиВРегистр", Ложь);
	ПараметрыЗакрытия.Вставить("ЭтоСписание", ЭтоСписание);	 
	//ПараметрыЗакрытия.Вставить("ИмяДерева",ИмяДерева);
	
	ЗакрытьФорму = Истина;
	Закрыть(ПараметрыЗакрытия); 
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)	
	Если Не ЗакрытьФорму Тогда 
		Отказ = Истина;
		ОповещениеВопросПродолжение = Новый ОписаниеОповещения("ПередЗакрытиемВопросПродолжение", ЭтаФорма);
		ПоказатьВопрос(ОповещениеВопросПродолжение, "Данные будут потеряны, продолжить?", РежимДиалогаВопрос.ДаНет,);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗакрытьФорму Тогда		
		Если ЗаписатьСтрокиВРегистр Тогда 
			ПараметрыЗакрытия = Новый Структура;
			//ПараметрыЗакрытия.Вставить("ИмяДерева",ИмяДерева); //Параметры.ИмяДерева);
			ПараметрыЗакрытия.Вставить("ЭтоСписание", ЭтоСписание); //Параметры.ЭтоСписание);
			ПараметрыЗакрытия.Вставить("Номенклатура", ВыбраннаяНоменклатура);
			ПараметрыЗакрытия.Вставить("ЗаписатьСтрокиВРегистр", ЗаписатьСтрокиВРегистр); 
			
			МассивСтрок = Новый Массив;
			
			Для Каждого СтрТаб из ТабНовойНоменклатуры Цикл
				Если не СтрТаб.Отметка Тогда 
					Продолжить;
				КонецЕсли;
				МассивСтрок.Добавить(СтрТаб);
			КонецЦикла;
			
			ПараметрыЗакрытия.Вставить("МассивСтрок", МассивСтрок); 
			ЗакрытьФорму = Истина;
			Закрыть(ПараметрыЗакрытия); 
		Иначе 
			ПараметрыЗакрытия = Неопределено;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабНовойНоменклатурыКоличествоПриИзменении(Элемент)
	ТекСтр = Элементы.ТабНовойНоменклатуры.ТекущиеДанные;      
	ТекСтр.КоличествоУпаковок = ТекСтр.Количество; 
КонецПроцедуры

#КонецОбласти


//////////////////////////////////////////////////////////////////////
#Область ВыполнениеКомадФормы

 &НаКлиенте
Процедура ДобавитьСтроки(Команда)       
	
	СтруктураДанныхСтроки = Новый Структура;
	СтруктураДанныхСтроки.Вставить("Номенклатура");
	СтруктураДанныхСтроки.Вставить("ЭтапПроизводства");
	СтруктураДанныхСтроки.Вставить("ВариантОбеспечения");
	СтруктураДанныхСтроки.Вставить("Количество");
	СтруктураДанныхСтроки.Вставить("КоличествоУпаковок");
	СтруктураДанныхСтроки.Вставить("Назначение");
	СтруктураДанныхСтроки.Вставить("НазначениеОбеспечения");
	СтруктураДанныхСтроки.Вставить("КатегорияМатериала");
	СтруктураДанныхСтроки.Вставить("Остаток");
	СтруктураДанныхСтроки.Вставить("Склад");
	СтруктураДанныхСтроки.Вставить("СтатьяКалькуляции");
	СтруктураДанныхСтроки.Вставить("Упаковка");
	СтруктураДанныхСтроки.Вставить("ДатаОтгрузки");
	СтруктураДанныхСтроки.Вставить("КлючСвязиСпецификация");
	СтруктураДанныхСтроки.Вставить("Подразделение");
	СтруктураДанныхСтроки.Вставить("Запланировано");
	СтруктураДанныхСтроки.Вставить("КлючСвязиНабор");
	СтруктураДанныхСтроки.Вставить("КлючНоменклатура");
	
	Для Каждого СтрТаб из ТабНовойНоменклатуры Цикл   
		Если не СтрТаб.Отметка Тогда 
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтруктураДанныхСтроки,СтрТаб);
		ДобавитьСтрокуВРегистр(СтруктураДанныхСтроки, ЭтоСписание);
	КонецЦикла;
	
	ЗаписатьСтрокиВРегистр = Ложь;  
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗаписатьСтрокиВРегистр",ЗаписатьСтрокиВРегистр);
	ПараметрыЗакрытия.Вставить("ЭтоСписание",ЭтоСписание);
	//ПараметрыЗакрытия.Вставить("ИмяДерева",ИмяДерева); 
	ПараметрыЗакрытия.Вставить("Номенклатура", ВыбраннаяНоменклатура);
	ЗакрытьФорму = Истина;
	Закрыть(ПараметрыЗакрытия);
КонецПроцедуры  

&НаКлиенте
Процедура ИзменитьКоличество(Команда)
	ОповещениеОбИзмененииКоличества = Новый ОписаниеОповещения("ПослеВводаЧисла", ЭтотОбъект);
    ПоказатьВводЧисла(ОповещениеОбИзмененииКоличества,, "Введите число", 3, 1);		  
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВводаЧисла(РезультатВвода, Параметры) Экспорт
 
    Если РезультатВвода = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	Для Каждого ТекМатериал Из ТабНовойНоменклатуры Цикл
		ТекМатериал.Количество = РезультатВвода;
		ТекМатериал.КоличествоУпаковок = РезультатВвода; 
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


//////////////////////////////////////////////////////////////////////
#Область ПереносВыбранныхСтрокВОсновуюФорму

&НаСервере
Функция ПолучитьКоличествоЗапланировано(ЭтапПроизводства)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапПроизводства2_2.КоличествоУпаковокПлан КАК Запланировано
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	               |ГДЕ
	               |	ЭтапПроизводства2_2.Ссылка = &Этап";
	Запрос.УстановитьПараметр("Этап",ЭтапПроизводства);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Запланировано;
	Иначе 
		Возврат 1;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьКатегориюМатериала(Номенклатура, ДопСвойство) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Владелец КАК Свойство,
	               |	ЗначенияСвойствОбъектов.Ссылка КАК КатегорияМатериала,
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |		ПО НоменклатураДополнительныеРеквизиты.Свойство = ЗначенияСвойствОбъектов.Владелец
	               |			И НоменклатураДополнительныеРеквизиты.Значение = ЗначенияСвойствОбъектов.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |	И НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Свойство",ДопСвойство);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КатегорияМатериала;
	Иначе 
		Возврат Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере 
Функция ПолучитьНазначение(ЭтапПроизводства) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Ссылка = &Этап";
	Запрос.УстановитьПараметр("Этап",ЭтапПроизводства);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Назначение;
	Иначе 
		Возврат Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуВРегистр(СтрокаДерева,ЭтоСписание)
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Номенклатура.Установить(СтрокаДерева.Номенклатура); 
	НЗ.Отбор.ЭтапПроизводства.Установить(СтрокаДерева.ЭтапПроизводства);
	НЗ.Отбор.ВариантОбеспечения.Установить(СтрокаДерева.ВариантОбеспечения);
	НЗ.Отбор.КлючСвязиСпецификация.Установить(СтрокаДерева.КлючСвязиСпецификация);
	НЗ.Прочитать();
	НоваяСтрока = НЗ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДерева);
	НоваяСтрока.Пользователь = Пользователи.АвторизованныйПользователь();   
	НоваяСтрока.ЭтоСписание = ЭтоСписание;
	НоваяСтрока.ЕдиницаИзмерения = СтрокаДерева.Номенклатура.ЕдиницаИзмерения;
	НоваяСтрока.Обеспечить = СтрокаДерева.Количество;
	Если НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению или НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда 
		НоваяСтрока.Назначение = СтрокаДерева.Назначение;
		НоваяСтрока.Обособленно = Истина;
	КонецЕсли;     
	//+22.08.22
	НоваяСтрока.ДатаОтгрузки = СтрокаДерева.ДатаОтгрузки;
	НоваяСтрока.ПериодЗатрат = КонецМесяца(СтрокаДерева.ДатаОтгрузки);    
	//-22.08.22
	//НоваяСтрока.Количество = СтрокаДерева.Количество;
	//НоваяСтрока.КоличествоУпаковок = СтрокаДерева.КоличествоУпаковок;
	
	//НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;
	НоваяСтрока.ОтборПоВариантамОбеспечения = УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(НоваяСтрока.ВариантОбеспечения);
	НЗ.Записать();
	
КонецПроцедуры      

&НаСервере
Функция УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспечения)
	Если ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению или ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда 
		Возврат 1;
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда 
		Возврат 2;	
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда 
		Возврат 3;
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
		Возврат 4;	
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
		Возврат 5;
	КонецЕсли;
КонецФункции

&НаСервере 
Функция ПолучитьОстаток(Номенклатура, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	               |	СвободныеОстаткиОстатки.ВНаличииОстаток КАК Остаток
	               |ИЗ
	               |	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
	               |ГДЕ
	               |	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
	               |	И СвободныеОстаткиОстатки.Склад = &Склад";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДатаСеанса()));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Остаток;   
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
