
//&НаСервере
//&ИзменениеИКонтроль("ЗаполнитьДоступныеПоля")
//Процедура АРМ1_ЗаполнитьДоступныеПоля()

//	УстановитьПривилегированныйРежим(Истина);

//	СхемаКомпоновкиДанных = Неопределено;
//	ШаблоныЭтикетокИЦенниковЛокализация.ПриЗаполненииСхемыКомпоновкиДанных(СхемаКомпоновкиДанных, Объект.Назначение);

//	// Заполнение доступных полей
//	Если Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляСкладскихЯчеек Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаСкладскиеЯчейки");
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаТовары");
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаТовары");
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляДоставки Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаДоставка");
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаСерииНоменклатуры Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаСерииНоменклатуры");
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУпаковочныхЛистов Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("ПоляШаблонаУпаковочныеЛисты");
//		//++ НЕ УТ

//		//++ Локализация
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаТМЦВЭксплуатацииЛента
//		ИЛИ Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаТМЦВЭксплуатацииБумага Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокТМЦВЭксплуатации.ПолучитьМакет("ПоляШаблонаТМЦВЭксплуатации");
//		//-- Локализация
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаОбъектаЭксплуатацииЛента
//		ИЛИ Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаОбъектаЭксплуатацииБумага Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокОбъектовЭксплуатации.ПолучитьМакет("ПоляШаблонаОбъектыЭксплуатации");
//		//-- НЕ УТ

//		//++ НЕ УТКА
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУзлаОбъектаЭксплуатацииЛента
//		ИЛИ Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУзлаОбъектаЭксплуатацииБумага Тогда
//		СхемаКомпоновкиДанных = Обработки.ПечатьЭтикетокУзловОбъектовЭксплуатации.ПолучитьМакет("ПоляШаблонаУзлыОбъектовЭксплуатации");
//		//-- НЕ УТКА
//	КонецЕсли;


//	ИменаПолей = Новый Массив;
//	ШаблоныЭтикетокИЦенниковЛокализация.ПриЗаполненииДоступныхПолейКомпоновкиДанных(ИменаПолей, Объект.Назначение);

//	Если Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляСкладскихЯчеек Тогда

//		ИменаПолей.Добавить("Штрихкод");

//		ИменаПолей.Добавить("Ячейка");
//		ИменаПолей.Добавить("Ячейка.Код");
//		ИменаПолей.Добавить("Ячейка.Родитель");
//		ИменаПолей.Добавить("Ячейка.Линия");
//		ИменаПолей.Добавить("Ячейка.Наименование");
//		ИменаПолей.Добавить("Ячейка.Позиция");
//		ИменаПолей.Добавить("Ячейка.ПорядокОбхода");
//		ИменаПолей.Добавить("Ячейка.РабочийУчасток");
//		ИменаПолей.Добавить("Ячейка.Секция");
//		ИменаПолей.Добавить("Ячейка.Владелец");
//		ИменаПолей.Добавить("Ячейка.Стеллаж");
//		ИменаПолей.Добавить("Ячейка.Ярус");

//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров
//		ИЛИ Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров Тогда

//		ИменаПолей.Добавить("Штрихкод");

//		ИменаПолей.Добавить("ВидЦены");
//		ИменаПолей.Добавить("ВидЦены.ВалютаЦены");
//		ИменаПолей.Добавить("ВидЦены.Наименование");
//		ИменаПолей.Добавить("ВидЦены.ЦенаВключаетНДС");
//		ИменаПолей.Добавить("Цена");
//		ИменаПолей.Добавить("ДатаПоследнегоИзмененияЦены");

//		ИменаПолей.Добавить("ВидЦеныДополнительно");
//		ИменаПолей.Добавить("ВидЦеныДополнительно.ВалютаЦены");
//		ИменаПолей.Добавить("ВидЦеныДополнительно.Наименование");
//		ИменаПолей.Добавить("ВидЦеныДополнительно.ЦенаВключаетНДС");
//		ИменаПолей.Добавить("ЦенаДополнительно");
//		ИменаПолей.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно");

//		ИменаПолей.Добавить("Номенклатура.Артикул");
//		ИменаПолей.Добавить("Номенклатура.ВариантОформленияПродажи");
//		ИменаПолей.Добавить("Номенклатура.Вес");
//		ИменаПолей.Добавить("Номенклатура.ВестиУчетПоГТД");
//		ИменаПолей.Добавить("Номенклатура.ВидНоменклатуры");
//		ИменаПолей.Добавить("Номенклатура.Родитель");
//		ИменаПолей.Добавить("Номенклатура.ЕдиницаИзмерения");
//		ИменаПолей.Добавить("Номенклатура.Код");
//		ИменаПолей.Добавить("Номенклатура.КодДляПоиска");
//		ИменаПолей.Добавить("Номенклатура.Наименование");
//		ИменаПолей.Добавить("Номенклатура.НаименованиеПолное");
//		ИменаПолей.Добавить("Номенклатура.Объем");
//		ИменаПолей.Добавить("Номенклатура.Производитель");
//		ИменаПолей.Добавить("Номенклатура.Описание");
//		ИменаПолей.Добавить("Номенклатура.ТипНоменклатуры");
//		ИменаПолей.Добавить("Номенклатура,Свойства");

//		ИменаПолей.Добавить("Характеристика.Наименование");
//		ИменаПолей.Добавить("Характеристика.НаименованиеПолное");
//		ИменаПолей.Добавить("Характеристика.Владелец");
//		ИменаПолей.Добавить("Характеристика,Свойства");

//		ИменаПолей.Добавить("Весовой");
//		ИменаПолей.Добавить("КодПодключаемогоОборудованияOffline");
//		ИменаПолей.Добавить("PLU");
//		ИменаПолей.Добавить("Организация");
//		ИменаПолей.Добавить("ТекущееВремя");
//		ИменаПолей.Добавить("ТекущийПользователь");
//		ИменаПолей.Добавить("УпаковкаЕдиницаИзмерения");
//		ИменаПолей.Добавить("СтавкаНДС");

//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляДоставки Тогда

//		ИменаПолей.Добавить("ВесНакладной");
//		ИменаПолей.Добавить("ЕдиницаИзмеренияВеса");
//		ИменаПолей.Добавить("ЕдиницаИзмеренияОбъема");
//		ИменаПолей.Добавить("КоличествоПозиций");
//		ИменаПолей.Добавить("ОбъемНакладной");
//		ИменаПолей.Добавить("Распоряжение,Свойства");

//		ИменаПолей.Добавить("Распоряжение.Автор");
//		ИменаПолей.Добавить("Распоряжение.АдресДоставки");
//		ИменаПолей.Добавить("Распоряжение.БанковскийСчетГрузоотправителя");
//		ИменаПолей.Добавить("Распоряжение.БанковскийСчетГрузополучателя");
//		ИменаПолей.Добавить("Распоряжение.БанковскийСчетКонтрагента");
//		ИменаПолей.Добавить("Распоряжение.БанковскийСчетОрганизации");
//		ИменаПолей.Добавить("Распоряжение.Валюта");
//		ИменаПолей.Добавить("Распоряжение.ВалютаВзаиморасчетов");
//		ИменаПолей.Добавить("Распоряжение.ВидЦены");
//		ИменаПолей.Добавить("Распоряжение.ВидыЗапасов");
//		ИменаПолей.Добавить("Распоряжение.Грузоотправитель");
//		ИменаПолей.Добавить("Распоряжение.Грузополучатель");
//		ИменаПолей.Добавить("Распоряжение.Дата");
//		ИменаПолей.Добавить("Распоряжение.ДоверенностьДата");
//		ИменаПолей.Добавить("Распоряжение.ДатаПлатежа");
//		ИменаПолей.Добавить("Распоряжение.Договор");
//		ИменаПолей.Добавить("Распоряжение.ОтпустилДолжность");
//		ИменаПолей.Добавить("Распоряжение.КартаЛояльности");
//		ИменаПолей.Добавить("Распоряжение.Касса");
//		ИменаПолей.Добавить("Распоряжение.ДоверенностьВыдана");
//		ИменаПолей.Добавить("Распоряжение.Партнер,Свойства");
//		ИменаПолей.Добавить("Распоряжение.Комментарий");
//		ИменаПолей.Добавить("Распоряжение.ДоверенностьЛицо");
//		ИменаПолей.Добавить("Распоряжение.Менеджер");
//		ИменаПолей.Добавить("Распоряжение.НалогообложениеНДС");
//		ИменаПолей.Добавить("Распоряжение.Номер");
//		ИменаПолей.Добавить("Распоряжение.ДоверенностьНомер");
//		ИменаПолей.Добавить("Распоряжение.ХозяйственнаяОперация");
//		ИменаПолей.Добавить("Распоряжение.Организация");
//		ИменаПолей.Добавить("Распоряжение.Основание");
//		ИменаПолей.Добавить("Распоряжение.Ответственный");
//		ИменаПолей.Добавить("Распоряжение.Отпустил");
//		ИменаПолей.Добавить("Распоряжение.Подразделение");
//		ИменаПолей.Добавить("Распоряжение.Склад");
//		ИменаПолей.Добавить("Распоряжение.СкладОтправитель");
//		ИменаПолей.Добавить("Распоряжение.СкладПолучатель");
//		ИменаПолей.Добавить("Распоряжение.Согласован");
//		ИменаПолей.Добавить("Распоряжение.Соглашение");
//		ИменаПолей.Добавить("Распоряжение.СуммаВзаиморасчетов");
//		ИменаПолей.Добавить("Распоряжение.СуммаДокумента");
//		ИменаПолей.Добавить("Распоряжение.ФормаОплаты");
//		ИменаПолей.Добавить("Распоряжение.ЦенаВключаетНДС");

//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаСерииНоменклатуры Тогда

//		ИменаПолей.Добавить("Штрихкод");
//		ИменаПолей.Добавить("Серия.ВидНоменклатуры");
//		ИменаПолей.Добавить("Серия.ГоденДо");
//		ИменаПолей.Добавить("Серия.Наименование");
//		ИменаПолей.Добавить("Серия.Номер");
//		ИменаПолей.Добавить("Серия,Свойства");

//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУпаковочныхЛистов Тогда

//		ИменаПолей.Добавить("Штрихкод");
//		ИменаПолей.Добавить("Код");
//		ИменаПолей.Добавить("Основание");

//		ИменаПолей.Добавить("УпаковочныйЛист.Код");
//		ИменаПолей.Добавить("УпаковочныйЛист.СкладУпаковки");
//		ИменаПолей.Добавить("УпаковочныйЛист.Вид");
//		ИменаПолей.Добавить("УпаковочныйЛист.Упаковал");
//		ИменаПолей.Добавить("УпаковочныйЛист.Основание");
//		ИменаПолей.Добавить("УпаковочныйЛист.Комментарий");
//		ИменаПолей.Добавить("УпаковочныйЛист.ВсегоМест");

//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаТМЦВЭксплуатацииЛента
//		ИЛИ Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаТМЦВЭксплуатацииБумага Тогда

//		ИменаПолей = Новый Массив;
//		ИменаПолей.Добавить("ИнвентарныйНомер");

//		ИменаПолей.Добавить("Номенклатура.Артикул");
//		ИменаПолей.Добавить("Номенклатура.ВариантОформленияПродажи");
//		ИменаПолей.Добавить("Номенклатура.Вес");
//		ИменаПолей.Добавить("Номенклатура.ВестиУчетПоГТД");
//		ИменаПолей.Добавить("Номенклатура.ВидНоменклатуры");
//		ИменаПолей.Добавить("Номенклатура.Родитель");
//		ИменаПолей.Добавить("Номенклатура.ЕдиницаИзмерения");
//		ИменаПолей.Добавить("Номенклатура.Код");
//		ИменаПолей.Добавить("Номенклатура.КодДляПоиска");
//		ИменаПолей.Добавить("Номенклатура.Наименование");
//		ИменаПолей.Добавить("Номенклатура.НаименованиеПолное");
//		ИменаПолей.Добавить("Номенклатура.Объем");
//		ИменаПолей.Добавить("Номенклатура.Производитель");
//		ИменаПолей.Добавить("Номенклатура.Описание");
//		ИменаПолей.Добавить("Номенклатура.ТипНоменклатуры");
//		ИменаПолей.Добавить("Номенклатура,Свойства");

//		ИменаПолей.Добавить("Характеристика.Наименование");
//		ИменаПолей.Добавить("Характеристика.НаименованиеПолное");
//		ИменаПолей.Добавить("Характеристика.Владелец");
//		ИменаПолей.Добавить("Характеристика,Свойства");

//		ИменаПолей.Добавить("Серия.Наименование");
//		ИменаПолей.Добавить("Серия.ГоденДо");
//		ИменаПолей.Добавить("Серия.Номер");
//		ИменаПолей.Добавить("Серия,Свойства");

//		ИменаПолей.Добавить("Партия.Наименование");
//		ИменаПолей.Добавить("Партия.КатегорияЭксплуатации");
//		ИменаПолей.Добавить("Партия.СрокЭксплуатации");
//		ИменаПолей.Добавить("Партия.ДатаНачалаЭксплуатации");
//		ИменаПолей.Добавить("Партия.ДатаЗавершенияЭксплуатации");

//		//++ НЕ УТ
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаОбъектаЭксплуатацииЛента
//		ИЛИ Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаОбъектаЭксплуатацииБумага Тогда

//		ИменаПолей = Новый Массив;
//		ИменаПолей.Добавить("Штрихкод");

//		ИменаПолей.Добавить("ОбъектЭксплуатации");
//		ИменаПолей.Добавить("ОбъектЭксплуатации.НаименованиеПолное");
//		ИменаПолей.Добавить("ОбъектЭксплуатации.ИнвентарныйНомер");

//		//-- НЕ УТ

//		//++ НЕ УТКА
//	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУзлаОбъектаЭксплуатацииЛента
//		ИЛИ Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУзлаОбъектаЭксплуатацииБумага Тогда

//		ИменаПолей = Новый Массив;
//		ИменаПолей.Добавить("Штрихкод");

//		ИменаПолей.Добавить("Узел");
//		ИменаПолей.Добавить("Узел.НаименованиеПолное");
//		ИменаПолей.Добавить("Узел.Класс");
//		ИменаПолей.Добавить("Узел.Подкласс");
//		ИменаПолей.Добавить("Узел.Модель");
//		ИменаПолей.Добавить("Узел.СерийныйНомер");
//		ИменаПолей.Добавить("Узел.Штрихкод");

//		//-- НЕ УТКА
//	КонецЕсли;

//	ДеревоОперандов = РаботаСФормулами.ПолучитьПустоеДеревоОперандов();

//	Если НЕ СхемаКомпоновкиДанных = Неопределено Тогда

//		ОграниченияРазвертки = ОграниченияРазверткиПоИменамПолей(ИменаПолей, "");
//		РаботаСФормулами.ДобавитьВДеревоДоступныеПоляПоСхемеКомпоновки(ДеревоОперандов, СхемаКомпоновкиДанных, ОграниченияРазвертки);

//		РекурсивноРазвернутьСтрокиДереваСУчетомОграниченийПолей(ДеревоОперандов, ИменаПолей, "");
//	КонецЕсли;

//	УстановитьПривилегированныйРежим(Ложь);

//	РаботаСФормулами.ЗагрузитьДеревоОперандовВДеревоФормы(ДоступныеПоляКомпоновкиДанных, ДеревоОперандов);

//КонецПроцедуры
	  
