#Область ОткрытиеФормыСоСпискомИВыбор

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыгруженныеЗаказы = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
	
	//Вызов серверной функции из модуля объекта
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	СгруппированныеЗаказы = ТекущийОбъект.ГруппировкаЗаказовСВыпуском(ВыгруженныеЗаказы);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СгруппированныеЗаказы, СписокЗаказовРеализации);
		
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыборОбработан = ОбработкаВыбораИзФормыСпискаЗаказов();
	
	Если Не ВыборОбработан Тогда
		Возврат
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
КонецПроцедуры

//Обработка выбора заказа при двойном клике мыши
&НаКлиенте
Процедура СписокЗаказовРеализацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборОбработан = ОбработкаВыбораИзФормыСпискаЗаказов();
	
	Если НЕ ВыборОбработан Тогда
		Возврат;
	КонецЕсли;

	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
функция ОбработкаВыбораИзФормыСпискаЗаказов(Знач ВыборОбработан = Ложь)
	МассивВыбранныхСтрок = Элементы.СписокЗаказовРеализации.ВыделенныеСтроки;
	
	Если МассивВыбранныхСтрок.Количество() > 1 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выбор из списка доступен только в количестве 1 заказа'"));
		Возврат ВыборОбработан;
	КонецЕсли;
	
	ВыбраннаяСтрока = Элементы.СписокЗаказовРеализации.ТекущиеДанные;
	Оповестить("ВыбранныйЗаказ", ВыбраннаяСтрока);	
	ВыборОбработан = Истина;
	
	Возврат ВыборОбработан;
КонецФункции

#КонецОбласти