
////////////////////////////////////////////////////////////////////
#Область ТТМ_АРМ_ТехпроцессГлобальныеПеременные

&НаКлиенте
Перем ТекСтрокаСтруктура;  

&НаСервере
Перем КОтгрузке;

#КонецОбласти


////////////////////////////////////////////////////////////////////
#Область ТТМ_АРМ_ТехпроцессРаботаСДеревом

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьУсловноеОформление();
	
	Если ЗначениеЗаполнено(Объект.ПроизводственноеПодразделение) Тогда				
		ИмяДерева = "ДеревоВыпуска";
		МассивВРЦ = ПолучитьВидыРабочихЦентров(Объект.ПроизводственноеПодразделение);  
		
		СоздатьРеквизитФормыДеревоВыпуска(ИмяДерева, МассивВРЦ);
		СоздатьЭлементыДереваНаФорме(МассивВРЦ);
	КонецЕсли;    
	Элементы.ОформитьВыпуск.Видимость = РольДоступна("АРМ_Выпуск_Реализация");
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ, СтандартнаяОбработка)
	
	ПроизводственноеПодразделениеТТМ = ПолучитьСсылкуНаПроизводственноеПодразделениеТТМ();
	
	Если ПроизводственноеПодразделениеТТМ = Неопределено Тогда
		Объект.ПроизводственноеПодразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
		Возврат;
	Иначе
		Объект.ПроизводственноеПодразделение = ПроизводственноеПодразделениеТТМ;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПроизводственноеПодразделение) Или Объект.ПроизводственноеПодразделение = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите подразделение'"),, "Объект.ПроизводственноеПодразделение");
		Возврат;
	КонецЕсли;    
	
	ИсполнительПередИзменением = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	КомментарийДоИзменения = "";
		
	ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение, Новый Структура);
	РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаПроизводственноеПодразделениеТТМ()
	
	ПроизводственноеПодразделениеТТМ = Справочники.СтруктураПредприятия.НайтиПоНаименованию("Производственное подразделение ТТМ");
	
	Если ПроизводственноеПодразделениеТТМ.Пустая() Тогда
		ПроизводственноеПодразделениеТТМ = Неопределено;
	КонецЕсли;
	
	Возврат ПроизводственноеПодразделениеТТМ;
	
КонецФункции

&НаСервере
Функция ПолучитьВидыРабочихЦентров(ПроизводственноеПодразделение)
		
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ТехнологическиеОперации.РабочийЦентр) = ТИП(Справочник.РабочиеЦентры)
	               |			ТОГДА ТехнологическиеОперации.РабочийЦентр.ВидРабочегоЦентра
	               |		ИНАЧЕ ТехнологическиеОперации.РабочийЦентр
	               |	КОНЕЦ КАК ВидыРабочихЦентров
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	               |		ПО ЭтапПроизводства2_2.Спецификация = ТехнологическиеОперации.Спецификация
	               |ГДЕ
	               |	НЕ ТехнологическиеОперации.ПометкаУдаления
	               |	И ЭтапПроизводства2_2.Проведен
	               |	И ЭтапПроизводства2_2.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
	               |	И ЭтапПроизводства2_2.Подразделение = &Подразделение
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТехнологическиеОперации.НомерОперации,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ТехнологическиеОперации.РабочийЦентр) = ТИП(Справочник.РабочиеЦентры)
	               |			ТОГДА ТехнологическиеОперации.РабочийЦентр.ВидРабочегоЦентра
	               |		ИНАЧЕ ТехнологическиеОперации.РабочийЦентр
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТехнологическиеОперации.НомерОперации";
	Запрос.УстановитьПараметр("Подразделение",ПроизводственноеПодразделение);   
	ТЗ_ВРЦ = Запрос.Выполнить().Выгрузить();
	ТЗ_ВРЦ.Свернуть("ВидыРабочихЦентров");                                    
	//СтруктураСтроки = Новый Структура("ВидыРабочихЦентров");
	//МассивСтрокТЗВРЦ = Новый Массив;
	//Для Каждого Стр из ТЗ_ВРЦ Цикл 
	//	ЗаполнитьЗначенияСвойств(СтруктураСтроки,Стр);
	//	МассивСтрокТЗВРЦ.Добавить(СтруктураСтроки);
	//КонецЦикла;
	
	//МассивВидовРабочихЦентров = ТЗ_ВРЦ.ВыгрузитьКолонку("ВидыРабочихЦентров");
	
	
	//ЗначениеВРеквизитФормы(ТЗ_ВРЦ,"ТабВидыРабочихЦентров");
	Возврат ТЗ_ВРЦ.ВыгрузитьКолонку("ВидыРабочихЦентров");
	
КонецФункции  

&НаСервере
Процедура ПолучитьВидыРабочихЦентровВТЗ(ПроизводственноеПодразделение)
		
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическиеОперации.РабочийЦентр КАК ВидыРабочихЦентров
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	               |		ПО ЭтапПроизводства2_2.Спецификация = ТехнологическиеОперации.Спецификация
	               |ГДЕ
	               |	НЕ ТехнологическиеОперации.ПометкаУдаления
	               |	И ЭтапПроизводства2_2.Проведен
	               |	И ЭтапПроизводства2_2.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
				   |	И ЭтапПроизводства2_2.Подразделение = &Подразделение
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТехнологическиеОперации.РабочийЦентр,
	               |	ТехнологическиеОперации.НомерОперации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТехнологическиеОперации.НомерОперации";
	Запрос.УстановитьПараметр("Подразделение",ПроизводственноеПодразделение);   
	ТЗ_ВРЦ = Запрос.Выполнить().Выгрузить();
	ТЗ_ВРЦ.Свернуть("ВидыРабочихЦентров");                                    
	//СтруктураСтроки = Новый Структура("ВидыРабочихЦентров");
	//МассивСтрокТЗВРЦ = Новый Массив;
	//Для Каждого Стр из ТЗ_ВРЦ Цикл 
	//	ЗаполнитьЗначенияСвойств(СтруктураСтроки,Стр);
	//	МассивСтрокТЗВРЦ.Добавить(СтруктураСтроки);
	//КонецЦикла;
	
	//МассивВидовРабочихЦентров = ТЗ_ВРЦ.ВыгрузитьКолонку("ВидыРабочихЦентров");
	
	
	ЗначениеВРеквизитФормы(ТЗ_ВРЦ,"ТабВидыРабочихЦентров");
	//Возврат ТЗ_ВРЦ;
	
КонецПроцедуры
	
&НаСервере
//БезКонтекста      
Процедура ОбновитьДанныеПланаПроизводства(ПроизводственноеПодразделение, ДополнительныеПараметры)
	
	МассивВРЦ = ПолучитьВидыРабочихЦентров(Объект.ПроизводственноеПодразделение);
	
	ЗапросИсполнениеПлана = Новый Запрос;
	ТекстЗапроса = ПолучитьТекстЗапросаИсполнениеПлана(МассивВРЦ);
	
	ЗапросИсполнениеПлана.Текст = ТекстЗапроса;
	ЗапросИсполнениеПлана.УстановитьПараметр("Подразделение", ПроизводственноеПодразделение);	
	//ЗапросИсполнениеПлана.УстановитьПараметр("ДопСвойствоИсполнитель", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ОтветственныйСотрудник_cd8e5a889b84479689186f49871bc700"));  //Test_erp
	//ЗапросИсполнениеПлана.УстановитьПараметр("ДопСвойствоИсполнитель", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ОтветственныйСотрудник_48e5aa6132c14318829fa01aa2d6db36")); //Test_Lena
	ЗапросИсполнениеПлана.УстановитьПараметр("ДопСвойствоИсполнитель", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ОтветственныйСотрудник_62538974ec0a491d811c29d4c48914c6")); //Раброчая
	
	//ЗапросИсполнениеПлана.УстановитьПараметр("ДопСвойствоКомментарий", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ТТМКомментарийКЭтапу_b08d8ab178a947f4a2fe40f66f6d146d")); //Test_Lena
	ЗапросИсполнениеПлана.УстановитьПараметр("ДопСвойствоКомментарий", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ТТМКомментарийКЭтапу_53d161b8457f4c33972f8c3f5f7fc5d1")); //Рабочая
	//ЗапросИсполнениеПлана.УстановитьПараметр("ИмяКолонки","Технолог");
	
	////////////////////////////////////////////////////////////////////////
	//Отборы   
	
	Если Объект.ОтборПериод.ДатаНачала <> Дата(1, 1, 1) Тогда
		ЗапросИсполнениеПлана.УстановитьПараметр("ОтборДатаНачала", Объект.ОтборПериод.ДатаНачала);
	КонецЕсли;
	
	Если Объект.ОтборПериод.ДатаОкончания <> Дата(1, 1, 1) Тогда 
		ЗапросИсполнениеПлана.УстановитьПараметр("ОтборДатаОкончания", Объект.ОтборПериод.ДатаОкончания);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборНазначение) Тогда 
		ЗапросИсполнениеПлана.УстановитьПараметр("ОтборНазначение", Объект.ОтборНазначение);
	КонецЕсли;     
	
	Если ЗначениеЗаполнено(Объект.ОтборИзделие) Тогда 
		ЗапросИсполнениеПлана.УстановитьПараметр("ОтборИзделие", Объект.ОтборИзделие);
	КонецЕсли;
		
	////////////////////////////////////////////////////////////////////////
	
	РезультатЗапроса = ЗапросИсполнениеПлана.Выполнить(); //ВыполнитьПакет();
	ДЗПланПроизводства = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);     
	
	ПроверитьУдалитьРеквизитыФормфы();
	
	ИмяДерева = "ДеревоВыпуска";
	СоздатьРеквизитФормыДеревоВыпуска(ИмяДерева, МассивВРЦ);    
	СоздатьЭлементыДереваНаФорме(МассивВРЦ);
	//ЗаполнитьКодТМДляСтрокПланаВыпуска(ДЗПланПроизводства);
	
	УстановитьУсловноеОформлениеДерева(ДЗПланПроизводства, ИмяДерева);
	
	ЗначениеВРеквизитФормы(ДЗПланПроизводства,"ДеревоВыпуска");    
	
	Если ДополнительныеПараметры.Свойство("СтруктураОтбораПартии") <> Неопределено Тогда 
		УстановитьТекущуюСтрокуДереваВыпуска(ДополнительныеПараметры);	
	КонецЕсли;
	
	///////////////////////////////
	//Заполним таблицу этапов
	
	ТекстЗапросаПлан = ПолучитьТекстЗапросаПланВыпуска();
	ЗапросПлан = Новый Запрос;
	ЗапросПлан.Текст = ТекстЗапросаПлан;
	ЗапросПлан.УстановитьПараметр("Подразделение", ПроизводственноеПодразделение);
	ЗапросПлан.УстановитьПараметр("СвойствоКодТМ",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","КодТМ_ТТМ"));
	
	////////////////////////////////////////////////////////////////////////
	//Отборы   
	Если Объект.ОтборПериод.ДатаНачала <> Дата(1, 1, 1) Тогда
		ЗапросПлан.УстановитьПараметр("ОтборДатаНачала", Объект.ОтборПериод.ДатаНачала);
	КонецЕсли;
	Если Объект.ОтборПериод.ДатаОкончания <> Дата(1, 1, 1) Тогда 
		ЗапросПлан.УстановитьПараметр("ОтборДатаОкончания", Объект.ОтборПериод.ДатаОкончания);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборНазначение) Тогда 
		ЗапросПлан.УстановитьПараметр("ОтборНазначение", Объект.ОтборНазначение);
	КонецЕсли;     
	Если ЗначениеЗаполнено(Объект.ОтборИзделие) Тогда 
		ЗапросПлан.УстановитьПараметр("ОтборИзделие", Объект.ОтборИзделие);
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////
	
	ТабПлан = ЗапросПлан.Выполнить().Выгрузить();
	//ЗаполнитьСерийныеНомераТабПлана(ТабПлан);
	
	ЗначениеВРеквизитФормы(ТабПлан, "ТабПланПроизводства");
	ПолучитьЗначениеРеквизитаДопСведений();
	
КонецПроцедуры   

&НаСервере
Процедура ПроверитьУдалитьРеквизитыФормфы()
	
	МассивРеквизитовФормы = ПолучитьРеквизиты(); //ЭтаФорма.ПолучитьРеквизиты();   
	МассивУдаляемыхРеквизитов = Новый Массив;
	Для Каждого РФ из МассивРеквизитовФормы Цикл 
		Если РФ.Имя = "ДеревоВыпуска" Тогда 
			МассивУдаляемыхРеквизитов.Добавить(РФ.Имя);
			ЭФ = Элементы.Найти("ДеревоВыпуска");  
			Если не ЭФ = Неопределено Тогда 
				Элементы.Удалить(ЭФ);
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов); 
	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапросаИсполнениеПлана(МассивВРЦ) 
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДополнительныеСведения.Объект КАК ЭтапПроизводства,
			|	ДополнительныеСведения.Значение КАК Комментарий
			|ПОМЕСТИТЬ КомментарииЭтапов
			|ИЗ
			|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|ГДЕ
			|	ДополнительныеСведения.Объект ССЫЛКА Документ.ЭтапПроизводства2_2
			|	И ДополнительныеСведения.Свойство = &ДопСвойствоКомментарий
			|
			|СГРУППИРОВАТЬ ПО
			|	ДополнительныеСведения.Объект,
			|	ДополнительныеСведения.Значение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства КАК ДатаВыпускаПлановая,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Изделие,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
			|	ЕСТЬNULL(КомментарииЭтапов.Комментарий, """") КАК Комментарий,
			|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок) КАК КоличествоУпаковок,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			|			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
			|		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Упаковка
			|	КОНЕЦ КАК Упаковка,
			|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация КАК Спецификация
			|ПОМЕСТИТЬ ПланВыпуска
			|ИЗ
			|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
			|		ЛЕВОЕ СОЕДИНЕНИЕ КомментарииЭтапов КАК КомментарииЭтапов
			|		ПО (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = КомментарииЭтапов.ЭтапПроизводства)
			|ГДЕ
			|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
			|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
			|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Подразделение = &Подразделение
			|	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Отменено
			|	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Произведено  
			|	&ТекстОтбораПоНазначению
			|	&ТекстОтбораДатаНачала
			|	&ТекстОтбораДатаОкончания
			|	&ТекстОтбораИзделие
			|
			|СГРУППИРОВАТЬ ПО
			|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация,
			|	ЕСТЬNULL(КомментарииЭтапов.Комментарий, """"),
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			|			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
			|		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Упаковка
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства КАК ДатаВыпускаПлановая,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Изделие,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
			|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок) КАК КоличествоУпаковок,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			|			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
			|		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Упаковка
			|	КОНЕЦ КАК Упаковка,
			|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация КАК Спецификация,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК ЭтапПроизводства
			|ПОМЕСТИТЬ ЭтапыПланаВыпуска
			|ИЗ
			|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
			|ГДЕ
			|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
			|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
			|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Подразделение = &Подразделение
			|	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Отменено
			|
			|СГРУППИРОВАТЬ ПО
			|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
			|			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
			|		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Упаковка
			|	КОНЕЦ,
			|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ &ТекстВыбораПолейВременныхТаблицПоВРЦ     
//++14.08.2024******************************************************************************************************
|ВЫБРАТЬ
|	ЭтапыПланаВыпуска.Спецификация КАК Спецификация,
|	КОЛИЧЕСТВО(ТехнологическиеОперации.Ссылка) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭтапыПланаВыпуска.ЭтапПроизводства) КАК КоличествоОпераций
|ПОМЕСТИТЬ КоличествоОперацийПоСпецификации
|ИЗ
|	ЭтапыПланаВыпуска КАК ЭтапыПланаВыпуска
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
|		ПО (ЭтапыПланаВыпуска.Спецификация = ТехнологическиеОперации.Спецификация)
|ГДЕ
|	НЕ ТехнологическиеОперации.ПометкаУдаления
|СГРУППИРОВАТЬ ПО
|	ЭтапыПланаВыпуска.Спецификация
|;
|
|////////////////////////////////////////////////////////////////////////////////
//*******************************************************************************************************************
|ВЫБРАТЬ
|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства КАК ЭтапПроизводства,
|	ТТМ_ИсполнениеТехПроцесса.Изделие КАК Изделие,
|	ТТМ_ИсполнениеТехПроцесса.Назначение КАК Назначение,
|	ТТМ_ИсполнениеТехПроцесса.ИзделиеВыпущено КАК ИзделиеВыпущено
|ПОМЕСТИТЬ ВыпущенныеЭтапы
|ИЗ
|	РегистрСведений.ТТМ_ИсполнениеТехПроцесса КАК ТТМ_ИсполнениеТехПроцесса
|ГДЕ
|	ТТМ_ИсполнениеТехПроцесса.ИзделиеВыпущено
|
|СГРУППИРОВАТЬ ПО
|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства,
|	ТТМ_ИсполнениеТехПроцесса.Изделие,
|	ТТМ_ИсполнениеТехПроцесса.Назначение,
|	ТТМ_ИсполнениеТехПроцесса.ИзделиеВыпущено
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства КАК ДатаВыпускаПлановая,
|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Изделие,
|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок) КАК КоличествоУпаковок,
|	ВЫБОР
|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
|		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Упаковка
|	КОНЕЦ КАК Упаковка,
|	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество,
|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация КАК Спецификация,
|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭтапПроизводства2_2ВыходныеИзделия.Ссылка) КАК КоличествоЭтаповПартии,
|	КОЛИЧЕСТВО(ВЫБОР
|			КОГДА ЕСТЬNULL(ВыпущенныеЭтапы.ИзделиеВыпущено, ЛОЖЬ) = ИСТИНА
|				ТОГДА 1
|			ИНАЧЕ 0
|		КОНЕЦ) КАК КоличествоВыпущенныхЭтапов
|ПОМЕСТИТЬ ВыпущенныеПартии
|ИЗ
|	ВыпущенныеЭтапы КАК ВыпущенныеЭтапы
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
|		ПО (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ВыпущенныеЭтапы.ЭтапПроизводства)
|ГДЕ
|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Подразделение = &Подразделение
|
|СГРУППИРОВАТЬ ПО
|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства,
|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
|	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка,
|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация,
|	ВЫБОР
|		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
|			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
|		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Упаковка
|	КОНЕЦ  
|;
|
|//////////////////////////////////////////////////////////////////////////////// 
//**22.10.2024******************************************************************************************************
|ВЫБРАТЬ
|	ДополнительныеСведения.Объект КАК ЭтапПроизводства,
|	ДополнительныеСведения.Значение КАК Исполнитель
|ПОМЕСТИТЬ ИсполнителиЭтапов
|ИЗ
|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
|ГДЕ
|	ДополнительныеСведения.Свойство = &ДопСвойствоИсполнитель
|	И ДополнительныеСведения.Объект ССЫЛКА Документ.ЭтапПроизводства2_2
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ДополнительныеСведения.Объект КАК РабочийЦентр,
|	ДополнительныеСведения.Значение КАК Исполнитель
|ПОМЕСТИТЬ ИсполнителиРабочихЦентров
|ИЗ
|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
|ГДЕ
|	ДополнительныеСведения.Свойство = &ДопСвойствоИсполнитель
|	И ДополнительныеСведения.Объект ССЫЛКА Справочник.РабочиеЦентры
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ЕСТЬNULL(ИсполнителиРабочихЦентров.РабочийЦентр, """") КАК РабочийЦентр,
|	ЕСТЬNULL(ИсполнителиЭтапов.Исполнитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Исполнитель,
|	ИсполнителиЭтапов.ЭтапПроизводства КАК ЭтапПроизводства
|ПОМЕСТИТЬ ОтветственныеИсполнителиРабочихЦентровЭтаповПроизводства
|ИЗ
|	ИсполнителиЭтапов КАК ИсполнителиЭтапов
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсполнителиРабочихЦентров КАК ИсполнителиРабочихЦентров
|		ПО (ЕСТЬNULL(ИсполнителиЭтапов.Исполнитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) = ЕСТЬNULL(ИсполнителиРабочихЦентров.Исполнитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)))
|
|СГРУППИРОВАТЬ ПО
|	ЕСТЬNULL(ИсполнителиРабочихЦентров.РабочийЦентр, """"),
|	ИсполнителиЭтапов.ЭтапПроизводства,
|	ЕСТЬNULL(ИсполнителиЭтапов.Исполнитель, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЭтапыПланаВыпуска.ДатаВыпускаПлановая КАК ДатаВыпуска,
|	ЭтапыПланаВыпуска.Изделие КАК Изделие,
|	ЭтапыПланаВыпуска.Назначение КАК Назначение,
|	ЭтапыПланаВыпуска.ЭтапПроизводства КАК ЭтапПроизводства
|ПОМЕСТИТЬ ЭтапыВыпускаИПлана
|ИЗ
|	ЭтапыПланаВыпуска КАК ЭтапыПланаВыпуска
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
|		ПО ЭтапыПланаВыпуска.ЭтапПроизводства = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства,
|	ВыпущенныеЭтапы.Изделие,
|	ВыпущенныеЭтапы.Назначение,
|	ВыпущенныеЭтапы.ЭтапПроизводства
|ИЗ
|	ВыпущенныеЭтапы КАК ВыпущенныеЭтапы
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
|		ПО ВыпущенныеЭтапы.ЭтапПроизводства = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ЭтапыВыпускаИПлана.ДатаВыпуска КАК ДатаВыпуска,
|	ЭтапыВыпускаИПлана.Изделие КАК Изделие,
|	ЭтапыВыпускаИПлана.Назначение КАК Назначение,
|	ЕСТЬNULL(ОтветственныеИсполнителиРабочихЦентровЭтаповПроизводства.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяССылка)) КАК Исполнитель
|ПОМЕСТИТЬ ИсполнителиПартийВыпуска
|ИЗ
|	ОтветственныеИсполнителиРабочихЦентровЭтаповПроизводства КАК ОтветственныеИсполнителиРабочихЦентровЭтаповПроизводства
|		ЛЕВОЕ СОЕДИНЕНИЕ ЭтапыВыпускаИПлана КАК ЭтапыВыпускаИПлана
|		ПО (ЕСТЬNULL(ОтветственныеИсполнителиРабочихЦентровЭтаповПроизводства.ЭтапПроизводства, ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)) = ЕСТЬNULL(ЭтапыВыпускаИПлана.ЭтапПроизводства, ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)))
|
|СГРУППИРОВАТЬ ПО
|	ЭтапыВыпускаИПлана.Назначение,
|	ЭтапыВыпускаИПлана.ДатаВыпуска,
|	ЭтапыВыпускаИПлана.Изделие,
|	ЕСТЬNULL(ОтветственныеИсполнителиРабочихЦентровЭтаповПроизводства.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяССылка))
|;
|
|////////////////////////////////////////////////////////////////////////////////

//*******************************************************************************************************************
			|ВЫБРАТЬ
			|	ПланВыпуска.ДатаВыпускаПлановая КАК ДатаВыпускаПлановая,
			|	ПланВыпуска.Изделие КАК Изделие,
			|	ПланВыпуска.Назначение КАК Назначение,
			|	ПланВыпуска.Назначение.Заказ.НомерПоДаннымКлиента КАК НомерЗаказаДР,
			|	ПланВыпуска.Комментарий КАК Комментарий,
			|	ИсполнителиПартийВыпуска.Исполнитель КАК Исполнитель,
			|	ПланВыпуска.КоличествоУпаковок КАК Количество,
			|	ПланВыпуска.Упаковка КАК Упак,
			//|	ПланВыпуска.Количество КАК Количество,
			|	ПланВыпуска.Спецификация КАК Спецификация,  
			|	ЕСТЬNULL(КоличествоОперацийПоСпецификации.КоличествоОпераций, 0) КАК Операций,
			//++//**************************************************************************************************
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВыпущенныеПартии.КоличествоЭтаповПартии, 0) = ЕСТЬNULL(ВыпущенныеПартии.КоличествоВыпущенныхЭтапов, 0)  и ЕСТЬNULL(ВыпущенныеПартии.КоличествоЭтаповПартии,0) <> 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ИзделиеВыпущено" + ?(МассивВРЦ.Количество() > 0,", ","") + "
			//--//**************************************************************************************************
			|	&ТекстЗапросаПолейПоВРЦ КАК ТекстЗапросаПолейПоВРЦ
			|ИЗ
			|	ПланВыпуска КАК ПланВыпуска 
			|  &ТекстСоединенияВТПоВРЦСпланом" + " 
			//++//**************************************************************************************************
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВыпущенныеПартии КАК ВыпущенныеПартии
			|	ПО ПланВыпуска.ДатаВыпускаПлановая = ВыпущенныеПартии.ДатаВыпускаПлановая
			|		И ПланВыпуска.Изделие = ВыпущенныеПартии.Изделие
			|		И ПланВыпуска.Назначение = ВыпущенныеПартии.Назначение
			|		И ПланВыпуска.Спецификация = ВыпущенныеПартии.Спецификация
			//--//**************************************************************************************************
			//****14.08.2024****************************************************************************************
			|	ЛЕВОЕ СОЕДИНЕНИЕ КоличествоОперацийПоСпецификации КАК КоличествоОперацийПоСпецификации
			|	ПО (ПланВыпуска.Спецификация = КоличествоОперацийПоСпецификации.Спецификация)
			//******************************************************************************************************                
			//**22.10.2024******************************************************************************************
			|ЛЕВОЕ СОЕДИНЕНИЕ ИсполнителиПартийВыпуска КАК ИсполнителиПартийВыпуска
			|		ПО (ПланВыпуска.ДатаВыпускаПлановая = ЕСТЬNULL(ИсполнителиПартийВыпуска.ДатаВыпуска, ДАТАВРЕМЯ(1, 1, 1)))
			|			И (ПланВыпуска.Изделие = ЕСТЬNULL(ИсполнителиПартийВыпуска.Изделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)))
			|			И (ПланВыпуска.Назначение = ЕСТЬNULL(ИсполнителиПартийВыпуска.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)))
			//******************************************************************************************************
			|
			|СГРУППИРОВАТЬ ПО
			|	ПланВыпуска.Упаковка,
			|	ПланВыпуска.ДатаВыпускаПлановая,
			|	ПланВыпуска.Изделие,
			|	ПланВыпуска.Назначение,
			|	ПланВыпуска.Назначение.Заказ.НомерПоДаннымКлиента,
			|	ПланВыпуска.Комментарий,
			|	ПланВыпуска.КоличествоУпаковок,
			//|	ПланВыпуска.Количество,
			|	ПланВыпуска.Спецификация,        
			//**22.10.2024******************************************************************************************
			|	ИсполнителиПартийВыпуска.Исполнитель,
			//++//**************************************************************************************************
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВыпущенныеПартии.КоличествоЭтаповПартии, 0) = ЕСТЬNULL(ВыпущенныеПартии.КоличествоВыпущенныхЭтапов, 0)  и ЕСТЬNULL(ВыпущенныеПартии.КоличествоЭтаповПартии,0) <> 0
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,    
			//--//*************************************************************************************************
			//****14.08.2024***************************************************************************************
			|	ЕСТЬNULL(КоличествоОперацийПоСпецификации.КоличествоОпераций, 0)" + ?(МассивВРЦ.Количество() >0,", ","") + "
			//*****************************************************************************************************
			|	&ТекстПолейГруппировки
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДатаВыпускаПлановая,
			|	Изделие
			|ИТОГИ ПО
			|	ДатаВыпускаПлановая
			|АВТОУПОРЯДОЧИВАНИЕ";
	
	//КолонкиВРЦ = "";           
	//Счетчик = 1;         
	ТекстЗапросаПолейПоВРЦ = "";
	ТекстСозданияВТПоВРЦ = "";    
	ТекстСвязиВтПоВРЦСПланом = "";   
	ТекстПолейГруппировки = "";
	Для Каждого ВРЦ из МассивВРЦ Цикл   
		//Если ВРЦ.наименование = "Технолог" тогда 
		//	Продолжить; 
		//КонецЕсли;
		ЗаголовокКолонки = ВРЦ.Наименование;
		ИмяКолонки = СтрЗаменить(ЗаголовокКолонки," ","");
		//КолонкиВРЦ = ?(КолонкиВРЦ = "","",Символы.ПС) + ИмяКолонки + " КАК " + Заголовок + ","
		//КолонкиВРЦ = КолонкиВРЦ + ?(КолонкиВРЦ = "","",Символы.ПС) + "ЛОЖЬ  КАК " + ИмяКолонки + ",";
		
		ТекстЗапросаКолонки = ПолучитьТекстзапросаПолейВТПоВРЦ(ИмяКолонки);
		ТекстЗапросаПолейПоВРЦ = ТекстЗапросаПолейПоВРЦ + ?(ТекстЗапросаКолонки = "","",Символы.ПС) + ТекстЗапросаКолонки;
		//?(ТекстЗапросаКолонки = "","",Символы.ПС) + " КАК " + ИмяКолонки + ", ";
		ТекстЗапросаВТ = ПолучитьТекстСозданияВТПоВРЦ(ИмяКолонки);
		ТекстСозданияВТПоВРЦ = ТекстСозданияВТПоВРЦ + ?(ТекстЗапросаВТ = "","",Символы.ПС) + ТекстЗапросаВТ;
		ТекстЗапросаСвязи = ПолучитьТекстСвязиВТПоВРЦСПланом(ИмяКолонки);
		ТекстСвязиВтПоВРЦСПланом = ТекстСвязиВтПоВРЦСПланом + ?(ТекстЗапросаСвязи = "","",Символы.ПС) + ТекстЗапросаСвязи;
		ТекстГруппировки = ПолучитьТекстПолейГруппировки(ИмяКолонки);
		ТекстПолейГруппировки = ТекстПолейГруппировки + ?(ТекстГруппировки = "","",Символы.ПС) + ТекстГруппировки;
		
		//Счетчик = Счетчик + 1;  
	КонецЦикла;
	//КолонкиВРЦ = Лев(КолонкиВРЦ,СтрДлина(КолонкиВРЦ)-1);   
	ТекстЗапросаПолейПоВРЦ = Лев(ТекстЗапросаПолейПоВРЦ,СтрДлина(ТекстЗапросаПолейПоВРЦ)-1);   	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТекстЗапросаПолейПоВРЦ КАК ТекстЗапросаПолейПоВРЦ",ТекстЗапросаПолейПоВРЦ); 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ВЫБРАТЬ &ТекстВыбораПолейВременныхТаблицПоВРЦ",ТекстСозданияВТПоВРЦ);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТекстСоединенияВТПоВРЦСпланом",ТекстСвязиВтПоВРЦСПланом);
	
	ТекстПолейГруппировки = Лев(ТекстПолейГруппировки,СтрДлина(ТекстПолейГруппировки)-1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТекстПолейГруппировки",ТекстПолейГруппировки);
	
	////////////////////////////////////////////////////////////////////////
	//Отборы    
	
	ТекстОтбораПоНазначению = "";
	ТекстОтбораДатаНачала = "";
	ТекстОтбораДатаОкончания = "";  
	ТекстОтбораИзделие = "";
	
	Если ЗначениеЗаполнено(Объект.ОтборПериод.ДатаНачала) Тогда 
		ТекстОтбораДатаНачала = " И ЭтапПроизводства2_2ВыходныеИзделия.датаПроизводства >= &ОтборДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборПериод.ДатаОкончания) Тогда 
		ТекстОтбораДатаОкончания = " И ЭтапПроизводства2_2ВыходныеИзделия.датаПроизводства <= &ОтборДатаОкончания";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборНазначение) Тогда 
		ТекстОтбораПоНазначению = " И ЭтапПроизводства2_2ВыходныеИзделия.Назначение В (&ОтборНазначение)";
	КонецЕсли;        
	Если ЗначениеЗаполнено(Объект.ОтборИзделие) Тогда 
		ТекстОтбораИзделие = " И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура В (&ОтборИзделие)";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТекстОтбораДатаНачала", ТекстОтбораДатаНачала);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТекстОтбораДатаОкончания", ТекстОтбораДатаОкончания);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТекстОтбораПоНазначению",ТекстОтбораПоНазначению);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ТекстОтбораИзделие",ТекстОтбораИзделие);
	
	////////////////////////////////////////////////////////////////////////
		
	Возврат ТекстЗапроса;
	
КонецФункции        

&НаСервере
Функция ПолучитьТекстСозданияВТПоВРЦ(ИмяКолонки) 
	
	ТекстВыборки ="ВЫБРАТЬ
			|	ЭтапыПланаВыпуска.ДатаВыпускаПлановая КАК ДатаВыпускаПлановая,
			|	ЭтапыПланаВыпуска.Изделие КАК Изделие,
			|	ЭтапыПланаВыпуска.Назначение КАК Назначение,
			|	СУММА(ЭтапыПланаВыпуска.КоличествоУпаковок) КАК КоличествоУпаковок,
			|	ЭтапыПланаВыпуска.Упаковка КАК Упаковка,
			|	СУММА(ЭтапыПланаВыпуска.Количество) КАК Количество,
			|	ЭтапыПланаВыпуска.Спецификация КАК Спецификация,
			|	ТТМ_ИсполнениеТехПроцесса.ТехОперация КАК ТехОперация,
			|	ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра КАК ВидРабочегоЦентра
			|ПОМЕСТИТЬ ВТ" + ИмяКолонки + "
			|ИЗ
			|	РегистрСведений.ТТМ_ИсполнениеТехПроцесса КАК ТТМ_ИсполнениеТехПроцесса
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЭтапыПланаВыпуска КАК ЭтапыПланаВыпуска
			|		ПО (ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства = ЭтапыПланаВыпуска.ЭтапПроизводства)
			|ГДЕ
			|	ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра.Наименование ПОДОБНО """ + ИмяКолонки + """
			|
			|СГРУППИРОВАТЬ ПО
			|	ЭтапыПланаВыпуска.ДатаВыпускаПлановая,
			|	ЭтапыПланаВыпуска.Изделие,
			|	ЭтапыПланаВыпуска.Назначение,
			|	ЭтапыПланаВыпуска.Упаковка,
			|	ЭтапыПланаВыпуска.Спецификация,
			|	ТТМ_ИсполнениеТехПроцесса.ТехОперация,
			|	ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
			
	Возврат ТекстВыборки;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстСвязиВТПоВРЦСПланом(ИмяКолонки) 
	
	ТекстВыборки = " ЛЕВОЕ СОЕДИНЕНИЕ ВТ" + Имяколонки + " КАК ВТ" + ИмяКолонки + "
			|		ПО (ПланВыпуска.ДатаВыпускаПлановая = ВТ" + Имяколонки + ".ДатаВыпускаПлановая)
			|			И (ПланВыпуска.Изделие = ВТ" + Имяколонки + ".Изделие)
			|			И (ПланВыпуска.Назначение = ВТ" + Имяколонки + ".Назначение)
			|			И (ПланВыпуска.Спецификация = ВТ" + Имяколонки + ".Спецификация)";
			
	Возврат ТекстВыборки;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаПолейВТПоВРЦ(ИмяКолонки) 
	
	ТекстВыборки = "ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ" + ИмяКолонки + ".ВидРабочегоЦентра, ЛОЖЬ) = ЛОЖЬ
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК " + ИмяКолонки + ",";
			
	Возврат ТекстВыборки;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстПолейГруппировки(ИмяКолонки) 
	
	ТекстВыборки = "ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ" + ИмяКолонки + ".ВидРабочегоЦентра, ЛОЖЬ) = ЛОЖЬ
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ,";
			
	Возврат ТекстВыборки;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаПланВыпуска()
	
	ТекстЗ = "ВЫБРАТЬ
	         |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК ЭтапПроизводства,
	         |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
	         |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
	         |	ТТМ_УчетСерийныхНомеровПродукции.Количество КАК Количество
	         |ПОМЕСТИТЬ СерийныеНомераВПроизводстве
	         |ИЗ
	         |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	         |ГДЕ
	         |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	         |	И НЕ ТТМ_УчетСерийныхНомеровПродукции.Произведено
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ДополнительныеСведения.Объект КАК Объект,
	         |	ДополнительныеСведения.Значение КАК Значение
	         |ПОМЕСТИТЬ КодыТМноменклатуры
	         |ИЗ
	         |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	         |ГДЕ
	         |	ДополнительныеСведения.Свойство = &СвойствоКодТМ
	         |	И ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	         |;
	         |
	         |////////////////////////////////////////////////////////////////////////////////
	         |ВЫБРАТЬ
	         |	ИСТИНА КАК Отметка,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК ЭтапПроизводства,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства КАК ДатаВыпускаПлановая,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Изделие,
	         |	ЕСТЬNULL(КодыТМноменклатуры.Значение, """") КАК КодТМ,
	         |	ЕСТЬNULL(СерийныеНомераВПроизводстве.СерийныйНомер, """") КАК СерийныйНомер,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	         |	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок) КАК КоличествоУпаковок,
	         |	ВЫБОР
	         |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	         |			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
	         |		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Упаковка
	         |	КОНЕЦ КАК Упаковка,
	         |	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация КАК Спецификация,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт КАК Выполнено
	         |ИЗ
	         |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	         |		ЛЕВОЕ СОЕДИНЕНИЕ СерийныеНомераВПроизводстве КАК СерийныеНомераВПроизводстве
	         |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = СерийныеНомераВПроизводстве.ЭтапПроизводства
	         |		ЛЕВОЕ СОЕДИНЕНИЕ КодыТМноменклатуры КАК КодыТМноменклатуры
	         |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = КодыТМноменклатуры.Объект
	         |ГДЕ
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	         |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
	         |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Подразделение = &Подразделение
	         |	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Произведено
	         |	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Отменено 
			 |	&ТекстОтбораПоНазначению
			 |	&ТекстОтбораДатаНачала
			 |	&ТекстОтбораДатаОкончания
			 |	&ТекстОтбораИзделие
	         |
	         |СГРУППИРОВАТЬ ПО
	         |	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Упаковка,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация,
	         |	ВЫБОР
	         |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	         |			ТОГДА ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура.ЕдиницаИзмерения
	         |		ИНАЧЕ ЭтапПроизводства2_2ВыходныеИзделия.Упаковка
	         |	КОНЕЦ,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка,
	         |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт,
	         |	ЕСТЬNULL(СерийныеНомераВПроизводстве.СерийныйНомер, """"),
	         |	ЕСТЬNULL(КодыТМноменклатуры.Значение, """")";
	
	////////////////////////////////////////////////////////////////////////
	//Отборы    
	
	ТекстОтбораПоНазначению = "";
	ТекстОтбораДатаНачала = "";
	ТекстОтбораДатаОкончания = ""; 
	ТекстОтбораИзделие = "";
	
	Если ЗначениеЗаполнено(Объект.ОтборПериод.ДатаНачала) Тогда 
		ТекстОтбораДатаНачала = " И ЭтапПроизводства2_2ВыходныеИзделия.датаПроизводства >= &ОтборДатаНачала";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборПериод.ДатаОкончания) Тогда 
		ТекстОтбораДатаОкончания = " И ЭтапПроизводства2_2ВыходныеИзделия.датаПроизводства <= &ОтборДатаОкончания";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборНазначение) Тогда 
		ТекстОтбораПоНазначению = " И ЭтапПроизводства2_2ВыходныеИзделия.Назначение В (&ОтборНазначение)";
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборИзделие) Тогда 
		ТекстОтбораИзделие = " И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура В (&ОтборИзделие)";
	КонецЕсли;
	
	ТекстЗ = СтрЗаменить(ТекстЗ,"&ТекстОтбораДатаНачала", ТекстОтбораДатаНачала);
	ТекстЗ = СтрЗаменить(ТекстЗ,"&ТекстОтбораДатаОкончания", ТекстОтбораДатаОкончания);
	ТекстЗ = СтрЗаменить(ТекстЗ,"&ТекстОтбораПоНазначению",ТекстОтбораПоНазначению);
	ТекстЗ = СтрЗаменить(ТекстЗ,"&ТекстОтбораИзделие",ТекстОтбораИзделие);
	
	////////////////////////////////////////////////////////////////////////
	
	Возврат ТекстЗ;			   
	
КонецФункции

////////////////////////////////////////////////////////////////////////////
//+ Арсений 09.04.2026
&НаСервере
Процедура ЗаполнитьСерийныеНомераТабПлана(ТабПлан)
	
	Если ТабПлан = Неопределено Или ТабПлан.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТабПлан.Колонки.Найти("СерийныйНомер") = Неопределено Тогда
		ТабПлан.Колонки.Добавить("СерийныйНомер", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(16, ДопустимаяДлина.Фиксированная)));
	КонецЕсли;
	
	МассивЭтапов = Новый Массив;
	Для Каждого СтрокаПлана Из ТабПлан Цикл
		СтрокаПлана.СерийныйНомер = "";
		Если ЗначениеЗаполнено(СтрокаПлана.ЭтапПроизводства) Тогда
			МассивЭтапов.Добавить(СтрокаПлана.ЭтапПроизводства);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивЭтапов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК ЭтапПроизводства,
	               |	МАКСИМУМ(ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер) КАК СерийныйНомер
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор В (&МассивЭтапов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор";
	Запрос.УстановитьПараметр("МассивЭтапов", МассивЭтапов);
	
	СерийныеНомераЭтапов = Запрос.Выполнить().Выгрузить();
	СоответствиеСерийныхНомеров = Новый Соответствие;
	
	Для Каждого СтрокаСерийногоНомера Из СерийныеНомераЭтапов Цикл
		СоответствиеСерийныхНомеров.Вставить(СтрокаСерийногоНомера.ЭтапПроизводства, СтрокаСерийногоНомера.СерийныйНомер);
	КонецЦикла;
	
	Для Каждого СтрокаПлана Из ТабПлан Цикл
		СерийныйНомер = СоответствиеСерийныхНомеров.Получить(СтрокаПлана.ЭтапПроизводства);
		Если СерийныйНомер <> Неопределено Тогда
			СтрокаПлана.СерийныйНомер = СерийныйНомер;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодТМДляСтрокПланаВыпуска(ДеревоПлана)
	
	Если ДеревоПлана = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДеревоПлана.Колонки.Найти("КодТМ") = Неопределено Тогда
		ДеревоПлана.Колонки.Добавить("КодТМ", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	КонецЕсли;
	
	СведениеКодТМ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "КодТМ_ТТМ");
	Если СведениеКодТМ = Неопределено Или СведениеКодТМ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеНоменклатуры = Новый Соответствие;
	СобратьНоменклатуруИзСтрокПланаВыпуска(ДеревоПлана.Строки, СоответствиеНоменклатуры);
	
	Если СоответствиеНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	Для Каждого ЭлементНоменклатуры Из СоответствиеНоменклатуры Цикл
		МассивНоменклатуры.Добавить(ЭлементНоменклатуры.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДополнительныеСведения.Объект КАК Изделие,
	               |	ДополнительныеСведения.Значение КАК КодТМ
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	               |	И ДополнительныеСведения.Объект В (&МассивНоменклатуры)
	               |	И ДополнительныеСведения.Свойство = &СведениеКодТМ";
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("СведениеКодТМ", СведениеКодТМ);
	
	СоответствиеКодовТМ = Новый Соответствие;
	Для Каждого СтрокаКодаТМ Из Запрос.Выполнить().Выгрузить() Цикл
		ЗначениеКодТМ = "";
		Если СтрокаКодаТМ.КодТМ <> Неопределено Тогда
			ЗначениеКодТМ = Строка(СтрокаКодаТМ.КодТМ);
		КонецЕсли;
		СоответствиеКодовТМ.Вставить(СтрокаКодаТМ.Изделие, ЗначениеКодТМ);
	КонецЦикла;
	
	Если СоответствиеКодовТМ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьКодТМВСтрокахПланаВыпуска(ДеревоПлана.Строки, СоответствиеКодовТМ);
	
КонецПроцедуры

&НаСервере
Процедура СобратьНоменклатуруИзСтрокПланаВыпуска(СтрокиПлана, СоответствиеНоменклатуры)
	
	Для Каждого СтрокаПлана Из СтрокиПлана Цикл
		СтрокаПлана.КодТМ = "";
		
		Если ЗначениеЗаполнено(СтрокаПлана.Изделие)
			И СоответствиеНоменклатуры.Получить(СтрокаПлана.Изделие) = Неопределено Тогда
			СоответствиеНоменклатуры.Вставить(СтрокаПлана.Изделие, Истина);
		КонецЕсли;
		
		Если СтрокаПлана.Строки.Количество() > 0 Тогда
			СобратьНоменклатуруИзСтрокПланаВыпуска(СтрокаПлана.Строки, СоответствиеНоменклатуры);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКодТМВСтрокахПланаВыпуска(СтрокиПлана, СоответствиеКодовТМ)
	
	Для Каждого СтрокаПлана Из СтрокиПлана Цикл
		Если ЗначениеЗаполнено(СтрокаПлана.Изделие) Тогда
			КодТМ = СоответствиеКодовТМ.Получить(СтрокаПлана.Изделие);
			Если КодТМ <> Неопределено Тогда
				СтрокаПлана.КодТМ = КодТМ;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаПлана.Строки.Количество() > 0 Тогда
			УстановитьКодТМВСтрокахПланаВыпуска(СтрокаПлана.Строки, СоответствиеКодовТМ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//- Арсений 09.04.2026
////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПроизводственноеПодразделениеПриИзменении(Элемент)
	
	ОбновитьДанныеПланапроизводства(Объект.ПроизводственноеПодразделение, Новый Структура);
	РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
	
КонецПроцедуры                          

&НаСервере
Процедура УстановитьУсловноеОформлениеДерева(ДЗ, ИмяДерева);
	//Элементы.ДеревоВыпуска.
	
	//Элементы.ДеревоВыпуска.ТолькоПросмотр = Истина;   
	//ДЗ = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОтобора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтобора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева + ".Уровень");
    ЭлементОтобора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтобора.ПравоеЗначение = 1;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноСерый);
	ЭлементОтобора.Использование = Истина;
	
	//Для Каждого Стр из ДЗ.Строки Цикл 
	//	Если Стр.Уровень = 1 Тогда 
	//		//Стр
	//	КонецЕсли;
	//КонецЦикла;  
	
	
	//Элементы.ПланВыпускаПродукцииСпецификация.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПланВыпуска(Команда)
	
	ОбновитьДанныеПланапроизводства(Объект.ПроизводственноеПодразделение, Новый Структура);	
	РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
	//СформироватьОповещениеДляПользователя(Команда.Действие);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗначениеРеквизитаДопСведений()
	
	ВыгруженнаяТаблицаПлана = Новый ТаблицаЗначений;
	ВыгруженнаяТаблицаПлана.Колонки.Добавить("Назначение", Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ВыгруженнаяТаблицаПлана.Колонки.Добавить("Изделие", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВыгруженнаяТаблицаПлана.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	
	ВерхниеСтрокиДерева = ЭтаФорма.ДеревоВыпуска.ПолучитьЭлементы();
	
	Для Каждого СтрокаВерхнегоУровня Из ВерхниеСтрокиДерева Цикл
		 ПодчиненныеСтроки = СтрокаВерхнегоУровня.ПолучитьЭлементы();
		 
		 Для Каждого СтрокаНижнегоУровня Из ПодчиненныеСтроки Цикл
			 НоваяСтрока = ВыгруженнаяТаблицаПлана.Добавить();
			 ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНижнегоУровня);
		 КонецЦикла;
		
	КонецЦикла;
	
	Если ВыгруженнаяТаблицаПлана.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//ДопСвойствоИсполнительЭтапа = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ОтветственныйСотрудник_cd8e5a889b84479689186f49871bc700"); //Test_Lena
	ДопСвойствоИсполнительЭтапа = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ОтветственныйСотрудник_62538974ec0a491d811c29d4c48914c6"); //Рабочая
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыгруженныеДанные.Назначение КАК Назначение,
	               |	ВыгруженныеДанные.Изделие КАК Изделие,
	               |	ВыгруженныеДанные.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ ВТ_ВыгруженныеДанные
	               |ИЗ
	               |	&ВыгруженныеДанные КАК ВыгруженныеДанные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВыгруженныеДанные.Назначение КАК Назначение,
	               |	ВТ_ВыгруженныеДанные.Изделие КАК Изделие,
	               |	ВТ_ВыгруженныеДанные.Спецификация КАК Спецификация,
	               |	ЕСТЬNULL(ЭтапПроизводства2_2.Ссылка, ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)) КАК ЭтапПроизводства
	               |ПОМЕСТИТЬ ВТ_СвязанныеЭтапы
	               |ИЗ
	               |	ВТ_ВыгруженныеДанные КАК ВТ_ВыгруженныеДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	               |		ПО ВТ_ВыгруженныеДанные.Спецификация = ЭтапПроизводства2_2.Спецификация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ВыгруженныеДанные
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвязанныеЭтапы.Назначение КАК Назначение,
	               |	ВТ_СвязанныеЭтапы.Изделие КАК Изделие,
	               |	ВТ_СвязанныеЭтапы.Спецификация КАК Спецификация,
	               |	ВТ_СвязанныеЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ЕСТЬNULL(ДополнительныеСведения.Значение, """") КАК ИсполнительПредставление
	               |ПОМЕСТИТЬ ВТ_ДопСведениеПредставление
	               |ИЗ
	               |	ВТ_СвязанныеЭтапы КАК ВТ_СвязанныеЭтапы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО ВТ_СвязанныеЭтапы.ЭтапПроизводства = ДополнительныеСведения.Объект
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДопСвойствоЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_СвязанныеЭтапы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДопСведениеПредставление.Назначение КАК Назначение,
	               |	ВТ_ДопСведениеПредставление.Изделие КАК Изделие,
	               |	ВТ_ДопСведениеПредставление.Спецификация КАК Спецификация,
	               |	ВТ_ДопСведениеПредставление.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ВТ_ДопСведениеПредставление.ИсполнительПредставление КАК ИсполнительПредставление,
	               |	ЕСТЬNULL(РабочиеЦентры.Ссылка, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК Исполнитель
	               |ПОМЕСТИТЬ ВТ_ИтоговыеДанные
	               |ИЗ
	               |	ВТ_ДопСведениеПредставление КАК ВТ_ДопСведениеПредставление
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеЦентры КАК РабочиеЦентры
	               |		ПО ВТ_ДопСведениеПредставление.ИсполнительПредставление = РабочиеЦентры.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ДопСведениеПредставление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИтоговыеДанные.Назначение КАК Назначение,
	               |	ВТ_ИтоговыеДанные.ИсполнительПредставление КАК ИсполнительПредставление,
	               |	ВТ_ИтоговыеДанные.Исполнитель КАК Исполнитель,
	               |	ВТ_ИтоговыеДанные.Изделие КАК Изделие,
	               |	ВТ_ИтоговыеДанные.Спецификация КАК Спецификация
	               |ИЗ
	               |	ВТ_ИтоговыеДанные КАК ВТ_ИтоговыеДанные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ИтоговыеДанные.Назначение,
	               |	ВТ_ИтоговыеДанные.ИсполнительПредставление,
	               |	ВТ_ИтоговыеДанные.Исполнитель,
	               |	ВТ_ИтоговыеДанные.Изделие,
	               |	ВТ_ИтоговыеДанные.Спецификация"; 
	
	 Запрос.УстановитьПараметр("ВыгруженныеДанные", ВыгруженнаяТаблицаПлана);
	 Запрос.УстановитьПараметр("ДопСвойствоЭтапа", ДопСвойствоИсполнительЭтапа);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 Для Каждого СтрокаВерхнегоУровня Из ВерхниеСтрокиДерева Цикл
			 ПодчиненныеСтроки = СтрокаВерхнегоУровня.ПолучитьЭлементы();
		 
			 Для Каждого СтрокаНижнегоУровня Из ПодчиненныеСтроки Цикл
				 Если Выборка.Назначение = СтрокаНижнегоУровня.Назначение
					 И Выборка.Изделие = СтрокаНижнегоУровня.Изделие
					 И Выборка.Спецификация = СтрокаНижнегоУровня.Спецификация Тогда
					 
					 СтрокаНижнегоУровня.Исполнитель = Выборка.Исполнитель;	 
				КонецЕсли;
			 КонецЦикла;
	 	КонецЦикла;
		 
	 КонецЦикла;
	 
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////
#Область ПрограммноеСозданиеРеквизитовИЭлементов

//Программное создание дерева выпуска
////////////////////////////////////////////////////////////////////

&НаСервере
Процедура СоздатьРеквизитФормыДеревоВыпуска(ИмяДерева, МассивВРЦ)
		
	МассивИзменяемыхРеквизитов = Новый Массив;
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяДерева,Новый ОписаниеТипов("ДеревоЗначений"),,"Выпуск продукции",Ложь));
	
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаВыпускаПлановая",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)),ИмяДерева,"Дата выпуска",Ложь));
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Назначение",Новый ОписаниеТипов("СправочникСсылка.Назначения"),ИмяДерева,"Назначение",Ложь));
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("НомерЗаказаДР",Новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки(30,ДопустимаяДлина.Переменная)),ИмяДерева,"Номер заказа ДР",Ложь));
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Изделие",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),ИмяДерева,"Номенклатура",Ложь));
	//МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("КодТМ",Новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки(100,ДопустимаяДлина.Переменная)),ИмяДерева,"КодТМ",Ложь));
	
	//+Комментарий 18.12.2024
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Комментарий",Новый ОписаниеТипов("Строка",,,,новый КвалификаторыСтроки(100,ДопустимаяДлина.Переменная)),ИмяДерева,"Комментарий",Ложь));
	//-Комментарий 18.12.2024
	
	//МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Количество",Новый ОписаниеТипов("Число",,,,новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)),ИмяДерева,"Количество",Ложь));
	//Количество показывает КоличествоУпаковок
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Количество",Новый ОписаниеТипов("Число",,,,новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)),ИмяДерева,"Количество",Ложь));
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Упак",Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"),ИмяДерева,"Упаковка",Ложь));
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Исполнитель",Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры"),ИмяДерева,"Исполнитель",Ложь));
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Спецификация",Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"),ИмяДерева,"Спецификация",Ложь));
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("ИзделиеВыпущено",Новый ОписаниеТипов("Булево"),ИмяДерева,"Изделие выпущено",Ложь));
	МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("Операций",Новый ОписаниеТипов("Число",,,,новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Неотрицательный)),ИмяДерева,"Операций",Ложь));
	//МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы("ВыполнитьВсеОперации",Новый ОписаниеТипов("Булево"),ИмяДерева,"Выпущено",Ложь));
	
	Для Каждого Стр из МассивВРЦ Цикл 
		ИмяКолонки = СтрЗаменить(Стр.Наименование," ","");
		ЗаголовокКолонки = Стр.Наименование;
		МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов("Булево"), ИмяДерева,ЗаголовокКолонки, Ложь));
		//МассивИзменяемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов("Число",,,,новый КвалификаторыЧисла(1,0,ДопустимыйЗнак.Неотрицательный)), ИмяДерева,ЗаголовокКолонки, Ложь));
	КонецЦикла;   
	
	ИзменитьРеквизиты(МассивИзменяемыхРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыДереваНаФорме(МассивВРЦ)              
		
	//НоваяГруппаФормы = Элементы.Добавить("ГруппаДеревоВыпуска",Тип("ГруппаФормы"));
	//НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//НоваяГруппаФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	ЭлементДеревоВыпуска = Элементы.Добавить("ДеревоВыпуска", Тип("ТаблицаФормы"), Элементы.ГруппаДерево);
	ЭлементДеревоВыпуска.ПутьКДанным = "ДеревоВыпуска";                                                
	ЭлементДеревоВыпуска.УстановитьДействие("ПриАктивизацииСтроки", "ОтборЭтаповПриАктивизацииСтроки"); 
	ЭлементДеревоВыпуска.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	
	//++Дарвин А.А. 01.07.2024
	//ЭлементДеревоВыпуска.УстановитьДействие("ПриИзменении", "ДеревоВыпускаИсполнительПриИзменении");
	//Дарвин А.А.
	
	ДобавитьЭлементКолонкиДерева("Дата выпуска плановая", 	Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода, 12, 2);
	ДобавитьЭлементКолонкиДерева("Назначение", 				Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода);
	ДобавитьЭлементКолонкиДерева("Номер заказа ДР", 		Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода, 12);
	ДобавитьЭлементКолонкиДерева("Изделие", 				Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода,30);
	//ДобавитьЭлементКолонкиДерева("КодТМ", 				Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода, 10);
	//+Комментарий 18.12.2024
	ДобавитьЭлементКолонкиДерева("Комментарий",				Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода, 30, 1);
	//-Комментарий 18.12.2024
	//ДобавитьЭлементКолонкиДерева("Количество", 				Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода);
	//Количество отображает Количество упаковок
	ДобавитьЭлементКолонкиДерева("Количество",	 			Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода,7);
	ДобавитьЭлементКолонкиДерева("Упак", 					Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода);
	ДобавитьЭлементКолонкиДерева("Исполнитель",				Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода);
	//ДобавитьЭлементКолонкиДерева("Спецификация", 			Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода);
	//ДобавитьЭлементКолонкиДерева("Операций",				Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеВвода);
	ДобавитьЭлементКолонкиДерева("Изделие выпущено", 		Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеФлажка, 5, 1);
	
	
	Для Каждого Стр из МассивВРЦ Цикл 
		ДобавитьЭлементКолонкиДерева(Стр.Наименование, Тип("ПолеФормы"), ЭлементДеревоВыпуска, ВидПоляФормы.ПолеФлажка, 5, 1);
	КонецЦикла;   
	
	ЭлементДеревоВыпуска.КоманднаяПанель.Видимость = Ложь;  
	//ЭлементДеревоВыпуска.ПодчиненныеЭлементы.Количество.Видимость = Ложь;
	
	//ЭлементДеревоВыпуска.ПодчиненныеЭлементы.Спецификация.Видимость = Ложь; 
	//ЭлементДеревоВыпуска.ПодчиненныеЭлементы.Операций.Видимость = Ложь;
	
КонецПроцедуры  

&НаСервере
Процедура ДобавитьЭлементКолонкиДерева(ЗаголовокКолонки, ТипКолонки, РодительскийЭлемент, ВидПоля, ШиринаКолонки = 0, ДобавитьДействие = 0)
	
	ИмяКолонки = СтрЗаменить(ЗаголовокКолонки," ","");
	ЭлементКол = Элементы.Добавить(ИмяКолонки,ТипКолонки,РодительскийЭлемент);
	ЭлементКол.ПутьКДанным = РодительскийЭлемент.Имя + "." + ИмяКолонки;
	ЭлементКол.Вид = ВидПоля;                                    
	ЭлементКол.Заголовок = ЗаголовокКолонки;  
	ЭлементКол.ТолькоПросмотр = Истина;  
	Если ВидПоля = ВидПоляФормы.ПолеФлажка Тогда 
		ЭлементКол.ШиринаЭлемента = ШиринаКолонки;
		//ЭлементКол.ТриСостояния = Истина;
	Иначе 
		ЭлементКол.Ширина = ШиринаКолонки; 
	КонецЕсли;
	
	Если ДобавитьДействие = 1 Тогда 
		ЭлементКол.УстановитьДействие("ПриИзменении","ВыполнениеОперации");
	ИначеЕсли ДобавитьДействие = 2 Тогда 
		ЭлементКол.УстановитьДействие("ПриИзменении","ИзменитьПлановуюДатуВыпускаВЭтапах");
	КонецЕсли;
	
	Если ЭлементКол.Имя = "Назначение" Тогда 
		ЭлементКол.Видимость = Ложь;
	КонецЕсли;   
	
	Если ЭлементКол.Имя = "Упак" Тогда 
		ЭлементКол.Видимость = Ложь;
	КонецЕсли;
	
	Если ЭлементКол.Имя = "Исполнитель" Тогда 

		СписокСборочныхБригад = ПолучитьСписокСборочныхБригад();   
		ЭлементКол.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		ЭлементКол.СписокВыбора.ЗагрузитьЗначения(СписокСборочныхБригад);  
		ЭлементКол.ТолькоПросмотр = Ложь; 
		ЭлементКол.УстановитьДействие("ПриИзменении", "ДеревоВыпускаИсполнительПриИзменении");
		
	КонецЕсли; 
	
	Если  ЭлементКол.Имя = "Комментарий" Тогда 
		  
		ЭлементКол.ТолькоПросмотр = Ложь; 
		ЭлементКол.УстановитьДействие("ПриИзменении", "ДеревоВыпускаКомментарийПриИзменении");
		
	КонецЕсли; 
	
	Если ЭлементКол.Имя = "Датавыпускаплановая" Тогда 
		ЭлементКол.ТолькоПросмотр = Ложь;
		ЭлементКол.УстановитьДействие("ПриИзменении", "ИзменитьПлановуюДатуВыпускаВЭтапах");
	КонецЕсли;
	
	Если ВидПоля = ВидПоляФормы.ПолеФлажка Тогда 
		ЭлементКол.ТолькоПросмотр = Ложь;	
	КонецЕсли;
	
КонецПроцедуры       

&НаСервере
Функция ПолучитьСписокСборочныхБригад()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РабочиеЦентры.Ссылка КАК РабочийЦентр
	               |ИЗ
	               |	Справочник.РабочиеЦентры КАК РабочиеЦентры
	               |ГДЕ
	               |	РабочиеЦентры.ВидРабочегоЦентра.Наименование = ""Сборка""";
	МассивРЦ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РабочийЦентр");
	
	Возврат МассивРЦ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьУсловноеОформление()	
	//1 УсловноеОформление
	ЭтотОбъект.УсловноеОформление.Элементы.Очистить();
	УФ = ЭтотОбъект.УсловноеОформление.Элементы.Добавить();
	уф.Использование = Истина;
	//2 Оформление
	//нс = УФ.Оформление.Элементы.Добавить();
	
	УФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветФона"), Новый Цвет(245, 245, 245));
	УФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Шрифт"), Новый Шрифт("Arial", 11, Истина));	
	//нс.Использование = Истина;
	//нс.Параметр = Новый ПараметрКомпоновкиДанных("ЦветФона");
	//нс.Значение = Новый Цвет(204, 255, 255);
	//3 Поля
	нс = Уф.Поля.Элементы;
	нс1 = нс.Добавить();
	нс1.Использование = Истина;
	нс1.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска");
	//4 Отбор
	нс = Уф.Отбор.Элементы;
	// Группа И
	нс1 = нс.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	нс1.Использование = Истина;
	нс1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	// ДеревоВыпуска.ДатаВыпускаПлановая > 01/01/1980
	нс2 = нс1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	нс2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.ДатаВыпускаПлановая");
	//нс2.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	нс2.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	нс2.ПравоеЗначение = Дата(1980,1,1);
	нс3 = нс1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	нс3.Использование = Истина;
	нс3.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Изделие");
	нс3.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
	//**********************************************************// - условное оформление не работает на дополнительных реквизитах
	
	//ОформлениеРедактирование = НовыйЭлементУсловногоОформления.Оформление.Элементы.Найти("ТолькоПросмотр");
	//ОформлениеРедактирование.Значение = Истина;
	//ОформлениеРедактирование.Использование = Истина;
	//				
	//НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.ДатаВыпускаПлановая");
	//НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	//
	//НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Изделие");
	//НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	//
	//НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.НомерЗаказаДР");
	//НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	//			
	//ОформляемоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.ВыполнитьВсеОперации");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Технолог");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Лазер");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Электрики");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Пила");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Гибка");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Зачиска");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Токарка");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Сборка");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.ОТК");
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоВыпуска.Упаков");
	//ОформляемоеПоле.Использование = Истина;	
	//**********************************************************//
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////

#КонецОбласти                   


//Действия событий элементов форм
#Область ДействияФормы

&НаСервере
Функция ВыполнениеОперацииНаСервере(ТекСтрока, ИмяОперации, СтруктураОтбораПартии, ПоВсемОперациям)
	
	Исполнитель = Справочники.РабочиеЦентры.НайтиПоНаименованию(ТекСтрока.Исполнитель);
	Если Исполнитель = Неопределено Тогда 
		Сообщить("не удалось определить Рабочий центр");
		Возврат Ложь;   
	Иначе 
		ФЛИсполнитель = ПолучитьИсполнителляРЦ(Исполнитель);
		Если ФЛИсполнитель = Неопределено Тогда 
			Сообщить("Не заполнен ответственный исполнитель для рабочего центра " + Исполнитель);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("ДатаВыпускаПлановая,Изделие,Назначение");
	ЗаполнитьЗначенияСвойств(ПараметрыОтбора,СтруктураОтбораПартии); 
	ТабПлан = ТабПланПроизводства.Выгрузить(ПараметрыОтбора,"ЭтапПроизводства");
	ТабПлан.Свернуть("ЭтапПроизводства");
	МассивЭтапов = ТабПлан.ВыгрузитьКолонку("ЭтапПроизводства");    
	//Убрать отбор по Спецификации, оставить только по этапам
	ТабПлан = ТабПланПроизводства.Выгрузить(ПараметрыОтбора,"Спецификация");
	ТабПлан.Свернуть("Спецификация");
	МассивСпецификаций = ТабПлан.ВыгрузитьКолонку("Спецификация");
	
	Запрос = Новый Запрос;                      
	Запрос.Текст = ПолучитьТекстЗапросаОперацийПоЭатпам();
	//Запрос получает данные для звгрузки в регистр ТТМ_ИсполнениеТехПроцесса 
	//невыполненные операции по спецификации
	
	Запрос.УстановитьПараметр("МассивСпецификаций", МассивСпецификаций);
	Запрос.УстановитьПараметр("ДатаВыпускаПлановая",СтруктураОтбораПартии.ДатаВыпускаПлановая);
	Запрос.УстановитьПараметр("Ответственный",Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДатаСеанса());  
	Запрос.УстановитьПараметр("ПоВсемОперациям",ПоВсемОперациям); 
	Запрос.УстановитьПараметр("ИмяКолонки",ИмяОперации);	
	Запрос.УстановитьПараметр("МассивЭтапов",МассивЭтапов);	                
	//Если ЗначениеЗаполнено(ТекСтрока.Исполнитель) Тогда 
	//	НазначенныйИсполнитель = Справочники.РабочиеЦентры.НайтиПоНаименованию(ТекСтрока.Исполнитель);
	//Иначе 
	//	НазначенныйИсполнитель = Справочники.РабочиеЦентры.ПустаяСсылка();
	//КонецЕсли;                                                       
	
	//Исполнителя заполним при заполнении строки регистра только для операции Сборка 
	НазначенныйИсполнитель = Справочники.РабочиеЦентры.ПустаяСсылка(); 
	Запрос.УстановитьПараметр("Исполнитель",НазначенныйИсполнитель); //ТекСтрока.Исполнитель);
	//СтруктураПараметров = Запрос.НайтиПараметры();
	
	//Параметр ПоВсемОперациям = 1 для записи выполнения по всем операциям спецификации
	//иначе только по той колонке в которой отметка
	
	ЭтапыПроизводства = Запрос.Выполнить().Выгрузить();    
	
	Если ЭтапыПроизводства.Количество() = 0 Тогда 
		Сообщить("Данная операция не определена для спецификации!");
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоПоследняяОперация = Ложь;
	Если ЭтапыПроизводства[0].ОсталосьВыполнить = 1 
		и ЭтапыПроизводства[0].ТехОперация.РабочийЦентр.Наименование = ИмяОперации Тогда 
		
		ЭтоПоследняяОперация = Истина;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	НЗ = РегистрыСведений.ТТМ_ИсполнениеТехПроцесса.СоздатьНаборЗаписей();        
	УстановитьОтметкуИзделиеВыпущено = Ложь;   
	
	Для Каждого СтрЭтап из ЭтапыПроизводства Цикл 
		
		НЗ.Отбор.ЭтапПроизводства.Установить(СтрЭтап.ЭтапПроизводства);
		НЗ.Отбор.Изделие.Установить(СтрЭтап.Изделие);
		НЗ.Отбор.Назначение.Установить(СтрЭтап.Назначение);
		НЗ.Прочитать();        
		
		КоличествоВыполненыхОпераций = НЗ.Количество();
		
		НЗ.Отбор.ТехОперация.Установить(СтрЭтап.ТехОперация);
		НЗ.Прочитать(); 
		
		Если НЗ.Количество() = 0 Тогда 
			НоваяСтрока = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрЭтап);  
			Если ЗначениеЗаполнено(ТекСтрока.Исполнитель) и СтрЭтап.РабочийЦентр.Наименование = "Сборка" Тогда 
				НоваяСтрока.Исполнитель = Исполнитель; //Справочники.РабочиеЦентры.НайтиПоНаименованию(ТекСтрока.Исполнитель);
				НоваяСтрока.ОтветственыйИсполнитель = ФЛИсполнитель;
			КонецЕсли;
			
			Попытка                                                
				НЗ.Записать(); 
			Исключение   
				Сообщить("Ощибка при записи данных о выполнении операции в регистр! Данные не записаны!");
				ОтменитьТранзакцию();
			КонецПопытки;
		Иначе 
			Сообщить("Результат отбора не пустой, операция уже была выполнена ранее!");
		КонецЕсли;     
		
	КонецЦикла;                   
	
	Если ЭтоПоследняяОперация или ПоВсемОперациям Тогда
		
		НЗ.Отбор.Сбросить();    
		Для Каждого ЭтапПроизводства из ЭтапыПроизводства Цикл 
			
			НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства.ЭтапПроизводства);
			НЗ.Отбор.Изделие.Установить(ЭтапПроизводства.Изделие);
			НЗ.Отбор.Назначение.Установить(ЭтапПроизводства.Назначение);
			НЗ.Прочитать();
			Для Каждого СтрНЗ из НЗ Цикл 
				СтрНЗ.ИзделиеВыпущено = Истина;
			КонецЦикла; 
			Попытка
				НЗ.Записать(); 
			Исключение
				Сообщить("Ошибка при установке признака Изделие выпущено! Данные о выполнении операции не записаны!");
				ОтменитьТранзакцию();
			КонецПопытки;  
			
		КонецЦикла; 

	КонецЕсли;      
	
	ЗафиксироватьТранзакцию();
	Возврат Истина; 
	
КонецФункции

&НаСервере
Функция ОтменитьВыполнениеОперацииНаСервере(ИмяОперации, СтруктураОтбораПартии, ПоВсемОперациям);
	
	ПараметрыОтбора = Новый Структура("ДатаВыпускаПлановая,Изделие,Назначение");
	ЗаполнитьЗначенияСвойств(ПараметрыОтбора,СтруктураОтбораПартии); 
	ТабПлан = ТабПланПроизводства.Выгрузить(ПараметрыОтбора,"ЭтапПроизводства");
	ТабПлан.Свернуть("ЭтапПроизводства");
	МассивЭтапов = ТабПлан.ВыгрузитьКолонку("ЭтапПроизводства");    
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
						|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства КАК ЭтапПроизводства,
						|	ТТМ_ИсполнениеТехПроцесса.Изделие КАК Изделие,
						|	ТТМ_ИсполнениеТехПроцесса.Назначение КАК Назначение,
						|	ТТМ_ИсполнениеТехПроцесса.ТехОперация КАК ТехОперация,
						|	ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
						|	ТТМ_ИсполнениеТехПроцесса.РабочийЦентр КАК РабочийЦентр,
						|	ТТМ_ИсполнениеТехПроцесса.ДатаНачала КАК ДатаНачала,
						|	ТТМ_ИсполнениеТехПроцесса.ДатаОкончания КАК ДатаОкончания,
						|	ТТМ_ИсполнениеТехПроцесса.ВремаОперацииПоСпецификацииВСекундах КАК ВремаОперацииПоСпецификацииВСекундах,
						|	ТТМ_ИсполнениеТехПроцесса.ВремаОперацииФактическоеВСекундах КАК ВремаОперацииФактическоеВСекундах,
						|	ТТМ_ИсполнениеТехПроцесса.Исполнитель КАК Исполнитель,
						|	ТТМ_ИсполнениеТехПроцесса.Ответственный КАК Ответственный
						|ИЗ
						|	РегистрСведений.ТТМ_ИсполнениеТехПроцесса КАК ТТМ_ИсполнениеТехПроцесса
						|ГДЕ
						|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства В (&МассивЭтапов)
						|	И ВЫБОР
						|			КОГДА &ПоВсемОперациям = 1
						|				ТОГДА ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра.Наименование ПОДОБНО ""%""
						|			ИНАЧЕ ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра.Наименование ПОДОБНО &ИмяОперации
						|		КОНЕЦ";
	Запрос.УстановитьПараметр("ИмяОперации",ИмяОперации);
	Запрос.УстановитьПараметр("МассивЭтапов",МассивЭтапов);
	Запрос.УстановитьПараметр("ПоВсемОперациям",ПоВсемОперациям);
	//Выборка = Запрос.Выполнить().Выбрать();
	ТабВРЦ = Запрос.Выполнить().Выгрузить();
	ТабВРЦ.Свернуть("ВидРабочегоЦентра");
	
	Попытка
		//Пока Выборка.Следующий() Цикл 
		Для Каждого ЭтапПроизводства из МассивЭтапов Цикл 
			НЗ = РегистрыСведений.ТТМ_ИсполнениеТехПроцесса.СоздатьНаборЗаписей();
			НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства);  
			НЗ.Прочитать(); 
			Если НЗ.Количество() <> 0 Тогда 
				ИзделиеВыпущено = НЗ[0].ИзделиеВыпущено;
			Иначе 
				ИзделиеВыпущено = Ложь;
			КонецЕсли;
			
			Если ИзделиеВыпущено Тогда //установим признак Изделие выпущено = ЛОЖЬ для всех операций этапа
				Для Каждого СтрНЗ из НЗ Цикл 
					СтрНЗ.ИзделиеВыпущено = Ложь;
				КонецЦикла;
			КонецЕсли; 
			НЗ.Записать();
			Если не ПоВсемОперациям Тогда 
				НЗ.Отбор.ВидРабочегоЦентра.Установить(ТабВРЦ[0].ВидРабочегоЦентра); 
			КонецЕсли;   
			НЗ.Прочитать();
			НЗ.Очистить();
			НЗ.Записать();    
			//Если ИзделиеВыпущено и не ПоВсемОперациям Тогда 
			//	Для Каждого СтрЭтап из МассивЭтапов Цикл 
			//		НЗ.Отбор.Сбросить();
			//		НЗ.Отбор.ЭтапПроизводства.Установить(СтрЭтап);
			//		НЗ.Прочитать();
			//		Для Каждого СтрНЗ из НЗ Цикл 
			//			СтрНЗ.ИзделиеВыпущено = Ложь;
			//		КонецЦикла; 
			//		НЗ.Записать();
			//	КонецЦикла;  
			//КонецЕсли;
		КонецЦикла; 
		Возврат Истина;
	Исключение      
		Если ПоВсемОперациям = 1 Тогда 
			ТекстСообщения = "Не удалось отменить выполнение операций!";
		Иначе 
			ТекстСообщения = "Не удалось отменить выполнение операции!";
		КонецЕсли;
		Сообщить(ТекстСообщения + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаОперацийПоЭатпам() 
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ЕСТЬNULL(ТехнологическиеОперации.Ссылка, ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка)) КАК ТехОперация,
|	ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
|	ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК Исполнитель,
|	ВЫБОР
|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(справочник.ВидыРабочихЦентров.ПустаяСсылка))) = ТИП(Справочник.ВидыРабочихЦентров)
|			ТОГДА ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
|		ИНАЧЕ ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр.ВидРабочегоЦентра, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
|	КОНЕЦ КАК ВидРабочегоЦентра,
|	&Ответственный КАК Ответственный,
|	&ТекущаяДата КАК ДатаНачала,
|	&ТекущаяДата КАК ДатаОкончания,
|	0 КАК ВремаОперацииПоСпецификацииВСекундах,
|	0 КАК ВремяОперацииФактическоеВСекундах,
|	ЕСТЬNULL(ТехнологическиеОперации.ВремяШтучное, 0) КАК ВремяШтучное,
|	ЕСТЬNULL(ТехнологическиеОперации.ВремяШтучноеЕдИзм, ЗНАЧЕНИЕ(перечисление.ЕдиницыИзмеренияВремени.ПустаяСсылка)) КАК ВремяШтучноеЕдИзм
|ПОМЕСТИТЬ ТехОперацииПоСпецификациямЭтапов
|ИЗ
|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
|ГДЕ
|	НЕ ЕСТЬNULL(ТехнологическиеОперации.ПометкаУдаления, ЛОЖЬ)
|	И ТехнологическиеОперации.Спецификация В(&МассивСпецификаций)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(ТехнологическиеОперации.Ссылка, ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка))) КАК КоличествоОпераций,
|	ТехнологическиеОперации.Спецификация КАК Спецификация
|ПОМЕСТИТЬ КоличествоОперацийПоСпецификации
|ИЗ
|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
|ГДЕ
|	НЕ ЕСТЬNULL(ТехнологическиеОперации.ПометкаУдаления, ЛОЖЬ)
|	И ТехнологическиеОперации.Спецификация В(&МассивСпецификаций)
|
|СГРУППИРОВАТЬ ПО
|	ТехнологическиеОперации.Спецификация
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка, ЗНАЧЕНИЕ(Документ.ЭтапПРоизводства2_2.ПустаяСсылка)) КАК ЭтапПроизводства,
|	ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)) КАК Изделие,
|	ЕСТЬNULL(ЭтапПроизводства2_2ВыходныеИзделия.Назначение, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение,
|	ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.ТехОперация, ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка)) КАК ТехОперация,
|	ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
|	&Исполнитель КАК Исполнитель,
|	ВЫБОР
|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.РабочийЦентр, ЗНАЧЕНИЕ(справочник.ВидыРабочихЦентров.ПустаяСсылка))) = ТИП(Справочник.ВидыРабочихЦентров)
|			ТОГДА ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
|		ИНАЧЕ ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.РабочийЦентр.ВидРабочегоЦентра, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
|	КОНЕЦ КАК ВидРабочегоЦентра,
|	&Ответственный КАК Ответственный,
|	&ТекущаяДата КАК ДатаНачала,
|	&ТекущаяДата КАК ДатаОкончания,
|	0 КАК ВремаОперацииПоСпецификацииВСекундах,
|	0 КАК ВремяОперацииФактическоеВСекундах,
|	ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.ВремяШтучное, 0) КАК ВремяШтучное,
|	ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.ВремяШтучноеЕдИзм, ЗНАЧЕНИЕ(перечисление.ЕдиницыИзмеренияВремени.ПустаяСсылка)) КАК ВремяШтучноеЕдИзм,
|	ЕСТЬNULL(КоличествоОперацийПоСпецификации.КоличествоОпераций, 0) КАК КоличествоОпераций
|ПОМЕСТИТЬ ВсеОперацииПоСпецификации
|ИЗ
|	ТехОперацииПоСпецификациямЭтапов КАК ТехОперацииПоСпецификациямЭтапов
|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
|		ПО (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация = ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.ТехОперация.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПУстаяССылка)))
|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоОперацийПоСпецификации КАК КоличествоОперацийПоСпецификации
|		ПО ТехОперацииПоСпецификациямЭтапов.ТехОперация.Спецификация = КоличествоОперацийПоСпецификации.Спецификация
|ГДЕ
|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства = &ДатаВыпускаПлановая
|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка В(&МассивЭтапов)
|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства КАК ЭтапПроизводства,
|	ТТМ_ИсполнениеТехПроцесса.Изделие КАК Изделие,
|	ТТМ_ИсполнениеТехПроцесса.Назначение КАК Назначение,
|	ТТМ_ИсполнениеТехПроцесса.ТехОперация КАК ТехОперация,
|	ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
|	ТТМ_ИсполнениеТехПроцесса.РабочийЦентр КАК РабочийЦентр,
|	ТТМ_ИсполнениеТехПроцесса.ДатаНачала КАК ДатаНачала,
|	ТТМ_ИсполнениеТехПроцесса.ДатаОкончания КАК ДатаОкончания,
|	ТТМ_ИсполнениеТехПроцесса.ВремаОперацииПоСпецификацииВСекундах КАК ВремаОперацииПоСпецификацииВСекундах,
|	ТТМ_ИсполнениеТехПроцесса.ВремаОперацииФактическоеВСекундах КАК ВремаОперацииФактическоеВСекундах,
|	ТТМ_ИсполнениеТехПроцесса.Исполнитель КАК Исполнитель,
|	ТТМ_ИсполнениеТехПроцесса.Ответственный КАК Ответственный,
|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТТМ_ИсполнениеТехПроцесса.ТехОперация) КАК ВыполненоОпераций
|ПОМЕСТИТЬ ВыполненныеОперации
|ИЗ
|	РегистрСведений.ТТМ_ИсполнениеТехПроцесса КАК ТТМ_ИсполнениеТехПроцесса
|ГДЕ
|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства В(&МассивЭтапов)
|
|СГРУППИРОВАТЬ ПО
|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства,
|	ТТМ_ИсполнениеТехПроцесса.Изделие,
|	ТТМ_ИсполнениеТехПроцесса.Назначение,
|	ТТМ_ИсполнениеТехПроцесса.ТехОперация,
|	ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра,
|	ТТМ_ИсполнениеТехПроцесса.РабочийЦентр,
|	ТТМ_ИсполнениеТехПроцесса.ДатаНачала,
|	ТТМ_ИсполнениеТехПроцесса.ДатаОкончания,
|	ТТМ_ИсполнениеТехПроцесса.ВремаОперацииПоСпецификацииВСекундах,
|	ТТМ_ИсполнениеТехПроцесса.ВремаОперацииФактическоеВСекундах,
|	ТТМ_ИсполнениеТехПроцесса.Исполнитель,
|	ТТМ_ИсполнениеТехПроцесса.Ответственный
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства КАК ЭтапПроизводства,
|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТТМ_ИсполнениеТехПроцесса.ТехОперация) КАК ВыполненоОпераций
|ПОМЕСТИТЬ КоличествоВыполненныхОпераций
|ИЗ
|	РегистрСведений.ТТМ_ИсполнениеТехПроцесса КАК ТТМ_ИсполнениеТехПроцесса
|ГДЕ
|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства В(&МассивЭтапов)
|
|СГРУППИРОВАТЬ ПО
|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВсеОперацииПоСпецификации.ЭтапПроизводства КАК ЭтапПроизводства,
|	ВсеОперацииПоСпецификации.Изделие КАК Изделие,
|	ВсеОперацииПоСпецификации.Назначение КАК Назначение,
|	ВсеОперацииПоСпецификации.ТехОперация КАК ТехОперация,
|	ВсеОперацииПоСпецификации.РабочийЦентр КАК РабочийЦентр,
|	ВсеОперацииПоСпецификации.Исполнитель КАК Исполнитель,
|	ВсеОперацииПоСпецификации.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
|	ВсеОперацииПоСпецификации.Ответственный КАК Ответственный,
|	ВсеОперацииПоСпецификации.ДатаНачала КАК ДатаНачала,
|	ВсеОперацииПоСпецификации.ДатаОкончания КАК ДатаОкончания,
|	ВсеОперацииПоСпецификации.ВремаОперацииПоСпецификацииВСекундах КАК ВремаОперацииПоСпецификацииВСекундах,
|	ВсеОперацииПоСпецификации.ВремяОперацииФактическоеВСекундах КАК ВремяОперацииФактическоеВСекундах,
|	ВсеОперацииПоСпецификации.ВремяШтучное КАК ВремяШтучное,
|	ВсеОперацииПоСпецификации.ВремяШтучноеЕдИзм КАК ВремяШтучноеЕдИзм,
|	ЕСТЬNULL(КоличествоВыполненныхОпераций.ВыполненоОпераций, 0) КАК ВыполненоОпераций,
|	ВсеОперацииПоСпецификации.КоличествоОпераций - ЕСТЬNULL(КоличествоВыполненныхОпераций.ВыполненоОпераций, 0) КАК ОсталосьВыполнить
|ИЗ
|	ВсеОперацииПоСпецификации КАК ВсеОперацииПоСпецификации
|		ЛЕВОЕ СОЕДИНЕНИЕ ВыполненныеОперации КАК ВыполненныеОперации
|		ПО (ВсеОперацииПоСпецификации.ЭтапПроизводства = ВыполненныеОперации.ЭтапПроизводства)
|			И (ВсеОперацииПоСпецификации.ТехОперация = ВыполненныеОперации.ТехОперация)
|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоВыполненныхОпераций КАК КоличествоВыполненныхОпераций
|		ПО (ВсеОперацииПоСпецификации.ЭтапПроизводства = КоличествоВыполненныхОпераций.ЭтапПроизводства)
|ГДЕ
|	НЕ ВсеОперацииПоСпецификации.ТехОперация В
|				(ВЫБРАТЬ
|					Т.ТехОперация
|				ИЗ
|					ВыполненныеОперации КАК Т)
|	И ВЫБОР
|			КОГДА &ПоВсемОперациям = 1
|				ТОГДА ВсеОперацииПоСпецификации.РабочийЦентр.Наименование ПОДОБНО ""%""
|			КОГДА ЕСТЬNULL(ВсеОперацииПоСпецификации.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)
|				ТОГДА ВсеОперацииПоСпецификации.РабочийЦентр.Наименование ПОДОБНО ""%""
|			КОГДА ТИПЗНАЧЕНИЯ(ВсеОперацииПоСпецификации.РабочийЦентр) = ТИП(Справочник.ВидыРабочихЦентров)
|				ТОГДА ВсеОперацииПоСпецификации.РабочийЦентр.Наименование ПОДОБНО &ИмяКолонки
|			ИНАЧЕ ВсеОперацииПоСпецификации.РабочийЦентр.ВидРабочегоЦентра.Наименование ПОДОБНО &ИмяКолонки
|		КОНЕЦ";
	
	//ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//		|	ЕСТЬNULL(ТехнологическиеОперации.Ссылка, ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка)) КАК ТехОперация,
	//		|	ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
	//		|	ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК Исполнитель,
	//		|	ВЫБОР
	//		|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(справочник.ВидыРабочихЦентров.ПустаяСсылка))) = ТИП(Справочник.ВидыРабочихЦентров)
	//		|			ТОГДА ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
	//		|		ИНАЧЕ ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр.ВидРабочегоЦентра, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
	//		|	КОНЕЦ КАК ВидРабочегоЦентра,
	//		|	&Ответственный КАК Ответственный,
	//		|	&ТекущаяДата КАК ДатаНачала,
	//		|	&ТекущаяДата КАК ДатаОкончания,
	//		|	0 КАК ВремаОперацииПоСпецификацииВСекундах,
	//		|	0 КАК ВремяОперацииФактическоеВСекундах,
	//		|	ЕСТЬNULL(ТехнологическиеОперации.ВремяШтучное, 0) КАК ВремяШтучное,
	//		|	ЕСТЬNULL(ТехнологическиеОперации.ВремяШтучноеЕдИзм, ЗНАЧЕНИЕ(перечисление.ЕдиницыИзмеренияВремени.ПустаяСсылка)) КАК ВремяШтучноеЕдИзм
	//		|ПОМЕСТИТЬ ТехОперацииПоСпецификациямЭтапов
	//		|ИЗ
	//		|	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	//		|ГДЕ
	//		|	НЕ ЕСТЬNULL(ТехнологическиеОперации.ПометкаУдаления, ЛОЖЬ)
	//		|	И ТехнологическиеОперации.Спецификация В(&МассивСпецификаций)
	//		|	И ВЫБОР
	//		|			КОГДА &ПоВсемОперациям = 1
	//		|				ТОГДА ТехнологическиеОперации.РабочийЦентр.Наименование ПОДОБНО ""%""
	//		|			КОГДА ЕСТЬNULL(ТехнологическиеОперации.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)
	//		|				ТОГДА ТехнологическиеОперации.РабочийЦентр.Наименование ПОДОБНО ""%""
	//		|			КОГДА ТИПЗНАЧЕНИЯ(ТехнологическиеОперации.РабочийЦентр) = ТИП(Справочник.ВидыРабочихЦентров)
	//		|				ТОГДА ТехнологическиеОперации.РабочийЦентр.Наименование ПОДОБНО &ИмяКолонки
	//		|			ИНАЧЕ ТехнологическиеОперации.РабочийЦентр.ВидРабочегоЦентра.Наименование ПОДОБНО &ИмяКолонки
	//		|		КОНЕЦ
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//		|	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК ЭтапПроизводства,
	//		|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Изделие,
	//		|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	//		|	ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.ТехОперация, ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПустаяСсылка)) КАК ТехОперация,
	//		|	ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
	//		|	&Исполнитель КАК Исполнитель,
	//		|	ВЫБОР
	//		|		КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.РабочийЦентр, ЗНАЧЕНИЕ(справочник.ВидыРабочихЦентров.ПустаяСсылка))) = ТИП(Справочник.ВидыРабочихЦентров)
	//		|			ТОГДА ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
	//		|		ИНАЧЕ ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.РабочийЦентр.ВидРабочегоЦентра, ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка))
	//		|	КОНЕЦ КАК ВидРабочегоЦентра,
	//		|	&Ответственный КАК Ответственный,
	//		|	&ТекущаяДата КАК ДатаНачала,
	//		|	&ТекущаяДата КАК ДатаОкончания,
	//		|	0 КАК ВремаОперацииПоСпецификацииВСекундах,
	//		|	0 КАК ВремяОперацииФактическоеВСекундах,
	//		|	ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.ВремяШтучное, 0) КАК ВремяШтучное,
	//		|	ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.ВремяШтучноеЕдИзм, ЗНАЧЕНИЕ(перечисление.ЕдиницыИзмеренияВремени.ПустаяСсылка)) КАК ВремяШтучноеЕдИзм
	//		|ПОМЕСТИТЬ ВсеОперацииПоСпецификации
	//		|ИЗ
	//		|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТехОперацииПоСпецификациямЭтапов КАК ТехОперацииПоСпецификациямЭтапов
	//		|		ПО (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация = ЕСТЬNULL(ТехОперацииПоСпецификациямЭтапов.ТехОперация.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПУстаяССылка)))
	//		|ГДЕ
	//		|	ЭтапПроизводства2_2ВыходныеИзделия.ДатаПроизводства = &ДатаВыпускаПлановая
	//		|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка В(&МассивЭтапов)
	//		|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства КАК ЭтапПроизводства,
	//		|	ТТМ_ИсполнениеТехПроцесса.Изделие КАК Изделие,
	//		|	ТТМ_ИсполнениеТехПроцесса.Назначение КАК Назначение,
	//		|	ТТМ_ИсполнениеТехПроцесса.ТехОперация КАК ТехОперация,
	//		|	ТТМ_ИсполнениеТехПроцесса.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	//		|	ТТМ_ИсполнениеТехПроцесса.РабочийЦентр КАК РабочийЦентр,
	//		|	ТТМ_ИсполнениеТехПроцесса.ДатаНачала КАК ДатаНачала,
	//		|	ТТМ_ИсполнениеТехПроцесса.ДатаОкончания КАК ДатаОкончания,
	//		|	ТТМ_ИсполнениеТехПроцесса.ВремаОперацииПоСпецификацииВСекундах КАК ВремаОперацииПоСпецификацииВСекундах,
	//		|	ТТМ_ИсполнениеТехПроцесса.ВремаОперацииФактическоеВСекундах КАК ВремаОперацииФактическоеВСекундах,
	//		|	ТТМ_ИсполнениеТехПроцесса.Исполнитель КАК Исполнитель,
	//		|	ТТМ_ИсполнениеТехПроцесса.Ответственный КАК Ответственный
	//		|ПОМЕСТИТЬ ВыполненныеОперации
	//		|ИЗ
	//		|	РегистрСведений.ТТМ_ИсполнениеТехПроцесса КАК ТТМ_ИсполнениеТехПроцесса
	//		|ГДЕ
	//		|	ТТМ_ИсполнениеТехПроцесса.ЭтапПроизводства В(&МассивЭтапов)
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВсеОперацииПоСпецификации.ЭтапПроизводства КАК ЭтапПроизводства,
	//		|	ВсеОперацииПоСпецификации.Изделие КАК Изделие,
	//		|	ВсеОперацииПоСпецификации.Назначение КАК Назначение,
	//		|	ВсеОперацииПоСпецификации.ТехОперация КАК ТехОперация,
	//		|	ВсеОперацииПоСпецификации.РабочийЦентр КАК РабочийЦентр,
	//		|	ВсеОперацииПоСпецификации.Исполнитель КАК Исполнитель,
	//		|	ВсеОперацииПоСпецификации.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
	//		|	ВсеОперацииПоСпецификации.Ответственный КАК Ответственный,
	//		|	ВсеОперацииПоСпецификации.ДатаНачала КАК ДатаНачала,
	//		|	ВсеОперацииПоСпецификации.ДатаОкончания КАК ДатаОкончания,
	//		|	ВсеОперацииПоСпецификации.ВремаОперацииПоСпецификацииВСекундах КАК ВремаОперацииПоСпецификацииВСекундах,
	//		|	ВсеОперацииПоСпецификации.ВремяОперацииФактическоеВСекундах КАК ВремяОперацииФактическоеВСекундах,
	//		|	ВсеОперацииПоСпецификации.ВремяШтучное КАК ВремяШтучное,
	//		|	ВсеОперацииПоСпецификации.ВремяШтучноеЕдИзм КАК ВремяШтучноеЕдИзм
	//		|ИЗ
	//		|	ВсеОперацииПоСпецификации КАК ВсеОперацииПоСпецификации
	//		|ГДЕ
	//		|	НЕ ВсеОперацииПоСпецификации.ТехОперация В
	//		|				(ВЫБРАТЬ
	//		|					Т.ТехОперация
	//		|				ИЗ
	//		|					ВыполненныеОперации КАК Т)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
//Процедура события ПриИзменении для колонок по ВидамРабочихЦентров (поле флажка при изменении)
Процедура ВыполнениеОперации(Элемент)
	
	ТекСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные; 
	//ТекСтрокаСтруктура = ПолучитьСтруктуруТекущейСтроки();
	//ЗаполнитьЗначенияСвойств(ТекСтрокаСтруктура,ТекСтрока);
	//СтруктураОтбораПартии = Элементы.ТабПланПроизводства.ОтборСтрок;
	//ИмяОперации = Элемент.Имя;  
	
	Если Элемент.Родитель.ТекущиеДанные.Изделие = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда   
		//Это строка 1-го уровня, отменяем все действия с ней
		Элемент.Родитель.ТекущиеДанные[Элемент.Имя] = не Элемент.Родитель.ТекущиеДанные[Элемент.Имя];
		Возврат;
	КонецЕсли;
	
	Если Элемент.Родитель.ТекущиеДанные[Элемент.Имя] Тогда 
		ЭтоВыполненияОпераций = Истина;
	Иначе // отмена выполнения операций
		ЭтоВыполненияОпераций = Ложь; 
	КонецЕсли; 
	
	КоличествоОперацийСпецификации = ПроверитьОперацииПоСпецификации(ТекСтрока.Спецификация);
	
	Если ЭтоВыполненияОпераций и КоличествоОперацийСпецификации = 0 и ЗначениеЗаполнено(Объект.ШаблонТехПроцесса) Тогда                                                                     
		ПараметрыЗаполненияОпераций = Новый Структура("Спецификация,ШаблонТехПроцесса,Элемент",ТекСтрока.Спецификация,Объект.ШаблонТехПроцесса,Элемент);
		ОповещениеОтсутствиеОпераций = Новый ОписаниеОповещения("ЗаполнениеОперацийСпецификации",ЭтаФорма,ПараметрыЗаполненияОпераций);
		ПоказатьВопрос(ОповещениеОтсутствиеОпераций,"Операции для спецификации не определены! Заполнить Операции по шаблону " + Объект.ШаблонТехПроцесса + "?",РежимДиалогаВопрос.ДаНет);
	Иначе 
		ВыполнениеОперацииПродолжение(Элемент);
		//Сообщить("Операции для спецификации не определены ");
		Возврат;
	КонецЕсли;
	
	////++Дарвин А.А. 03.07.2024
	//ТекущаяКоманда = "ОтменаИПодтверждениеОпераций";
	//ОчиститьСообщения();
	////Дарвин А.А.
	//
	//Если Элемент.Родитель.ТекущиеДанные[Элемент.Имя] Тогда 
	//	ЭтоВыполненияОпераций = Истина;
	//Иначе // отмена выполнения операций
	//	ЭтоВыполненияОпераций = Ложь; 
	//КонецЕсли;
	//Если Врег(ИмяОперации) = Врег("ИзделиеВыпущено") Тогда   //ВыполнитьВсеОперации
	//	ПоВсемОперациям = 1
	//Иначе 
	//	ПоВсемОперациям = 0;
	//КонецЕсли;
	//Если ЭтоВыполненияОпераций и (СтрНайти(ВРЕГ(ИмяОперации),ВРег("Сборка")) > 0 или ПоВсемОперациям = 1) Тогда  
	//	Если не ЗначениеЗаполнено(ТекСтрока.Исполнитель) Тогда 
	//		ТекСтрока[ИмяОперации] = не ТекСтрока[ИмяОперации];
	//		Сообщить("Укажите исполнителя операции для данной партии!" + Символы.ПС + "Данные не записаны");
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	////++Дарвин А.А. 03.07.2024		
	//Если Элемент.Родитель.ТекущиеДанные[Элемент.Имя] = Ложь Тогда
	//	//ЗаписиОбновлены = ВыполнениеОперацииНаСервере(ТекСтрокаСтруктура, ИмяОперации, СтруктураОтбораПартии, ВыполнитьВсеОперации, Истина);		
	//	Если ПоВсемОперациям = 1 Тогда           
	//		ТекстВопроса = "Вы действительно хотите очистить историю выполнения операций по партии?";
	//	Иначе 
	//		ТекстВопроса = "Вы действительно хотите удалить историю выполнения операции по партии?";
	//	КонецЕсли;
	//	ДопПараметры = ТекСтрокаСтруктура;       
	//	ДопПараметры.Вставить("ПоВсемОперациям",ПоВсемОперациям);
	//	ДопПараметры.Вставить("ИмяОперации",ИмяОперации);
	//	ОповещениеОбУдаленииВсехОперацийПоПартии = Новый ОписаниеОповещения("УдалениеОперацийПоПартииПродолжение", ЭтаФорма, ДопПараметры);
	//	ПоказатьВопрос(ОповещениеОбУдаленииВсехОперацийПоПартии,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	//Иначе   
	//	ЗаписиОбновлены = ВыполнениеОперацииНаСервере(ТекСтрокаСтруктура, ИмяОперации, СтруктураОтбораПартии, ПоВсемОперациям);  		
	//	//Установить галочки по всем операциям
	//	
	//	Если ЗаписиОбновлены Тогда  
	//		СнятьУстановитьОтметкуВыполненияОперации(ПоВсемОперациям, ИмяОперации, Истина);
	//	Иначе 
	//		ТекСтрока[ИмяОперации] = не ТекСтрока[ИмяОперации];
	//	КонецЕсли;
	//	
	//	//ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение);
	//	//РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
	//КонецЕсли;
	//
	////Если Не ЗаписиОбновлены Тогда 
	////	Элемент.Родитель.ТекущиеДанные[Элемент.Имя] = Ложь;
	////	Возврат;
	////КонецЕсли; 
	//	
	//СформироватьОповещениеДляПользователя(ТекущаяКоманда);
	////Дарвин А.А.
		
КонецПроцедуры    

&НаКлиенте
//Процедура события ПриИзменении для колоноки по ПлановыаяДатаВыпуска
Процедура ИзменитьПлановуюДатуВыпускаВЭтапах(Элемент)
	
	СтруктураОтбораПартии = Новый Структура("Датавыпускаплановая, Изделие, Назначение");
	ЗаполнитьЗначенияСвойств(СтруктураОтбораПартии,Элементы.ТабПланПроизводства.ОтборСтрок);             
	
	Если Элемент.Родитель.ТекущиеДанные.Изделие = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда   
		//Это строка 1-го уровня, вернем значение до изменения                          
		Элемент.Родитель.ТекущиеДанные[Элемент.Имя] = СтруктураОтбораПартии[Элемент.Имя];
		Возврат;
	КонецЕсли;
	
	//Если Элемент.Родитель.ТекущиеДанные[Элемент.Имя] Тогда 
	//	ЭтоВыполненияОпераций = Истина;
	//Иначе // отмена выполнения операций
	//	ЭтоВыполненияОпераций = Ложь; 
	//КонецЕсли;
	
	//ДатаВыпускаИсходная, ДатаВыпускаНовая)
	
	
	
	ДатаВыпускаНовая = Элемент.Родитель.ТекущиеДанные[Элемент.Имя]; //ТекущаяДата();
	ДопПараметры = Новый Структура("ДатаИсходная, ДатаНовая, СтруктураОтбораПартии", СтруктураОтбораПартии.ДатаВыпускаПлановая, ДатаВыпускаНовая, СтруктураОтбораПартии);
	ОповещениеОбИзмененииПлановойДатыПроизводства = Новый ОписаниеОповещения("ИзменитьПлановуюДатуВыпускаВЭтапахПродолжение", ЭтаФорма, ДопПараметры); 	
	ПоказатьВопрос(ОповещениеОбИзмененииПлановойДатыПроизводства,"Изменить плановую дату выпуска для всех подчиненных этапов?",РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры        

&НаКлиенте
Процедура ИзменитьПлановуюДатуВыпускаВЭтапахПродолжение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение,ДопПараметры.СтруктураОтбораПартии);
	Иначе 
		ИзменитьПлановуюДатуВыпускаВЭтапахНаСервере(ДопПараметры.ДатаИсходная, ДопПараметры.ДатаНовая, ДопПараметры.СтруктураОтбораПартии);
		ДопПараметры.СтруктураОтбораПартии.Датавыпускаплановая = ДопПараметры.ДатаНовая;
		ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение,ДопПараметры.СтруктураОтбораПартии);
		РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
		//Спозиционируемся на новой строке
		//Элементы.ДеревоВыпуска. 
		Если ДопПараметры.Свойство("СтруктураОтбораПартии") <> Неопределено Тогда 
			УстановитьТекущуюСтрокуДереваВыпуска(ДопПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПлановуюДатуВыпускаВЭтапахНаСервере(ДатаВыпускаИсходная, ДатаВыпускаНовая, СтруктураОтбораПартии)
	
	МассивСтрокДляОбработки = ТабПланПроизводства.НайтиСтроки(СтруктураОтбораПартии);
	Для Каждого Стр из МассивСтрокДляОбработки Цикл   
		Если не Стр.Отметка Тогда 
			Продолжить;
		КонецЕсли;
		ЭтапОбъект = Стр.ЭтапПроизводства.ПолучитьОбъект();
		Для Каждого СтрТЧ из ЭтапОбъект.ВыходныеИзделия Цикл 
			Если СтрТЧ.ДатаПроизводства <> ДатаВыпускаНовая Тогда 
				СтрТЧ.ДатаПроизводства = ДатаВыпускаНовая;
			КонецЕсли;
		КонецЦикла;   
		Попытка
			ЭтапОбъект.Записать();
		Исключение
			Сообщить("Ошибка при изменении Даты производства!" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеОперацийПоПартииПродолжение(Результат, ДопПараметры)	Экспорт
	
	Если не Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные; 
		Если не ТекСтрока = Неопределено Тогда 
			Текстрока[ДопПараметры.ИмяОперации] = не ТекСтрока[ДопПараметры.ИмяОперации];
		КонецЕсли;
		Возврат;
	Иначе 
		ЗаписиОбновлены = ОтменитьВыполнениеОперацииНаСервере(ДопПараметры.ИмяОперации, ДопПараметры, ДопПараметры.ПоВсемОперациям);
		
		Если ЗаписиОбновлены Тогда                                                                                      
			
			СнятьУстановитьОтметкуВыполненияОперации(ДопПараметры.ПоВсемОперациям, ДопПараметры.ИмяОперации, Ложь);
			
			//Если ДопПараметры.ПоВсемОперациям = 1 Тогда 
			//	СнятьУстановитьОтметкуВыполненияОперации(ДопПараметры.ПоВсемОперациям, ДопПараметры.ИмяОперации, Ложь);
			//Иначе 
			//	Текстрока[ДопПараметры.ИмяОперации] = не ТекСтрока[ДопПараметры.ИмяОперации];
			//КонецЕсли;
		Иначе                  
			Если не ТекСтрока = Неопределено Тогда 
				ТекСтрока[ДопПараметры.ИмяОперации] = не ТекСтрока[ДопПараметры.ИмяОперации];
			КонецЕсли;
		КонецЕсли;
		//ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение);
	КонецЕсли;
	
КонецПроцедуры	    

&НаКлиенте
Процедура СнятьУстановитьОтметкуВыполненияОперации(ПоВсемОперациям, ИмяОперации, Выполнено)
	
	ТекСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные;
	 
	МассивВРЦ = ПолучитьВидыРабочихЦентров(Объект.ПроизводственноеПодразделение);  
	Если ПоВсемОперациям = 1 Тогда  
		Для Каждого ВРЦ из МассивВРЦ Цикл 
		
			Попытка
				ТекСтрока[Строка(ВРЦ)] = Выполнено;   
				ТекСтрока.ИзделиеВыпущено = Выполнено;
			Исключение
				Сообщить("Отсутствует колонка " + ВРЦ.Имя);
			КонецПопытки; 

		КонецЦикла;  
	Иначе 
		Текстрока[ИмяОперации] = Выполнено; // не ТекСтрока[ИмяОперации];
		СчетсикОпераций = 0;
		Для Каждого ВРЦ из МассивВРЦ Цикл 
			Если ТекСтрока[Строка(ВРЦ)] = Выполнено Тогда 
				СчетсикОпераций = СчетсикОпераций + 1;
			КонецЕсли;
		КонецЦикла;                                   
		Если Выполнено Тогда 
			Если СчетсикОпераций = МассивВРЦ.Количество() Тогда 
				ТекСтрока.ИзделиеВыпущено = Выполнено;     
			Иначе 
				ТекСтрока.ИзделиеВыпущено = не Выполнено;
			КонецЕсли;
		Иначе 
			Если ТекСтрока.ИзделиеВыпущено Тогда 
				ТекСтрока.ИзделиеВыпущено = Выполнено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;   
	//Если ПоВсемОперациям = 1 Тогда 
	//	ТекСтрока.ИзделиеВыпущено = Выполнено
	//ИначеЕсли не Выполнено Тогда 
	//	//Если партия выпущена, тогда тменить выпуск
	//	//Если партия не выпущена и это посл
	//КонецЕсли;
	
	//следующая строка вызывает ошибку с завершением работы 1С
	//ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭтаповПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные;
	
	Если не ТекСтрока = Неопределено Тогда
		//++Дарвин А.А. 01.07.2024
		ИсполнительПередИзменением = ТекСтрока.Исполнитель;
		//Дарвин А.А.
		
		//ТекСтрокаСтруктура = ПолучитьСтруктуруТекущейСтроки();                  
		ОтборЭтапов = Новый Структура("ДатаВыпускаПлановая, Изделие, Назначение");
		ЗаполнитьЗначенияСвойств(ОтборЭтапов,ТекСтрока);
		Элементы.ТабПланПроизводства.ОтборСтрок  = Новый ФиксированнаяСтруктура(ОтборЭтапов);
	Иначе 
		Элементы.ТабПланПроизводства.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруТекущейСтроки()
	
	Возврат Новый Структура(
		"ДатаВыпускаПлановая,
		|ЭтапПроизводства, 
		|Изделие, 
		|Назначение, 
		|ТехОперация, 
		|Исполнитель,
		|Количество, 
		|КоличествоУпаковок, 
		|Упаковка, 
		|Операций,
		|Спецификация,
		|ВидРабочегоЦентра,
		|ТехОперация");  
	
КонецФункции   

&НаКлиенте
Процедура ЗаполнениеОперацийСпецификации(Результат, ПараметрыЗаполненияОпераций) Экспорт
	
	//КоличествоОперацийСпецификации = ПроверитьОперацииПоСпецификации(ПараметрыЗаполненияОпераций.Спецификация);
	Если Результат = КодВозвратаДиалога.Да Тогда //и КоличествоОперацийСпецификации = 0
		ОперацииЗаполнены = ЗаполнениеОперацийНаСервере(ПараметрыЗаполненияОпераций.Спецификация, ПараметрыЗаполненияОпераций.ШаблонТехПроцесса);
		Если ОперацииЗаполнены Тогда 
			ВыполнениеОперацииПродолжение(ПараметрыЗаполненияОпераций.Элемент);
		КонецЕсли;
	Иначе    
		//очистить галку на форм                                                    
		//22.11.24 Ганьшина
		ИмяОперации = ПараметрыЗаполненияОпераций.Элемент.Имя;
		Если ПараметрыЗаполненияОпераций.Элемент.Родитель.ТекущиеДанные[ИмяОперации] Тогда 
			ПараметрыЗаполненияОпераций.Элемент.Родитель.ТекущиеДанные[ИмяОперации] = Ложь; 
		Иначе 
			ПараметрыЗаполненияОпераций.Элемент.Родитель.ТекущиеДанные[ИмяОперации] = Истина;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОперацииПродолжение(Элемент)  
	
	ТекСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные; 
	ТекСтрокаСтруктура = ПолучитьСтруктуруТекущейСтроки();
	ЗаполнитьЗначенияСвойств(ТекСтрокаСтруктура,ТекСтрока);
	СтруктураОтбораПартии = Элементы.ТабПланПроизводства.ОтборСтрок;
	ИмяОперации = Элемент.Имя;
	
	
	//++Дарвин А.А. 03.07.2024
	ТекущаяКоманда = "ОтменаИПодтверждениеОпераций";
	ОчиститьСообщения();
	//Дарвин А.А.
	
	Если Элемент.Родитель.ТекущиеДанные[Элемент.Имя] Тогда 
		ЭтоВыполнениеОпераций = Истина;
	Иначе // отмена выполнения операций
		ЭтоВыполнениеОпераций = Ложь; 
	КонецЕсли;
	Если Врег(ИмяОперации) = Врег("ИзделиеВыпущено") Тогда   //ВыполнитьВсеОперации
		ПоВсемОперациям = 1
	Иначе 
		ПоВсемОперациям = 0;
	КонецЕсли;
	Если ЭтоВыполнениеОпераций и (СтрНайти(ВРЕГ(ИмяОперации),ВРег("Сборка")) > 0 или ПоВсемОперациям = 1) Тогда  
		Если не ЗначениеЗаполнено(ТекСтрока.Исполнитель) Тогда 
			ТекСтрока[ИмяОперации] = не ТекСтрока[ИмяОперации];
			Сообщить("Укажите исполнителя операции для данной партии!" + Символы.ПС + "Данные не записаны");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//++Дарвин А.А. 03.07.2024		
	Если Элемент.Родитель.ТекущиеДанные[Элемент.Имя] = Ложь Тогда
		//ЗаписиОбновлены = ВыполнениеОперацииНаСервере(ТекСтрокаСтруктура, ИмяОперации, СтруктураОтбораПартии, ВыполнитьВсеОперации, Истина);		
		Если ПоВсемОперациям = 1 Тогда           
			ТекстВопроса = "Вы действительно хотите очистить историю выполнения операций по партии?";
		Иначе 
			ТекстВопроса = "Вы действительно хотите удалить историю выполнения операции по партии?";
		КонецЕсли;
		ДопПараметры = ТекСтрокаСтруктура;       
		ДопПараметры.Вставить("ПоВсемОперациям",ПоВсемОперациям);
		ДопПараметры.Вставить("ИмяОперации",ИмяОперации);
		ОповещениеОбУдаленииВсехОперацийПоПартии = Новый ОписаниеОповещения("УдалениеОперацийПоПартииПродолжение", ЭтаФорма, ДопПараметры);
		ПоказатьВопрос(ОповещениеОбУдаленииВсехОперацийПоПартии,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Иначе   
		ЗаписиОбновлены = ВыполнениеОперацииНаСервере(ТекСтрокаСтруктура, ИмяОперации, СтруктураОтбораПартии, ПоВсемОперациям);  		
		//Установить галочки по всем операциям
		
		Если ЗаписиОбновлены Тогда  
			СнятьУстановитьОтметкуВыполненияОперации(ПоВсемОперациям, ИмяОперации, Истина);
		Иначе 
			ТекСтрока[ИмяОперации] = не ТекСтрока[ИмяОперации];
		КонецЕсли;
		
		//ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение);
		//РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
	КонецЕсли;
	
	//Если Не ЗаписиОбновлены Тогда 
	//	Элемент.Родитель.ТекущиеДанные[Элемент.Имя] = Ложь;
	//	Возврат;
	//КонецЕсли; 
		
	//СформироватьОповещениеДляПользователя(ТекущаяКоманда);
	//Дарвин А.А.
КонецПроцедуры

&НаСервере
Функция ЗаполнениеОперацийНаСервере(Спецификация, ШаблонТехПроцесса)
	
	
	//СпецификацияОбъект = Спецификация.ПолучитьОбъект(); 
	//ЗапросЭтапов = Новый Запрос;
	//ЗапросЭтапов.Текст = "ВЫБРАТЬ
	//                     |	ЭтапыПроизводства.Ссылка КАК ЭтапПроизводства
	//                     |ИЗ
	//                     |	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	//                     |ГДЕ
	//                     |	ЭтапыПроизводства.Владелец = &Владелец";
	//ЗапросЭтапов.УстановитьПараметр("Владелец",Спецификация);
	//ТабЭтапыСпецификации = ЗапросЭтапов.Выполнить().Выгрузить();     
	//Если ТабЭтапыСпецификации.Количество() > 1 Тогда 
	//	Сообщить("В специфмкации более одного этапа производства, операции не добавлены ");
	//	Возврат;
	//Иначе 
	//	ВладелецОпераций = ТабЭтапыСпецификации[0].ЭтапПроизводствва;
	//КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЭтапыПроизводства.Ссылка) КАК КоличествоЭтапов,
	               |	ЭтапыПроизводства.Владелец КАК Спецификация
	               |ПОМЕСТИТЬ КоличествоЭтаповСпецификации
	               |ИЗ
	               |	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	               |ГДЕ
	               |	ЭтапыПроизводства.Владелец = &Спецификация
				   |	И НЕ ЭтапыПроизводства.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапыПроизводства.Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ЭтапыПроизводства.Ссылка) КАК ЭтапПроизводства,
	               |	ЭтапыПроизводства.Владелец КАК Спецификация,
	               |	КоличествоЭтаповСпецификации.КоличествоЭтапов КАК КоличествоЭтапов
	               |ИЗ
	               |	КоличествоЭтаповСпецификации КАК КоличествоЭтаповСпецификации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	               |		ПО КоличествоЭтаповСпецификации.Спецификация = ЭтапыПроизводства.Владелец
	               |ГДЕ
	               |	ЭтапыПроизводства.Владелец = &Спецификация
	               |	И КоличествоЭтаповСпецификации.КоличествоЭтапов = 1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапыПроизводства.Владелец,
	               |	КоличествоЭтаповСпецификации.КоличествоЭтапов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ  *
	               //|	ТехнологическиеОперации.Ссылка КАК ТехОперация
	               |ИЗ
	               |	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	               |ГДЕ
	               |	ТехнологическиеОперации.Владелец = &ШаблонТехПроцесса
	               |	И НЕ ТехнологическиеОперации.ПометкаУдаления";  
	
    Запрос.УстановитьПараметр("Спецификация",Спецификация);
	Запрос.УстановитьПараметр("ШаблонТехПроцесса",ШаблонТехПроцесса);   
		
	//ПолучитьОперацииПОШаблону(ПараметрыЗаполненияОпераций.ШаблонТехПроцесса);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТабЭтапыСпецификации = РезультатЗапроса[1].Выгрузить();  
	//ЭтапыСпецификации.Следующий();
	Если ТабЭтапыСпецификации[0].КоличествоЭтапов = 1 Тогда 
		ЭтапВладелец = ТабЭтапыСпецификации[0].ЭтапПроизводства;  
		Если не ЗначениеЗаполнено(ЭтапВладелец) Тогда 
			Сообщить("Для спецификации неопределен Этап Производства! Невозможно заполнить операции");
			Возврат Ложь;
		КонецЕсли;
		ТабОперации = РезультатЗапроса[2].Выгрузить(); 
		НачатьТранзакцию();
		Для Каждого Стр из ТабОперации Цикл 
			НоваяОперация = Справочники.ТехнологическиеОперации.СоздатьЭлемент();
			//НоваяОперация.Наименование 				= Стр.ТехОперация.Наименование;
			//НоваяОперация.ВидОперации 				= Стр.ТехОперация.ВидОперации; 
			//НоваяОперация.Владелец 					= ЭтапВладелец;   
			//НоваяОперация.Количество 				= Стр.ТехОперация.Количество;
			//НоваяОперация.Контроль 					= Стр.ТехОперация.Контроль;    //Перечисления.ВариантыКонтроляТехнологическихОпераций.НеТребуется;
			//НоваяОперация.НомерОперации 			= Стр.ТехОперация.НомерОперации;
			//НоваяОперация.НомерСледующейОперации	= Стр.ТехОперация.НомерСледующейОперации;
			//НоваяОперация.РабочийЦентр				= Стр.ТехОперация.РабочийЦентр;
			//НоваяОперация.Спецификация 				= Спецификация;
			
			ЗаполнитьЗначенияСвойств(НоваяОперация,Стр);
			НоваяОперация.Владелец 					= ЭтапВладелец;     
			НоваяОперация.Спецификация 				= Спецификация;
			Попытка                
				НоваяОперация.ОбменДанными.Загрузка = Истина;
				НоваяОперация.Записать();   
			Исключение 
				ОтменитьТранзакцию();
				Сообщить("Ошибка при добавлении операции по шаблону!");
			КонецПопытки;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Иначе 
		Сообщить("В специфмкации более одного этапа производства, операции не добавлены!");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРегистрИсполнениеПланаПоДаннымПланаНаСервере()
	ТекстЗапроса = ПолучитьТекстЗапросаПланВыпуска();
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр из ТЗ Цикл 
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРегистрИсполнениеПланаПоДаннымПлана(Команда)
	ЗаполнитьРегистрИсполнениеПланаПоДаннымПланаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыпускаИсполнительПриИзменении(Элемент)
			
	ВыбраннаяСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные;
	ТекущаяКоманда = "ПриИзмененииПоляИсполнителя";
	
	Если ВыбраннаяСтрока = Неопределено Или ТабПланПроизводства.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока.Изделие) Или Не ЗначениеЗаполнено(ВыбраннаяСтрока.НомерЗаказаДР) Тогда
		ВыбраннаяСтрока.Исполнитель = ИсполнительПередИзменением;
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ДатаВыпускаПлановая", ВыбраннаяСтрока.ДатаВыпускаПлановая);
	СтруктураОтбора.Вставить("Назначение", ВыбраннаяСтрока.Назначение);
	СтруктураОтбора.Вставить("Изделие", ВыбраннаяСтрока.Изделие);
	
	МассивНайденныхСтрок = ТабПланПроизводства.НайтиСтроки(СтруктураОтбора);
	
	Если МассивНайденныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтапыДляОбработки = Новый Массив;
	Для Каждого Стр из МассивНайденныхСтрок Цикл 
		ЭтапыДляОбработки.Добавить(Стр.ЭтапПроизводства);
	КонецЦикла; 
	Если Элемент.СписокВыбора.НайтиПоЗначению(ВыбраннаяСтрока.Исполнитель) = Неопределено Тогда 
		РЦ = ВыбраннаяСтрока.Исполнитель;
	    Элемент.СписокВыбора.Добавить(РЦ,Строка(РЦ));
	КонецЕсли;
	
	ЗаписьОбновлена = ЗаписатьИсполниетляВДопСвойстваЭтапов(ВыбраннаяСтрока.Исполнитель, ЭтапыДляОбработки);	
		
	Если Не ЗаписьОбновлена Тогда
		ВыбраннаяСтрока.Исполнитель = ИсполнительПередИзменением;
		Возврат;
	КонецЕсли;
	
	//СформироватьОповещениеДляПользователя(ТекущаяКоманда);
	
КонецПроцедуры  

&НаКлиенте
Процедура ДеревоВыпускаКомментарийПриИзменении(Элемент)
			
	ВыбраннаяСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные;
	ТекущаяКоманда = "ПриИзмененииКомментария";
	
	Если ВыбраннаяСтрока = Неопределено Или ТабПланПроизводства.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(ВыбраннаяСтрока.Изделие) Или Не ЗначениеЗаполнено(ВыбраннаяСтрока.НомерЗаказаДР) Тогда
	//	ВыбраннаяСтрока.Исполнитель = ИсполнительПередИзменением;
	//	Возврат;
	//КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ДатаВыпускаПлановая", ВыбраннаяСтрока.ДатаВыпускаПлановая);
	СтруктураОтбора.Вставить("Назначение", ВыбраннаяСтрока.Назначение);
	СтруктураОтбора.Вставить("Изделие", ВыбраннаяСтрока.Изделие);
	
	МассивНайденныхСтрок = ТабПланПроизводства.НайтиСтроки(СтруктураОтбора);
	
	Если МассивНайденныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭтапыДляОбработки = Новый Массив;
	Для Каждого Стр из МассивНайденныхСтрок Цикл 
		ЭтапыДляОбработки.Добавить(Стр.ЭтапПроизводства);
	КонецЦикла; 
		
	ЗаписьОбновлена = ЗаписатьКоммментарий(ВыбраннаяСтрока.Комментарий, ЭтапыДляОбработки);	
		
	Если Не ЗаписьОбновлена Тогда
		ВыбраннаяСтрока.Комментарий = ИсполнительПередИзменением;
		Возврат;
	КонецЕсли;
	
	//СформироватьОповещениеДляПользователя(ТекущаяКоманда);
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ЗаписатьИсполниетляВДопСвойстваЭтапов(Исполнитель, МассивЭтапов)
	                                                                                                               
	//ДопСвойствоИсполнительЭтапа = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ОтветственныйСотрудник_cd8e5a889b84479689186f49871bc700"); //Test_Lena
	ДопСвойствоИсполнительЭтапа = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ОтветственныйСотрудник_62538974ec0a491d811c29d4c48914c6"); //Рабочая
	
	Если ДопСвойствоИсполнительЭтапа.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден дополнительный реквизит ''Исполнитель тех. процесса'' '"));
		Возврат Ложь;
	КонецЕсли;                
	
	РЦ = Справочники.РабочиеЦентры.НайтиПоНаименованию(Исполнитель);
	ФЛИсполнитель = ПолучитьИсполнителляРЦ(РЦ);
	
	Если ФЛИсполнитель = Неопределено Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не задан ответственный исполнитель для рабочего центра " + Исполнитель +"! '") + ОписаниеОшибки());
		Возврат Ложь;
		
	КонецЕсли;
	
	Для Каждого ЭтапПроизводства Из МассивЭтапов Цикл    
		
		ВладелецСвойств = ЭтапПроизводства;
		ЗаписьОбновлена = Ложь;     
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДополнительныеСведения");
		ЭлементБлокировки.УстановитьЗначение("Объект", ВладелецСвойств);
		ЭлементБлокировки.УстановитьЗначение("Свойство", ДопСвойствоИсполнительЭтапа);
		Блокировка.Заблокировать();
		
		МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Объект = ВладелецСвойств;
		МенеджерЗаписи.Свойство = ДопСвойствоИсполнительЭтапа;
		МенеджерЗаписи.Значение = ФЛИсполнитель;
		
		Попытка
			МенеджерЗаписи.Записать(Истина);   
			//ЗаписьОбновлена = Истина;
			
			//ЗафиксироватьТранзакцию();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка во время записи доп. сведений для этапов: '") + ОписаниеОшибки());
			ЗаписатьРезультатыОшибокВЖурналРегистрации();
			
			ОтменитьТранзакцию();
		КонецПопытки;  
		
		//проверить записи в регистре ТТМ_Исполнение тех. процесса
		//НЗ1 = РегистрыСведений.ABCXYZКлассификацияКлиентов.СоздатьНаборЗаписей();
		НЗ = РегистрыСведений.ТТМ_ИсполнениеТехПроцесса.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства); 
		ВРЦ_Сборка = Справочники.ВидыРабочихЦентров.НайтиПоНаименованию("Сборка"); 
		Если не ВРЦ_Сборка = Неопределено Тогда  
			НЗ.Отбор.ВидРабочегоЦентра.Установить(ВРЦ_Сборка);
			НЗ.Прочитать();     
			
			//РЦ = Справочники.РабочиеЦентры.НайтиПоНаименованию(Исполнитель);
			Если не РЦ = Неопределено Тогда 
				Для Каждого СтрНЗ из НЗ Цикл 
					Если СтрНЗ.Исполнитель <> РЦ или СтрНЗ.ОтветственыйИсполнитель <> ФЛИсполнитель Тогда 
						СтрНЗ.Исполнитель = РЦ;
						СтрНЗ.ОтветственыйИсполнитель = ФЛИсполнитель;
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Исполнитель по Этапу изменен: " + ЭтапПроизводства +": '") + ОписаниеОшибки());
					КонецЕсли;
				КонецЦикла;  
			Иначе 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден рабочий центр "+ Исполнитель +": '") + ОписаниеОшибки());
				ЗаписатьРезультатыОшибокВЖурналРегистрации();
				ОтменитьТранзакцию();
			КонецЕсли;
		Иначе 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден вид рабочего центра ""сборка"": '") + ОписаниеОшибки());
			ЗаписатьРезультатыОшибокВЖурналРегистрации();
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Попытка
			НЗ.Записать();
			ЗафиксироватьТранзакцию();
			ЗаписьОбновлена = Истина;
		Исключение     
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка при записи исполниетля в регистр сведений: '") + ОписаниеОшибки());
			ЗаписатьРезультатыОшибокВЖурналРегистрации();
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
	
	Возврат ЗаписьОбновлена;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьКоммментарий(Комментарий, МассивЭтапов)
	
	//ДопСвойствоКомментарийЭтапа = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ТТМКомментарийКЭтапу_b08d8ab178a947f4a2fe40f66f6d146d");  //Test_Lena
	ДопСвойствоКомментарийЭтапа = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","ТТМКомментарийКЭтапу_53d161b8457f4c33972f8c3f5f7fc5d1");  //Рабочая
	
	Если ДопСвойствоКомментарийЭтапа.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не найден дополнительный реквизит ''Комментарий'' '"));
		Возврат Ложь;
	КонецЕсли;     
	
	
	
	Для Каждого ЭтапПроизводства из МассивЭтапов Цикл 
		
		ВладелецСвойств = ЭтапПроизводства;
		ЗаписьОбновлена = Ложь;     
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДополнительныеСведения");
		ЭлементБлокировки.УстановитьЗначение("Объект", ВладелецСвойств);
		ЭлементБлокировки.УстановитьЗначение("Свойство", ДопСвойствоКомментарийЭтапа);
		Блокировка.Заблокировать();
		
		МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Объект = ВладелецСвойств;
		МенеджерЗаписи.Свойство = ДопСвойствоКомментарийЭтапа;
		МенеджерЗаписи.Значение = Комментарий;
		
		Попытка
			МенеджерЗаписи.Записать(Истина);   
			//ЗаписьОбновлена = Истина;
			//ЗафиксироватьТранзакцию();
			//Возврат ЗаписьОбновлена;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка при записи доп. сведения Комментарий для этапов: '") + ОписаниеОшибки());
			ЗаписатьРезультатыОшибокВЖурналРегистрации();
			ЗаписьОбновлена = Ложь;
			ОтменитьТранзакцию();    
			Возврат ЗаписьОбновлена;
			
		КонецПопытки;  
		
		НЗ = РегистрыСведений.ТТМ_ИсполнениеТехПроцесса.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства);
		НЗ.Прочитать();
	
		Для Каждого СтрНЗ из НЗ Цикл 
			СтрНЗ.Комментарий = Комментарий;
		КонецЦикла;
		
		Попытка
			НЗ.Записать();
			ЗаписьОбновлена = Истина;
			ЗафиксироватьТранзакцию();
			//Возврат ЗаписьОбновлена;
		Исключение 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка записи комментария в регистр: '") + ОписаниеОшибки());
			ЗаписатьРезультатыОшибокВЖурналРегистрации();
			ЗаписьОбновлена = Ложь;   
			ОтменитьТранзакцию();
			Возврат ЗаписьОбновлена;
		КонецПопытки;
		
	КонецЦикла;  
	Возврат ЗаписьОбновлена;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИсполнителляРЦ(Исполнитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК РЦ,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ДополнительныеСведения.Значение КАК ФЛИсполнитель
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Объект = &РЦ
	               |	И ДополнительныеСведения.Свойство = &ДопСвойствоИсполнитель";
	Запрос.УстановитьПараметр("РЦ",Исполнитель);
	//Запрос.УстановитьПараметр("ДопСвойствоИсполнитель", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ОтветственныйСотрудник_cd8e5a889b84479689186f49871bc700")); //Test_Lena
	Запрос.УстановитьПараметр("ДопСвойствоИсполнитель", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ОтветственныйСотрудник_62538974ec0a491d811c29d4c48914c6")); //Рабочая
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ФЛИсполнитель;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

//////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОтборНазначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ПодобратьНазначения(Текст);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПодобратьНазначения(СтрокаПоиска)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("СтрокаПоиска", СтрокаПоиска);
	СтруктураОтбора.Вставить("ВводПоСтрокеРасширенный", Истина);
	
	СтрокаПоиска = СтрЗаменить(СтруктураОтбора.СтрокаПоиска, """", ""); 
	
	Если СтрокаПоиска <> "" И СтруктураОтбора.Свойство("ВводПоСтрокеРасширенный") Тогда
		МассивСловПоиска = СтрРазделить(СтрокаПоиска, " ", Ложь); 

		Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ		
						|	Назначения.Заказ КАК Заказ,
						|	Назначения.Наименование КАК Наименование,
						|	Назначения.ПометкаУдаления КАК ПометкаУдаления,
						|	Назначения.Ссылка КАК Назначение
						//|ПОМЕСТИТЬ ВТ_ЗаказКлиентаОтборПоНомеру
						|ИЗ
						|	Справочник.Назначения КАК Назначения
						|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
						|		ПО (СостоянияЗаказовКлиентов.Заказ = Назначения.Заказ)
						|ГДЕ
						|	Назначения.Наименование ПОДОБНО &СловоПоиска
						|	И НЕ Назначения.ПометкаУдаления
						|	И НЕ Назначения.Заказ.ПометкаУдаления 
						|	И СостоянияЗаказовКлиентов.Состояние <> &Состояние";
						//|	И Назначения.Заказ.Статус <> &СтатусЗаказа";
						//|;
						//|
						//|////////////////////////////////////////////////////////////////////////////////
						//|ВЫБРАТЬ
						//|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
						//|	ВТ_ЗаказКлиентаОтборПоНомеру.Наименование КАК Наименование,
						//|	ВТ_ЗаказКлиентаОтборПоНомеру.ПометкаУдаления КАК ПометкаУдаления
						//|ИЗ
						//|	ВТ_ЗаказКлиентаОтборПоНомеру КАК ВТ_ЗаказКлиентаОтборПоНомеру
						//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
						//|		ПО (СостоянияЗаказовКлиентов.Заказ = ВТ_ЗаказКлиентаОтборПоНомеру.Заказ)
						//|ГДЕ
						//|	СостоянияЗаказовКлиентов.Состояние <> &Состояние";
		
		Запрос.УстановитьПараметр("СловоПоиска", "%" + СтрокаПоиска + "%");
		//Запрос.УстановитьПараметр("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.Закрыт);
		Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗаказовКлиентов.ГотовКЗакрытию);
				
		Выборка = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		СписокВыбора = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Значение", ВыборкаДетальныеЗаписи.Назначение);
			СтруктураОтбора.Вставить("ПометкаУдаления", ВыборкаДетальныеЗаписи.ПометкаУдаления);
			
			СписокВыбора.Добавить(СтруктураОтбора, ТТМ_ДанныеВыбораСервер.ПодсветитьСлова(ВыборкаДетальныеЗаписи.Наименование, МассивСловПоиска));
		КонецЦикла;
	
		ДанныеВыбора = СписокВыбора;
	КонецЕсли;
		
	Возврат ДанныеВыбора;	
	
КонецФункции


//////////////////////////////////////////////////////////////////
 
#КонецОбласти                  


////////////////////////////////////////////////////////////////////
#Область ТТМ_АРМ_ТехпроцессДополнительныеКомандыДерева

//++ Дарвин А.А. 01.07.2024 
&НаКлиенте
Процедура РазвернутьСтрокиДереваВыпуска(Команда)
	РазвернутьСвернутьПодчиненныеСтрокиДерева(Команда.Действие);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьСтрокиДереваВыпуска(Команда)
	РазвернутьСвернутьПодчиненныеСтрокиДерева(Команда.Действие);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСвернутьПодчиненныеСтрокиДерева(ТекущаяКоманда)

	Если ТекущаяКоманда = "РазвернутьСтрокиДереваВыпуска" Тогда
		ЭлементыДерева = ЭтаФорма.ДеревоВыпуска.ПолучитьЭлементы();
		 
		Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        	Элементы.ДеревоВыпуска.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
		КонецЦикла;
	ИначеЕсли ТекущаяКоманда = "СвернутьСтрокиДереваВыпуска" Тогда
		ЭлементыДерева = ЭтаФорма.ДеревоВыпуска.ПолучитьЭлементы();
		
		Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        	Элементы.ДеревоВыпуска.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьДеревоПоВозрастанию(Команда)
	
	КоллекцияСортировки = ЭтаФорма.ДеревоВыпуска.ПолучитьЭлементы();
	РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
    СортироватьДанныеФормыКоллекция(Команда.Действие, КоллекцияСортировки, "ДатаВыпускаПлановая"); 
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьДеревоПоУбыванию(Команда)
	
	КоллекцияСортировки = ЭтаФорма.ДеревоВыпуска.ПолучитьЭлементы();
	РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
    СортироватьДанныеФормыКоллекция(Команда.Действие, КоллекцияСортировки, "ДатаВыпускаПлановая"); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СортироватьДанныеФормыКоллекция(ТекущаяКоманда, КоллекцияСтрок, КолонкаСортировки)
	
	ПараметрыЗначений     = Новый Соответствие;
	СортированныеЗначения = Новый СписокЗначений;
	
	Для Каждого ТекущаяСтрока Из КоллекцияСтрок Цикл
		ТекущееЗначение = ТекущаяСтрока[КолонкаСортировки];
		ПараметрыЗначения = ПараметрыЗначений.Получить(ТекущееЗначение);
		
		Если ПараметрыЗначения = Неопределено Тогда
			ПараметрыЗначения = Новый Массив;
			ПараметрыЗначений.Вставить(ТекущееЗначение, ПараметрыЗначения);
			СортированныеЗначения.Добавить(ТекущееЗначение);
		КонецЕсли;
		
		ПараметрыЗначения.Добавить(ТекущаяСтрока);		
	КонецЦикла;
	
	Если ТекущаяКоманда = "СортироватьДеревоПоВозрастанию" Тогда
		СортированныеЗначения.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	ИначеЕсли ТекущаяКоманда = "СортироватьДеревоПоУбыванию" Тогда
		СортированныеЗначения.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	КонецЕсли;
	
	НовыйИндекс = 0;
	
	Для Каждого ТекущееЗначение Из СортированныеЗначения Цикл	
		МассивСтрок = ПараметрыЗначений.Получить(ТекущееЗначение.Значение);
		
		Для Каждого ТекущаяСтрока Из МассивСтрок Цикл
			
			ТекущийИндекс = КоллекцияСтрок.Индекс(ТекущаяСтрока);
			ШагСдвига     = НовыйИндекс - ТекущийИндекс;
			Если НЕ ШагСдвига = 0 Тогда
				КоллекцияСтрок.Сдвинуть(ТекущийИндекс, ШагСдвига);
			КонецЕсли;
			
			НовыйИндекс   = НовыйИндекс + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
//Дарвин А.А.

#КонецОбласти


////////////////////////////////////////////////////////////////////
#Область ТТМ_АРМ_ТехпроцессДополнительныйОтборДерева

//++ Дарвин А.А. 02.07.2024
&НаКлиенте
Процедура ОтборПериодПриИзменении(Элемент)
	
	ОбновитьДанныеПланапроизводства(Объект.ПроизводственноеПодразделение, Новый Структура);
	ТекущаяКоманда = "ОтборПериодПриИзменении";
		
	//Если Объект.ОтборПериод.ДатаНачала <> Дата(1, 1, 1) Или Объект.ОтборПериод.ДатаОкончания <> Дата(1, 1, 1) Тогда			
	//	ПерезаполнитьДеревоПланаПоОтбору(ТекущаяКоманда);
	//КонецЕсли;
	
	РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДеревоПланаПоОтбору(ТекущаяКоманда)	
	
	ЭлементыДерева = ЭтаФорма.ДеревоВыпуска.ПолучитьЭлементы();
	МассивДанныхКОчистке = Новый Массив;
	
	Для Каждого СтрокиВерхнегоУровня Из ЭлементыДерева Цикл
		
		Если ТекущаяКоманда = "ОтборПериодПриИзменении" Тогда
			Если СтрокиВерхнегоУровня.ДатаВыпускаПлановая >= Объект.ОтборПериод.ДатаНачала И СтрокиВерхнегоУровня.ДатаВыпускаПлановая <= Объект.ОтборПериод.ДатаОкончания Тогда
				Продолжить;
			КонецЕсли;
			
			МассивДанныхКОчистке.Добавить(СтрокиВерхнегоУровня);
		КонецЕсли;
				
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из МассивДанныхКОчистке Цикл
		ЭтаФорма.ДеревоВыпуска.ПолучитьЭлементы().Удалить(СтрокаКУдалению);
	КонецЦикла;
	
КонецПроцедуры
//Дарвин А.А.   






#КонецОбласти


////////////////////////////////////////////////////////////////////
#Область ТТМ_АРМ_ТехпроцессВзаимодействиеСПользователем

//++ Дарвин А.А. 01.07.2024
&НаКлиенте
Процедура СформироватьОповещениеДляПользователя(ТекущаяКоманда)
	
	Если ТекущаяКоманда = "ОбновитьПланВыпуска" Или ТекущаяКоманда = "ПриИзмененииПоляИсполнителя" или ТекущаяКоманда = "ПриИзмененииКомментария" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Тех. процесс производства'");
		ТекстСОписанием = НСтр("ru = 'Данные обновлены!'");
	ИначеЕсли ТекущаяКоманда = "ОтменаИПодтверждениеОпераций" Тогда
		ЗаголовокОповещения = НСтр("ru = 'Тех. процесс производства'");
		ТекстСОписанием = НСтр("ru = 'Запись обновлена!'");
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(ЗаголовокОповещения,, ТекстСОписанием, БиблиотекаКартинок.Информация48БЗК, СтатусОповещенияПользователя.Информация);
	
КонецПроцедуры
//Дарвин А.А.

&НаСервереБезКонтекста
Процедура ЗаписатьРезультатыОшибокВЖурналРегистрации()
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), 
		УровеньЖурналаРегистрации.Ошибка,,, 
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

КонецПроцедуры

#КонецОбласти


#Область ОформлениеВыпуска

&НаКлиенте
Процедура ОформитьВыпуск(Команда)
	
	ТекСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные;
	Если не ЗначениеЗаполнено(ТекСтрока.Изделие) Тогда
		Сообщить("не выбрана партия выпуска!");
		Возврат;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ТекСтрока.Исполнитель) Тогда 
		Сообщить("Невозможно оформить выпуск партии, не выбран Исполнитель");
		Возврат;
	КонецЕсли;  
	
	КоличествоОперацийСпецификации = ПроверитьОперацииПоСпецификации(ТекСтрока.Спецификация);
	Если не ЗначениеЗаполнено(Объект.ШаблонТехПроцесса) и КоличествоОперацийСпецификации = 0 Тогда 
		Сообщить("В спецификации отсутствуют операции и шаблон тех. процесса не заполнен!");
		Возврат;
	КонецЕсли;
	
	Если Команда.Действие = "ОформитьВыпуск" Тогда
		ТекстВопроса = НСтр("ru = 'Сформировать выпуск по партии?'");
		ЗаголовокВопроса = НСтр("ru = 'Формирование выпуска'");
	КонецЕсли;                   
	
	ДопПараметры = Новый Структура("Команда, ЗаполнитьОперацииСпецификации", Команда, КоличествоОперацийСпецификации = 0);
	
	
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопроса", ЭтотОбъект, ДопПараметры);     
    ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0,, ЗаголовокВопроса);
		
КонецПроцедуры  

&НаСервере
Функция ПроверитьОперацииПоСпецификации(Спецификация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехнологическиеОперации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
	               |ГДЕ
	               |	ТехнологическиеОперации.Владелец = &Владелец
	               |	И НЕ ТехнологическиеОперации.ПометкаУдаления"; 
	
	ЭтапСпецификации = ПолучитьЭтапСпецификации(Спецификация); 
	
	Если ЭтапСпецификации = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
	КоличествоОперацийСпецификации = Запрос.Выполнить().Выгрузить().Количество(); 
	Если не ЗначениеЗаполнено(КоличествоОперацийСпецификации) Тогда 
		КоличествоОперацийСпецификации =0;
	КонецЕсли;
	
	Возврат КоличествоОперацийСпецификации;
	
КонецФункции

&НаСервере
Функция ПолучитьЭтапСпецификации(Спецификация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапыПроизводства.Ссылка КАК ЭтапСпецификации
	               |ИЗ
	               |	Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
	               |ГДЕ
	               |	ЭтапыПроизводства.Владелец = &Спецификация";
	Запрос.УстановитьПараметр("Спецификация",Спецификация);
	ТабЭтап = Запрос.Выполнить().Выгрузить();
	Если ТабЭтап.Количество() > 1 Тогда 
		Сообщить("Не удалось однозначно определить Этап производства по спецификации " + Спецификация);
		Возврат Неопределено;
	Иначе 
		Возврат ТабЭтап[0].ЭтапСпецификации;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеВопроса(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Сообщить("");
		Возврат;
	КонецЕсли;
	
	ТекущееДействиеКоманды = ДополнительныеПараметры.Команда.Действие;
	РезультатВыполнения = Ложь; 
		
	Если ТекущееДействиеКоманды = "ОформитьВыпуск" Тогда
		
		ТекСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные; 
		ТекСтрокаСтруктура = ПолучитьСтруктуруТекущейСтроки();
		ЗаполнитьЗначенияСвойств(ТекСтрокаСтруктура,ТекСтрока);
		
		Если ДополнительныеПараметры.ЗаполнитьОперацииСпецификации Тогда 
			//Заполнить
			ОперацииЗаполнены = ЗаполнениеОперацийНаСервере(ТекСтрокаСтруктура.Спецификация, Объект.ШаблонТехПроцесса);
		КонецЕсли;
		
		СтруктураОтбораПартии = Новый Структура("ДатаВыпускаПлановая, Изделие, Назначение");
		ЗаполнитьЗначенияСвойств(СтруктураОтбораПартии,Элементы.ТабПланПроизводства.ОтборСтрок);
		
		////////////////////////////////////////////////////////////////////////
		ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима();
	
		Оповещение = Новый ОписаниеОповещения("ПослеПредоставленияРазрешения",ЭтаФорма);
		МассивИДРазрешений = ПолучитьМассивИдентификаторовРазрешений(СписокИДЗапросовРазрешений);
		РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(МассивИДРазрешений, ЭтаФорма, Оповещение);
		
		ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Истина);
		////////////////////////////////////////////////////////////////////////
		
		СтруктураВозврата = ОформитьВыпускНаСервере(СтруктураОтбораПартии, ТекСтрокаСтруктура);       
		
		////////////////////////////////////////////////////////////////////////
		ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Ложь);
		////////////////////////////////////////////////////////////////////////
		
		Если не СтруктураВозврата.ВыпускСформирован и СтруктураВозврата.Свойство("СтруктураОтбораПартии") Тогда 
			//Заказ клиента закрыт, можно пометить этапы производства на удаление
			Оповещение  = Новый ОписаниеОповещения("УдалениеЛишнихЭтапов",ЭтотОбъект,СтруктураОтбораПартии);
			ПоказатьВопрос(Оповещение,"Заказ клиента закрыт, пометить Этапы партии на удаление?",РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		
		Если СтруктураВозврата.ВыпускСформирован Тогда
			ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение, СтруктураОтбораПартии);
			РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
			ОповеститьПользователя(ТекущееДействиеКоманды);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры        

&НаСервере
Процедура УстановитьТекущуюСтрокуДереваВыпуска(СтруктураОтбораПартии);
	
	//СтрокиПлана = ДеревоВыпуска.ПолучитьЭлементы();
	//СтрокиПлана = ПланВыпускаПродукции.ПолучитьЭлементы();
	//ПланВыпускаПродукции.НайтиПоИдентификатору(
	 
КонецПроцедуры

&НаСервере
функция ОформитьВыпускНаСервере(СтруктураОтбораПартии, ТекСтрокаСтруктура)
	
	СтруктураВозврата = Новый Структура("ВыпускСформирован");
	ВыпускСформирован = Ложь;
	
	ЗаказКлиента = СтруктураОтбораПартии.Назначение.Заказ;
	Если ТипЗнч(ЗаказКлиента) <> Тип("ДокументСсылка.ЗаказКлиента") Или ЗаказКлиента.Проведен = Ложь Тогда 
		Сообщить("Не удалось определить Заказ клиента по Назначению!");
		СтруктураВозврата.ВыпускСформирован = ВыпускСформирован;
		Возврат СтруктураВозврата;
	КонецЕсли;       
	
	ТабЭтапы = ТабПланПроизводства.Выгрузить(СтруктураОтбораПартии,"ЭтапПроизводства,Количество");
	КоличествоВыпуска = ТабЭтапы.Итог("Количество");   
	МассивЭтапов = ТабЭтапы.ВыгрузитьКолонку("ЭтапПроизводства");
	
	Если ЗаказКлиента.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		
		Сообщить("Заказ клиента закрыт! Выпуск по нему не требуется!");    
	    СтруктураОтбораПартии.Вставить("МассивЭтапов", МассивЭтапов);
		СтруктураВозврата.ВыпускСформирован = ВыпускСформирован;
		СтруктураВозврата.Вставить("СтруктураОтбораПартии", СтруктураОтбораПартии);
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	ИзделиеПоЗаказу = ЗаказКлиента.Товары.Выгрузить(Новый Структура("Номенклатура, ВариантОбеспечения", СтруктураОтбораПартии.Изделие, Перечисления.ВариантыОбеспечения.КОбеспечению));
	КоличествоПоЗаказуКОбеспечению =  ИзделиеПоЗаказу.Итог("Количество");
	
	ИзделиеПоЗаказу = ЗаказКлиента.Товары.Выгрузить(Новый Структура("Номенклатура, ВариантОбеспечения", СтруктураОтбораПартии.Изделие, Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления));
	КоличествоПоЗаказуРезервПоМереПоступления =  ИзделиеПоЗаказу.Итог("Количество");	
	
	КоличествоПоЗаказу = КоличествоПоЗаказуКОбеспечению + КоличествоПоЗаказуРезервПоМереПоступления;
	
	/////////////////////////////////////////////////////////////////////////////////////
			
			
	//Если ЗначениеЗаполнено(Элементы.ДеревоВыпуска.ТекущиеДанные.Номенклатура) Тогда 		
	
	Если КоличествоВыпуска > КоличествоПоЗаказу Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Количество выпуска превышает количество по заказу'"));
	Иначе
		//Если Объект.Количество > КоличествоВыпуска Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Количество выпуска превышает количество в этапах. Обработано '") + Строка(КоличествоВыпуска));
		//КонецЕсли; 
		ИзменитьЭтапы(МассивЭтапов, СтруктураОтбораПартии, КоличествоВыпуска,ТекСтрокаСтруктура);
	КонецЕсли;
		
	//ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение, СтруктураОтбораПартии); 
	ВыпускСформирован = Истина;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Формирование выпуска завершено'"));		 
	
	Если ВыпускСформирован Тогда 
		//Установим строки Заказа клиента КОтгрузке
		ЗаказОбъект = ЗаказКлиента.ПолучитьОбъект();
		
		//+проверить
		//04.12.2024 закомментитровала
		
		//ПереченьВариантов = Новый Массив();
		//ПереченьВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));  
		//
		//Результат = Новый Структура("ПереченьВариантов, ЗаполнятьЦелымиУпаковками");
		//Результат.ПереченьВариантов = ПереченьВариантов;
		//Результат.ЗаполнятьЦелымиУпаковками = Ложь;
		
		//04.12.2024
		//-проверить
				
		ПараметрыВстраивания = Документы.ЗаказКлиента.ДоступныеОстаткиПараметрыВстраивания();

		МассивДок = Новый Массив();
		МассивДок.Добавить(ЗаказОбъект.Ссылка);
		
		ПараметрыПроцедуры = Новый Структура();
		
		ПараметрыПроцедуры.Вставить("КодДействия", "ДЕЙСТВИЕ_ОТГРУЗИТЬ");
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("СнятьФлагОтгружатьОднойДатой", Истина);  
		ПараметрыЗаполнения.Вставить("ЗаполнитьДатуОтгрузкиОднойДатой", Ложь );
		ПараметрыПроцедуры.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);        
		
		ПараметрыПроцедуры.Вставить("Заказы", МассивДок);  
		ПараметрыПроцедуры.Вставить("ПараметрыВстраивания", ПараметрыВстраивания); 
		РезультатВыполненияДействий = ОбеспечениеВДокументахСервер.ВыполнитьДействиеДляЗаказовПослеВопроса(ПараметрыПроцедуры);
			
		Если Не РезультатВыполненияДействий.СписокОшибок.Количество() = 0 Тогда
			Сообщить("Не удалось проставить действике ""Отгрузить"" в строках Заказа клиента: " + ЗаказОбъект);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураВозврата.ВыпускСформирован = ВыпускСформирован;
	Возврат СтруктураВозврата;

КонецФункции

&НаСервере
Процедура ИзменитьЭтапы(ДокЭтапы, СтруктураОтбораПатии,КоличествоВыпуска,ТекСтрокаСтруктура)
	
	ОсталосьВыпустить = КоличествоВыпуска;
	КОтгрузке = 0;
	
	Для каждого Док из ДокЭтапы Цикл
		
		ДокОбъект = Док.Ссылка.ПолучитьОбъект();
		ДокОбъект.КоличествоУпаковокФакт  = 0.5;
		НайденныеСтроки = ДокОбъект.ВыходныеИзделия.НайтиСтроки(Новый Структура("Номенклатура", СтруктураОтбораПатии.Изделие));
		
		Для Каждого Стр из НайденныеСтроки Цикл
			Если ОсталосьВыпустить >= Стр.Количество Тогда
				Стр.Произведено = Истина;
				Стр.ДатаПроизводства = ТекущаяДатаСеанса(); //СтруктураОтбораПатии.ДатаВыпускаПлановая;
				ОсталосьВыпустить = ОсталосьВыпустить - Стр.Количество;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЭтапОбновлен = Ложь;
		Попытка
			//УстановитьПривилегированныйРежим(Истина); 
			//ДокОбъект = документы.ЭтапПроизводства2_2.СоздатьДокумент();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			//УстановитьПривилегированныйРежим(Ложь);
			ЭтапОбновлен = Истина;
		Исключение
			Сообщить("Не удалось изменить документ " + ДокОбъект.Номер + " от " + ДокОбъект.Дата);
			
			// Запись события в журнал регистрации для системного администратора.
	    	ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Выполнение операции'"),
				УровеньЖурналаРегистрации.Ошибка,,, 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	    	ВызватьИсключение;
		КонецПопытки;
		
		Если ЭтапОбновлен Тогда          
			//ТекСтрока = Элементы.ДеревоВыпуска.ТекущиеДанные; 
			//ТекСтрокаСтруктура = ПолучитьСтруктуруТекущейСтроки();
			//ЗаполнитьЗначенияСвойств(ТекСтрокаСтруктура,ТекСтрока);          
			ВыполнениеОперацииНаСервере(ТекСтрокаСтруктура,"ИзделиеВыпущено",СтруктураОтбораПатии,1);
			ПереданоКОтгрузке = СоздатьПередачуПродукцииНаСклад(ДокОбъект);
			//Если ПереданоКОтгрузке > 0 Тогда 
			КОтгрузке = КОтгрузке + ПереданоКОтгрузке;
		КонецЕсли;
		
		Если ОсталосьВыпустить <= 0 Тогда
			Прервать;
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры    

&НаСервере
Функция СоздатьПередачуПродукцииНаСклад(Этап)
	
	МассивСсылок = Новый Массив();
	МассивСсылок.Добавить(Этап.Ссылка);
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивСсылок,
		"ДвижениеПродукцииИМатериалов", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства"));
	ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;
	
	Документ = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
	Документ.Заполнить(ДанныеЗаполнения);
	Документ.Дата = НачалоДня(ТекущаяДатаСеанса()); //Объект.ДатаВыпуска;
	
	Попытка
		НачатьТранзакцию();
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
		
		Возврат Документ.Товары.Итог("Количество");
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("'Ошибка во время проведения документа: '") + Документ + " " + ОписаниеОшибки());
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		Возврат 0;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура УдалениеЛишнихЭтапов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;    
	УдалитьЭтапыНаСервере(ДополнительныеПараметры);
	
КонецПроцедуры 

&НаСервере
Процедура УдалитьЭтапыНаСервере(ДополнительныеПараметры)
	Для Каждого ЭтапПроизводства из ДополнительныеПараметры.МассивЭтапов Цикл 
		ЭтапОбъект = ЭтапПроизводства.ПолучитьОбъект();
		ЭтапОбъект.Пометкаудаления = Истина;
		Попытка                
			//ЭтапОбъект = Документы.ЭтапПроизводства2_2.СоздатьДокумент();
			ЭтапОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение, Новый Структура);
		Исключение
			Сообщить("Не удалось установить пометку удаления " + ЭтапПроизводства + символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПользователя(ТекущаяКоманда)
	Если ТекущаяКоманда = "Выпуск" Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Выпуск и реализация'"),, 
			НСтр("ru = 'Формирование выпуска завершено'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация
		);
	КонецЕсли;
	
КонецПроцедуры

//КОтгрузке = 0;

#КонецОбласти                   

////////////////////////////////////////////////////////////////////

#Область ФункцииПривилегированногоРежима

&НаСервереБезКонтекста
Функция ПолучитьМассивИдентификаторовРазрешений(знач СписокИДЗапросовРазрешений)
	МассивИДРазрешений = Новый Массив;
	Для Каждого ИД из СписокИДЗапросовРазрешений Цикл 
		МассивИДРазрешений.Добавить(ИД.Значение);
	КонецЦикла;
	Возврат МассивИДРазрешений;
КонецФункции

&НаКлиенте
Процедура ПослеПредоставленияРазрешения(Результат,ДопПараметры) Экспорт
	//Если Результат = КодВозвратаДиалога.ОК Тогда 
	//	Сообщить("Разрешение на использование привилегированного режима установлено!");
	//Иначе 
	//	Сообщить("Разрешение на использование привилегированного режима не получено!");
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Включить)
	Если не Включить Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Включить);
	Если Включить Тогда 
		УстановитьБезопасныйРежим(Истина);
		УстановитьБезопасныйРежим(Ложь);
	Иначе 
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;
	РФ_ПривилегированныйРежим = ПривилегированныйРежим();
	РФ_БезопасныйРежим = БезопасныйРежим();
КонецПроцедуры

&НаСервере
Процедура ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима()
	СписокИДЗапросовРазрешений.Очистить();
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеПривилегированногоРежима("Разрешение привилегированного режима для пользователей с ограниченными правами");
	МассивРазрешений = Новый Массив;
	МассивРазрешений.Добавить(Разрешение);
	ИДЗапроса = РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(МассивРазрешений, ЭтотОбъект, Истина);
	СписокИДЗапросовРазрешений.Добавить(ИДЗапроса);
КонецПроцедуры

&НаСервере
Процедура ТабПланПроизводстваКомментарийНажатиеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТабПланПроизводстваКомментарийНажатие(Элемент, СтандартнаяОбработка)
	ТабПланПроизводстваКомментарийНажатиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборНазначениеПриИзменении(Элемент)
	
	СтруктураОтбораПартии = Новый Структура("ДатаВыпускаПлановая, Изделие, Назначение"); 
	Если Элементы.ТабПланПроизводства.ОтборСтрок <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураОтбораПартии,Элементы.ТабПланПроизводства.ОтборСтрок);
	КонецЕсли;
	ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение, СтруктураОтбораПартии);
	РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИзделиеПриИзменении(Элемент)
	
	СтруктураОтбораПартии = Новый Структура("ДатаВыпускаПлановая, Изделие, Назначение"); 
	Если Элементы.ТабПланПроизводства.ОтборСтрок <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураОтбораПартии,Элементы.ТабПланПроизводства.ОтборСтрок);
	КонецЕсли;
	ОбновитьДанныеПланаПроизводства(Объект.ПроизводственноеПодразделение, СтруктураОтбораПартии);
	РазвернутьСвернутьПодчиненныеСтрокиДерева("РазвернутьСтрокиДереваВыпуска");
	
КонецПроцедуры

#КонецОбласти

#Область НеИспользуется



#КонецОбласти
