///////////////////////////////////////////////////////////////////////////////////
#Область ТТМ_АРМ_СписаниеРезервированиеГлобальныеПеременные 

&НаКлиенте
Перем ДанныеИсходнойСтроки;

&НаКлиенте
Перем ТекСтраница;

&НаКлиенте
Перем ТолькоРезерв;

&НаКлиенте
Перем ЗакрытьФормуОбработки;

&НаКлиенте
Перем МассивОбрабатываемыхСтрок;   

#КонецОбласти

&НаСервере
Функция ПолучитьНормативыПоСпецификации(ПолучатьМатериалыПоТребованию, Знач ПереченьДанных = Неопределено, ЭтапОбъект1)
	
	ДанныеПартииПроизводстваКопия = ОбщегоНазначения.СкопироватьРекурсивно(ДанныеПартииПроизводства, Ложь);
	КоэффициентПлан = Справочники.УпаковкиЕдиницыИзмерения.КоэффициентУпаковки
			(ЭтапОбъект1.УпаковкаПлан, Объект.Номенклатура);
	КоличествоПлан = ЭтапОбъект1.КоличествоУпаковокПлан * КоэффициентПлан;
	ДанныеПартииПроизводстваКопия.Количество = КоличествоПлан;
	
	Возврат Документы.ЭтапПроизводства2_2.ПолучитьНормативыПоСпецификации(
		ДанныеПартииПроизводстваКопия,
		ПолучатьМатериалыПоТребованию,
		ПереченьДанных);
	
КонецФункции
	

//** Нормативы **//
#Область Нормативы

&НаСервере
Функция ПолучитьНормативыИзВременногоХранилища(Этап)
	
	//*****************30.09.2024
	УстановитьДанныеПартииПроизводства(Этап);
	//****************

	Если ЭтоАдресВременногоХранилища(АдресХранилищаНормативы) Тогда
		
		Результат = ПолучитьИзВременногоХранилища(АдресХранилищаНормативы);
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Структура();
	
	ДанныеСпецификации = ПолучитьНормативыПоСпецификации(Истина, "МатериалыИУслуги,ВходящиеИзделия,Трудозатраты",Этап);
	
	Если ДанныеСпецификации <> Неопределено Тогда
		
		Таблица = ДанныеСпецификации.МатериалыИУслуги.Скопировать(, "Номенклатура,Характеристика,Упаковка,ДанныеУпаковки,КоличествоУпаковок"); // ТаблицаЗначений - 
		Таблица.Свернуть("Номенклатура,Характеристика,Упаковка,ДанныеУпаковки", "КоличествоУпаковок");
		Результат.Вставить("ОбеспечениеМатериаламиИРаботами", Таблица);
		
		Таблица = ДанныеСпецификации.Трудозатраты.Скопировать(, "ВидРабот,Количество"); // ТаблицаЗначений - 
		Таблица.Свернуть("ВидРабот", "Количество");
		Результат.Вставить("Трудозатраты", Таблица);
		
	КонецЕсли;
	
	АдресХранилищаНормативы = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
//**/////////////////**//

&НаСервере 
//Не используется
Функция ПолучитьМатериалыПоЭтапам(ОтборПоВариантамОбеспечения, ДатаОстатков, Склад, Списание)
	
	ТаблицаЭтапов = РеквизитФормыВЗначение("Этапы", Тип("ТаблицаЗначений"));

	Если ТаблицаЭтапов.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапросаУсловие = СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабЭтапы.Обрабатывать КАК Обрабатывать,
	               |	ТабЭтапы.Статус КАК Статус,
	               |	ТабЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТабЭтапы.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	               |	ТабЭтапы.Назначение КАК Назначение,
	               |	ТабЭтапы.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ ВТ_Этапы
	               |ИЗ
	               |	&ТабЭтапы КАК ТабЭтапы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Этапы.Обрабатывать КАК Обрабатывать,
	               |	ВТ_Этапы.Статус КАК Статус,
	               |	ВТ_Этапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ВТ_Этапы.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	               |	ВТ_Этапы.Назначение КАК Назначение,
	               |	ВТ_Этапы.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ Таб_ЭтапыДляОбработки
	               |ИЗ
	               |	ВТ_Этапы КАК ВТ_Этапы
	               |ГДЕ
	               |	ВТ_Этапы.Обрабатывать = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок КАК Норматив,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие
	               |ПОМЕСТИТЬ НормативыпоСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Таб_ЭтапыДляОбработки КАК Таб_ЭтапыДляОбработки
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = Таб_ЭтапыДляОбработки.Спецификация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК СсылкаНаНоменклатуру,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ПОМЕСТИТЬ ЗначенияДополнительногоРеквизита
	               |ИЗ
	               |	НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО НормативыпоСпецификации.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЕСТЬNULL(ЗначенияДополнительногоРеквизита.Значение, ЗНАЧЕНИЕ(Справочник.ЗначенияСвойствОбъектов.ПустаяСсылка)) КАК КатегорияМатериала,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК ЭтапПроизводства,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	1 КАК КоличествоСтрок,
	               |	НормативыпоСпецификации.Норматив КАК Норматив,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество КАК КоличествоВЭтапе,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
				   |			ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Обеспечить,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Отгрузить,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |			ТОГДА ЕСТЬNULL(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Зарезервировать,
	               |	0 КАК Остаток,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Склад КАК Склад,
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Назначение КАК Назначение,
	               |	НормативыпоСпецификации.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	НормативыпоСпецификации.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	НормативыпоСпецификации.Спецификация КАК Спецификация
	               |ПОМЕСТИТЬ ПредварительныеДанные
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация = НормативыпоСпецификации.Спецификация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияДополнительногоРеквизита КАК ЗначенияДополнительногоРеквизита
	               |		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(ЗначенияДополнительногоРеквизита.СсылкаНаНоменклатуру, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЭтапПроизводства
	               |			ИЗ
	               |				Таб_ЭтапыДляОбработки КАК Т)";
	Запрос.Текст = Запрос.Текст + "
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,  //**//
				   |	ПредварительныеДанные.Количествоэтапов КАК КоличествоЭтапов,
	               |	ПредварительныеДанные.Норматив КАК Норматив,
	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
	               |	ПредварительныеДанные.Остаток КАК Остаток,
	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеДанные.Склад КАК Склад,
	               |	ПредварительныеДанные.Назначение КАК Назначение,
	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
				   |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
				   |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход
	               |ИЗ
	               |	ПредварительныеДанные КАК ПредварительныеДанные
	               |ГДЕ %ТекстЗапросаУсловие
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура, ЭтапПроизводства 
	               |ИТОГИ
				   |	СУММА(КоличествоСтрок),
	               |	МАКСИМУМ(ВидНоменклатуры),
	               |	СУММА(Норматив),
	               |	СУММА(Обеспечить),
	               |	СУММА(Отгрузить),
	               |	СУММА(Зарезервировать),
	               |	СРЕДНЕЕ(Остаток),
	               |	МАКСИМУМ(Склад),
	               |	МАКСИМУМ(Назначение),
	               |	МАКСИМУМ(Спецификация),
	               |	СУММА(Расход)
	               |ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("ТабЭтапы", ТаблицаЭтапов);	
	Запрос.УстановитьПараметр("ДатаОстатков",ДатаОстатков);
	Запрос.УстановитьПараметр("Свойство",Объект.ДР_КатегорияМатериала);
	
	Если ТекстЗапросаУсловие <> "" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ТекстЗапросаУсловие",ТекстЗапросаУсловие);
		Если СтрНайти(ТекстЗапросаУсловие,"&КатегорияМатериала") > 0 Тогда  
			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериала);
		КонецЕсли;
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ %ТекстЗапросаУсловие","");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

&НаСервере     
//Исправила Списание/Резерв
Функция СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание)
	
	ТекстЗапросаУсловие = "";
	Если ЗначениеЗаполнено(ОтборКатегорияМатериала) Тогда 
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.КатегорияМатериала = &КатегорияМатериала"; // + Символы.ПС;
	КонецЕсли;
	Если ОтборПоВариантамОбеспечения = 1 Тогда  //Необеспеченные
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.КОбеспечению) ";
	ИначеЕсли ОтборПоВариантамОбеспечения = 3 Тогда  //Мягкий резерв
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления) ";
	ИначеЕсли ОтборПоВариантамОбеспечения = 4 Тогда  //Зарезервированные
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.СоСклада) ";
	ИначеЕсли ОтборПоВариантамОбеспечения = 5 Тогда //Отгруженные
		Если ТекстЗапросаУсловие <> "" Тогда
			ТекстЗапросаУсловие = ТекстЗапросаУсловие + Символы.ПС + " И ";
		КонецЕсли;
		ТекстЗапросаУсловие = ТекстЗапросаУсловие + " ПредварительныеДанные.ВариантОбеспечения = Значение(перечисление.ВариантыОбеспечения.Отгрузить) "; 
	КонецЕсли;
	Возврат ТекстЗапросаУсловие;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала(ИмяСписка)
    Элементы[ИмяСписка].СписокВыбора.Очистить();
	СписокВыбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Ссылка КАК КатегорияМатериала
	               |ИЗ
	               |	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Владелец = &Владелец
	               |	И ЗначенияСвойствОбъектов.Наименование ПОДОБНО ""*"" + ""%""";
	Запрос.УстановитьПараметр("Владелец",Объект.ДР_КатегорияМатериала);
	ТЗ = Запрос.Выполнить().Выгрузить();//.ВыгрузитьКолонку("ЗначениеДопРеквизита");
	
	//Элементы.СписокЗначенийДопРеквизита.СписокВыбора.Добавить("");
	Для Каждого Стр из ТЗ Цикл 
		Элементы[ИмяСписка].СписокВыбора.Добавить(Стр.КатегорияМатериала, Стр.КатегорияМатериала.Наименование);
		СписокВыбора.Добавить(Стр.КатегорияМатериала,Стр.КатегорияМатериала.Наименование);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияСпискаВыбораВариантОбеспечения(ИмяСписка)
	
	Элементы[ИмяСписка].СписокВыбора.Очистить();
	//Элементы.ВариантОбеспеченияРезервирование.СписокВыбора.Добавить(1,"Необеспеченные");
	Элементы[ИмяСписка].СписокВыбора.Добавить(1,"К Обеспечению"); 	  // Требуется    //// Обособленно
	Элементы[ИмяСписка].СписокВыбора.Добавить(2,"Не обеспечивать");   // НеТребуется
	Элементы[ИмяСписка].СписокВыбора.Добавить(3,"Мягкий резерв");   // Требуется
	Элементы[ИмяСписка].СписокВыбора.Добавить(4,"Зарезервированные"); // СоСклада     ////, ИзЗаказов
	Элементы[ИмяСписка].СписокВыбора.Добавить(5,"Отгруженные");       // Отгрузить     ////, ОтгрузитьОбособленно

КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////
#Область ВспомогательныеФункции1С

&НаСервере
// Возвращает Истина, если функциональная подсистема существует в конфигурации.
// Предназначена для реализации вызова необязательной подсистемы (условного вызова).
// У функциональной подсистемы снят флажок "Включать в командный интерфейс".
// См. также ОбщегоНазначенияПереопределяемый.ПриОпределенииОтключенныхПодсистем
// и ОбщегоНазначенияКлиент.ПодсистемаСуществует для вызова из клиентского кода.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//  Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
//  	МодульВариантыОтчетов.<Имя метода>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево - Истина, если подсистема существует.
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	ИменаПодсистем = СтандартныеПодсистемыПовтИсп.ИменаПодсистем();
	Возврат ИменаПодсистем.Получить(ПолноеИмяПодсистемы) <> Неопределено;
	
КонецФункции 

&НаСервере
// Возвращает ссылку на общий модуль или модуль менеджера по имени.
//
// Параметры:
//  Имя - Строка - имя общего модуля.
//
// Возвращаемое значение:
//   ОбщийМодуль
//   МодульМенеджераОбъекта
//
// Пример:
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурации = ОбщегоНазначения.ОбщийМодуль("ОбновлениеКонфигурации");
//		МодульОбновлениеКонфигурации.<Имя метода>();
//	КонецЕсли;
//
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
//		МодульПолнотекстовыйПоискСервер = ОбщегоНазначения.ОбщийМодуль("ПолнотекстовыйПоискСервер");
//		МодульПолнотекстовыйПоискСервер.<Имя метода>();
//	КонецЕсли;
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
		УстановитьБезопасныйРежим(Истина);
		Модуль = Вычислить(Имя);
		// АПК:488-вкл
	ИначеЕсли СтрЧислоВхождений(Имя, ".") = 1 Тогда
		Возврат СерверныйМодульМенеджера(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не существует.';
				|en = 'Common module ""%1"" does not exist.'"),
			Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции  

&НаСервере
// Возвращает серверный модуль менеджера по имени объекта.
Функция СерверныйМодульМенеджера(Имя)
	ОбъектНайден = Ложь;
	
	ЧастиИмени = СтрРазделить(Имя, ".");
	Если ЧастиИмени.Количество() = 2 Тогда
		
		ИмяВида = ВРег(ЧастиИмени[0]);
		ИмяОбъекта = ЧастиИмени[1];
		
		Если ИмяВида = ВРег("Константы") Тогда
			Если Метаданные.Константы.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыСведений") Тогда
			Если Метаданные.РегистрыСведений.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыНакопления") Тогда
			Если Метаданные.РегистрыНакопления.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыБухгалтерии") Тогда
			Если Метаданные.РегистрыБухгалтерии.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("РегистрыРасчета") Тогда
			Если Метаданные.РегистрыРасчета.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Справочники") Тогда
			Если Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Документы") Тогда
			Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Отчеты") Тогда
			Если Метаданные.Отчеты.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Обработки") Тогда
			Если Метаданные.Обработки.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("БизнесПроцессы") Тогда
			Если Метаданные.БизнесПроцессы.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ЖурналыДокументов") Тогда
			Если Метаданные.ЖурналыДокументов.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("Задачи") Тогда
			Если Метаданные.Задачи.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ПланыСчетов") Тогда
			Если Метаданные.ПланыСчетов.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ПланыОбмена") Тогда
			Если Метаданные.ПланыОбмена.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ПланыВидовХарактеристик") Тогда
			Если Метаданные.ПланыВидовХарактеристик.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		ИначеЕсли ИмяВида = ВРег("ПланыВидовРасчета") Тогда
			Если Метаданные.ПланыВидовРасчета.Найти(ИмяОбъекта) <> Неопределено Тогда
				ОбъектНайден = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ОбъектНайден Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Объект метаданных ""%1"" не существует.';
				|en = 'Metadata object ""%1"" does not exist.'"), Имя);
	КонецЕсли;
	
	// АПК:488-выкл ВычислитьВБезопасномРежиме не используется, чтобы избежать вызова ОбщийМодуль рекурсивно.
	УстановитьБезопасныйРежим(Истина);
	Модуль = Вычислить(Имя);
	// АПК:488-вкл
	
	Возврат Модуль;
КонецФункции

#КонецОбласти

//Сейчас не нужно, эти функции нужны для расчета количества по формуле, когда мы имеем формулу


//25.04.2025       
//не используется 
#Область Проверено1

//&НаСервере
//Процедура ЗаписатьДанныеЭтаповВТЧ(РезультатЗапроса, Период, ЭтоСписание)
//	ТабМатериалы = РезультатЗапроса.Выгрузить();
//	//ТабМатериалы = Объект.МатериалыСписание.Выгрузить();
//	ТабМатериалы.Колонки.Удалить("Норматив");
//	ТабМатериалы.Колонки.Удалить("Остаток");
//	ТабМатериалы.Колонки.Удалить("ЭтапПроизводства");
//	ТабМатериалы.Колонки.Удалить("СпецификацияЭтапа");
//	ТабМатериалы.Колонки.Удалить("Пользователь");
//	ТабМатериалы.Колонки.Удалить("Категори\яМатериала");
//	ТабМатериалы.Колонки.Удалить("отборПоВариантамОбеспечения");
//	
//	Если ЭтоСписание Тогда 
//		Объект.МатериалыСписание.Загрузить(ТабМатериалы);
//	Иначе 
//		Объект.МатериалыРезервирование.Загрузить(ТабМатериалы);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗначениеДопРеквизитаПриИзменении(Элемент)
//	ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериалов", Ложь);
//	//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериалов");
//КонецПроцедуры

//&НаСервере
//Процедура ЗарезервироватьВсеНаСервере(ИмяДерева,ЭтоСписание)
//	
//	//////////1. Получим данные регистра с учетом отборов (Категория материала, ОтборПоВариантамОбеспечения, Пользователь, ЭтоСписание, ВариантОбеспечения (исходный))
//	//////////2. Изменим данные в соответствии с данными дерева (синхронизация по полю ИдентификаторСтрокиРегистра)
//	//////////3. Загрузить новые данные в регистр
//	
//	Дерево = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
//	
//	//ДеревоМатериалов = Новый ДеревоЗначений;//////////////////////////////////////////////////////////
//	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
//	Для Каждого Строка из Дерево.Строки Цикл 
//		Если ТекНоменклатура <> Строка.Номенклатура Тогда
//			ТекНоменклатура = Строка.Номенклатура;
//			ТекОстаток = Строка.Остаток;
//		КонецЕсли;
//		//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
//		НоменклатураБезОстатка = Новый ТаблицаЗначений;
//		НоменклатураБезОстатка.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		НоменклатураБезОстатка.Колонки.Добавить("Этап",Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
//		Для Каждого Стр из Строка.Строки Цикл 
//			Если ТекНоменклатура = Стр.Номенклатура тогда
//				ТекОстаток = ТекОстаток - Стр.Обеспечить;
//			КонецЕсли;
//			Если ТекОстаток >= 0 Тогда			
//				НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//				НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
//				НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
//				НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
//				НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
//				Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
//					НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
//				ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
//					НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
//				КонецЕсли;
//				Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
//					НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериала);
//				ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда 
//					НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериалаРезервирование);
//				КонецЕсли;
//				НЗ.Прочитать();
//				Если НЗ.Количество() = 1 Тогда 
//					//ТЗ = НЗ.Выгрузить();
//					Для Каждого СтрНЗ из НЗ Цикл 
//						//Если НЗ.Отбор[НЗ.Отбор.Количество()-28] = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения").Использование  = Ложь Тогда 
//							//НЗ.Отбор.Удалить(НЗ.Отбор.Количество()-28);
//						//НЗ.Отбор[НЗ.Отбор.Количество()-28].Использование = Ложь;
//						//КонецЕсли;
//						//СтрНЗ.Количество = Стр.Обеспечить + Стр.;  
//						СтрНЗ.Обеспечить = СтрНЗ.Количество - СтрНЗ.Обеспечить;
//						СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
//						Если СтрНЗ.Обособленно Тогда 
//							СтрНЗ.Обособленно = Ложь;
//						КонецЕсли;
//						СтрНЗ.ОтборПоВариантамОбеспечения = 2;//4;
//						СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();
//						//СтрНЗ.Обеспечить = 0;
//						
//						//В регистре только исходный остаток - его не изменяем!!!
//						//СтрНЗ.Остаток = ОстатокПослеРезервированияВсехСтрокПоНоменклатуре;
//						
//						//Закомментировала корректировку строки дерева, так как дерево перестраивается по регистру
//						
//						//Стр.Зарезервировать = Стр.Обеспечить;
//						//Стр.Отгрузить		= 0;
//						//Стр.Обеспечить		= 0;
//						//Стр.КонтрольОстатка = Стр.Остаток - Стр.Зарезервировать - Стр.Отгрузить - Стр.Обеспечить - Стр.КОбеспечению;			 
//						
//					КонецЦикла;
//					ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
//					Если не ЭлементОтбора = Неопределено Тогда 
//						ЭлементОтбора.Использование = Ложь;
//					КонецЕсли;
//					//НЗ.Загрузить(ТЗ);
//					НЗ.Записать();
//				ИначеЕсли НЗ.Количество() > 1 Тогда 
//					//Найти запись с нужным вариантом обеспечения
//					Сообщить("Найдено более 1 строки в регистре, уточните условия поиска",СтатусСообщения.Важное);
//				Иначе 
//					Сообщить("Не найдена строка регистра для корректировки данных, "+стр.Номенклатура + " "+ Стр.ЭтапПроизводства,СтатусСообщения.Важное);
//				КонецЕсли;
//			Иначе               
//				ПараметрыПоиска = Новый Структура("Номенклатура,Этап");
//				МассивСтрокБезОстатка = НоменклатураБезОстатка.НайтиСтроки(ПараметрыПоиска);
//				Если МассивСтрокБезОстатка.Количество() = 0 Тогда 
//					НоваяСтрока = МассивСтрокБезОстатка.Добавить();
//					НоваяСтрока.Номенклатура = Стр.Номенклатура ;
//					НоваяСтрока.Этап = Стр.ЭтапПроизводства;     
//				КонецЕсли;
//				
//			КонецЕсли;
//		КонецЦикла;	       
//		ТекстНачалаСообщения = "Отсутствует остаток для резервирования по номенклатуре ";
//		ТекстСообщения = "";
//		Для Каждого СтрТЗ из НоменклатураБезОстатка Цикл 
//			ТекстСообщения = ТекстСообщения + ТекстНачалаСообщения + " " + СтрТЗ.Номенклатура + ", " + СтрТЗ.Этап + Символы.ПС;
//		КонецЦикла;                           
//		Сообщить(ТекстСообщения,СтатусСообщения.Важное);
//	КонецЦикла;
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//	
//	//ЭтапОбъект 
//	//ДанныеСпецификации = ПолучитьНормативыПоСпецификации("МатериалыИУслуги,Трудозатраты", Истина, Ложь);
//	//
//	//Если ДанныеСпецификации.Свойство("МатериалыИУслуги") Тогда
//	//	Таблица = ДанныеСпецификации.МатериалыИУслуги.Скопировать(, "Номенклатура,Характеристика,Количество");
//	//	Таблица.Свернуть("Номенклатура,Характеристика", "Количество");
//	//	Результат.Вставить("ОбеспечениеМатериаламиИРаботами", Таблица);
//	//КонецЕсли;
//	
//	
//	//АдресХранилищаНормативы = ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор);
//	//Если ЭтоАдресВременногоХранилища(АдресИлиНормативы) Тогда
//	//	НормативыИзХранилища = ПолучитьИзВременногоХранилища(АдресИлиНормативы);
//	//Иначе
//	//	НормативыИзХранилища = АдресИлиНормативы;
//	//КонецЕсли;
//	//Если ЗначениеЗаполнено(НормативыИзХранилища) И НормативыИзХранилища.Свойство(ИмяТЧ) Тогда
//	//	Нормативы = НормативыИзХранилища[ИмяТЧ];
//	//Иначе
//	//	Нормативы = Неопределено;
//	//КонецЕсли;
//	//
//	//Если ИмяТЧ = "ОбеспечениеМатериаламиИРаботами" Тогда
//	//	
//	//	СтруктураПоиска = Новый Структура("Номенклатура,Характеристика");
//	//	
//	//	Результат = УправлениеПроизводством.ПолучитьНормативы(
//	//		Нормативы,
//	//		МассивДанных,
//	//		СтруктураПоиска,
//	//		Истина);
//	//	
//	//ИначеЕсли ИмяТЧ = "Трудозатраты" Тогда
//	//	
//	//	СтруктураПоиска = Новый Структура("ВидРабот");
//	//	
//	//	Результат = УправлениеПроизводством.ПолучитьНормативы(
//	//		Нормативы,
//	//		МассивДанных,
//	//		СтруктураПоиска,
//	//		Ложь);
//	//
//	//КонецЕсли;
//	
//	
//	////ПараметрыВыборки = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных(ПереченьДанных, МенеджерВременныхТаблиц);
//	
//	//ПартияПроизводства				ФиксированнаяСтруктура	ФиксированнаяСтруктура
//		//Договор
//		//Запланировано
//		//Количество
//		//НазначениеПродукция
//		//НаправлениеДеятельности
//		//Номенклатура
//		//ОсновноеИзделиеНоменклатура
//		//ОсновноеИзделиеХарактеристика
//		//ПартияПроизводства
//		//Партнер     //не заполнено
//		//Распоряжение
//		//Спецификация
//		//ТипПроизводственногоПроцесса
//		//Характеристика
//		//ХозяйственнаОперация
//	//ПереченьДанных					"МатериалыИУслуги,Трудозатраты"	Строка
//	//ПолучатьМатериалыПоТребованию		Истина							Булево
//	//ОкруглятьКоличествоШтучныхТоваров	Ложь							Булево
//	//Отбор								Структура						Структура
//		//Этап	87215 ПА11-МК Миксер мотор.с коутером д/попкорна	СправочникСсылка.ЭтапыПроизводства
//		
//		
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДР_КатегорияМатериалаПриИзменении(Элемент)
//	ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("КатегорияМатериала");
//КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПериодОтгрузкиПриИзменении(Элемент) 
	Списание = не Объект.Резерв;
	ЗаполнитьЭтапыСВопросом(Списание);
КонецПроцедуры
   
&НаКлиенте
Процедура УдалениеЗаписейРегистраПродолжение(Результат,ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		УдалитьЗаписиРегистра(ДопПараметры.ЭтоСписание);
	Иначе 
		Объект.Номенклатура = ДопПараметры.Номенклатура;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоЗаписейРегистра(ЭтоСписание);
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Прочитать();
	Возврат НЗ.Количество();
	
КонецФункции   

&НаСервереБезКонтекста
Процедура УдалитьЗаписиРегистра(ЭтоСписание);
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры
	

&НаСервере
Процедура УстановитьДанныеПартииПроизводства(Этап)  
	
	ПараметрыПоиска = Новый Структура("Обрабатывать", Истина);   
	//ЭтапОбъект = Этапы.НайтиСтроки(ПараметрыПоиска)[0].ЭтапПроизводства;
	ДанныеПартииПроизводства = Документы.ЭтапПроизводства2_2.ДанныеПартииПроизводства(Этап.Распоряжение, Этап.НазначениеПродукция, Этап.ПартияПроизводства);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОтборКатегорияМатериалаРезервированиеПриИзменении(Элемент )
//	ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериаловРезервирование", Ложь);
//	//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериаловРезервирование");
//КонецПроцедуры

//&НаКлиенте
//Процедура СтраницыРезервированияПриСменеСтраницы(Элемент, ТекущаяСтраница)
//	
//	ИмяДерева = "ДеревоМатериаловРезервирование";         
//	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//	Если ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда  
//		ЗаполнитьСпецификациюПоВыбраннымЭтапам("ЭтапыРезервирование",Ложь);
//		ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, Истина);  
//		//ОбновитьИдентификаторыСтрокДерева(ИмяДерева);
//		//ОбновитьИдентификаторыСтрокДереваНовая(ИмяДерева,ИмяТаблицыИдентификаторов, Элементы[ИмяДерева].ТекущиеДанные);
//		ВосстановитьСостояниеДерева(ИмяДерева);      
//		//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериаловРезервирование");
//	ИначеЕсли ТекущаяСтраница.Имя = "ЭтапыРезервирования" Тогда  
//		Если ДеревоМатериаловРезервирование.ПолучитьЭлементы().Количество() > 0 Тогда 
//			ДопПарметры = Новый Структура;
//			ДопПарметры.Вставить("ЭтоСписание",Ложь); 
//			ДопПарметры.Вставить("ИмяДерева",ИмяДерева);
//			ДопПарметры.Вставить("ИмяТаблицыИдентификаторов",ИмяТаблицыИдентификаторов);
//			ОповещениеПриПереходеНаСтрЭтапы = Новый ОписаниеОповещения("ПереходНаСтрЭтапыПродолжение",ЭтаФорма,ДопПарметры);
//			ПоказатьВопрос(ОповещениеПриПереходеНаСтрЭтапы,"Данные по корректировке материалов будут утеряны, продолжить?",РежимДиалогаВопрос.ДаНет, 300);
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Процедура УдалитьМатериалыДляКорректирвкиИзРегистра (ЭтоСписание)
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.этоСписание.Установить(ЭтоСписание);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияВРегистр(ТекСтрока,ЭтоСписание)
	
	МЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьМенеджерЗаписи();
	МЗ.Пользователь = Пользователи.АвторизованныйПользователь();
	МЗ.ЭтоСписание = ЭтоСписание;
	МЗ.ИдентификаторСтрокиРегистра = ТекСтрока.ИдентификаторСтрокиРегистра;
	//ЗаполнитьЗначенияСвойств(МЗ,ИсходныеДанныеСтрокиДереваМатериалов);
	
	//МЗ.Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
	//МЗ.ЭтапПроизводства = ИсходныеДанныеСтрокиДереваМатериалов.ЭтапПроизводства;
	//МЗ.Номенклатура = ИсходныеДанныеСтрокиДереваМатериалов.Номенклатура
	МЗ.Прочитать();
	ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока,"Количество,КоличествоУпаковок, ВариантОбеспечения, Обеспечить");
	МЗ.Записать();
	//Если ЗначениеЗаполнено(ТекСтрока.НоваяНоменклатура) Тогда 
	//	МЗ.НоваяНоменклатура = ТекСтрока.НоваяНоменклатура;
	//	МЗ.НоваяЕдиницаИзмерения = ТекСтрока.НоваяЕдиницаИзмерения;
	//	МЗ.ОбеспечитьНов = ТекСтрока.Обеспечить
	//КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ОтменитьРезервВсеСтрокиНаСервере(ИмяДерева,ЭтоСписание)
//	
//	Дерево = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
//	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
//	Для Каждого Строка из Дерево.Строки Цикл 
//		Если ТекНоменклатура <> Строка.Номенклатура Тогда
//			ТекНоменклатура = Строка.Номенклатура;
//			//ТекОстаток = Строка.Остаток;
//		КонецЕсли;
//		//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
//		Для Каждого Стр из Строка.Строки Цикл 
//			Если ТекНоменклатура = Стр.Номенклатура тогда
//				//ТекОстаток = ТекОстаток + Стр.Обеспечить;
//			КонецЕсли;
//			//Если ТекОстаток >= 0 Тогда			
//				НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//				НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
//				НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
//				
//				//Обрабатываем только зарезервированные материалы, поэтому отбор по заререзервированным материалам устанавливаем безусловно!!!!!
//				НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(2);  //(4)
//				НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
//				НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
//				//Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
//				//	НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
//				//ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
//				//	НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
//				//КонецЕсли;
//				
//				Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
//					НЗ.Отбор.КатегорияМатериала = ОтборКатегорияМатериала;
//				ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда 
//					НЗ.Отбор.КатегорияМатериала = ОтборКатегорияМатериалаРезервирование;
//				КонецЕсли;
//				НЗ.Прочитать();
//				Если НЗ.Количество() = 1 Тогда 
//					Для Каждого СтрНЗ из НЗ Цикл 
//						//Если НЗ.Отбор[НЗ.Отбор.Количество()-28] = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения").Использование  = Ложь Тогда 
//							//НЗ.Отбор.Удалить(НЗ.Отбор.Количество()-28);
//							//НЗ.Отбор[НЗ.Отбор.Количество()-28].Использование = Ложь;
//						//КонецЕсли;
//						СтрНЗ.Количество = Стр.Обеспечить + Стр.Зарезервировать;
//						//СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОбособленно;
//						СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
//						СтрНЗ.Обособленно = Истина;
//						
//						СтрНЗ.ОтборПоВариантамОбеспечения = 1;
//						СтрНЗ.Обеспечить = Стр.Обеспечить + Стр.Зарезервировать;
//						//СтрНЗ.Остаток = ОстатокПослеРезервированияВсехСтрокПоНоменклатуре;
//						
//						//Строки дерева не корректируем, так как дерево перерисовывается по данным регистра
//						//Стр.Зарезервировать = Стр.Обеспечить;
//						//Стр.Отгрузить		= 0;
//						//Стр.Обеспечить		= 0;
//						//Стр.КонтрольОстатка = Стр.Остаток - Стр.Зарезервировать - Стр.Отгрузить - Стр.Обеспечить - Стр.КОбеспечению;			 
//					КонецЦикла;
//					ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
//					Если не ЭлементОтбора = Неопределено Тогда 
//						ЭлементОтбора.Использование = Ложь;
//					КонецЕсли;
//						//НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения").Использование  = Ложь;
//					НЗ.Записать();
//				ИначеЕсли НЗ.Количество() > 1 Тогда 
//					//Найти запись с нужным вариантом обеспечения
//					Сообщить("Найдено более 1 строки в регистре, уточните условия поиска",СтатусСообщения.Важное);
//				Иначе 
//					Сообщить("Не найдена строка регистра для корректировки данных!",СтатусСообщения.Важное);
//				КонецЕсли;
//			//Иначе 
//			//	Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства + Символы.ПС,СтатусСообщения.Важное);
//			//КонецЕсли;
//		КонецЦикла;				
//	КонецЦикла;
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, ПоЭтапам = Ложь, ДанныеТекущейСтроки = Неопределено)
	
	ЗаполнитьМатериалыСпецификации(ПоЭтапам);  
	УстановитьУсловноеОформлениеМатериаловСпецификации();
		
КонецПроцедуры 

//&НаКлиенте
//Процедура ОтменитьРезервВсеСтроки(Команда)
//	//Элементы.ДеревоМатериалов.ТекущиеДанные
//	//Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
//	Если ТекСтраница = "Резервирование" Тогда 
//		ЭтоСписание = Ложь;
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		//ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//		//ОтменитьРезервВсеСтрокиНаСервере("ДеревоМатериаловРезервирование", Ложь);
//	ИначеЕсли Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
//		ЭтоСписание = Истина;
//		ИмяДерева = "ДеревоМатериалов";
//		//ОтменитьРезервВсеСтрокиНаСервере("ДеревоМатериалов", Истина);
//	КонецЕсли;                                                  
//	ВариантОбеспеченияДо = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
//	ВариантОбеспеченияПосле = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления");
//	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,ВариантОбеспеченияДо,ВариантОбеспеченияПосле);
//	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//	//ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные;
//	//ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();
//	//
//	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства,ИДТекСтроки);
//	ВосстановитьСостояниеДерева(ИмяДерева);
//	
//КонецПроцедуры

&НаСервере 
Функция ТекстЗапросаДанныхРегистра()
	
	Возврат "ВЫБРАТЬ
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика КАК Характеристика,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия КАК Серия,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	        |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	        |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	        |	КОНЕЦ КАК Упаковка,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки КАК ДатаОтгрузки,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад КАК Склад,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится КАК Производится,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения КАК НазначениеОбеспечения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий КАК СтатусУказанияСерий,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки КАК КодСтроки,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора КАК СведенияАвтовыбора,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала КАК ПрименениеМатериала,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатьяКалькуляции КАК СтатьяКалькуляции,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Отменено КАК Отменено,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПричинаОтмены КАК ПричинаОтмены,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат КАК Период,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	        //|	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспеченияДоИзмененияОбновлениемИБ КАК ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтроки КАК ИдентификаторСтроки,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение КАК Подразделение,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа КАК СпецификацияЭтапа,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь КАК Пользователь,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание КАК ЭтоСписание,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска КАК ДатаЗапуска,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяЕдиницаИзмерения КАК ИсходнаяЕдиницаИзмерения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодОтгрузки КАК ПериодОтгрузки,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала КАК КатегорияМатериала,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество КАК Количество,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок КАК КоличествоУпаковок,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Остаток КАК Остаток,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обеспечить КАК Обеспечить,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор КАК КлючСвязиНабор,
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура КАК КлючНоменклатура
	        |ИЗ
	        |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	        |ГДЕ
	        |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства = &ЭтапПроизводства
	        |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	        |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь";
	
КонецФункции

&НаСервере
Функция ОтменитьРасходМатериаловВЭтапе(Этап, Знач ЗаписьУспешна = Истина)
	
	ОбъектЭтап = Этап.ПолучитьОбъект(); 
	ОбъектЭтап.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Начат;
	ОбъектЭтап.КоличествоУпаковокФакт = 0.5;
	ОбъектЭтап.РасходМатериаловИРабот.Очистить(); 
	
	Попытка
		НачатьТранзакцию();
		ОбъектЭтап.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить("Не удалось отменить завершение этапа " + Этап);
		ЗаписьУспешна = Ложь;
	КонецПопытки;    
	
	Возврат ЗаписьУспешна;
	
КонецФункции

&НаСервере
Функция СформироватьПередачуМатериаловНаСервере(Этап)
	
	перем СписокОшибок;
	
	МассивСсылок = Новый Массив();
	МассивСсылок.Добавить(Этап);  
	
	ТабСклады = Этап.ОбеспечениеМатериаламиИРаботами.Выгрузить(,"Склад"); //.Свернуть("Склад");
	ТабСклады.Свернуть("Склад");
	КоличествоОтправителей = ТабСклады.Количество();
	
	ПараметрыОткрытия = СозданиеНаОснованииУТВызовСервера.ПараметрыОткрытияФормыНакладнойНаОснованииЗаказа(МассивСсылок,
			"ДвижениеПродукцииИМатериалов", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство"));
	
	СозданныеДокументы = Новый Массив;
	Если КоличествоОтправителей = 1 Тогда   //1 склад в ТЧ Обеспечение и 1 документ передачи материалов в производство
		
		ДанныеЗаполнения = ПараметрыОткрытия.ПараметрыФормы.Основание;  
		Документ = Документы.ДвижениеПродукцииИМатериалов.СоздатьДокумент();
		Документ.Заполнить(ДанныеЗаполнения);
		Документ.Дата = Объект.ПериодОтгрузки;  
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			Возврат Истина;
		Исключение
			Сообщить("Ошибка формирования Передачи материалов "+Этап+"  "+ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
	Иначе  
		//Формирование нескольких документов Передачи материалов в производство по различным складам в ТЧ Обеспечение ЭтапаПроизводства
		РежимФормирования = 0;
		
		ОтборХозяйственныеОперации = ПараметрыОткрытия.ПараметрыФормы.СтруктураБыстрогоОтбора.ОтборХозяйственныеОперации;
		ОтборТипыДокументов = ПараметрыОткрытия.ПараметрыФормы.СтруктураБыстрогоОтбора.ОтборТипыДокументов;    
		
		Если ПараметрыОткрытия.ПараметрыФормы.Свойство("Распоряжения") Тогда
			Распоряжения.ЗагрузитьЗначения(ПараметрыОткрытия.ПараметрыФормы.Распоряжения);
		КонецЕсли;
		
		КлючНастроек = ПараметрыОткрытия.ПараметрыФормы.КлючНазначенияФормы;
		ТЗХозОперацииИТипыДокументов = ОбщегоНазначенияУТ.ДоступныеХозяйственныеОперацииИДокументы(ОписаниеОперацийИТиповДокументов(),
																	ОтборХозяйственныеОперации, ОтборТипыДокументов, КлючНастроек);   
		ХозяйственныеОперацииИДокументы.Загрузить(ТЗХозОперацииИТипыДокументов);																			
		
		СформироватьТекстыЗапросов();
		ОбновитьСписокРаспоряженияНаОформлениеНаСервере();
		
		ВыделенныеСтроки = СписокРаспоряженияНаОформление.Выгрузить();
		ГруппировкиРаспоряжений = Новый Массив; 
		Для Каждого Строка из ВыделенныеСтроки Цикл 
			//Строка = СписокРаспоряженияНаОформление.НайтиПоИдентификатору(ИдентификторСтроки); 
			ПоляГруппировки = "ХозяйственнаяОперация,ВнутренняяПереработка,ОрганизацияДавалец,Отправитель,Получатель"; 
			
			Группировка1 = ПолучитьГруппировку(ГруппировкиРаспоряжений, Строка, ПоляГруппировки, ХозяйственныеОперацииИДокументы, Ложь);
			Группировка1.МассивЗаказов.Добавить(Строка.Ссылка);   
			
		КонецЦикла;

		Если ЗначениеЗаполнено(ГруппировкиРаспоряжений) Тогда
			
			ПолеОшибки = "Объект.СписокРаспоряженияНаОформление";
			НакладныеСервер.СгруппироватьДокументыПоКлючевымПолямВКоллекции(ГруппировкиРаспоряжений, "МассивЗаказов", "КлючевыеПоляШапки");
			Результат = СформироватьДокументыПоРаспоряжениям(ГруппировкиРаспоряжений, СписокОшибок, ПолеОшибки);
			СозданныеДокументы = Результат.СозданныеДокументы; 
			СписокОшибок = Результат.СписокОшибок;
			Если СозданныеДокументы.Количество() > 0 Тогда 
				Возврат Истина;
			Иначе 
				Возврат Ложь;  
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
КонецФункции   




////////////////////////////////////////////////////////////////////////////////
#Область ВспомогательныеФункцииПередачиМатериалов     
//Заимствованные, переделанные

&НаСервере
Функция ОписаниеОперацийИТиповДокументов()
	
	ТЗХозОперацииИТипыДокументов = ХозяйственныеОперацииИДокументы.Выгрузить(Новый Массив);
	
	ДоступныеОперацииДокумента = Документы.ДвижениеПродукцииИМатериалов.СписокОпераций();
	
	СвойстваПоУмолчанию = Новый Структура(
		"КлючНазначенияИспользования,ЗаголовокРабочегоМеста,ТипДокумента,ПолноеИмяДокумента,ИспользуютсяСтатусы,
		|ДобавитьКнопкуСоздать,КлючевыеПоляШапки, ЗаголовокФормыПереоформления");
	
	СвойстваПоУмолчанию.КлючНазначенияИспользования  = "";
	СвойстваПоУмолчанию.ЗаголовокРабочегоМеста       = НСтр("ru = 'Внутренние документы (движения продукции и материалов)';
															|en = 'Internal documents (transfer of products and materials)'");
	СвойстваПоУмолчанию.ТипДокумента                 = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов");
	СвойстваПоУмолчанию.ПолноеИмяДокумента           = Метаданные.Документы.ДвижениеПродукцииИМатериалов.ПолноеИмя();
	СвойстваПоУмолчанию.ИспользуютсяСтатусы          = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыДвиженийПродукцииИМатериалов");
	СвойстваПоУмолчанию.ДобавитьКнопкуСоздать        = Истина;
	СвойстваПоУмолчанию.КлючевыеПоляШапки            = Документы.ДвижениеПродукцииИМатериалов.КлючевыеПоляШапкиРаспоряжения();
	СвойстваПоУмолчанию.ЗаголовокФормыПереоформления = "";
	
	ТекущаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой;
	Если ДоступныеОперацииДокумента.НайтиПоЗначению(ТекущаяОперация) <> Неопределено Тогда
		
		Строка = ТЗХозОперацииИТипыДокументов.Добавить();
		Строка.ХозяйственнаяОперация = ТекущаяОперация;
		ЗаполнитьЗначенияСвойств(Строка, СвойстваПоУмолчанию);
		Строка.ЗаголовокФормыПереоформления = "";
		
	КонецЕсли;
	
	ТекущаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзКладовой;
	Если ДоступныеОперацииДокумента.НайтиПоЗначению(ТекущаяОперация) <> Неопределено Тогда
		
		Строка = ТЗХозОперацииИТипыДокументов.Добавить();
		Строка.ХозяйственнаяОперация = ТекущаяОперация;
		ЗаполнитьЗначенияСвойств(Строка, СвойстваПоУмолчанию);
		Строка.ЗаголовокФормыПереоформления = "";
		
	КонецЕсли;
	
	ТекущаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;
	Если ДоступныеОперацииДокумента.НайтиПоЗначению(ТекущаяОперация) <> Неопределено Тогда
		
		Строка = ТЗХозОперацииИТипыДокументов.Добавить();
		Строка.ХозяйственнаяОперация = ТекущаяОперация;
		ЗаполнитьЗначенияСвойств(Строка, СвойстваПоУмолчанию);
		Строка.ЗаголовокФормыПереоформления = НСтр("ru = 'Переоформление передачи в кладовую по выбранным распоряжениям';
													|en = 'Reregister transfer to storeroom for the selected references'");
		
	КонецЕсли;
	
	ТекущаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВПроизводство;
	Если ДоступныеОперацииДокумента.НайтиПоЗначению(ТекущаяОперация) <> Неопределено Тогда
		
		Строка = ТЗХозОперацииИТипыДокументов.Добавить();
		Строка.ХозяйственнаяОперация = ТекущаяОперация;
		ЗаполнитьЗначенияСвойств(Строка, СвойстваПоУмолчанию);
		Строка.ЗаголовокФормыПереоформления = НСтр("ru = 'Переоформление передачи в производство по выбранным распоряжениям';
													|en = 'Reregister transfer to production for the selected references'");
		//++ НЕ УТКА
		Строка.КлючевыеПоляШапки = Документы.ДвижениеПродукцииИМатериалов.КлючевыеПоляШапкиРаспоряженияЭтапа();
		//-- НЕ УТКА
		
	КонецЕсли;
	
	ТекущаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства;
	Если ДоступныеОперацииДокумента.НайтиПоЗначению(ТекущаяОперация) <> Неопределено Тогда
		
		Строка = ТЗХозОперацииИТипыДокументов.Добавить();
		Строка.ХозяйственнаяОперация = ТекущаяОперация;
		ЗаполнитьЗначенияСвойств(Строка, СвойстваПоУмолчанию);
		Строка.ЗаголовокФормыПереоформления = НСтр("ru = 'Переоформление возврата из производства по выбранным распоряжениям';
													|en = 'Reregister return from production by selected references'");
		//++ НЕ УТКА
		Строка.КлючевыеПоляШапки = Документы.ДвижениеПродукцииИМатериалов.КлючевыеПоляШапкиРаспоряженияЭтапа();
		//-- НЕ УТКА
		
	КонецЕсли;
	
	ТекущаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства;
	Если ДоступныеОперацииДокумента.НайтиПоЗначению(ТекущаяОперация) <> Неопределено Тогда
		
		Строка = ТЗХозОперацииИТипыДокументов.Добавить();
		Строка.ХозяйственнаяОперация = ТекущаяОперация;
		ЗаполнитьЗначенияСвойств(Строка, СвойстваПоУмолчанию);
		Строка.ЗаголовокФормыПереоформления = НСтр("ru = 'Переоформление передачи из производства по выбранным распоряжениям';
													|en = 'Reregister transfer from production for the selected references'");
		//++ НЕ УТКА
		Строка.КлючевыеПоляШапки = Документы.ДвижениеПродукцииИМатериалов.КлючевыеПоляШапкиРаспоряженияЭтапа();
		//-- НЕ УТКА
		
	КонецЕсли;
	
	Возврат ТЗХозОперацииИТипыДокументов;
	
КонецФункции

 &НаСервере
Процедура СформироватьТекстыЗапросов()
	
	Организация = Справочники.Организации.ПустаяСсылка();
	Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Менеджер = Справочники.Пользователи.ПустаяСсылка(); 
	РежимФормирования = 0;
	
	ПараметрыОтбора = НакладныеСервер.ПараметрыОтбораРаспоряжений(Организация, Подразделение,, ОтборХозяйственныеОперации, Менеджер);
	
	// Получение состояний всегда выполняется в разрезе номенклатуры.
	ПараметрыЗамены = Новый Структура("ПолеНоменклатура");
	
	// Итоговые данные сворачиваются в зависимости от режима отображения.
	ПараметрыЗаменыДанных = ?(РежимФормирования > 0, ПараметрыЗамены, Неопределено);
	
	Пакет = Новый Массив;
	Выборка = Новый Массив;
	Состояния = НакладныеСервер.СостоянияПоХозоперациям(ОтборХозяйственныеОперации.ВыгрузитьЗначения());
	//++ НЕ УТКА
	ЕстьСостоянияПередачИзПроизводства = Состояния.Свойство("СостоянияПередачИзПроизводства");
	//-- НЕ УТКА 
	Для каждого КЗ Из Состояния Цикл
		Пакет.Добавить(НакладныеСервер.ТекстЗапросаСостояний(КЗ.Ключ, ПараметрыОтбора, КЗ.Значение,, ПараметрыЗамены));
		
		Если КЗ.Ключ = "СостоянияРасходныхОрдеров" Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СостоянияРасходныхОрдеров.Распоряжение КАК Распоряжение,
			|	&Поля КАК Поля,
			|	СостоянияРасходныхОрдеров.Склад КАК Отправитель,
			|	СостоянияРасходныхОрдеров.Получатель КАК Получатель,
			|	ВЫБОР
			//++ НЕ УТКА
			|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияРасходныхОрдеров.Распоряжение) = ТИП(Документ.ЭтапПроизводства2_2)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
			//-- НЕ УТКА
			|		КОГДА ИСТИНА
			|			ТОГДА NULL
			|	КОНЕЦ КАК ХозОперация,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияРасходныхОрдеров.Распоряжение) В (&ТипыЗаказов)
			|			ТОГДА 0
			|		ИНАЧЕ 4
			|	КОНЕЦ КАК СостояниеНакладной,
			|	СостоянияРасходныхОрдеров.Состояние КАК СостояниеРасходногоОрдера,
			|	4 КАК СостояниеПриходногоОрдера,
			|	ИСТИНА КАК НакладнаяНаОтгрузку,
			|	ЛОЖЬ КАК НакладнаяНаПриемку
			|ИЗ
			|	ВТСостоянияРасходныхОрдеров КАК СостоянияРасходныхОрдеров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыПолучатель
			|		ПО (СпрСкладыПолучатель.Ссылка = СостоянияРасходныхОрдеров.Получатель)
			|			И (СпрСкладыПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении)
			|			И (СпрСкладыПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении <= &НачалоТекущегоДня)";
			
			НакладныеСервер.НастроитьПолеНоменклатуры(
				ТекстЗапроса, ПараметрыЗаменыДанных, "&Поля КАК Поля,", "СостоянияРасходныхОрдеров");
			
			Выборка.Добавить(ТекстЗапроса);
			
		ИначеЕсли КЗ.Ключ = "СостоянияПриходныхОрдеров" Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СостоянияПриходныхОрдеров.Распоряжение КАК Распоряжение,
			|	&Поля КАК Поля,
			|	СостоянияПриходныхОрдеров.Отправитель КАК Отправитель,
			|	СостоянияПриходныхОрдеров.Склад КАК Получатель,
			|	СостоянияПриходныхОрдеров.ХозОперация КАК ХозОперация,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияПриходныхОрдеров.Распоряжение) В (&ТипыЗаказов)
			|			ТОГДА 0
			|		ИНАЧЕ 4
			|	КОНЕЦ КАК СостояниеНакладной,
			|	4 КАК СостояниеРасходногоОрдера,
			|	СостоянияПриходныхОрдеров.Состояние КАК СостояниеПриходногоОрдера,
			|	ЛОЖЬ КАК НакладнаяНаОтгрузку,
			|	ИСТИНА КАК НакладнаяНаПриемку
			|ИЗ
			|	ВтСостоянияПриходныхОрдеров КАК СостоянияПриходныхОрдеров
			|	
			|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОтправитель
			|	ПО СпрСкладыОтправитель.Ссылка = СостоянияПриходныхОрдеров.Отправитель
			|	И СпрСкладыОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке
			|	И СпрСкладыОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня
			|";
			
			НакладныеСервер.НастроитьПолеНоменклатуры(
				ТекстЗапроса, ПараметрыЗаменыДанных, "&Поля КАК Поля,", "СостоянияПриходныхОрдеров");
			
			//++ НЕ УТКА
			Если ЕстьСостоянияПередачИзПроизводства Тогда
				
				ОписаниеТаблицы = 
					СхемыЗапросов.ОписаниеТаблицы(
						Тип("ОписаниеВременнойТаблицыСхемыЗапроса"),
						"ВтСостоянияПередачИзПроизводства",
						"СостоянияПередачИзПроизводства",
						"Распоряжение, Номенклатура, Характеристика, Склад, Отправитель, ХозОперация");
				
				ОписаниеСоединения =
					СхемыЗапросов.ОписаниеСоединения(
						ОписаниеТаблицы,
						"&ТекстУсловияСоединения",
						ТипСоединенияСхемыЗапроса.Внутреннее);
				
				ТекстЗапроса =
					СхемыЗапросов.ДобавитьСоединениеВЗапрос(
						ТекстЗапроса,
						"СостоянияПриходныхОрдеров",
						ОписаниеСоединения);
				
				ТекстЗапроса =
					СтрЗаменить(
						ТекстЗапроса,
						"&ТекстУсловияСоединения",
						"СостоянияПередачИзПроизводства.Распоряжение = СостоянияПриходныхОрдеров.Распоряжение
						// Соединение по номенклатуре выполняется всегда для минимизации дублирования строк передачи
						// продукции из производства и возврата материалов из производства. Дублирование может возникать
						// из-за разных хоз. операций в складском и производственном учетах.
						|	И СостоянияПередачИзПроизводства.Номенклатура   = СостоянияПриходныхОрдеров.Номенклатура
						|	И СостоянияПередачИзПроизводства.Характеристика = СостоянияПриходныхОрдеров.Характеристика
						|	И СостоянияПередачИзПроизводства.Склад = СостоянияПриходныхОрдеров.Склад
						|	И СостоянияПередачИзПроизводства.Отправитель = СостоянияПриходныхОрдеров.Отправитель
						|	И СостоянияПередачИзПроизводства.ХозОперация = СостоянияПриходныхОрдеров.ХозОперация");
				
			КонецЕсли;
			//-- НЕ УТКА
			
			Выборка.Добавить(ТекстЗапроса);
			
			//++ НЕ УТКА
			Если ЕстьСостоянияПередачИзПроизводства Тогда
				// Получим состояние оформления приходных ордеров для возврата материалов из производства
				ТекстЗапроса =
				"ВЫБРАТЬ
				|	СостоянияПриходныхОрдеров.Распоряжение КАК Распоряжение,
				|	&Поля КАК Поля,
				|	СостоянияПриходныхОрдеров.Отправитель КАК Отправитель,
				|	СостоянияПриходныхОрдеров.Склад КАК Получатель,
				|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства) КАК ХозОперация,
				|	ВЫБОР
				|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияПриходныхОрдеров.Распоряжение) В (&ТипыЗаказов)
				|			ТОГДА 0
				|		ИНАЧЕ 4
				|	КОНЕЦ КАК СостояниеНакладной,
				|	4 КАК СостояниеРасходногоОрдера,
				|	СостоянияПриходныхОрдеров.Состояние КАК СостояниеПриходногоОрдера,
				|	ЛОЖЬ КАК НакладнаяНаОтгрузку,
				|	ИСТИНА КАК НакладнаяНаПриемку
				|ИЗ
				|	ВтСостоянияПриходныхОрдеров КАК СостоянияПриходныхОрдеров
				|	
				|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтСостоянияПередачИзПроизводства КАК СостоянияПередачИзПроизводства
				|	ПО СостоянияПередачИзПроизводства.Распоряжение = СостоянияПриходныхОрдеров.Распоряжение
				// Соединение по номенклатуре выполняется всегда для минимизации дублирования строк передачи
				// продукции из производства и возврата материалов из производства. Дублирование может возникать
				// из-за разных хоз. операций в складском и производственном учетах.
				|	И СостоянияПередачИзПроизводства.Номенклатура   = СостоянияПриходныхОрдеров.Номенклатура
				|	И СостоянияПередачИзПроизводства.Характеристика = СостоянияПриходныхОрдеров.Характеристика
				|	И СостоянияПередачИзПроизводства.Склад = СостоянияПриходныхОрдеров.Склад
				|	И СостоянияПередачИзПроизводства.Отправитель = СостоянияПриходныхОрдеров.Отправитель
				|	И СостоянияПередачИзПроизводства.ХозОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства)
				|	
				|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОтправитель
				|	ПО СпрСкладыОтправитель.Ссылка = СостоянияПриходныхОрдеров.Отправитель
				|	И СпрСкладыОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке
				|	И СпрСкладыОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня
				|";
				
				НакладныеСервер.НастроитьПолеНоменклатуры(
					ТекстЗапроса, ПараметрыЗаменыДанных, "&Поля КАК Поля,", "СостоянияПриходныхОрдеров");
				
				Выборка.Добавить(ТекстЗапроса);
				
				// Получим состояние оформления приходных ордеров, по которым оформлены все накладные
				ТекстЗапроса =
				"ВЫБРАТЬ
				|	СостоянияПриходныхОрдеров.Распоряжение КАК Распоряжение,
				|	&Поля КАК Поля,
				|	СостоянияПриходныхОрдеров.Отправитель КАК Отправитель,
				|	СостоянияПриходныхОрдеров.Склад КАК Получатель,
				|	СостоянияПриходныхОрдеров.ХозОперация КАК ХозОперация,
				|	ВЫБОР
				|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияПриходныхОрдеров.Распоряжение) В (&ТипыЗаказов)
				|			ТОГДА 0
				|		ИНАЧЕ 4
				|	КОНЕЦ КАК СостояниеНакладной,
				|	4 КАК СостояниеРасходногоОрдера,
				|	СостоянияПриходныхОрдеров.Состояние КАК СостояниеПриходногоОрдера,
				|	ЛОЖЬ КАК НакладнаяНаОтгрузку,
				|	ИСТИНА КАК НакладнаяНаПриемку
				|ИЗ
				|	ВтСостоянияПриходныхОрдеров КАК СостоянияПриходныхОрдеров
				|	
				|	ЛЕВОЕ СОЕДИНЕНИЕ ВтСостоянияПередачИзПроизводства КАК СостоянияПередачИзПроизводства
				|	ПО СостоянияПередачИзПроизводства.Распоряжение = СостоянияПриходныхОрдеров.Распоряжение
				// Соединение по номенклатуре выполняется всегда для минимизации дублирования строк передачи
				// продукции из производства и возврата материалов из производства. Дублирование может возникать
				// из-за разных хоз. операций в складском и производственном учетах.
				|	И СостоянияПередачИзПроизводства.Номенклатура   = СостоянияПриходныхОрдеров.Номенклатура
				|	И СостоянияПередачИзПроизводства.Характеристика = СостоянияПриходныхОрдеров.Характеристика
				|	И СостоянияПередачИзПроизводства.Склад = СостоянияПриходныхОрдеров.Склад
				|	И СостоянияПередачИзПроизводства.Отправитель = СостоянияПриходныхОрдеров.Отправитель
				|	И СостоянияПередачИзПроизводства.ХозОперация = СостоянияПриходныхОрдеров.ХозОперация
				|	
				|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОтправитель
				|	ПО СпрСкладыОтправитель.Ссылка = СостоянияПриходныхОрдеров.Отправитель
				|	И СпрСкладыОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке
				|	И СпрСкладыОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня
				|
				|ГДЕ
				|	СостоянияПередачИзПроизводства.Распоряжение ЕСТЬ NULL
				|";
				
				НакладныеСервер.НастроитьПолеНоменклатуры(
					ТекстЗапроса, ПараметрыЗаменыДанных, "&Поля КАК Поля,", "СостоянияПриходныхОрдеров");
				
				Выборка.Добавить(ТекстЗапроса);
				
			КонецЕсли;
			//-- НЕ УТКА
			
		ИначеЕсли КЗ.Ключ = "СостоянияПередачВПроизводство" Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СостоянияПередачВПроизводство.Распоряжение КАК Распоряжение,
			|	&Поля КАК Поля,
			|	СостоянияПередачВПроизводство.Склад КАК Отправитель,
			|	СостоянияПередачВПроизводство.Получатель КАК Получатель,
			|	ВЫБОР
			//++ НЕ УТКА
			|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияПередачВПроизводство.Распоряжение) = ТИП(Документ.ЭтапПроизводства2_2)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
			//-- НЕ УТКА
			|		КОГДА ИСТИНА
			|			ТОГДА NULL
			|	КОНЕЦ КАК ХозОперация,
			|	СостоянияПередачВПроизводство.Состояние КАК СостояниеНакладной,
			|	ВЫБОР
			|		КОГДА СпрСкладыОтправитель.Ссылка ЕСТЬ NULL
			|			ТОГДА 4
			|		КОГДА СостоянияПередачВПроизводство.Состояние = 1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеРасходногоОрдера,
			|	4 КАК СостояниеПриходногоОрдера,
			|	ИСТИНА КАК НакладнаяНаОтгрузку,
			|	ЛОЖЬ КАК НакладнаяНаПриемку
			|ИЗ
			|	ВтСостоянияПередачВПроизводство КАК СостоянияПередачВПроизводство
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОтправитель
			|		ПО (СпрСкладыОтправитель.Ссылка = СостоянияПередачВПроизводство.Склад)
			|			И (СпрСкладыОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке)
			|			И (СпрСкладыОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)";
			
			НакладныеСервер.НастроитьПолеНоменклатуры(
				ТекстЗапроса, ПараметрыЗаменыДанных, "&Поля КАК Поля,", "СостоянияПередачВПроизводство");
			
			Выборка.Добавить(ТекстЗапроса);
			
		//++ НЕ УТКА
		ИначеЕсли КЗ.Ключ = "СостоянияПередачИзПроизводства" Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СостоянияПередачИзПроизводства.Распоряжение КАК Распоряжение,
			|	&Поля КАК Поля,
			|	СостоянияПередачИзПроизводства.Отправитель КАК Отправитель,
			|	СостоянияПередачИзПроизводства.Склад КАК Получатель,
			|	СостоянияПередачИзПроизводства.ХозОперация КАК ХозОперация,
			|	СостоянияПередачИзПроизводства.Состояние КАК СостояниеНакладной,
			|	4 КАК СостояниеРасходногоОрдера,
			|	ВЫБОР
			|		КОГДА СпрСкладыПолучатель.Ссылка ЕСТЬ NULL
			|				ИЛИ ДокЭтапПроизводства.ВариантПриемкиТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным)
			|			ТОГДА 4
			|		КОГДА СостоянияПередачИзПроизводства.Состояние = 1
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СостояниеПриходногоОрдера,
			|	ЛОЖЬ КАК НакладнаяНаОтгрузку,
			|	ИСТИНА КАК НакладнаяНаПриемку
			|ИЗ
			|	ВтСостоянияПередачИзПроизводства КАК СостоянияПередачИзПроизводства
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ДокЭтапПроизводства
			|		ПО СостоянияПередачИзПроизводства.Распоряжение = ДокЭтапПроизводства.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыПолучатель
			|		ПО (СпрСкладыПолучатель.Ссылка = СостоянияПередачИзПроизводства.Склад)
			|			И (СпрСкладыПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении)
			|			И (СпрСкладыПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении <= &НачалоТекущегоДня)";
			
			НакладныеСервер.НастроитьПолеНоменклатуры(
				ТекстЗапроса, ПараметрыЗаменыДанных, "&Поля КАК Поля,", "СостоянияПередачИзПроизводства");
			
			Выборка.Добавить(ТекстЗапроса);
			
		//-- НЕ УТКА
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапросаРасчетаСостояний = СтрСоединить(Пакет, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	ТекстЗапросаСпискаРаспоряжений =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Распоряжение КАК Ссылка,
		|	&Поля КАК Поля,
		|	ВложенныйЗапрос.Отправитель КАК Отправитель,
		|	ВложенныйЗапрос.Получатель КАК Получатель,
		|	ВложенныйЗапрос.ХозОперация КАК ХозОперация,
		|	МАКСИМУМ(ВложенныйЗапрос.СостояниеНакладной) КАК СостояниеНакладной,
		|	МАКСИМУМ(ВложенныйЗапрос.СостояниеРасходногоОрдера) КАК СостояниеОрдераНаОтгрузку,
		|	МАКСИМУМ(ВложенныйЗапрос.СостояниеПриходногоОрдера) КАК СостояниеОрдераНаПриемку,
		|	МАКСИМУМ(ВложенныйЗапрос.НакладнаяНаОтгрузку) КАК НакладнаяНаОтгрузку,
		|	МАКСИМУМ(ВложенныйЗапрос.НакладнаяНаПриемку) КАК НакладнаяНаПриемку
		|ПОМЕСТИТЬ ВтОстаткиСостояния
		|ИЗ
		|	ТекстЗапросаВложенный КАК ВложенныйЗапрос
		|ГДЕ
		|	&КонтекстРаспоряжений
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Распоряжение,
		|	&Поля,
		|	ВложенныйЗапрос.Отправитель,
		|	ВложенныйЗапрос.Получатель,
		|	ВложенныйЗапрос.ХозОперация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеестрДокументов.НомерДокументаИБ КАК Номер,
		|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата,
		|	ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) КАК ТипРаспоряжения,
		|	ОстаткиСостояния.СостояниеНакладной КАК СостояниеНакладной,
		|	ВЫБОР
		|		КОГДА ОстаткиСостояния.СостояниеОрдераНаОтгрузку < ОстаткиСостояния.СостояниеОрдераНаПриемку
		|			ТОГДА ОстаткиСостояния.СостояниеОрдераНаОтгрузку
		|		ИНАЧЕ ОстаткиСостояния.СостояниеОрдераНаПриемку
		|	КОНЕЦ КАК СостояниеОрдера,
		|	ОстаткиСостояния.СостояниеОрдераНаОтгрузку КАК СостояниеОрдераНаОтгрузку,
		|	ОстаткиСостояния.СостояниеОрдераНаПриемку КАК СостояниеОрдераНаПриемку,
		|	ОстаткиСостояния.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
		|	ОстаткиСостояния.НакладнаяНаПриемку КАК НакладнаяНаПриемку,
		|	РеестрДокументов.Организация КАК Организация,
		|	РеестрДокументов.Подразделение КАК Подразделение,
		|	ОстаткиСостояния.Отправитель КАК Отправитель,
		|	ОстаткиСостояния.Получатель КАК Получатель,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиСостояния.Отправитель) = ТИП(Справочник.Склады)
		|			ТОГДА ОстаткиСостояния.Отправитель
		|		ИНАЧЕ ОстаткиСостояния.Получатель
		|	КОНЕЦ КАК Склад,
		|	РеестрДокументов.Ответственный КАК Менеджер,
		|	РеестрДокументов.Автор КАК Автор,
		|	ЕСТЬNULL(ОстаткиСостояния.ХозОперация, РеестрДокументов.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
		|	&ОстаткиСостоянияПоля КАК ОстаткиСостоянияПоля,
		//++ НЕ УТКА
		|	ДокЭтапПроизводства.ВнутренняяПереработка КАК ВнутренняяПереработка,
		|	ДокЭтапПроизводства.ОрганизацияДавалец КАК ОрганизацияДавалец,
		//-- НЕ УТКА
		|	ОстаткиСостояния.Ссылка КАК Ссылка
		|ИЗ
		|	ВтОстаткиСостояния КАК ОстаткиСостояния
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|	ПО ОстаткиСостояния.Ссылка = РеестрДокументов.Ссылка
		|	И НЕ РеестрДокументов.ДополнительнаяЗапись
		//++ НЕ УТКА
		|	
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ДокЭтапПроизводства
		|	ПО ДокЭтапПроизводства.Ссылка = ОстаткиСостояния.Ссылка
		//-- НЕ УТКА
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	НакладныеСервер.НастроитьПолеНоменклатуры(
		ТекстЗапросаСпискаРаспоряжений, ПараметрыЗаменыДанных, "&Поля КАК Поля,", "ВложенныйЗапрос",,, "&Поля,");
	
	НакладныеСервер.НастроитьПолеНоменклатуры(
		ТекстЗапросаСпискаРаспоряжений,
		ПараметрыЗаменыДанных,
		"&ОстаткиСостоянияПоля КАК ОстаткиСостоянияПоля,",
		"ОстаткиСостояния");
	
	ТекстЗапросаСпискаРаспоряжений =
		СтрЗаменить(
			ТекстЗапросаСпискаРаспоряжений,
			"ТекстЗапросаВложенный",
			"(" + СтрСоединить(Выборка, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()) + ")");
	
	ТекстЗапросаСпискаРаспоряжений =
		СтрЗаменить(
			ТекстЗапросаСпискаРаспоряжений,
			"&КонтекстРаспоряжений",
			?(ЗначениеЗаполнено(Распоряжения),
				"ВложенныйЗапрос.Распоряжение В (&Распоряжения)",
				"ИСТИНА"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокРаспоряженияНаОформлениеНаСервере()
	
	Организация = Справочники.Организации.ПустаяСсылка(); 
	//СписокОрганизаций = Новый СписокЗначений;
	//СписокОрганизаций.Добавить(Организация);
	Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Менеджер = Справочники.Пользователи.ПустаяСсылка(); 
	//РежимФормирования = 1;
	
	//Если Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока <> Неопределено Тогда
	//	ТекущийДокумент = СписокРаспоряженияНаОформление.НайтиПоИдентификатору(Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока).Ссылка;
	//Иначе
	//	ТекущийДокумент = Неопределено;
	//КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапросаРасчетаСостояний);
	ПараметрыОтбора = НакладныеСервер.ПараметрыОтбораРаспоряжений(Организация, Подразделение,, ОтборХозяйственныеОперации, Менеджер);
	НакладныеСервер.ДобавитьПараметрыОтбораПоРееструДокументов(Запрос, ПараметрыОтбора);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТипыЗаказов = Новый Массив;
	ТипыЗаказов.Добавить(Тип("ДокументСсылка.ЗаказМатериаловВПроизводство"));
	//++ НЕ УТКА
	ТипыЗаказов.Добавить(Тип("ДокументСсылка.ЭтапПроизводства2_2"));
	//-- НЕ УТКА
	
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация",       СписокОрганизаций.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Подразделение",     Подразделение);
	Запрос.УстановитьПараметр("Менеджер",          Менеджер);
	Запрос.УстановитьПараметр("ХозОперация",       ОтборХозяйственныеОперации.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ТипыЗаказов",       ТипыЗаказов);
	Запрос.УстановитьПараметр("Распоряжения",      Распоряжения.ВыгрузитьЗначения());
	
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаСпискаРаспоряжений;
	
	УстановитьПривилегированныйРежим(Истина);
	СписокРаспоряженияНаОформление.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
	//Если ТекущийДокумент <> Неопределено Тогда
	//	Найдено = СписокРаспоряженияНаОформление.НайтиСтроки(Новый Структура("Ссылка", ТекущийДокумент));
	//	Если ЗначениеЗаполнено(Найдено) Тогда
	//		Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока = Найдено[0].ПолучитьИдентификатор();
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

//для оформления Передачи товаров по нескольким складам     
#Область Сомнительное 

///////////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьТекстЗапросаСостояний()
	 Текстзапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
|	ВложенныйЗапрос.Номенклатура   КАК Номенклатура,
|ВложенныйЗапрос.Характеристика КАК Характеристика,
|	ВложенныйЗапрос.Склад        КАК Склад,
|	ВложенныйЗапрос.Получатель   КАК Получатель
|ПОМЕСТИТЬ ВтЕстьРаспоряжения
|ИЗ
|	(ВЫБРАТЬ
|		Остатки.Распоряжение          КАК Распоряжение,
|		Остатки.Номенклатура          КАК Номенклатура,
|		Остатки.Характеристика        КАК Характеристика,
|		Остатки.КодСтроки             КАК КодСтроки,
|		Остатки.Склад                 КАК Склад,
|		Остатки.Подразделение         КАК Подразделение,
|		Остатки.Серия                 КАК Серия,
|		Остатки.Назначение            КАК Назначение,
|		Остатки.НазначениеОтправителя КАК НазначениеОтправителя,
|		Остатки.Получатель 			  КАК Получатель
|	ИЗ
|		РегистрНакопления.ЗаказыМатериаловВПроизводство.Остатки(, (Распоряжение ССЫЛКА Документ.ЭтапПроизводства2_2)) КАК Остатки
|	ГДЕ
|		Остатки.КОформлениюОстаток <> 0
|		И ИСТИНА В(
|			ВЫБРАТЬ ПЕРВЫЕ 1
|				ИСТИНА
|			ИЗ
|				РегистрСведений.РеестрДокументов КАК РеестрДокументов
|			ГДЕ
|				РеестрДокументов.Ссылка = Остатки.Распоряжение
|				И (НЕ &ОтбиратьПоХозОперации ИЛИ ВЫБОР
|КОГДА РеестрДокументов.Ссылка ССЫЛКА Документ.ЗаказНаПроизводство ТОГДА
|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВПроизводство)
|КОГДА РеестрДокументов.Ссылка ССЫЛКА Документ.ЭтапПроизводства2_2 ТОГДА
|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
|ИНАЧЕ
|	РеестрДокументов.ХозяйственнаяОперация
|КОНЕЦ В (&ХозОперация))
|				И (НЕ &ОтбиратьПоОрганизации ИЛИ РеестрДокументов.Организация В (&Организация))
|				И (НЕ &ОтбиратьПоМенеджеру ИЛИ РеестрДокументов.Ответственный В (&Менеджер))
|			)
|	) КАК ВложенныйЗапрос
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	Распоряжения.Распоряжение КАК Распоряжение,
|	Распоряжения.Номенклатура   КАК Номенклатура,
|Распоряжения.Характеристика КАК Характеристика,
|	Распоряжения.Склад        КАК Склад,
|	Распоряжения.Получатель   КАК Получатель
|ПОМЕСТИТЬ ВтЕстьНакладные
|ИЗ
|	ВтЕстьРаспоряжения КАК Распоряжения
|ГДЕ
|	ИСТИНА В
|			(ВЫБРАТЬ
|				ИСТИНА
|			ИЗ
|				РегистрНакопления.ЗаказыМатериаловВПроизводство КАК ЗаказыМатериаловВПроизводство
|			ГДЕ
|				ЗаказыМатериаловВПроизводство.Активность
|				И ЗаказыМатериаловВПроизводство.Распоряжение = Распоряжения.Распоряжение
|				И Распоряжения.Номенклатура = ЗаказыМатериаловВПроизводство.Номенклатура
|И Распоряжения.Характеристика = ЗаказыМатериаловВПроизводство.Характеристика
|				И ЗаказыМатериаловВПроизводство.Склад        = Распоряжения.Склад
|				И ЗаказыМатериаловВПроизводство.Получатель   = Распоряжения.Получатель
|				И ЗаказыМатериаловВПроизводство.ВидДвижения  = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
|			ИМЕЮЩИЕ
|				СУММА(ЗаказыМатериаловВПроизводство.КОформлению)  > 0)
|
|ИНДЕКСИРОВАТЬ ПО
|	Распоряжение,
|	Распоряжения.Номенклатура,
|Распоряжения.Характеристика,
|	Склад,
|	Получатель
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтЕстьРаспоряжения.Распоряжение КАК Распоряжение,
|	ВтЕстьРаспоряжения.Номенклатура   КАК Номенклатура,
|ВтЕстьРаспоряжения.Характеристика КАК Характеристика,
|	ВтЕстьРаспоряжения.Склад        КАК Склад,
|	ВтЕстьРаспоряжения.Получатель   КАК Получатель,
|	ВЫБОР
|		КОГДА ВтЕстьНакладные.Распоряжение ЕСТЬ NULL
|			ТОГДА 1
|		ИНАЧЕ 2
|	КОНЕЦ                           КАК Состояние
|ПОМЕСТИТЬ ВтСостоянияПередачВПроизводство
|ИЗ
|	ВтЕстьРаспоряжения КАК ВтЕстьРаспоряжения
|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЕстьНакладные КАК ВтЕстьНакладные
|		ПО ВтЕстьРаспоряжения.Распоряжение = ВтЕстьНакладные.Распоряжение
|			И ВтЕстьРаспоряжения.Номенклатура = ВтЕстьНакладные.Номенклатура
|И ВтЕстьРаспоряжения.Характеристика = ВтЕстьНакладные.Характеристика
|			И ВтЕстьРаспоряжения.Склад = ВтЕстьНакладные.Склад
|			И ВтЕстьРаспоряжения.Получатель = ВтЕстьНакладные.Получатель
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ВтЕстьРаспоряжения
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ВтЕстьНакладные
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
|	ВложенныйЗапрос.ДокументОтгрузки КАК ДокументОтгрузки,
|	ВложенныйЗапрос.Номенклатура   КАК Номенклатура,
|ВложенныйЗапрос.Характеристика КАК Характеристика,
|	ВложенныйЗапрос.Склад            КАК Склад,
|	ВложенныйЗапрос.Получатель       КАК Получатель
|ПОМЕСТИТЬ ВтЕстьРаспоряжения
|ИЗ
|	(ВЫБРАТЬ
|		Остатки.Склад            КАК Склад,
|		Остатки.Получатель       КАК Получатель,
|		Остатки.ДокументОтгрузки КАК ДокументОтгрузки,
|		Остатки.Номенклатура     КАК Номенклатура,
|		Остатки.Характеристика   КАК Характеристика,
|		Остатки.Назначение       КАК Назначение,
|		Остатки.Серия            КАК Серия
|	ИЗ
|		РегистрНакопления.ТоварыКОтгрузке.Остатки(, (ДокументОтгрузки ССЫЛКА Документ.ЭтапПроизводства2_2)) КАК Остатки
|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
|			ПО Остатки.Склад = СпрСклады.Ссылка
|				И (СпрСклады.ИспользоватьОрдернуюСхемуПриОтгрузке)
|				И (СпрСклады.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)
|	ГДЕ
|		НЕ СпрСклады.Ссылка ЕСТЬ NULL
|		И Остатки.КОтгрузкеОстаток - Остатки.СобраноОстаток <> Остатки.КОформлениюОстаток
|		И ИСТИНА В(
|			ВЫБРАТЬ ПЕРВЫЕ 1
|				ИСТИНА
|			ИЗ
|				РегистрСведений.РеестрДокументов КАК РеестрДокументов
|			ГДЕ
|				РеестрДокументов.Ссылка = Остатки.ДокументОтгрузки
|				И (НЕ &ОтбиратьПоХозОперации ИЛИ ВЫБОР
|КОГДА РеестрДокументов.Ссылка ССЫЛКА Документ.ЗаказНаПроизводство ТОГДА
|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВПроизводство)
|КОГДА РеестрДокументов.Ссылка ССЫЛКА Документ.ЭтапПроизводства2_2 ТОГДА
|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
|КОГДА РеестрДокументов.Ссылка ССЫЛКА Документ.ЗаказНаРемонт ТОГДА
|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
|ИНАЧЕ
|	РеестрДокументов.ХозяйственнаяОперация
|КОНЕЦ В (&ХозОперация))
|				И (НЕ &ОтбиратьПоОрганизации ИЛИ РеестрДокументов.Организация В (&Организация))
|				И (НЕ &ОтбиратьПоПодразделению ИЛИ РеестрДокументов.Подразделение В (&Подразделение))
|				И (НЕ &ОтбиратьПоМенеджеру ИЛИ РеестрДокументов.Ответственный В (&Менеджер))
|			)
|	) КАК ВложенныйЗапрос
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	Распоряжения.ДокументОтгрузки КАК ДокументОтгрузки,
|	Распоряжения.Номенклатура   КАК Номенклатура,
|Распоряжения.Характеристика КАК Характеристика,
|	Распоряжения.Склад            КАК Склад,
|	Распоряжения.Получатель       КАК Получатель
|ПОМЕСТИТЬ ВтЕстьОрдера
|ИЗ
|	ВтЕстьРаспоряжения КАК Распоряжения
|ГДЕ
|	ИСТИНА В
|			(ВЫБРАТЬ
|				ИСТИНА
|			ИЗ
|				РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
|			ГДЕ
|				ТоварыКОтгрузке.Активность
|				И ТоварыКОтгрузке.ДокументОтгрузки = Распоряжения.ДокументОтгрузки
|				И Распоряжения.Номенклатура = ТоварыКОтгрузке.Номенклатура
|И Распоряжения.Характеристика = ТоварыКОтгрузке.Характеристика
|				И ТоварыКОтгрузке.Склад = Распоряжения.Склад
|				И ТоварыКОтгрузке.Получатель = Распоряжения.Получатель
|				И ТоварыКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
|			ИМЕЮЩИЕ
|				СУММА(ТоварыКОтгрузке.Собрано) > 0
|			
|			ОБЪЕДИНИТЬ ВСЕ
|			
|			ВЫБРАТЬ
|				ИСТИНА
|			ИЗ
|				РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
|			ГДЕ
|				ТоварыКОтгрузке.Активность
|				И ТоварыКОтгрузке.ДокументОтгрузки = Распоряжения.ДокументОтгрузки
|				И Распоряжения.Номенклатура = ТоварыКОтгрузке.Номенклатура
|И Распоряжения.Характеристика = ТоварыКОтгрузке.Характеристика
|				И ТоварыКОтгрузке.Склад = Распоряжения.Склад
|				И ТоварыКОтгрузке.Получатель = Распоряжения.Получатель
|				И ТоварыКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
|				
|			ИМЕЮЩИЕ
|				СУММА(ТоварыКОтгрузке.КОтгрузке) > 0
|			)
|
|ИНДЕКСИРОВАТЬ ПО
|	ДокументОтгрузки,
|	Распоряжения.Номенклатура,
|Распоряжения.Характеристика,
|	Склад
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВтЕстьРаспоряжения.ДокументОтгрузки КАК Распоряжение,
|	ВтЕстьРаспоряжения.Номенклатура   КАК Номенклатура,
|ВтЕстьРаспоряжения.Характеристика КАК Характеристика,
|	ВтЕстьРаспоряжения.Склад            КАК Склад,
|	ВтЕстьРаспоряжения.Получатель       КАК Получатель,
|	ВЫБОР
|		КОГДА ВтЕстьОрдера.Склад ЕСТЬ NULL
|			ТОГДА 1
|		ИНАЧЕ 3
|	КОНЕЦ                               КАК Состояние
|ПОМЕСТИТЬ ВТСостоянияРасходныхОрдеров
|ИЗ
|	ВтЕстьРаспоряжения КАК ВтЕстьРаспоряжения
|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЕстьОрдера КАК ВтЕстьОрдера
|		ПО ВтЕстьРаспоряжения.ДокументОтгрузки = ВтЕстьОрдера.ДокументОтгрузки
|			И ВтЕстьРаспоряжения.Номенклатура = ВтЕстьОрдера.Номенклатура
|И ВтЕстьРаспоряжения.Характеристика = ВтЕстьОрдера.Характеристика
|			И ВтЕстьРаспоряжения.Склад = ВтЕстьОрдера.Склад
|			И ВтЕстьРаспоряжения.Получатель = ВтЕстьОрдера.Получатель
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ВтЕстьРаспоряжения
|;
|
|////////////////////////////////////////////////////////////////////////////////
|УНИЧТОЖИТЬ ВтЕстьОрдера";
	 Возврат Текстзапроса
 КонецФункции 
 
&НаСервере
Функция ПолучитьТекстЗапросаСпискаРаспоряжений()
	ТекстЗапроса = "ВЫБРАТЬ
|	ВложенныйЗапрос.Распоряжение КАК Ссылка,
|	
|	ВложенныйЗапрос.Отправитель КАК Отправитель,
|	ВложенныйЗапрос.Получатель КАК Получатель,
|	ВложенныйЗапрос.ХозОперация КАК ХозОперация,
|	МАКСИМУМ(ВложенныйЗапрос.СостояниеНакладной) КАК СостояниеНакладной,
|	МАКСИМУМ(ВложенныйЗапрос.СостояниеРасходногоОрдера) КАК СостояниеОрдераНаОтгрузку,
|	МАКСИМУМ(ВложенныйЗапрос.СостояниеПриходногоОрдера) КАК СостояниеОрдераНаПриемку,
|	МАКСИМУМ(ВложенныйЗапрос.НакладнаяНаОтгрузку) КАК НакладнаяНаОтгрузку,
|	МАКСИМУМ(ВложенныйЗапрос.НакладнаяНаПриемку) КАК НакладнаяНаПриемку
|ПОМЕСТИТЬ ВтОстаткиСостояния
|ИЗ
|	(ВЫБРАТЬ
|	СостоянияПередачВПроизводство.Распоряжение КАК Распоряжение,
|	
|	СостоянияПередачВПроизводство.Склад КАК Отправитель,
|	СостоянияПередачВПроизводство.Получатель КАК Получатель,
|	ВЫБОР
|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияПередачВПроизводство.Распоряжение) = ТИП(Документ.ЭтапПроизводства2_2)
|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
|		КОГДА ИСТИНА
|			ТОГДА NULL
|	КОНЕЦ КАК ХозОперация,
|	СостоянияПередачВПроизводство.Состояние КАК СостояниеНакладной,
|	ВЫБОР
|		КОГДА СпрСкладыОтправитель.Ссылка ЕСТЬ NULL
|			ТОГДА 4
|		КОГДА СостоянияПередачВПроизводство.Состояние = 1
|			ТОГДА 1
|		ИНАЧЕ 0
|	КОНЕЦ КАК СостояниеРасходногоОрдера,
|	4 КАК СостояниеПриходногоОрдера,
|	ИСТИНА КАК НакладнаяНаОтгрузку,
|	ЛОЖЬ КАК НакладнаяНаПриемку
|ИЗ
|	ВтСостоянияПередачВПроизводство КАК СостоянияПередачВПроизводство
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыОтправитель
|		ПО (СпрСкладыОтправитель.Ссылка = СостоянияПередачВПроизводство.Склад)
|			И (СпрСкладыОтправитель.ИспользоватьОрдернуюСхемуПриОтгрузке)
|			И (СпрСкладыОтправитель.ДатаНачалаОрдернойСхемыПриОтгрузке <= &НачалоТекущегоДня)
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	СостоянияРасходныхОрдеров.Распоряжение КАК Распоряжение,
|	
|	СостоянияРасходныхОрдеров.Склад КАК Отправитель,
|	СостоянияРасходныхОрдеров.Получатель КАК Получатель,
|	ВЫБОР
|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияРасходныхОрдеров.Распоряжение) = ТИП(Документ.ЭтапПроизводства2_2)
|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)
|		КОГДА ИСТИНА
|			ТОГДА NULL
|	КОНЕЦ КАК ХозОперация,
|	ВЫБОР
|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияРасходныхОрдеров.Распоряжение) В (&ТипыЗаказов)
|			ТОГДА 0
|		ИНАЧЕ 4
|	КОНЕЦ КАК СостояниеНакладной,
|	СостоянияРасходныхОрдеров.Состояние КАК СостояниеРасходногоОрдера,
|	4 КАК СостояниеПриходногоОрдера,
|	ИСТИНА КАК НакладнаяНаОтгрузку,
|	ЛОЖЬ КАК НакладнаяНаПриемку
|ИЗ
|	ВТСостоянияРасходныхОрдеров КАК СостоянияРасходныхОрдеров
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСкладыПолучатель
|		ПО (СпрСкладыПолучатель.Ссылка = СостоянияРасходныхОрдеров.Получатель)
|			И (СпрСкладыПолучатель.ИспользоватьОрдернуюСхемуПриПоступлении)
|			И (СпрСкладыПолучатель.ДатаНачалаОрдернойСхемыПриПоступлении <= &НачалоТекущегоДня)) КАК ВложенныйЗапрос
|ГДЕ
|	ВложенныйЗапрос.Распоряжение В (&Распоряжения)
|
|СГРУППИРОВАТЬ ПО
|	ВложенныйЗапрос.Распоряжение,
|	
|	ВложенныйЗапрос.Отправитель,
|	ВложенныйЗапрос.Получатель,
|	ВложенныйЗапрос.ХозОперация
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	РеестрДокументов.НомерДокументаИБ КАК Номер,
|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1,1,1)) КАК Дата,
|	ТИПЗНАЧЕНИЯ(РеестрДокументов.Ссылка) КАК ТипРаспоряжения,
|	ОстаткиСостояния.СостояниеНакладной КАК СостояниеНакладной,
|	ВЫБОР
|		КОГДА ОстаткиСостояния.СостояниеОрдераНаОтгрузку < ОстаткиСостояния.СостояниеОрдераНаПриемку
|			ТОГДА ОстаткиСостояния.СостояниеОрдераНаОтгрузку
|		ИНАЧЕ ОстаткиСостояния.СостояниеОрдераНаПриемку
|	КОНЕЦ КАК СостояниеОрдера,
|	ОстаткиСостояния.СостояниеОрдераНаОтгрузку КАК СостояниеОрдераНаОтгрузку,
|	ОстаткиСостояния.СостояниеОрдераНаПриемку КАК СостояниеОрдераНаПриемку,
|	ОстаткиСостояния.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
|	ОстаткиСостояния.НакладнаяНаПриемку КАК НакладнаяНаПриемку,
|	РеестрДокументов.Организация КАК Организация,
|	РеестрДокументов.Подразделение КАК Подразделение,
|	ОстаткиСостояния.Отправитель КАК Отправитель,
|	ОстаткиСостояния.Получатель КАК Получатель,
|	ВЫБОР
|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиСостояния.Отправитель) = ТИП(Справочник.Склады)
|			ТОГДА ОстаткиСостояния.Отправитель
|		ИНАЧЕ ОстаткиСостояния.Получатель
|	КОНЕЦ КАК Склад,
|	РеестрДокументов.Ответственный КАК Менеджер,
|	РеестрДокументов.Автор КАК Автор,
|	ЕСТЬNULL(ОстаткиСостояния.ХозОперация, РеестрДокументов.ХозяйственнаяОперация) КАК ХозяйственнаяОперация,
|	
|	ДокЭтапПроизводства.ВнутренняяПереработка КАК ВнутренняяПереработка,
|	ДокЭтапПроизводства.ОрганизацияДавалец КАК ОрганизацияДавалец,
|	ОстаткиСостояния.Ссылка КАК Ссылка
|ИЗ
|	ВтОстаткиСостояния КАК ОстаткиСостояния
|
|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
|	ПО ОстаткиСостояния.Ссылка = РеестрДокументов.Ссылка
|	И НЕ РеестрДокументов.ДополнительнаяЗапись
|	
|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ДокЭтапПроизводства
|	ПО ДокЭтапПроизводства.Ссылка = ОстаткиСостояния.Ссылка
|
|УПОРЯДОЧИТЬ ПО
|	Дата";
	Возврат ТекстЗапроса;
КонецФункции

&НаСервере      
//Заимствована из Формы рабочее место документа ДвижениеПродукцииИМатериалов
Процедура ОбновитьСписокРаспоряженияНаОформлениеНаСервере_ГаньшинаЕ()
	
	Если Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока <> Неопределено Тогда
		ТекущийДокумент = СписокРаспоряженияНаОформление.НайтиПоИдентификатору(Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока).Ссылка;
	Иначе
		ТекущийДокумент = Неопределено;
	КонецЕсли;                                                
	//++Ганьшина
	ТекстЗапросаРасчетаСостояний  = ПолучитьТекстЗапросаСостояний(); 
	Организация = Справочники.Организации.ПустаяСсылка();
	Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка(); 
	Менеджер = Справочники.Пользователи.ПустаяСсылка();
	//--
	Запрос = Новый Запрос(ТекстЗапросаРасчетаСостояний);
	ПараметрыОтбора = НакладныеСервер.ПараметрыОтбораРаспоряжений(Организация, Подразделение,, ОтборХозяйственныеОперации, Менеджер);
	НакладныеСервер.ДобавитьПараметрыОтбораПоРееструДокументов(Запрос, ПараметрыОтбора);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТипыЗаказов = Новый Массив;
	ТипыЗаказов.Добавить(Тип("ДокументСсылка.ЗаказМатериаловВПроизводство"));
	//++ НЕ УТКА
	ТипыЗаказов.Добавить(Тип("ДокументСсылка.ЭтапПроизводства2_2"));
	//-- НЕ УТКА
	//++Ганьшина Е
	//МассивОрганизаций = Новый Массив;
	//МассивОрганизаций.Добавить(Справочники.Организации.ПустаяСсылка());
	//--
	Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Организация",       СписокОрганизаций.ВыгрузитьЗначения());	//МассивОрганизаций); //
	Запрос.УстановитьПараметр("Подразделение",     Подразделение);
	Запрос.УстановитьПараметр("Менеджер",          Менеджер);
	Запрос.УстановитьПараметр("ХозОперация",       ОтборХозяйственныеОперации.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ТипыЗаказов",       ТипыЗаказов);
	Запрос.УстановитьПараметр("Распоряжения",      Распоряжения.ВыгрузитьЗначения());
	
	Запрос.Выполнить();
	
	//++ Ганьшина Е
	ТекстЗапросаСпискаРаспоряжений = ПолучитьТекстЗапросаСпискаРаспоряжений();
	//--
	
	Запрос.Текст = ТекстЗапросаСпискаРаспоряжений;
	
	УстановитьПривилегированныйРежим(Истина);
	СписокРаспоряженияНаОформление.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТекущийДокумент <> Неопределено Тогда
		Найдено = СписокРаспоряженияНаОформление.НайтиСтроки(Новый Структура("Ссылка", ТекущийДокумент));
		Если ЗначениеЗаполнено(Найдено) Тогда
			Элементы.СписокРаспоряженияНаОформление.ТекущаяСтрока = Найдено[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
///////////////////////////////////////////////////////////////
#КонецОбласти

&НаСервере
Функция ПараметрыФормыСозданныхДокументов()
		
	//ПараметрыФормы = Новый Структура("КлючДанных, ВидимыеКолонки, СобытияОбновления",
	//	КлючНазначенияИспользования, Новый Массив, Новый Массив);
	//
	//ПараметрыФормы.ВидимыеКолонки.Добавить("Номер");
	//ПараметрыФормы.ВидимыеКолонки.Добавить("Дата");
	//ПараметрыФормы.ВидимыеКолонки.Добавить("ТипЗначения");
	//ПараметрыФормы.ВидимыеКолонки.Добавить("ХозяйственнаяОперация");
	//ПараметрыФормы.ВидимыеКолонки.Добавить("Организация");
	//ПараметрыФормы.ВидимыеКолонки.Добавить("Подразделение");
	//ПараметрыФормы.ВидимыеКолонки.Добавить("НаправлениеДеятельности");
	//Если ХозяйственныеОперацииИДокументы.НайтиСтроки(Новый Структура("Отбор, ИспользуютсяСтатусы", Истина, Истина)).Количество() <> 0 Тогда
	//	ПараметрыФормы.ВидимыеКолонки.Добавить("Статус");
	//КонецЕсли;
	//ПараметрыФормы.ВидимыеКолонки.Добавить("Дополнительно");
	//
	//ПараметрыФормы.СобытияОбновления.Добавить("Запись_ДвижениеПродукцииИМатериалов");
	//
	//Возврат ПараметрыФормы;
	
КонецФункции

//&НаСервере
// Формирует список группировок по выделенным строкам списка распоряжений, исключая некорректные состояния,
// в которых содержится необходимая информация для оформления накладной по заказу.
//
// Параметры:
//  ДанныеРаспоряжений	 - ДанныеФормыКоллекция - реквизит на форме, содержащий данные списка распоряжений.
//  ИдентификаторыСтрок	 - Массив - идентификаторы строк в коллекции, которые нужно обработать.
//  ПоляГруппировки		 - Строка - имена полей в данных распоряжений по которым их необходимо сгруппировать.
//  СписокОшибок		 - Структура - список ошибок.
//  ПолеОшибки			 - Строка - значение, которое задается в свойстве Поле объекта СообщениеПользователю.
//  МетаданныеНакладных	 - ДанныеФормыКоллекция - таблица с полями:
//  												ХозяйственнаяОперация        - оформляемая хоз. операция
//  												КлючевыеПоляШапки            - ключевые реквизиты распоряжений по которым их можно группировать
//  												ПолноеИмяДокумента           - имя документа в метаданных
//  												ЗаголовокФормыПереоформления - заголовок для ОбщаяФорма.ПереоформлениеНакладныхПоРаспоряжениям.
//	ПоНоменклатуре 		 - Булево - признак режима формирования по номенклатуре (характеристике)
//
// Возвращаемое значение:
//  Массив из Структура:
//  * МассивЗаказов - Массив
//  * ПоляЗаполнения - Структура
//  * КлючевыеПоляШапки - Строка
//  * ИмяОформляемогоДокумента - Строка
//  * Обработчик - Строка
//  * ЕстьНакладные - Булево
//  * ЭтоНакладная - Булево
//  * ЗаголовокФормыПереоформления - Строка
//  * Склад - СправочникСсылка.Склады
//  * НакладнаяНаОтгрузку - ДокументСсылка
//  * НакладнаяНаПриемку - ДокументСсылка
//

&НаСервере
Функция ПолучитьГруппировку(МассивГруппировок, Строка, ПоляГруппировки, МетаданныеНакладных, ПоОрдеру)
	//Группировка заменила на Гр, так как отладчик воспринимал ее как группировку элементов группы
	Для каждого Гр Из МассивГруппировок Цикл
		Если ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(Гр.ПоляЗаполнения, Строка, ПоляГруппировки) Тогда
			Возврат Гр;
		КонецЕсли;
	КонецЦикла;
	
	ПоляЗаполненияГруппировки = Новый Структура(ПоляГруппировки); 
	Гр = Новый Структура("МассивЗаказов,ПоляЗаполнения", Новый Массив, ПоляЗаполненияГруппировки);
	ЗаполнитьЗначенияСвойств(Гр.ПоляЗаполнения, Строка);
	Гр.ПоляЗаполнения.Вставить("ЗаполнятьПоОрдеру", ПоОрдеру);
	
	МетаданныеНакладной = МетаданныеНакладных.НайтиСтроки(Новый Структура("ХозяйственнаяОперация", Строка.ХозяйственнаяОперация))[0];
	Гр.Вставить("КлючевыеПоляШапки", МетаданныеНакладной.КлючевыеПоляШапки);
	Гр.Вставить("ИмяОформляемогоДокумента", СтрЗаменить(МетаданныеНакладной.ПолноеИмяДокумента, "Документ.", ""));
	Гр.Вставить("Обработчик");
	МетаданныеНакладной.Свойство("Обработчик", Гр.Обработчик);
	
	Если ПоОрдеру Тогда
		Гр.Вставить("ЕстьНакладные", Ложь);
		Гр.Вставить("ЭтоНакладная", Ложь);
		Гр.Вставить("ЗаголовокФормыПереоформления", МетаданныеНакладной.ЗаголовокФормыПереоформления);
		Гр.Вставить("Склад", Строка.Склад);
		Гр.Вставить("НакладнаяНаОтгрузку", Строка.НакладнаяНаОтгрузку);
		Гр.Вставить("НакладнаяНаПриемку", Строка.НакладнаяНаПриемку);
	КонецЕсли;
	
	МассивГруппировок.Добавить(Гр);
	
	Возврат Гр;
	
КонецФункции

// Формирует документы по списку групп распоряжений.
//
// Параметры:
//  ГруппировкиРаспоряжений  - см. НакладныеКлиент.ДанныеДляОформленияПоЗаказам
//  СписокОшибок			 - Структура - список ошибок.
//  ПолеОшибки				 - Строка - значение, которое задается в свойстве Поле объекта СообщениеПользователю.
//
// Возвращаемое значение:
//  Массив из ДокументСсылка - содержит ссылки на созданные документы.
//   
&НаСервере
Функция СформироватьДокументыПоРаспоряжениям(ГруппировкиРаспоряжений, СписокОшибок, ПолеОшибки) //Экспорт
	
	Результат = Новый Структура("СозданныеДокументы,СписокОшибок");
	СозданныеДокументы = Новый Массив;   
	
	Для каждого Группировка1 Из ГруппировкиРаспоряжений Цикл
		
		Если Группировка1.Свойство("Обработчик") И ЗначениеЗаполнено(Группировка1.Обработчик) Тогда
			МенеджерНакладной = ОбщегоНазначения.ОбщийМодуль(Группировка1.Обработчик);
		Иначе
			МенеджерНакладной = Документы[Группировка1.ИмяОформляемогоДокумента];
		КонецЕсли;
		
		Для каждого Распоряжение Из Группировка1.МассивЗаказов Цикл
			
			ДокументОбъект = Документы[Группировка1.ИмяОформляемогоДокумента].СоздатьДокумент();
			
			ПараметрыЗаполнения = МенеджерНакладной.ПараметрыЗаполненияДокумента();
			ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Группировка1.ПоляЗаполнения);
			РеквизитыШапки = МенеджерНакладной.ДанныеЗаполненияНакладной(Распоряжение, Группировка1.ПоляЗаполнения);
			МенеджерНакладной.ИнициализироватьПараметрыЗаполнения(ПараметрыЗаполнения, РеквизитыШапки, Распоряжение);
			
			ДокументОбъект.Заполнить(ПараметрыЗаполнения);
			//ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ДокументОбъект.Дата), ДокументОбъект.Дата, Объект.ПериодОтгрузки); //ТекущаяДатаСеанса()); //++ Ганьшина Е --//
			ДокументОбъект.Дата = Объект.ПериодОтгрузки;
			Ошибка = Не ДокументОбъект.ПроверитьЗаполнение();
			Если Не Ошибка Тогда
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ЗаписьЖурналаРегистрации(
						НСтр("ru = 'Ошибка при проведении документа';
							|en = 'An error occurred while posting the document'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
						УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					Ошибка = Истина;
				КонецПопытки;
			КонецЕсли;
			
			Если Ошибка Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				
				Сообщения = ПолучитьСообщенияПользователю(Истина);
				Для Каждого Сообщение Из Сообщения Цикл
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок, ПолеОшибки, Сообщение.Текст, Неопределено);
				КонецЦикла;
				
				ТекстОшибки = НСтр("ru = 'Не удалось провести документ - %1';
									|en = 'Cannot post the document: %1'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, ДокументОбъект.Ссылка);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(СписокОшибок, ПолеОшибки, ТекстОшибки, Неопределено);
			КонецЕсли;
			
			ИсторияРаботыПользователя.Добавить(ДокументОбъект.Ссылка);
			СозданныеДокументы.Добавить(ДокументОбъект.Ссылка);
			
			Результат.СозданныеДокументы = СозданныеДокументы;
			Результат.СписокОшибок = СписокОшибок;
			
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбеспечениеВДокументахСервер.ПроверитьЗапуститьФоновоеЗаданиеРаспределенияЗапасов();
	Возврат Результат; //СозданныеДокументы;
	
КонецФункции

#КонецОбласти 
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Функция ЗаполнитьМатериалыЭтапаПоДаннымРегистра(ЭтапПроизводства)
	
	Если ТекСтраница = "Резервирование" Тогда 
		ЭтоСписание = Ложь;
		//ТабЭтапы = ЭтапыРезервирование;
		ТабМатериалы = Объект.МатериалыРезервирование;
	ИначеЕсли ТекСтраница = "Списание" Тогда 
		ЭтоСписание = Истина;
		//ТабЭтапы = Этапы;
		ТабМатериалы = Объект.МатериалыСписание;
	КонецЕсли;
	//Для Каждого Стр из ТабЭтапы Цикл 
		//Если не Стр.Обрабатывать Тогда 
		//	Продолжить;
		//КонецЕсли;
		СтруктураКлючФормы = Новый Структура("Ключ",ЭтапПроизводства);
		Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",СтруктураКлючФормы);
		ТЧОбеспечение = Форма.Объект.ОбеспечениеМатериаламиИРаботами;
		ТЧОбеспечение.Очистить();
		ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапа();   
		//ТабМатериалы = 
		ПеренестиКорректировкиВТЧ(ЭтоСписание, ЭтапПроизводства, ПереченьКолонок);
		//ТЧОбеспечение.Загрузить(ТабМатериалы.Выгрузить()); //**Метод недоступен на клиенте**//
		Для Каждого Стр из ТабМатериалы Цикл 
			НоваяСтрока = ТЧОбеспечение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр); 
		КонецЦикла;  
		//Форма.Объект.ОбеспечениеМатериаламиИРаботами = ТЧОбеспечение;
		Форма.Объект.НеОтгружатьЧастями = Истина; 
		Если ЭтоСписание Тогда 
			Форма.Объект.ДатаОтгрузки = Объект.ПериодОтгрузки;
		//Иначе 
		//	Форма.Объект.ДатаОтгрузки = ТекущаяДатаСеанса();
		КонецЕсли;
		Попытка
			Форма.Записать();
			Возврат Истина;
		Исключение
			Сообщить("Ошибка записи "+Стр.ЭтапПроизводства+"  "+ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	//КонецЦикла;
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////////
#Область ФункцииПривилегированногоРежима

&НаСервереБезКонтекста
Функция ПолучитьМассивИдентификаторовРазрешений(знач СписокИДЗапросовРазрешений)
	МассивИДРазрешений = Новый Массив;
	Для Каждого ИД из СписокИДЗапросовРазрешений Цикл 
		МассивИДРазрешений.Добавить(ИД.Значение);
	КонецЦикла;
	Возврат МассивИДРазрешений;
КонецФункции

&НаКлиенте
Процедура ПослеПредоставленияРазрешения(Результат,ДопПараметры) Экспорт
	//Если Результат = КодВозвратаДиалога.ОК Тогда 
	//	Сообщить("Разрешение на использование привилегированного режима установлено!");
	//Иначе 
	//	Сообщить("Разрешение на использование привилегированного режима не получено!");
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Включить)
	Если не Включить Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Включить);
	Если Включить Тогда 
		УстановитьБезопасныйРежим(Истина);
		УстановитьБезопасныйРежим(Ложь);
	Иначе 
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;
	РФ_ПривилегированныйРежим = ПривилегированныйРежим();
	РФ_БезопасныйРежим = БезопасныйРежим();
КонецПроцедуры

&НаСервере
Процедура ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима()
	СписокИДЗапросовРазрешений.Очистить();
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеПривилегированногоРежима("Разрешение привилегированного режима для пользователей с ограниченными правами");
	МассивРазрешений = Новый Массив;
	МассивРазрешений.Добавить(Разрешение);
	ИДЗапроса = РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(МассивРазрешений, ЭтотОбъект, Истина);
	СписокИДЗапросовРазрешений.Добавить(ИДЗапроса);
КонецПроцедуры

#КонецОбласти 


///////////////////////////////////////////////////////////////////////////////////
#Область РедактированиеУдалениеДанныхДерева

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеЗарезервироватьПриИзменении(Элемент)

//	//ИсходныеДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;  
//	Если ТекСтраница = "Списание" Тогда 
//		ТекСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;  
//		ИмяДерева = "ДеревоМатериалов";  
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//		//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериалов,ТекСтрока);
//		ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериалов;	
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ТекСтрока = Элементы.ДеревоМатериаловРезервирование.ТекущиеДанные;
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//		//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериаловРезервирование,ТекСтрока);
//		ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
//	КонецЕсли;    
//	
//	Если ТекСтрока.Уровень = 1 Тогда 
//		ОбщееКоличествоОбеспечить = ?(ЗначениеЗаполнено(ТекСтрока.Обеспечить), ТекСтрока.Обеспечить, 0);
//		ОбщееКоличествоРезервировать = ?(ЗначениеЗаполнено(ТекСтрока.Зарезервировать), ТекСтрока.Зарезервировать, 0);
//		КоличествоПодчиненныхСтрок = ТекСтрока.ПолучитьЭлементы().Количество();   
//		ОбработаноСтрок = 0;
//		КоличествоЗарезервировано = 0;  
//		ДопустимыйОстаток = ДанныеСтроки.Остаток/КоличествоПодчиненныхСтрок;
//		Для Каждого ПодчиненнаяСтрока из ТекСтрока.ПолучитьЭлементы() Цикл   
//			ЗаполнитьЗначенияСвойств(ДанныеСтроки,ПодчиненнаяСтрока);
//			КоличествоИсходное = ПодчиненнаяСтрока.Количество;
//			Если УпаковкаШтуки(ПодчиненнаяСтрока.Упаковка) Тогда 
//				Если ОбработаноСтрок = КоличествоПодчиненныхСтрок - 1 Тогда 
//					Количество = ОбщееКоличествоРезервировать - КоличествоЗарезервировано;
//					КоличествоЗарезервировано = КоличествоЗарезервировано + Количество;
//					//ПодчиненнаяСтрока.Резервировать = ОбщееКоличествоРезервировать;                      
//					ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное,,Истина,ДопустимыйОстаток);
//				Иначе                     
//					Количество = Цел(ОбщееКоличествоРезервировать/КоличествоПодчиненныхСтрок);
//					КоличествоЗарезервировано = КоличествоЗарезервировано + Количество;
//					//ПодчиненнаяСтрока.Резервировать = Цел(ОбщееКоличествоРезервировать/КоличествоПодчиненныхСтрок);
//					//ПодчиненнаяСтрока.Обеспечить = ПодчиненнаяСтрока.Обеспечить +  
//					//ОбщееКоличествоРезервировать = ОбщееКоличествоРезервировать - ПодчиненнаяСтрока.Резервировать;
//					ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное,,Истина, ДопустимыйОстаток);
//					ОбработаноСтрок = ОбработаноСтрок + 1;
//				КонецЕсли;  
//			Иначе 
//				Количество = ОбщееКоличествоРезервировать/КоличествоПодчиненныхСтрок;
//				ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное,,Истина, ДопустимыйОстаток);
//				КоличествоЗарезервировано = КоличествоЗарезервировано + Количество;
//			КонецЕсли;
//		КонецЦикла;
//		ТекСтрока.Зарезервировать = КоличествоЗарезервировано; //ДанныеСтроки.Отгрузить;
//	Иначе   
//		ДопустимыйОстаток = ДанныеСтроки.Остаток;
//		КоличествоОбеспечить = ?(ЗначениеЗаполнено(ТекСтрока.Обеспечить), ТекСтрока.Обеспечить, 0);
//		КоличествоРезервировать = ?(ЗначениеЗаполнено(ТекСтрока.Зарезервировать), ТекСтрока.Зарезервировать, 0);
//		Количество = КоличествоОбеспечить;
//		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
//		КоличествоИсходное = ДанныеСтроки.Количество;
//		ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное,,Истина, ДопустимыйОстаток);     
//	КонецЕсли;   
//	
//	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
//		
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь, ДанныеСтроки);
//	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
//	
//	//ИДТекСтроки = Элементы[ИмяДерева].ТекущаяСтрока;
//	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства, ИДТекСтроки);
//	
//	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
//	ВосстановитьСостояниеДерева(ИмяДерева);     
//	
//КонецПроцедуры

&НаКлиенте
Процедура ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов)
	
	ДанныеТекСтроки = Элементы[ИмяДерева].ТекущиеДанные;
	ИДТекСтроки = Элементы[ИмяДерева].ТекущаяСтрока; 
	СтруктураПоиска = Новый Структура("ТекущаяСтрока", Истина);
	МассивТекСтр = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
	Если МассивТекСтр.Количество() = 1 Тогда 
		ТекстрокаИД = МассивТекСтр[0];
		ЗаполнитьЗначенияСвойств(ТекстрокаИД,ДанныеТекСтроки);
		ТекстрокаИД.ТекущаяСтрока = Истина;
		ТекстрокаИД.Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
	ИначеЕсли МассивТекСтр.Количество() > 1 Тогда 
		ТекстрокаИД = МассивТекСтр[0];
		ЗаполнитьЗначенияСвойств(ТекстрокаИД,ДанныеТекСтроки);
		ТекстрокаИД.ТекущаяСтрока = Истина;
		ТекстрокаИД.Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
		Сообщить("Найдено более 1 текущей строки в таблице идентификаторов, проверить добавление текущей строки!",СтатусСообщения.Важное);
	Иначе 
		//добавим текущую строку в таблицу идентификаторов
		НоваСтрокаИД = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();  
		ЗаполнитьЗначенияСвойств(НоваСтрокаИД, ДанныеТекСтроки);
		НоваСтрокаИД.ТекущаяСтрока = Истина;
		НоваСтрокаИД.Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//БезКонтекста
Процедура ИзменитьКоличествоВСтрокеРегистра(Количество, СтрокаДанных, КоличествоИсходное, Отгрузить = Ложь, Зарезервировать = Ложь, ДопустимыйОстаток)
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Номенклатура.Установить(СтрокаДанных.Номенклатура);
	Если ЗначениеЗаполнено(СтрокаДанных.ЭтапПроизводства) Тогда 
		НЗ.Отбор.ЭтапПроизводства.Установить(СтрокаДанных.ЭтапПроизводства);
	КонецЕсли;
	//ЗаполнитьЗначенияСвойств(НЗ.Отбор,СтрокаДанных);
	НЗ.Прочитать();              
	//НЗ.Отбор.ВариантОбеспечения.Использование = Ложь;   
	Если Отгрузить Тогда 
		ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	ИначеЕсли Зарезервировать Тогда 
		ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
	КонецЕсли;
	
	Для Каждого СтрНЗ из НЗ Цикл 
		СтрНЗ.ВариантОбеспечения = ВариантОбеспечения; 
		СтрНЗ.ОтборПоВариантамОбеспечения = УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспечения);
		СтрНЗ.Обособленно = Ложь; //При отгрузке и резерве обособленность не нужна (только при обеспечении!!!)
		Если ЗначениеЗаполнено(СтрНЗ.Упаковка) Тогда 
			КоэффициентПересчета = СтрНЗ.Упаковка.Числитель * СтрНЗ.Упаковка.Знаменатель;
		Иначе 
			КоэффициентПересчета = 1;
		КонецЕсли;
		Если КоэффициентПересчета = 0 Тогда 
			КоэффициентПересчета = 1;
		КонецЕсли;
		Если Количество > КоличествоИсходное Тогда 
			Если Количество <= ДопустимыйОстаток Тогда
				СтрНЗ.Количество = Количество;
				СтрНЗ.КоличествоУпаковок = Количество/КоэффициентПересчета; //СтрНЗ.Упаковка.Числитель * СтрНЗ.Упаковка.Знаменатель;
			Иначе 
				СтрНЗ.Количество = ДопустимыйОстаток;
				СтрНЗ.КоличествоУпаковок = СтрНЗ.Остаток/КоэффициентПересчета; //СтрНЗ.Упаковка.Числитель * СтрНЗ.Упаковка.Знаменатель;
				Сообщить("Нельзя " +?(Отгрузить,"отгрузить","") + ?(Зарезервировать,"зарезервировать","")+ " больше остатка!");
			КонецЕсли;
		ИначеЕсли Количество <= КоличествоИсходное Тогда 
			СтрНЗ.Количество = Количество;   
			СтрНЗ.КоличествоУпаковок = Количество/КоэффициентПересчета; //СтрНЗ.Упаковка.Числитель * СтрНЗ.Упаковка.Знаменатель;
		КонецЕсли;
	
	КонецЦикла; 
	НЗ.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УпаковкаШтуки(Упаковка)
	
	Если Упаковка.ЕдиницаИзмерения  = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду(796) Тогда 
		Возврат  Истина;
	Иначе 
		Возврат Ложь;   
	КонецЕсли;
	
КонецФункции 

//&НаКлиенте
//Процедура ОтгрузитьВсе(Команда)
//	Если ТекСтраница = "Списание" Тогда 
//		Если ЗначениеЗаполнено(ОтборВариантОбеспечения) Тогда 
//			Если ОтборВариантОбеспечения = 3 Тогда 
//				Возврат;
//				Сообщить("Отгружать материалы не требуется!", СтатусСообщения.Важное);
//			ИначеЕсли ОтборВариантОбеспечения = 5 Тогда 
//				Возврат;
//				Сообщить("Материалы уже отгружены!", СтатусСообщения.Важное);
//			КонецЕсли;
//		КонецЕсли;
//		ЭтоСписание = Истина;
//		ИмяДерева = "ДеревоМатериалов"; 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//	ИначеЕсли ТекСтраница = "Резервирование"  Тогда 
//		ЭтоСписание = Ложь;
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//	Иначе 
//		ЭтоСписание = Истина;
//		
//	КонецЕсли;
//	//ОтгрузитьВсеНаСервере(ИмяДерева,ЭтоСписание)
//	Отбор = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.ПустаяСсылка");
//	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
//	ОтгрузитьНаСервере(ИмяДерева, ЭтоСписание, Отбор);           
//	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,,ВариантОбеспеченияНовый);
//		
//	//ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные();    
//	////ИДТекСтроки = Элемент.ТекущаяСтрока(); 
//	//ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();   
//	//
//	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства,ИДТекСтроки);
//	ВосстановитьСостояниеДерева(ИмяДерева);
//	
//КонецПроцедуры

&НаСервере
Функция ЕстьНеотгруженныеСтроки()
	
	ПараметрыОтбора = Новый Структура("ВариантОбеспечения",ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению"));
	Если Объект.МатериалыСпецификации.Выгрузить(ПараметрыОтбора).Количество() <> 0 Тогда 
		Возврат Истина;
	КонецЕсли; 
	ПараметрыОтбора = Новый Структура("ВариантОбеспечения",ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления"));
	Если Объект.МатериалыСпецификации.Выгрузить(ПараметрыОтбора).Количество() <> 0 Тогда 
		Возврат Истина;
	КонецЕсли;  
	ПараметрыОтбора = Новый Структура("ВариантОбеспечения",ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"));
	Если Объект.МатериалыСпецификации.Выгрузить(ПараметрыОтбора).Количество() <> 0 Тогда 
		Возврат Истина;
	КонецЕсли; 
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПустойРегистр()
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСписание.Установить(не Объект.Резерв);
	НЗ.Прочитать();
	
КонецФункции

&НаКлиенте
Процедура ДеревоМатериаловПередНачаломИзменения(Элемент, Отказ)    
	
	ИсхДанныеСтроки = ЗапомнитьИсходныеДанныеСтроки();
	
КонецПроцедуры  

&НаКлиенте
Функция ЗапомнитьИсходныеДанныеСтроки()
	
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов";
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
		ЭтоСписание = Истина;  
		ДанныеТекСтроки = Элементы[ИмяДерева].ТекущиеДанные;
		ИДТекСтроки = ДанныеТекСтроки.ПолучитьИдентификатор();
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериалов, ДанныеТекСтроки);
		//ОбновитьИДТекущейСтроки(ИмяДерева, ИмяТаблицыИдентификаторов,ДанныеТекСтроки.Номенклатура, ДанныеТекСтроки.ЭтапПроизводства, ИДТекСтроки);
		Возврат ИсходныеДанныеСтрокиДереваМатериалов;
	ИначеЕсли ТекСтраница = "резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование";    
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
		ЭтоСписание = Ложь; 
		ДанныеТекСтроки = Элементы[ИмяДерева].ТекущиеДанные;
		ИДТекСтроки = ДанныеТекСтроки.ПолучитьИдентификатор();
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериаловРезервирование, ДанныеТекСтроки);
		//ОбновитьИДТекущейСтроки(ИмяДерева, ИмяТаблицыИдентификаторов,ДанныеТекСтроки.Номенклатура, ДанныеТекСтроки.ЭтапПроизводства, ИДТекСтроки);
		Возврат ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
	КонецЕсли;
	
КонецФункции

&НаСервере
//НЕ ИСПОЛЬЗУЕТСЯ
//Делаем отбор по старой номенклатуре (НЗ) и по новой (НЗ1). Затем добавляем строку в новый набор и заполняем по старой номенклатуре. Старый набор очищаем, Новый записываем
//
//
Процедура ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок, ТекСтрока, ЭтоСписание)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Пользователь = Пользователи.АвторизованныйПользователь(); 
	Для Каждого Стр из МассивСтруктурОбрабатываемыхСтрок Цикл 
		НЗ=РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ.Отбор.Пользователь.Установить(Пользователь);
		НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура); 
		Если ЗначениеЗаполнено(Стр.ЭтапПроизводства) Тогда 
			НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ВариантОбеспечения) Тогда 
			НЗ.Отбор.ВариантОбеспечения.Установить(Стр.ВариантОбеспечения); 
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Спецификация) Тогда 
			НЗ.Отбор.СпецификацияЭтапа.Установить(Стр.Спецификация);      
		КонецЕсли;
		НЗ.Прочитать();
		//Стр = НЗ[0];  
		
		НЗ1=РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ1.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ1.Отбор.Пользователь.Установить(Пользователь);
		НЗ1.Отбор.Номенклатура.Установить(ТекСтрока.Номенклатура);
		НЗ1.Прочитать();
		
		Для Каждого СтрНЗ из НЗ Цикл 
			//Сообщить(Строка(НЗ.Количество()) + " строк будет удалено из регистра."); 
			//Стр.Номенклатура = ТекСтрока.Номенклатура;
			
			ЕдиницаИзмерения = ТекСтрока.Номенклатура.ЕдиницаИзмерения; 
						
			НоваяСтрока = НЗ1.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрНЗ);  
			НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
			НоваяСтрока.Упаковка = ЕдиницаИзмерения;
			НоваяСтрока.ЕдиницаИзмерения = ЕдиницаИзмерения;
			//НоваяСтрока.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
			НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;  //.УдалитьОбособленно
			//+22.08.22
			НоваяСтрока.ДатаОтгрузки = Объект.ПериодОтгрузки;   
			НоваяСтрока.ПериодЗатрат = КонецМесяца(Объект.ПериодОтгрузки);
			//-22.08.22
			НоваяСтрока.ОтборПоВариантамОбеспечения = 1;                                                       
			НоваяСтрока.Обособленно = Истина;
			НоваяСтрока.Норматив = 0;
			//НоваяСтрока.Количество = 0;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество * НоваяСтрока.Упаковка.Числитель / НоваяСтрока.Упаковка.Знаменатель;
			НоваяСтрока.Обеспечить = СтрНЗ.Норматив; // - СтрНЗ.Количество;
			НоваяСтрока.КатегорияМатериала = ОбработкаОбъект.ПолучитьКатегориюМатериала(ТекСтрока.Номенклатура);
			//НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(ТекСтрока.Номенклатура,ТекСтрока.Склад,Этапы.Выгрузить(,"ЭтапПроизводства"));   
			
			ПараметрыПоиска = Новый Структура("Обрабатывать", Истина);
			ТабЭтапы = Этапы.Выгрузить(ПараметрыПоиска,);
			НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(ТекСтрока.Номенклатура, ТекСтрока.Склад, Этапы.Выгрузить(,"ЭтапПроизводства"), ТабЭтапы, Объект.Резерв);    
			
			Если НЗ1.Количество() > 0 Тогда 
				КлючСвязи = НЗ1[0].КлючСвязиСпецификация;
				НоваяСтрока.КлючСвязиСпецификация = КлючСвязи;
			Иначе 
				КлючСвязи = Новый УникальныйИдентификатор();
			КонецЕсли;
			
			//??НоваяСтрока.АналитикаУчетаНоменклатуры = Справочники.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка();
			//??НоваяСтрока.КорАналитикаУчетаНоменклатуры = Справочники.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка();  
		КонецЦикла;
		
		НЗ.Очистить();
		НЗ.Записать();
		
		НЗ1.Записать();  
		
	КонецЦикла;
	
КонецПроцедуры

//&НаСервере
//Функция  ЗаменаМатералаВДереве(ИмяДерева, ИДСтрокиДерева, ЭтоСписание, ДанныеИсходнойСтроки)
////Процедура	
//	ТекСтрока = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(ИДСтрокиДерева);
//	ИсходнаяНоменклатура = ДанныеИсходнойСтроки.Номенклатура;
//	ДанныеСтроки = Новый Структура("Номенклатура, ИсходнаяНоменклатура, ЭтапПроизводства, ВариантОбеспечения, Спецификация, КлючСвязиСпецификация");  
//	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
//	
//	Если ТекСтрока <> Неопределено Тогда 
//		Если ЗначениеЗаполнено(ИсходнаяНоменклатура) и ТекСтрока.Номенклатура <> ИсходнаяНоменклатура Тогда 
//			Если ДанныеИсходнойСтроки.Уровень = 1 Тогда     
//				//Надо обработать все строки по номенклатуре    
//				ДанныеСтроки.Номенклатура = ИсходнаяНоменклатура;
//				//ДанныеСтроки.ИсходнаяНоменклатура = ИсходнаяНоменклатура; 
//				МассивСтруктурОбрабатываемыхСтрок.Добавить(ДанныеСтроки);
//				ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок,ТекСтрока,ЭтоСписание);
//			Иначе                                           
//				//надо обработать только текущую строку, поэтому структура отбора по полным данным строки
//				ЗаполнитьЗначенияСвойств(ДанныеСтроки,ДанныеИсходнойСтроки); 
//				МассивСтруктурОбрабатываемыхСтрок.Добавить(ДанныеСтроки);
//				ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок,ТекСтрока,ЭтоСписание);
//			КонецЕсли;
//		КонецЕсли
//	КонецЕсли;
//	
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь); 
//	
//	ОбновитьИдентификаторыСтрокДереваПослеИзмененияНоменклатуры(ИмяДерева,ТекСтрока, ИсходнаяНоменклатура);
//	//ИДТекСтроки = Элементы[ИмяДерева].ТекущиеДанные.ПолучитьИдентификатор();
//	//СтруктураВозврата = Новый Структура("НоваяНоменклатура, ИДТекСтроки", ТекСтрока.Номенклатура);
//	Возврат ТекСтрока.Номенклатура; //СтруктураВозврата
//	
//КонецФункции //Процедуры

&НаСервере
Процедура ОбновитьИдентификаторыСтрокДереваПослеИзмененияНоменклатуры(ИмяДерева,ТекСтрока, ИсходнаяНоменклатура);
		
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуРегистра(МассивСтруктурОбрабатываемыхСтрок,ЭтоСписание)
	
	Для Каждого Стр из МассивСтруктурОбрабатываемыхСтрок Цикл 
		НЗ=РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
		НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);  
		Если ЗначениеЗаполнено(Стр.ЭтапПроизводства) Тогда 
			НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.ВариантОбеспечения) Тогда 
			НЗ.Отбор.ВариантОбеспечения.Установить(Стр.ВариантОбеспечения); 
		КонецЕсли;
		Если ЗначениеЗаполнено(Стр.Спецификация) Тогда 
			НЗ.Отбор.СпецификацияЭтапа.Установить(Стр.Спецификация);      
		КонецЕсли;
		НЗ.Прочитать();
		Сообщить(Строка(НЗ.Количество()) + " строк будет удалено из регистра.");
		НЗ.Очистить();
		НЗ.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуВРегистр(СтрокаДерева,ЭтоСписание,ДатаОтгрузки)
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Номенклатура.Установить(СтрокаДерева.Номенклатура);
	НЗ.Отбор.ЭтапПроизводства.Установить(СтрокаДерева.ЭтапПроизводства);
	НЗ.Отбор.ВариантОбеспечения.Установить(СтрокаДерева.ВариантОбеспечения); //??Почему устанавливается ВариантОбеспечения?? Д.б. "Требуется"!!!
	
	НЗ.Прочитать();
	НоваяСтрока = НЗ.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДерева);
	НоваяСтрока.Пользователь = Пользователь;
	НоваяСтрока.ЭтоСписание = ЭтоСписание;  
	НоваяСтрока.Обеспечить = НоваяСтрока.Количество;     
	//+22.08.22
	НоваяСтрока.ДатаОтгрузки = ДатаОтгрузки;
	НоваяСтрока.ПериодЗатрат = КонецМесяца(ДатаОтгрузки);
	//-22.08.22
	////НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно;
	//??10.03.22 НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Требуется;
	//??10.03.22 НоваяСтрока.Обособленно = Истина;
	НоваяСтрока.ОтборПоВариантамОбеспечения = УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(НоваяСтрока.ВариантОбеспечения);
	НоваяСтрока.КлючСвязиСпецификация = СтрокаДерева.КлючСвязиСпецификация;
	
	НЗ.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспечения)
	Если ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления
		ИЛИ ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда  //УдалитьОбособленно
		Возврат 1;
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда //или ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьИзЗаказов
		Возврат 2;
	//ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Требуется Тогда 
	//	Возврат 3;	
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда 
		Возврат 4;
	ИначеЕсли ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда //или ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОтгрузитьОбособленно
		Возврат 5;
	КонецЕсли;
КонецФункции
	
&НаКлиенте            
//Старая//
Процедура ОбновитьИДТекущейСтрокиСтарая(ИмяДерева,ИмяТаблицыИдентификаторов,ТекНоменклатура,ЭтапПроизводства = Неопределено, ИДТекСтроки = Неопределено)
	//Если не ЗначениеЗаполнено(ИДТекСтроки) Тогда 
	//	Если ЗначениеЗаполнено(ЭтапПроизводства) Тогда 
	//		ТекущаяСтрока1Уровня = Ложь;
	//		////СтруктураПоиска.Вставить("ЭтапПроизводства", ЭтапПроизводства);
	//	Иначе 
	//		ТекущаяСтрока1Уровня = Истина;
	//	КонецЕсли;
	//	КоллекцияЭлементов1Уровня = Этаформа[ИмяДерева].ПолучитьЭлементы();
	//	Для Каждого СтрокаДерева из КоллекцияЭлементов1Уровня Цикл
	//		Если СтрокаДерева.Номенклатура = ТекНоменклатура Тогда 
	//			Если ТекущаяСтрока1Уровня Тогда 
	//				ИДТекСтроки = СтрокаДерева.ПолучитьИдентификатор();
	//				Прервать;
	//			Иначе 
	//				ПодчиненныеСтроки = СтрокаДерева.ПолучитьЭлементы();
	//				Для Каждого Стр из ПодчиненныеСтроки Цикл 
	//					Если Стр.ЭтапПроизводства = ЭтапПроизводства Тогда 
	//						ИДТекСтроки = Стр.ПолучитьИдентификатор();
	//						Прервать;
	//					КонецЕсли;
	//				КонецЦикла;
	//			КонецЕсли;
	//		Иначе 
	//			Продолжить;
	//		КонецЕсли; 
	//	КонецЦикла; 
	//КонецЕсли;
	//Если ИДТекСтроки = Неопределено Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//СтруктураПоиска = Новый Структура;
	//СтруктураПоиска.Вставить("ТекущаяСтрока", Истина);     
	//
	//МассивТекСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
	//Если МассивТекСтрока.Количество() = 0 Тогда
	//	НайденнаяСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
	//Иначе 
	//	НайденнаяСтрока = МассивТекСТрока[0];
	//КонецЕсли;
	//НайденнаяСтрока.Номенклатура  		= ТекНоменклатура; //ИсходнаяНоменклатура;
	//НайденнаяСтрока.ИсходнаяНоменклатура= ИсходнаяНоменклатура; //ИсходнаяНоменклатура;
	//НайденнаяСтрока.ЭтапПроизводства	= ?(ЗначениеЗаполнено(ЭтапПроизводства), ЭтапПроизводства, ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка"));
	//НайденнаяСтрока.Идентификатор		= ИДТекСтроки;
	//НайденнаяСтрока.ТекущаяСтрока		= Истина;  

КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловПередУдалением(Элемент, Отказ) 
//	
//	//Запоминаем данные исходной строки дерева в реквизит формы ИсходныеДанныеСтрокиДереваМатериалов или ИсходныеДанныеСтрокиДереваМатериаловРезервирование
//	ДанныеИсходнойСтроки =ЗапомнитьИсходныеДанныеСтроки();
//	Если ТекСтраница = "Списание" Тогда 
//		ИмяДерева = "ДеревоМатериалов";
//		ЭтоСписание = Истина;
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		ЭтоСписание = Ложь;
//	КонецЕсли;  
//	
//	
//	
//	ОчиститьЗаписиРегистраДляУдаления(ДанныеИсходнойСтроки,ЭтоСписание);
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//	
//КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаписиРегистраДляУдаления(ДанныеУдаляемойСтроки, ЭтоСписание);
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Номенклатура.Установить(ДанныеУдаляемойСтроки.Номенклатура);    
	Если ЗначениеЗаполнено(ДанныеУдаляемойСтроки.ЭтапПроизводства) Тогда 
		НЗ.Отбор.ЭтапПроизводства.Установить(ДанныеУдаляемойСтроки.ЭтапПроизводства);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеУдаляемойСтроки.ВариантОбеспечения) Тогда 
		НЗ.Отбор.ВариантОбеспечения.Установить(ДанныеУдаляемойСтроки.ВариантОбеспечения);
	КонецЕсли;   
	Если ЗначениеЗаполнено(ДанныеУдаляемойСтроки.Спецификация) Тогда 
		НЗ.Отбор.СпецификацияЭтапа.Установить(ДанныеУдаляемойСтроки.Спецификация);      
	КонецЕсли;
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМатериаловРезервированиеПередНачаломИзменения(Элемент, Отказ)
	
	ДанныеТекСтроки = ЗапомнитьИсходныеДанныеСтроки(); 
	Если ТекСтраница = "Списание" Тогда 
		ИмяДерева = "ДеревоМатериалов"; 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
		ИмяДерева = "ДеревоМатериаловРезервирование"; 
		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
	КонецЕсли;
		
	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
	
КонецПроцедуры
	
#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область ЗаполнениеПоСпецификации

&НаСервере  
Процедура ЗаполнитьОбеспечениеПоСпецификацииНаСервере()
	
	//Объект.ОбеспечениеМатериаламиИРаботами.Очистить();
	//	
	//ДанныеСпецификации = ПолучитьНормативыПоСпецификации("МатериалыИУслуги", Ложь, Истина);
	//Если ДанныеСпецификации = Неопределено
	//	ИЛИ НЕ ДанныеСпецификации.Свойство("МатериалыИУслуги") Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ОбщегоНазначенияУТ.ДобавитьСтрокиВТаблицу(
	//	Объект.ОбеспечениеМатериаламиИРаботами,
	//	ДанныеСпецификации.МатериалыИУслуги,
	//	Новый Структура("КлючСвязиСпецификация", "КлючСвязи"),
	//	Новый Структура("ДатаОтгрузки", Объект.ЖелаемаяДатаОбеспечения));
	//
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПроверитьЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства",
	//	ОбеспечениеПроизводстваКлиентСервер.ПараметрыДействияПроверитьЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства(Объект));
	//
	//ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.ОбеспечениеМатериаламиИРаботами, СтруктураДействий, Неопределено);
	//
	//ПослеИзмененияСтрокТЧПрограммноНаСервере("ОбеспечениеМатериаламиИРаботами",, СтруктураДействий);
	//
	//ПроверитьНаличиеУточненийНоменклатуры("ОбеспечениеМатериаламиИРаботами", ЕстьУточненияМатериалов);
	//НастроитьЗависимыеЭлементыФормы(ЭтаФорма, "ЕстьУточненияМатериалов");
	
КонецПроцедуры

//Рабочая 30.04.2025
//+ Ганьшина Е 21.08.2025 доработка после добавления серийных номеров в таблицу Этапы
&НаКлиенте
Процедура ЗаполнитьПоСпецификации(Команда)
	
	ТабВыбранныеЭтапы = ПолучитьКоличествоВыбранныхЭтапов(Истина,,Истина);
	ЭтоСписание = не Объект.Резерв;  
	
	МассивЗадвоеннойНоменклатуры = Новый Массив;
	ОчиститРегистрПолностью(не Объект.Резерв);
	
	Для Каждого ЭтапПроизводства из ТабВыбранныеЭтапы Цикл 
		ПараметрыФормы = Новый Структура("Ключ", ЭтапПроизводства);
		Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",ПараметрыФормы);
		//Форма.Обеспечение_ЗаполнитьПоСпецификацииЗавершение(КодВозвратаДиалога.Да, Неопределено); 
		
		ПереченьДанных = Новый Структура("ОбеспечениеМатериаламиИРаботами");                         
		ДополнительныеПараметры = Новый Структура;
		Форма.Производство_ЗаполнитьПоСпецификацииЗавершение(ПереченьДанных,ДополнительныеПараметры);
		
		ТабМатериалы = Форма.Объект.ОбеспечениеМатериаламиИРаботами; 
		ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапаДляСвертки();
		СтруктураВозврата = ЗаполнитьРегистрПоСпецификациям(ТабМатериалы, Форма.Объект.Ссылка, ЭтоСписание);
		
		Если СтруктураВозврата.МассивЗадвоеннойноменклатуры.Количество() > 0 Тогда 
			Для Каждого Задвоеннаяноменклатура из СтруктураВозврата.МассивЗадвоеннойноменклатуры Цикл 
				Если МассивЗадвоеннойноменклатуры.Найти(Задвоеннаяноменклатура) = Неопределено Тогда 
					МассивЗадвоеннойноменклатуры.Добавить(Задвоеннаяноменклатура);
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
		
	КонецЦикла;  
		
	Если МассивЗадвоеннойНоменклатуры.Количество() <> 0 Тогда 
		ТекстСообщенияЗадвоеннаяноменклатура = "";
		Для Каждого Номенклатура из МассивЗадвоеннойНоменклатуры Цикл 
			ТекстСообщенияЗадвоеннаяноменклатура = ТекстСообщенияЗадвоеннаяноменклатура + Номенклатура + Символы.ПС;
		КонецЦикла;   
		Сообщить("В спецификации более 1 строки по номенклатуре:" + Символы.ПС + ТекстСообщенияЗадвоеннаяноменклатура);
	КонецЕсли;
	
	ПоЭтапам = Ложь;                              
	СписокНоменклатурыБезОстатка.Очистить();
	ЗаполнитьМатериалыСпецификации(ПоЭтапам);  
	
	Если СписокНоменклатурыБезОстатка.Количество() > 0 Тогда 
		ТекстСообщенияНоменклатураБезОстатка = "";
		Для Каждого Номенклатура из СписокНоменклатурыБезОстатка Цикл 
			ТекстСообщенияНоменклатураБезОстатка = ТекстСообщенияНоменклатураБезОстатка + Номенклатура + Символы.ПС;
		КонецЦикла;
		Сообщить("Нет остатка на складе по номенклатуре:" + Символы.ПС + ТекстСообщенияНоменклатураБезОстатка);
	КонецЕсли;
	
	УстановитьУсловноеОформлениеМатериаловСпецификации();
	Сообщить("Материалы этапов заполенны по спецификации!", СтатусСообщения.Важное);
    
КонецПроцедуры   

//Рабочая 30.04.2025
&НаСервереБезКонтекста
Процедура ОчиститРегистрПолностью(ЭтоСписание)
	Пользователь = Пользователи.АвторизованныйПользователь();
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание); 
	//НЗ.Отбор.ЭтапПроизводства.Установить(СсылкаНаЭтап);
	НЗ.Прочитать();  
	НЗ.Очистить();  
	НЗ.Записать();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРегистрПоСпецификациям(ТаблицаДанных, СсылкаНаЭтап, ЭтоСписание)
	
	СтруктураРезультата = Новый Структура("Результат,МассивЗадвоеннойНоменклатуры");
	Результат = Ложь;
	
	ТабМатериалы = ТаблицаДанных.Выгрузить();
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание); 
	НЗ.Отбор.ЭтапПроизводства.Установить(СсылкаНаЭтап);
	НЗ.Прочитать();      
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МатериалыЭтапа.НомерСтроки КАК НомерСтроки,
	               |	МатериалыЭтапа.Номенклатура КАК Номенклатура,
	               |	МатериалыЭтапа.Характеристика КАК Характеристика,
	               |	МатериалыЭтапа.Серия КАК Серия,
	               |	МатериалыЭтапа.Упаковка КАК Упаковка,
	               |	МатериалыЭтапа.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	МатериалыЭтапа.Количество КАК Количество,
	               |	МатериалыЭтапа.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	МатериалыЭтапа.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	МатериалыЭтапа.Склад КАК Склад,
	               |	МатериалыЭтапа.Производится КАК Производится,
	               |	МатериалыЭтапа.Назначение КАК Назначение,
	               |	МатериалыЭтапа.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	МатериалыЭтапа.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	МатериалыЭтапа.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	МатериалыЭтапа.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	МатериалыЭтапа.КодСтроки КАК КодСтроки,
	               |	МатериалыЭтапа.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	МатериалыЭтапа.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	МатериалыЭтапа.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	МатериалыЭтапа.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	МатериалыЭтапа.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	МатериалыЭтапа.Обособленно КАК Обособленно,
	               |	МатериалыЭтапа.Отменено КАК Отменено,
	               |	МатериалыЭтапа.ПричинаОтмены КАК ПричинаОтмены,
	               |	МатериалыЭтапа.Период КАК Период,
	               |	МатериалыЭтапа.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	МатериалыЭтапа.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	МатериалыЭтапа.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	МатериалыЭтапа.Подразделение КАК Подразделение,
	               |	МатериалыЭтапа.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	МатериалыЭтапа.КлючНоменклатура КАК КлючНоменклатура,
	               |	МатериалыЭтапа.Количество КАК Обеспечить,
	               |	МатериалыЭтапа.Спецификация КАК Спецификация,
	               |	МатериалыЭтапа.Количество КАК Норматив,
	               |	1 КАК СтрокаМатериала
	               |ПОМЕСТИТЬ ТабМатериалыЭтапаБезОстатков
	               |ИЗ
	               |	&ТабМатериалы КАК МатериалыЭтапа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТабМатериалыЭтапаБезОстатков.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ СписокМатериалов
	               |ИЗ
	               |	ТабМатериалыЭтапаБезОстатков КАК ТабМатериалыЭтапаБезОстатков
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	               |	СписокМатериалов.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	               |	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0)) КАК Резерв,
	               |	СУММА(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК Отгружается
	               |ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов_v1
	               |ИЗ
	               |	СписокМатериалов КАК СписокМатериалов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&Склад)) КАК ТоварыНаСкладахОстатки
	               |		ПО (ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЕСТЬNULL(СписокМатериалов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(, Склад В (&Склад)) КАК ЗапасыИПотребностиОстатки
	               |		ПО (ЕСТЬNULL(СписокМатериалов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЕСТЬNULL(ЗапасыИПотребностиОстатки.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад В (&Склад)) КАК ТоварыКОтгрузкеОстатки
	               |		ПО (ЕСТЬNULL(СписокМатериалов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЕСТЬNULL(ТоварыКОтгрузкеОстатки.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СписокМатериалов.Номенклатура,
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)),
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировано,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РезервироватьПоМереПоступления,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отгружено
	               |ПОМЕСТИТЬ ЗарезервированоИОтружено
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В(&СсылкаНаЭтап)
	               |	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура В (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |		ИНАЧЕ 0
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&СсылкаНаЭтап КАК ЭтапПроизводства,
	               |	ТабМатериалыЭтапаБезОстатков.НомерСтроки КАК НомерСтроки,
	               |	ТабМатериалыЭтапаБезОстатков.Номенклатура КАК Номенклатура,
	               |	ТабМатериалыЭтапаБезОстатков.Характеристика КАК Характеристика,
	               |	ТабМатериалыЭтапаБезОстатков.Серия КАК Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТабМатериалыЭтапаБезОстатков.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА НоменклатураДополнительныеРеквизиты.Ссылка.ЕдиницаИзмерения
	               |		ИНАЧЕ ТабМатериалыЭтапаБезОстатков.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	ТабМатериалыЭтапаБезОстатков.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ТабМатериалыЭтапаБезОстатков.Количество КАК Количество,
	               |	ТабМатериалыЭтапаБезОстатков.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ТабМатериалыЭтапаБезОстатков.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ТабМатериалыЭтапаБезОстатков.Склад КАК Склад,
	               |	ТабМатериалыЭтапаБезОстатков.Производится КАК Производится,
	               |	ТабМатериалыЭтапаБезОстатков.Назначение КАК Назначение,
	               |	ТабМатериалыЭтапаБезОстатков.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ТабМатериалыЭтапаБезОстатков.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ТабМатериалыЭтапаБезОстатков.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ТабМатериалыЭтапаБезОстатков.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ТабМатериалыЭтапаБезОстатков.КодСтроки КАК КодСтроки,
	               |	ТабМатериалыЭтапаБезОстатков.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ТабМатериалыЭтапаБезОстатков.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ТабМатериалыЭтапаБезОстатков.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ТабМатериалыЭтапаБезОстатков.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ТабМатериалыЭтапаБезОстатков.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ТабМатериалыЭтапаБезОстатков.Обособленно КАК Обособленно,
	               |	ТабМатериалыЭтапаБезОстатков.Отменено КАК Отменено,
	               |	ТабМатериалыЭтапаБезОстатков.ПричинаОтмены КАК ПричинаОтмены,
	               |	ТабМатериалыЭтапаБезОстатков.Период КАК Период,
	               |	ТабМатериалыЭтапаБезОстатков.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ТабМатериалыЭтапаБезОстатков.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ТабМатериалыЭтапаБезОстатков.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ТабМатериалыЭтапаБезОстатков.Подразделение КАК Подразделение,
	               |	ТабМатериалыЭтапаБезОстатков.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ТабМатериалыЭтапаБезОстатков.КлючНоменклатура КАК КлючНоменклатура,
	               |	ТабМатериалыЭтапаБезОстатков.Обеспечить КАК Обеспечить,
	               |	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии, 0) КАК Остаток,
	               |	&ЭтоСписание КАК ЭтоСписание,
	               |	1 КАК ОтборПоВариантамОбеспечения,
	               |	&Запланировано КАК Запланировано,
	               |	&Пользователь КАК Пользователь,
	               |	&СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, """") КАК КатегорияМатериала,
	               |	ТабМатериалыЭтапаБезОстатков.Норматив КАК Норматив,
	               |	НоменклатураДополнительныеРеквизиты.Ссылка.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	ТабМатериалыЭтапаБезОстатков КАК ТабМатериалыЭтапаБезОстатков
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НовыеОстаткиИзЗапасов_v1 КАК ВТ_НовыеОстаткиИзЗапасов_v1
	               |		ПО ТабМатериалыЭтапаБезОстатков.Номенклатура = ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗарезервированоИОтружено КАК ЗарезервированоИОтружено
	               |		ПО ТабМатериалыЭтапаБезОстатков.Номенклатура = ЗарезервированоИОтружено.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ПО ТабМатериалыЭтапаБезОстатков.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабМатериалыЭтапаБезОстатков.Номенклатура КАК Номенклатура,
	               |	СУММА(ТабМатериалыЭтапаБезОстатков.СтрокаМатериала) КАК СтрокаМатериала
	               |ПОМЕСТИТЬ КоличествоСтрокПоМатериалу
	               |ИЗ
	               |	ТабМатериалыЭтапаБезОстатков КАК ТабМатериалыЭтапаБезОстатков
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабМатериалыЭтапаБезОстатков.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КоличествоСтрокПоМатериалу.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	КоличествоСтрокПоМатериалу КАК КоличествоСтрокПоМатериалу
	               |ГДЕ
	               |	КоличествоСтрокПоМатериалу.СтрокаМатериала > 1";                
	Запрос.УстановитьПараметр("ТабМатериалы",ТабМатериалы);
	Запрос.УстановитьПараметр("СсылкаНаЭтап",СсылкаНаЭтап);
	Запрос.УстановитьПараметр("ЭтоСписание",ЭтоСписание);
	Запрос.УстановитьПараметр("СпецификацияЭтапа",СсылкаНаЭтап.Спецификация);
	Запрос.УстановитьПараметр("ДатаОтгрузки",СсылкаНаЭтап.ДатаОтгрузки);
	Запрос.УстановитьПараметр("Запланировано",СсылкаНаЭтап.КоличествоУпаковокПлан);        
	Запрос.УстановитьПараметр("Пользователь", Пользователь); 
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИМЯ","КатегорияМатериалаТТМ_aafd1a586b084314b826261406267a99"));
	МассивСкладов = Новый Массив;
	МассивСкладов.Добавить(Объект.Склад);
	МассивСкладов.Добавить(Объект.СкладПФ);
	Запрос.УстановитьПараметр("Склад", МассивСкладов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();	
	ТЗ = МассивРезультатов[4].Выгрузить();
		
	НЗ.Загрузить(ТЗ); 
	
	//ОбщегоНазначенияУТ.ПоказатьВременнуюТаблицу(Запрос,"ЗамноженныеСтрокиПоМатериалу").ВыгрузитьКолонку("Номенклатура")
	ТабЗадвоенныеСтрокиПоНоменклатуре = МассивРезультатов[6].Выгрузить(); 
	МассивЗадвоеннойноменклатуры = ТабЗадвоенныеСтрокиПоНоменклатуре.ВыгрузитьКолонку("Номенклатура");
	
	
	ПоискСтрокСНулевымОстатком = Новый Структура("Остаток",0);
	ТабСТрокиБезОстатка = ТЗ.Скопировать(ПоискСтрокСНулевымОстатком);
	ТабСТрокиБезОстатка.Свернуть("Номенклатура");
	
	СтруктураРезультата.МассивЗадвоеннойноменклатуры = МассивЗадвоеннойноменклатуры;
	Попытка
		НЗ.Записать();  
		Результат = Истина;
	Исключение
		Сообщить("Ошибка при записи данных в регистр");
	КонецПопытки;  
	
	СтруктураРезультата.Результат = Результат;
	
	Возврат СтруктураРезультата;
	
КонецФункции

//16/10/2025
//&НаСервере
//Функция ЗаполнитьРегистрПоСпецификациям(ТаблицаДанных, СсылкаНаЭтап, ЭтоСписание)
//	
//	СтруктураРезультата = Новый Структура("Результат,МассивЗадвоеннойНоменклатуры");
//	Результат = Ложь;
//	
//	ТабМатериалы = ТаблицаДанных.Выгрузить();
//	
//	Пользователь = Пользователи.АвторизованныйПользователь();
//	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//	НЗ.Отбор.Пользователь.Установить(Пользователь);
//	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание); 
//	НЗ.Отбор.ЭтапПроизводства.Установить(СсылкаНаЭтап);
//	НЗ.Прочитать();      
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	МатериалыЭтапа.НомерСтроки КАК НомерСтроки,
//	               |	МатериалыЭтапа.Номенклатура КАК Номенклатура,
//	               |	МатериалыЭтапа.Характеристика КАК Характеристика,
//	               |	МатериалыЭтапа.Серия КАК Серия,
//	               |	МатериалыЭтапа.Упаковка КАК Упаковка,
//	               |	МатериалыЭтапа.КоличествоУпаковок КАК КоличествоУпаковок,
//	               |	МатериалыЭтапа.Количество КАК Количество,
//	               |	МатериалыЭтапа.ВариантОбеспечения КАК ВариантОбеспечения,
//	               |	МатериалыЭтапа.ДатаОтгрузки КАК ДатаОтгрузки,
//	               |	МатериалыЭтапа.Склад КАК Склад,
//	               |	МатериалыЭтапа.Производится КАК Производится,
//	               |	МатериалыЭтапа.Назначение КАК Назначение,
//	               |	МатериалыЭтапа.НазначениеОбеспечения КАК НазначениеОбеспечения,
//	               |	МатериалыЭтапа.СтатусУказанияСерий КАК СтатусУказанияСерий,
//	               |	МатериалыЭтапа.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
//	               |	МатериалыЭтапа.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
//	               |	МатериалыЭтапа.КодСтроки КАК КодСтроки,
//	               |	МатериалыЭтапа.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
//	               |	МатериалыЭтапа.СведенияАвтовыбора КАК СведенияАвтовыбора,
//	               |	МатериалыЭтапа.ПрименениеМатериала КАК ПрименениеМатериала,
//	               |	МатериалыЭтапа.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
//	               |	МатериалыЭтапа.СтатьяКалькуляции КАК СтатьяКалькуляции,
//	               |	МатериалыЭтапа.Обособленно КАК Обособленно,
//	               |	МатериалыЭтапа.Отменено КАК Отменено,
//	               |	МатериалыЭтапа.ПричинаОтмены КАК ПричинаОтмены,
//	               |	МатериалыЭтапа.Период КАК Период,
//	               |	МатериалыЭтапа.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	               |	МатериалыЭтапа.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
//	               |	МатериалыЭтапа.ИдентификаторСтроки КАК ИдентификаторСтроки,
//	               |	МатериалыЭтапа.Подразделение КАК Подразделение,
//	               |	МатериалыЭтапа.КлючСвязиНабор КАК КлючСвязиНабор,
//	               |	МатериалыЭтапа.КлючНоменклатура КАК КлючНоменклатура,
//	               |	МатериалыЭтапа.Количество КАК Обеспечить,
//	               |	МатериалыЭтапа.Спецификация КАК Спецификация,
//	               |	МатериалыЭтапа.Количество КАК Норматив,
//	               |	1 КАК СтрокаМатериала
//	               |ПОМЕСТИТЬ ТабМатериалыЭтапаБезОстатков
//	               |ИЗ
//	               |	&ТабМатериалы КАК МатериалыЭтапа
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ТабМатериалыЭтапаБезОстатков.Номенклатура КАК Номенклатура
//	               |ПОМЕСТИТЬ СписокМатериалов
//	               |ИЗ
//	               |	ТабМатериалыЭтапаБезОстатков КАК ТабМатериалыЭтапаБезОстатков
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
//	               |	СписокМатериалов.Номенклатура КАК Номенклатура,
//	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
//	               |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
//	               |	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0)) КАК Резерв,
//	               |	СУММА(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК Отгружается
//	               |ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов_v1
//	               |ИЗ
//	               |	СписокМатериалов КАК СписокМатериалов
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
//	               |				,
//	               |				Номенклатура В
//	               |						(ВЫБРАТЬ
//	               |							Т.Номенклатура
//	               |						ИЗ
//	               |							СписокМатериалов КАК Т)
//	               |					И Склад В (&Склад)) КАК ТоварыНаСкладахОстатки
//	               |			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(
//	               |					,
//	               |					Номенклатура В
//	               |							(ВЫБРАТЬ
//	               |								Т.Номенклатура
//	               |							ИЗ
//	               |								СписокМатериалов КАК Т)
//	               |						И Склад В (&Склад)) КАК ЗапасыИПотребностиОстатки
//	               |			ПО ТоварыНаСкладахОстатки.Номенклатура = ЗапасыИПотребностиОстатки.Номенклатура
//	               |			ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(
//	               |					,
//	               |					Номенклатура В
//	               |							(ВЫБРАТЬ
//	               |								Т.Номенклатура
//	               |							ИЗ
//	               |								СписокМатериалов КАК Т)
//	               |						И Склад В (&Склад)) КАК ТоварыКОтгрузкеОстатки
//	               |			ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
//	               |		ПО (СписокМатериалов.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)),
//	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
//	               |	СписокМатериалов.Номенклатура
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
//	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Зарезервировано,
//	               |	ВЫБОР
//	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
//	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |		ИНАЧЕ 0
//	               |	КОНЕЦ КАК РезервироватьПоМереПоступления,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
//	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Отгружено
//	               |ПОМЕСТИТЬ ЗарезервированоИОтружено
//	               |ИЗ
//	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
//	               |ГДЕ
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В(&СсылкаНаЭтап)
//	               |	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура В (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
//	               |	ВЫБОР
//	               |		КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
//	               |			ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |		ИНАЧЕ 0
//	               |	КОНЕЦ
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	&СсылкаНаЭтап КАК ЭтапПроизводства,
//	               |	ТабМатериалыЭтапаБезОстатков.НомерСтроки КАК НомерСтроки,
//	               |	ТабМатериалыЭтапаБезОстатков.Номенклатура КАК Номенклатура,
//	               |	ТабМатериалыЭтапаБезОстатков.Характеристика КАК Характеристика,
//	               |	ТабМатериалыЭтапаБезОстатков.Серия КАК Серия,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(ТабМатериалыЭтапаБезОстатков.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	               |			ТОГДА НоменклатураДополнительныеРеквизиты.Ссылка.ЕдиницаИзмерения
//	               |		ИНАЧЕ ТабМатериалыЭтапаБезОстатков.Упаковка
//	               |	КОНЕЦ КАК Упаковка,
//	               |	ТабМатериалыЭтапаБезОстатков.КоличествоУпаковок КАК КоличествоУпаковок,
//	               |	ТабМатериалыЭтапаБезОстатков.Количество КАК Количество,
//	               |	ТабМатериалыЭтапаБезОстатков.ВариантОбеспечения КАК ВариантОбеспечения,
//	               |	ТабМатериалыЭтапаБезОстатков.ДатаОтгрузки КАК ДатаОтгрузки,
//	               |	ТабМатериалыЭтапаБезОстатков.Склад КАК Склад,
//	               |	ТабМатериалыЭтапаБезОстатков.Производится КАК Производится,
//	               |	ТабМатериалыЭтапаБезОстатков.Назначение КАК Назначение,
//	               |	ТабМатериалыЭтапаБезОстатков.НазначениеОбеспечения КАК НазначениеОбеспечения,
//	               |	ТабМатериалыЭтапаБезОстатков.СтатусУказанияСерий КАК СтатусУказанияСерий,
//	               |	ТабМатериалыЭтапаБезОстатков.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
//	               |	ТабМатериалыЭтапаБезОстатков.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
//	               |	ТабМатериалыЭтапаБезОстатков.КодСтроки КАК КодСтроки,
//	               |	ТабМатериалыЭтапаБезОстатков.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
//	               |	ТабМатериалыЭтапаБезОстатков.СведенияАвтовыбора КАК СведенияАвтовыбора,
//	               |	ТабМатериалыЭтапаБезОстатков.ПрименениеМатериала КАК ПрименениеМатериала,
//	               |	ТабМатериалыЭтапаБезОстатков.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
//	               |	ТабМатериалыЭтапаБезОстатков.СтатьяКалькуляции КАК СтатьяКалькуляции,
//	               |	ТабМатериалыЭтапаБезОстатков.Обособленно КАК Обособленно,
//	               |	ТабМатериалыЭтапаБезОстатков.Отменено КАК Отменено,
//	               |	ТабМатериалыЭтапаБезОстатков.ПричинаОтмены КАК ПричинаОтмены,
//	               |	ТабМатериалыЭтапаБезОстатков.Период КАК Период,
//	               |	ТабМатериалыЭтапаБезОстатков.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	               |	ТабМатериалыЭтапаБезОстатков.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
//	               |	ТабМатериалыЭтапаБезОстатков.ИдентификаторСтроки КАК ИдентификаторСтроки,
//	               |	ТабМатериалыЭтапаБезОстатков.Подразделение КАК Подразделение,
//	               |	ТабМатериалыЭтапаБезОстатков.КлючСвязиНабор КАК КлючСвязиНабор,
//	               |	ТабМатериалыЭтапаБезОстатков.КлючНоменклатура КАК КлючНоменклатура,
//	               |	ТабМатериалыЭтапаБезОстатков.Обеспечить КАК Обеспечить,
//	               |	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии, 0) КАК Остаток,
//	               |	&ЭтоСписание КАК ЭтоСписание,
//	               |	1 КАК ОтборПоВариантамОбеспечения,
//	               |	&Запланировано КАК Запланировано,
//	               |	&Пользователь КАК Пользователь,
//	               |	&СпецификацияЭтапа КАК СпецификацияЭтапа,
//	               |	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, """") КАК КатегорияМатериала,
//	               |	ТабМатериалыЭтапаБезОстатков.Норматив КАК Норматив,
//	               |	НоменклатураДополнительныеРеквизиты.Ссылка.ЕдиницаИзмерения КАК ЕдиницаИзмерения
//	               |ИЗ
//	               |	ТабМатериалыЭтапаБезОстатков КАК ТабМатериалыЭтапаБезОстатков
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НовыеОстаткиИзЗапасов_v1 КАК ВТ_НовыеОстаткиИзЗапасов_v1
//	               |		ПО ТабМатериалыЭтапаБезОстатков.Номенклатура = ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗарезервированоИОтружено КАК ЗарезервированоИОтружено
//	               |		ПО ТабМатериалыЭтапаБезОстатков.Номенклатура = ЗарезервированоИОтружено.Номенклатура
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
//	               |		ПО ТабМатериалыЭтапаБезОстатков.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
//	               |ГДЕ
//	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ТабМатериалыЭтапаБезОстатков.Номенклатура КАК Номенклатура,
//	               |	СУММА(ТабМатериалыЭтапаБезОстатков.СтрокаМатериала) КАК СтрокаМатериала
//	               |ПОМЕСТИТЬ КоличествоСтрокПоМатериалу
//	               |ИЗ
//	               |	ТабМатериалыЭтапаБезОстатков КАК ТабМатериалыЭтапаБезОстатков
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ТабМатериалыЭтапаБезОстатков.Номенклатура
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	КоличествоСтрокПоМатериалу.Номенклатура КАК Номенклатура
//	               //|ПОМЕСТИТЬ ЗамноженныеСтрокиПоМатериалу
//	               |ИЗ
//	               |	КоличествоСтрокПоМатериалу КАК КоличествоСтрокПоМатериалу
//	               |ГДЕ
//	               |	КоличествоСтрокПоМатериалу.СтрокаМатериала > 1";                
//	Запрос.УстановитьПараметр("ТабМатериалы",ТабМатериалы);
//	Запрос.УстановитьПараметр("СсылкаНаЭтап",СсылкаНаЭтап);
//	Запрос.УстановитьПараметр("ЭтоСписание",ЭтоСписание);
//	Запрос.УстановитьПараметр("СпецификацияЭтапа",СсылкаНаЭтап.Спецификация);
//	Запрос.УстановитьПараметр("ДатаОтгрузки",СсылкаНаЭтап.ДатаОтгрузки);
//	Запрос.УстановитьПараметр("Запланировано",СсылкаНаЭтап.КоличествоУпаковокПлан);        
//	Запрос.УстановитьПараметр("Пользователь", Пользователь); 
//	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИМЯ","КатегорияМатериалаТТМ_aafd1a586b084314b826261406267a99"));
//	МассивСкладов = Новый Массив;
//	МассивСкладов.Добавить(Объект.Склад);
//	МассивСкладов.Добавить(Объект.СкладПФ);
//	Запрос.УстановитьПараметр("Склад", МассивСкладов);
//	
//	МассивРезультатов = Запрос.ВыполнитьПакет();	
//	ТЗ = МассивРезультатов[4].Выгрузить();
//		
//	НЗ.Загрузить(ТЗ); 
//	
//	//ОбщегоНазначенияУТ.ПоказатьВременнуюТаблицу(Запрос,"ЗамноженныеСтрокиПоМатериалу").ВыгрузитьКолонку("Номенклатура")
//	ТабЗадвоенныеСтрокиПоНоменклатуре = МассивРезультатов[6].Выгрузить(); 
//	МассивЗадвоеннойноменклатуры = ТабЗадвоенныеСтрокиПоНоменклатуре.ВыгрузитьКолонку("Номенклатура");
//	
//	
//	ПоискСтрокСНулевымОстатком = Новый Структура("Остаток",0);
//	ТабСТрокиБезОстатка = ТЗ.Скопировать(ПоискСтрокСНулевымОстатком);
//	ТабСТрокиБезОстатка.Свернуть("Номенклатура");
//	
//	СтруктураРезультата.МассивЗадвоеннойноменклатуры = МассивЗадвоеннойноменклатуры;
//	Попытка
//		НЗ.Записать();  
//		Результат = Истина;
//	Исключение
//		Сообщить("Ошибка при записи данных в регистр");
//	КонецПопытки;  
//	
//	СтруктураРезультата.Результат = Результат;
//	
//	Возврат СтруктураРезультата;
//	
//КонецФункции

&НаСервере
Функция ПолучитьТабОстаткиМатериалов(ТабМатериалов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабМатериалов.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ТабНоменклатура
	               |ИЗ
	               |	&ТабМатериалов КАК ТабМатериалов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабНоменклатура.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) КАК Остаток
	               |ИЗ
	               |	ТабНоменклатура КАК ТабНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
	               |		ПО ЕСТЬNULL(ТабНоменклатура.Номенклатура,Значение(Справочник.Номенклатура.ПустаяСсылка)) = ЕСТЬNULL(СвободныеОстаткиОстатки.Номенклатура,Значение(Справочник.Номенклатура.ПустаяСсылка))";
	Запрос.УстановитьПараметр("ТабМатериалов", ТабМатериалов.Выгрузить());
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьЗаписиРегистраПоОтбору(ЗначениеРеквизитаРезервДо)
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСписание.Установить(ЗначениеРеквизитаРезервДо);
	НЗ.Прочитать();
	Если НЗ.Количество()>0 Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПроверитьУстановитьЭтоСписание()
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	//НЗ.Отбор.ЭтоСписание = не Объект.Резерв;
	НЗ.Прочитать(); 
	Если НЗ.Количество() > 0 Тогда 
		//проверить что по этому пользователю и Призна
		НЗ.Очистить();
		НЗ.Записать();  
		поЭтапам = Истина;
		ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
функция ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки_Новая(СписокВариантовОбеспечения, ЭтоСписание)
	
	МассивСтрок = Элементы.МатериалыСпецификации.ВыделенныеСтроки;
	МассивОбрабатываемыхСтрок = Новый Массив;
	Для Каждого Стр из МассивСтрок Цикл  
		//ОтменаРезерва = не МассивОбрабатываемыхСтрок.Найти(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада")) = Неопределено;
		Если Объект.МатериалыСпецификации.НайтиПоИдентификатору(Стр).Остаток = 0 Тогда //и не ОтменаРезерва Тогда
			Продолжить;
		КонецЕсли;
		Если Объект.МатериалыСпецификации.НайтиПоИдентификатору(Стр) <> Неопределено Тогда  
			МассивОбрабатываемыхСтрок.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
	Для Каждого МСтр из МассивОбрабатываемыхСтрок Цикл 
		//ТекСтрока = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(МСтр);
		//ДанныеСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, ВариантОбеспечения");
		//Если ТекСтрока <> Неопределено Тогда        
		//	Если СписокВариантовОбеспечения.НайтиПоЗначению(Текстрока.ВариантОбеспечения) = Неопределено Тогда 
		//		Продолжить;
		//	КонецЕсли;
		//	ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
		//	МассивСтруктурОбрабатываемыхСтрок.Добавить(ДанныеСтроки);
		//КонецЕсли;
	КонецЦикла;                              
	
	Возврат МассивСтруктурОбрабатываемыхСтрок;
	
КонецФункции

//&НаКлиенте
//Процедура РазрешитьОстаткиНаТекущуюДатуПриСписанииПриИзменении(Элемент)                         
//	ИмяДерева = "ДеревоМатериалов";
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//	//ВосстановитьСостояниеДерева(ИмяДерева);
//КонецПроцедуры

//15/08/2025 Закомментировала не используется
//&НаКлиенте
//Процедура ДатаОстатковДляСписанияПриИзменении(Элемент)
//	Если Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании Тогда 
//		Если не ЗначениеЗаполнено(Объект.ДатаОстатковДляСписания) и Месяц(Объект.ПериодОтгрузки) <> Месяц(ТекущаяДата()) Тогда 
//			Объект.ДатаОстатковДляСписания = КонецМесяца(Объект.ПериодОтгрузки);
//			Сообщить("Дата остатков не должна превышать конец месяца Даты списания!");
//		ИначеЕсли ЗначениеЗаполнено(Объект.ДатаОстатковДляСписания) и Месяц(Объект.ПериодОтгрузки) <> Месяц(Объект.ДатаОстатковДляСписания) Тогда
//			Объект.ДатаОстатковДляСписания = КонецМесяца(Объект.ПериодОтгрузки);
//			Сообщить("Дата остатков не должна превышать конец месяца Даты списания!");
//		КонецЕсли;
//	Иначе    
//		Объект.ДатаОстатковДляСписания = Дата(1,1,1);
//	КонецЕсли; 
//	ИмяДерева = "ДеревоМатериалов";
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//	//ВосстановитьСостояниеДерева(ИмяДерева);
//КонецПроцедуры

&НаСервере
Процедура ОбособленноПриИзмененииНаСервере(ИмяДерева, ДанныеТекущейСтроки)
	
	//Если ТекСтраница = "Списание" Тогда
	//	Если ДанныеТекущейСтроки.Уровень = 1 Тогда 
	//		
	//	КонецЕсли;
	//ИначеЕсли ТекСтраница = "Резервирвоание" Тогда 
	//	Если ДанныеТекущейСтроки.Уровень = 1 Тогда 
	//		//
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
//БезКонтекста
Процедура ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам)
	
	////Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	//Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
	//	ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	//	ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	//	Номенклатура = ТекСтрока.Номенклатура;
	//Иначе            
	//	Если Объект.МатериалыСпецификации.Количество() > 0 Тогда 
	//		ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(0);
	//		ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	//		Номенклатура = ТекСтрока.Номенклатура;
	//	КонецЕсли;
	//КонецЕсли;
	
	ЗаполнитьМатериалыСпецификации(ПоЭтапам);  
	
	////Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	//ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	//МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	//Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
	//	ТекСтрока = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	//Иначе 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	//КонецЕсли;
		
	//Условное оформление            
	ОбновлениеДанныхФормы = Истина;
	УстановитьУсловноеОформлениеМатериаловСпецификации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМатериалыПоДаннымРегистра(Команда)
	
	
	
	ОбновитьМатериалыСпецификации(Ложь);
	//ОбновитьМатериалыПоДаннымРегистраНаСервере();
	//	
	//	Если не Этаформа.ТекущийЭлемент = Элементы.МатериалыСпецификации Тогда 
	//		Этаформа.ТекущийЭлемент = Элементы.МатериалыСпецификации
	//	КонецЕсли;
	//	Если Элементы.МатериалыСпецификации.ТекущиеДанные = Неопределено Тогда  
	//		Этаформа.ТекущийЭлемент.ТекущаяСтрока = 0;
	//	КонецЕсли;
	//	ТекНоменклатура = Элементы.МатериалыСпецификации.ТекущиеДанные.Номенклатура;
	//
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекНоменклатура);
	//
	//	РасходВсего = Объект.РаспределениеМатериала.Итог("Количество");
	//	КоличествоОтмеченныхЭтапов = Объект.РаспределениеМатериала.Количество();
КонецПроцедуры             
	
&НаКлиенте
Процедура ОбновитьМатериалыСпецификации(ПоЭтапам)
	
	//Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
		ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
		ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
		Номенклатура = ТекСтрока.Номенклатура;
	Иначе            
		Если Объект.МатериалыСпецификации.Количество() > 0 Тогда 
			ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(0);
			ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
			Номенклатура = ТекСтрока.Номенклатура;
		КонецЕсли;
	КонецЕсли;
	
	ОтборКатегорияМатериала = ОтборКатегорияМатериала;   
	//ОтборПоВариантамОбеспечения = ОтборВариантОбеспечения;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
		
	//Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
		ТекСтрока = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;           
	Если Элементы.МатериалыСпецификации.ТекущиеДанные = Неопределено Тогда   
		Если Объект.МатериалыСпецификации.Количество() > 0 Тогда 
			ТекНоменклатура = Объект.МатериалыСпецификации[0].Номенклатура;
		Иначе 
			ТекНоменклатура = Неопределено;
		КонецЕсли;
	Иначе 
		ТекНоменклатура = Элементы.МатериалыСпецификации.ТекущиеДанные.Номенклатура;
	КонецЕсли;
	
	//Заполним ТЧ РаспределениеМатериала
	Если не ТекНоменклатура = Неопределено Тогда 
		ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекНоменклатура);
	КонецЕсли;
	РасходВсего = Объект.РаспределениеМатериала.Итог("КоличествоУпаковок");
	КоличествоОтмеченныхЭтапов = Объект.РаспределениеМатериала.Количество();
		
КонецПроцедуры	
	
&НаКлиенте
Процедура РаспределениеМатериалаОтметкаПриИзменении(Элемент) 
	ВыполнитьИзменениеОтметки(); 	 
КонецПроцедуры  

&НаКлиенте
Процедура ВыполнитьИзменениеОтметки()
	ТекСтрока = Элементы.РаспределениеМатериала.ТекущиеДанные; //Элемент.Родитель.ТекущиеДанные;  
	ТекСтрокаНомер = Элементы.РаспределениеМатериала.ТекущаяСтрока; //Элемент.Родитель.ТекущаяСтрока;
	ЭтапПроизводства = ТекСтрока.ЭтапПроизводства;
	ИДТекСтроки = Элементы.РаспределениеМатериала.ТекущиеДанные.ПолучитьИдентификатор();
	Если не ТекСтрока.Отметка Тогда 
		КоличествоОтмеченныхЭтапов = КоличествоОтмеченныхЭтапов - 1;
		РасходВсего = РасходВсего - ТекСтрока.КоличествоУпаковок;
	ИначеЕсли ТекСтрока.Отметка Тогда 
		КоличествоОтмеченныхЭтапов = КоличествоОтмеченныхЭтапов + 1;
		РасходВсего = РасходВсего + ТекСтрока.КоличествоУпаковок;
	Иначе 
		ПараметрыОтбора = Новый Структура("Отметка",Истина);
		МассивОтмеченныхСтрок = Объект.РаспределениеМатериала.Выгрузить(ПараметрыОтбора,"Отметка");
		КоличествоОтмеченныхЭтапов = МассивОтмеченныхСтрок.Количество();
		РасходВсего = Объект.РаспределениеМатериала.Итог("КоличествоУпаковок");
	КонецЕсли;      
	
	ДанныеСтрокиРаспределенияМатериалов = ПолучитьСтруктуруДанныхСтрокиТЧРаспределениеМатериала();  
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиРаспределенияМатериалов,ТекСтрока); 
		
	ДанныеСтрокиРаспределенияМатериалов.Номенклатура = Элементы.МатериалыСпецификации.ТекущиеДанные.Номенклатура;
	
	ТекСтрокаРегистра = Элементы.МатериалыСпецификации.ТекущиеДанные;
	ТекНоменклатура = ТекСтрокаРегистра.Номенклатура;
	
	//+Ганьшина Е. 29.04.2025
	//Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	ПараметрыОтбораТЧМС = Новый Структура("Номенклатура",ТекущаяНоменклатура);
	МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбораТЧМС); 
	Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
		ТекСтрока = МассивСтрокПоНоменклатуре[0]; //Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;    
	
	//Восстановим ТекущуюСтрокуТЧ РАспределениематериалов
	ПараметрыОтбораРАспределениеМатериалов = Новый Структура("ЭтапПроизводства", ТекущийЭтап);
	МассивНайденныхСтрок = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыОтбораРАспределениеМатериалов);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		ТекСтр = МассивНайденныхСтрок[0];
		Элементы.РаспределениеМатериала.ТекущаяСтрока = ТекСтр.ПолучитьИдентификатор();
	Иначе 
		Элементы.РаспределениеМатериала.ТекущаяСтрока = 0;
	КонецЕсли;   
	//- Ганьшина Е

	
	
	////Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	//Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
	//	//ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	//	////ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	//	Номенклатура = ТекСтрока.Номенклатура;
	//Иначе 
	//	//+ Ганьшина Е
	//	Если не ТекущаяНоменклатура = Неопределено Тогда 
	//		Номенклатура = ТекущаяНоменклатура;          
	//	КонецЕсли;    
	//	//- Ганьшина Е  

	//КонецЕсли;  
	
	ВыполнитьИзменениеОтметкиНаСервере(ДанныеСтрокиРаспределенияМатериалов, ИсходныеДанныеСтрокиМатериаловСпецификации, ЭтапПроизводства); 
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	
	
	////ЗаписатьИзмененияВРегистрНовая(ДанныеСтрокиРаспределенияМатериалов, ИсходныеДанныеСтрокиМатериаловСпецификации, ЭтапПроизводства); 
	////	
	////ПоЭтапам = Ложь;
	////ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	//
	////Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	//ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	//МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	//Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
	//	ТекСтрока = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	//Иначе 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	//КонецЕсли;
	
КонецПроцедуры      

&НаСервере
//БезКонтекста
Процедура ВыполнитьИзменениеОтметкиНаСервере(ДанныеСтрокиРаспределенияМатериалов, ИсходныеДанныеСтрокиМатериаловСпецификации, ЭтапПроизводства)
	
	ЗаписатьИзмененияВРегистрНовая(ДанныеСтрокиРаспределенияМатериалов, ИсходныеДанныеСтрокиМатериаловСпецификации, ЭтапПроизводства, "Отметка"); 
		
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	
КонецПроцедуры
	


&НаСервере
Функция ПолучитьСтруктуруДанныхСтрокиТЧРаспределениеМатериала()  
	СтруктураВозврата = Новый Структура;
	Для Каждого Колонка из Объект.РаспределениеМатериала.Выгрузить().Колонки Цикл 
		СтруктураВозврата.Вставить(Колонка.Имя);
	КонецЦикла; 
	Возврат СтруктураВозврата;
КонецФункции

&НаСервере
Функция ПолучитьВариантОбеспеченияИзРегистра(Номенклатура, ЭтапПроизводства)
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСписание.Установить(Не Объект.Резерв);
	НЗ.Отбор.Номенклатура.Установить(Номенклатура);
	НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства);
	НЗ.Прочитать();
	Если НЗ.Количество() > 0 Тогда 
	//Для Каждого стрНЗ из НЗ Цикл 
		ВариантОбеспеченияДо = НЗ[0].ВариантОбеспечения;
	Иначе 
		ВариантОбеспеченияДо = Перечисления.ВариантыОбеспечения.КОбеспечению;
	КонецЕсли; 
	Возврат ВариантОбеспеченияДо;
КонецФункции

&НаКлиенте
Процедура МатериалыСпецификацииПередУдалением(Элемент, Отказ)
	//ИсходныеДанныеСтрокиМатериаловСпецификации   
	УдалитьСтрокиРегистраСОтбором(ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура,,не Объект.Резерв);
КонецПроцедуры

&НаСервере
Процедура МатериалыСпецификацииУстановитьВариантОбеспечения(ВариантОбеспеченияНовый, Обособленно)
	Для Каждого СтрТЧ из Объект.МатериалыСпецификации Цикл 
		ТекНоменклатура = СтрТЧ.Номенклатура;
		ТекОстаток = СтрТЧ.Остаток;
		ОбрабатываемаяСтрока = ИсходныеДанныеСтрокиМатериаловСпецификации;
		ЗаполнитьЗначенияСвойств(ОбрабатываемаяСтрока,СтрТЧ);
		
		Если СтрТЧ.ВариантОбеспечения = ВариантОбеспеченияНовый Тогда
			Продолжить;
		Иначе   
			
			ДанныеСтроки = Новый Структура("Номенклатура, ЭтапПроизводства");
			ДанныеСтроки.Номенклатура = СтрТЧ.Номенклатура; 
			ДанныеПоНоменклатуре = ПолучитьДанныеРегистраПоНоменклатуре(СтрТЧ.Номенклатура);
			
			КоличествоРасход = ДанныеПоНоменклатуре.Расход; //Объект.РаспределениеМатериала.Итог("Количество");
			Если ТекОстаток - КоличествоРасход < 0 Тогда //СтрТЧ.Количество
				Сообщить("Номенклатура " + СтрТЧ.Номенклатура + " недостаточно остатка в наличии на складе для отгрузки!");
				Продолжить;
			КонецЕсли;  
			ТекОстаток = ТекОстаток-КоличествоРасход;
			
			//ДанныеСтроки = Новый Структура("Номенклатура, ЭтапПроизводства");
			////ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрТЧ);
			//ДанныеСтроки.Номенклатура = СтрТЧ.Номенклатура;  
			////ДанныеСтроки.ЭтапПроизводства = СтрТЧ.
			////Обособленно = Ложь;
			УстановитьВариантОбеспеченияНовая(ВариантОбеспеченияНовый,Обособленно,не Объект.Резерв,ДанныеСТроки);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОбеспеченияНовая(ВариантОбеспеченияНовый, Обособленно, ЭтоСписание, СтруктураОтбора)
	
	ВО_Зарезервировать = Перечисления.ВариантыОбеспечения.СоСклада;
	ВО_Отгрузить = Перечисления.ВариантыОбеспечения.Отгрузить;
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());  
	Если СтруктураОтбора.свойство("Номенклатура") и ЗначениеЗаполнено(СтруктураОтбора.Номенклатура) Тогда 
		НЗ.Отбор.Номенклатура.Установить(СтруктураОтбора.Номенклатура);        
	КонецЕсли;
	Если СтруктураОтбора.Свойство("ЭтапПроизводства") и ЗначениеЗаполнено(СтруктураОтбора.ЭтапПроизводства) Тогда 
		НЗ.Отбор.ЭтапПроизводства.Установить(СтруктураОтбора.ЭтапПроизводства)
	КонецЕсли;
	НЗ.Прочитать();       
	ОстатокРасределения = 0;  
	МассивНоменклатурыБезОстатка = Новый Массив;
	Для Каждого СтрНЗ из НЗ Цикл   
		Если СтрНЗ.КоличествоУпаковок = 0 или СтрНЗ.Количество = 0 Тогда     
			Если ВариантОбеспеченияНовый = ВО_Отгрузить Тогда 
				СтрокаОкончание = " Материал не отгружен!";
			ИначеЕсли ВариантОбеспеченияНовый = ВО_Зарезервировать Тогда 
				СтрокаОкончание = " Материал не зарезервирован!";
			Иначе 
				СтрокаОкончание = "";
			КонецЕсли;
			Сообщить("Не указано количество материала "+СтрНЗ.Номенклатура + " по этапу " + СтрНЗ.ЭтапПроизводства + СтрокаОкончание);
			Если не СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
				СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
				СтрНЗ.Обособленно = Истина;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Если СтрНЗ.Остаток <= 0 Тогда 
			Если МассивНоменклатурыБезОстатка.Найти(СтрНЗ.Номенклатура) = Неопределено Тогда 
				МассивНоменклатурыБезОстатка.Добавить(СтрНЗ.Номенклатура);
			КонецЕсли;
			//Продолжить;
		КонецЕсли;
		Если ОстатокРасределения = 0 Тогда 
			ОстатокРасределения = СтрНЗ.Остаток;
		КонецЕсли;                   
		Числитель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Числитель),СтрНЗ.Упаковка.Числитель,1);
		Знаменатель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Знаменатель),СтрНЗ.Упаковка.Знаменатель,1);
		Если ОстатокРасределения < СтрНЗ.КоличествоУпаковок Тогда 
			//29.05.2025
			СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
			СтрНЗ.Обособленно = Истина;
			СтрНЗ.ОтборПоВариантамОбеспечения = 1;  
			Продолжить;
			//-
			
			//+Закомментировала 29.05.2025
			//СтрНЗ.КоличествоУпаковок = ОстатокРасределения;
			//Числитель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Числитель),СтрНЗ.Упаковка.Числитель,1);
			//Знаменатель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Знаменатель),СтрНЗ.Упаковка.Знаменатель,1);
			//СтрНЗ.Количество = СтрНЗ.КоличествоУпаковок * Числитель / Знаменатель;
			//-
		КонецЕсли;		
		Если СтруктураОтбора.Свойство("ПодборНаТСД") и ЗначениеЗаполнено(СтруктураОтбора.ПодборНаТСД) Тогда 
			Если не ЗначениеЗаполнено(СтрНЗ.ПодобраноНаТСД) Тогда  
				Продолжить;
			КонецЕсли;  
			Если СтрНЗ.ВариантОбеспечения = ВО_Зарезервировать или СтрНЗ.ВариантОбеспечения = ВО_Отгрузить Тогда 
				СтрНЗ.КоличествоУпаковок = СтрНЗ.КоличествоУпаковок + СтрНЗ.ПодобраноНаТСД;
			Иначе 
				СтрНЗ.КоличествоУпаковок = СтрНЗ.ПодобраноНаТСД;
			КонецЕсли;  
			СтрНЗ.ПодобраноНаТСД = 0;
			СтрНЗ.Количество = СтрНЗ.КоличествоУпаковок * Числитель / Знаменатель;
		КонецЕсли;      
		СтрНЗ.ВариантОбеспечения = ВариантОбеспеченияНовый;              
		СтрНЗ.Обособленно = Обособленно;
		Если ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
			СтрНЗ.ОтборПоВариантамОбеспечения = 5;
		ИначеЕсли ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.СоСклада Тогда
			СтрНЗ.ОтборПоВариантамОбеспечения = 4;
		ИначеЕсли ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда
			СтрНЗ.ОтборПоВариантамОбеспечения = 3;
		ИначеЕсли ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
			СтрНЗ.ОтборПоВариантамОбеспечения = 1;
		КонецЕсли; 
		//Если не Обособленно Тогда         
		//	Назначение = Справочники.Назначения.ПустаяСсылка();
		//Иначе 
		//	Если не ЗначениеЗаполнено(СтрНЗ.Назначение) Тогда 
		//		Назначение = СтрНЗ.ЭтапПроизводства.НазначениеПродукция;
		//	КонецЕсли;
		//КонецЕсли;                                                      
		Назначение = СтрНЗ.ЭтапПроизводства.НазначениеПродукция;
		СтрНЗ.Назначение = Назначение;
		СтрНЗ.НазначениеОбеспечения = Назначение;
	КонецЦикла; 
	НЗ.Записать();
	
	Если МассивНоменклатурыБезОстатка.Количество() > 0 Тогда                                                
		ТекстСообщения = "";
		Для Каждого Номенклатура из МассивНоменклатурыБезОстатка Цикл  
			Если ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
				ТекстСообщения = ТекстСообщения + "Остаток отсутствует! Не зарезервировано количество по номенклатуре "+ СтрНЗ.Номенклатура + Символы.ПС;
			ИначеЕсли ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
				ТекстСообщения = ТекстСообщения + "Остаток отсутствует! Не отгружено количество по номенклатуре "+ СтрНЗ.Номенклатура + Символы.ПС;
			КонецЕсли;
		КонецЦикла;     
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда 
			Сообщить(ТекстСообщения);
		КонецЕсли;  
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция ПолучитьДанныеРегистраПоНоменклатуре(Номенклатура)
	
	ДанныеРегистра = Новый Структура("Остаток,Расход,РасходПоТСД");
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Номенклатура.Установить(Номенклатура);
	НЗ.Отбор.ЭтоСписание.Установить(не Объект.Резерв);
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Прочитать();
	ТЗ = НЗ.Выгрузить();                               
	Расход = ТЗ.Итог("Количество");
	РасходПоТСД = ТЗ.Итог("ПодобраноНаТСД");
	Остаток = ТЗ[0].Остаток;
	
	ДанныеРегистра.Остаток = Остаток;
	ДанныеРегистра.Расход = Расход;
	ДанныеРегистра.РасходПоТСД = РасходПоТСД;
	
	Возврат ДанныеРегистра;
	
КонецФункции

&НаСервере
Процедура ОтгрузитьСтрокиРегистраПоОтбору(ЭтоСписание)   
	
	//Для Каждого СтрМатериал из Объект.МатериалыСпецификации Цикл 
	//	ТекНоменклатура = СтрМатериал.Номенклатура;
	//	ТекОстаток = СтрМатериал.Остаток;
	//	ОбрабатываемаяСтрока = ИсходныеДанныеСтрокиМатериаловСпецификации;
	//	ЗаполнитьЗначенияСвойств(ОбрабатываемаяСтрока,СтрМатериал);
	//	Если не ОбрабатываемаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда                           
	//		СтруктураОтбора = Новый Структура("Номенклатура,ЭтапПроизводства"); 
	//		ЗаполнитьЗначенияСвойств(СтруктураОтбора,ОбрабатываемаяСтрока);
	//		УстановитьВариантОбеспеченияНовая(Перечисления.ВариантыОбеспечения.Отгрузить, ОбрабатываемаяСтрока.Обособленно, Истина, СтруктураОтбора);
	//	КонецЕсли;
	//	//Для Каждого СтрЭтап из Объект.РаспределениеМатериала Цикл 
	//	//	ОбрабатываемаяСтрока.ЭтапПроизводства = СтрЭтап.ЭтапПроизводства;
	//	//	
	//	////
	//	//КонецЦикла;
	//	
	//КонецЦикла;
	
	
	
	//*************************
	//Для Каждого СтрокаДерева из Дерево.Строки Цикл 
	//	Если ТекНоменклатура <> СтрокаДерева.Номенклатура Тогда // строка 1 уровня. Зафиксируем данные по номенкдатуре и остаткам на складе.
	//		ТекНоменклатура = СтрокаДерева.Номенклатура;
	//		ТекОстаток = СтрокаДерева.Остаток;
	//	КонецЕсли;
	//	//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
	//	Для Каждого Стр из СтрокаДерева.Строки Цикл 
	//		Если ЗначениеЗаполнено(Отбор) и Стр.ВариантОбеспечения <> Отбор Тогда 
	//			Продолжить;
	//		ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
	//			//или Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно Тогда 
	//			Продолжить;
	//		КонецЕсли;
	//		Если ТекНоменклатура = Стр.Номенклатура тогда
	//			ТекОстаток = ТекОстаток - Стр.Обеспечить;
	//		КонецЕсли;
	//		Если ТекОстаток >= 0 Тогда			
	//			НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	//			НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	//			НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	//			НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
	//			НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
	//			Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
	//				НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
	//			ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
	//				НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
	//			КонецЕсли;
	//			Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
	//				НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериала);
	//			ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда
	//				НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериалаРезервирование);
	//			КонецЕсли;
	//			НЗ.Прочитать(); 
	//			ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Отгрузить;
	//			Если НЗ.Количество() = 1 Тогда 
	//				Для Каждого СтрНЗ из НЗ Цикл 
	//						Если Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
	//							//или Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьИзЗаказов тогда
	//							Количество = Стр.Зарезервировать; 
	//						ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления
	//							ИЛИ Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
	//							Количество = Стр.Обеспечить;
	//						//ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОбособленно Тогда  
	//						//	Количество = Стр.Обеспечить;
	//						Иначе 
	//							Количество = 0;
	//						КонецЕсли;
	//						СтрНЗ.Количество = Количество;
	//						СтрНЗ.ВариантОбеспечения = ВариантОбеспеченияНовый;
	//						СтрНЗ.Обособленно = Ложь;
	//						СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();
	//						
	//						ИндексВариантаОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Индекс(ВариантОбеспеченияНовый);
	//						ИмяПеречисления = Строка(Метаданные.Перечисления.ВариантыОбеспечения.ЗначенияПеречисления[ИндексВариантаОбеспеченияНовый]);
	//						
	//						СтрНЗ.ОтборПоВариантамОбеспечения = СоответствиеВариантовОбеспеченияОтбору[ИмяПеречисления];
	//						СтрНЗ.Обеспечить = ?(ЗначениеЗаполнено(СтрНЗ.Обеспечить),СтрНЗ.Обеспечить,0) - ?(ЗначениеЗаполнено(Количество),Количество,0);
	//					//В регистре только исходный остаток - его не изменяем!!!
	//				КонецЦикла;
	//				ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
	//				Если не ЭлементОтбора = Неопределено Тогда 
	//					ЭлементОтбора.Использование = Ложь;
	//				КонецЕсли;
	//				НЗ.Записать();
	//			ИначеЕсли НЗ.Количество() > 1 Тогда 
	//				//Найти запись с нужным вариантом обеспечения
	//				Сообщить("Найдено более 1 строки в регистре, уточните условия поиска "+стр.Номенклатура + " " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
	//			Иначе 
	//				Сообщить("Не найдена строка регистра для корректировки данных, "+стр.Номенклатура + " " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
	//			КонецЕсли;
	//		Иначе 
	//			Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
	//		КонецЕсли;
	//	КонецЦикла;				
	//КонецЦикла;
	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗарезервироватьПоДанымТСДнаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "";
	//Запрос.УстановитьПараметр();
	//Выборка = Запрос.Выполнить().Выгрузить();   
	
	//МассивЭтапов = Новый Массив;
	Для Каждого Этап из Этапы Цикл 
		Если не Этап.Обрабатывать Тогда 
			Продолжить;
		КонецЕсли;
			//МассивЭтапов.Добавить(Этап.ЭтапПроизводства);
		СтруктураОтбора = Новый Структура("ЭтапПроизводства,ПодборНаТСД",Этап.ЭтапПроизводства,Истина);
		УстановитьВариантОбеспеченияНовая(Перечисления.ВариантыОбеспечения.СоСклада,Ложь,не Объект.Резерв,СтруктураОтбора);
	КонецЦикла;	
	
	ДокОбъект = Объект.ДокументПодбораМатериалов.ПолучитьОбъект();
	ДокОбъект.Статус= Перечисления.ТТМ_СтатусыПодбораМатериалов.Обработан;
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		Сообщить("Ошибка Записи документа " + ДокОбъект.Ссылка + " " + ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗарезервироватьПоДанымТСД(Команда)
	ЗарезервироватьПоДанымТСДнаСервере();
	ОбновитьМатериалыСпецификации(Ложь);
	//УстановитьУсловноеОформлениеМатериаловСпецификации();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПодбораНовая(Знач ВыгруженнаяТаблица = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТТМ_ПодборМатериаловПоСпецификацииЭтапы.ЭтапПроизводства) КАК КоличествоЭтапов,
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка КАК Ссылка,
	               |	СУММА(ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Запланировано) КАК Запланировано
	               |ПОМЕСТИТЬ КоличествоЭтаповДокумента
	               |ИЗ
	               |	Документ.ТТМ_ПодборМатериаловПоСпецификации.Этапы КАК ТТМ_ПодборМатериаловПоСпецификацииЭтапы
	               |ГДЕ
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Проведен
	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Ответственный = &Пользователь
	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Статус = &СтатусДокумента
	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Номер = &НомерДокумента
	               |	И НАЧАЛОПЕРИОДА(ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка КАК Упаковка,
	               |	ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК УпаковкаСпецификации,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Номенклатура
	               |			ТОГДА ВЫБОР
	               |					КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка))
	               |						ТОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок, 0) * ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Запланировано
	               |					ИНАЧЕ ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок, 0) * ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Запланировано / ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель, 1) * ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель, 1)
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Норматив,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество КАК КоличествоУпаковок,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель, 1) = 1
	               |			ТОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / 1 * ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Знаменатель, 1)
	               |		КОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель = 0
	               |			ТОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / 1 * 1
	               |		ИНАЧЕ ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель, 1) * ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Знаменатель, 1)
	               |	КОНЕЦ КАК Количество,
	               |	ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок, 0) КАК КоличествоУпаковокСпецификации,
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Назначение КАК Назначение,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация КАК Спецификация,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Склад КАК Склад,
	               |	КоличествоЭтаповДокумента.КоличествоЭтапов КАК КоличествоЭтапов,
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Запланировано КАК Запланировано,
	               |	КоличествоЭтаповДокумента.Запланировано КАК ЗапланированоВсего,
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка КАК ДокументПодбора
	               |ИЗ
	               |	Документ.ТТМ_ПодборМатериаловПоСпецификации.ОбеспечениеМатериаламиИРаботами КАК ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТТМ_ПодборМатериаловПоСпецификации.Этапы КАК ТТМ_ПодборМатериаловПоСпецификацииЭтапы
	               |		ПО ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка = ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоЭтаповДокумента КАК КоличествоЭтаповДокумента
	               |		ПО (КоличествоЭтаповДокумента.Ссылка = ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |		ПО (ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация = ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Ссылка, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяССылка)))
	               |			И (ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Номенклатура = ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяССылка)))
	               |ГДЕ
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Ответственный = &Пользователь
	               |	И ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Проведен
	               |	И ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Статус = &СтатусДокумента
	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка В
	               |			(ВЫБРАТЬ ПЕРВЫЕ 1
	               |				Т.Ссылка
	               |			ИЗ
	               |				КоличествоЭтаповДокумента КАК Т)
	               |	И ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Подобрано <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДокументПодбора,
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ"; 
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Объект.ДокументПодбораМатериалов.Дата)); 
	Запрос.УстановитьПараметр("НомерДокумента", Объект.ДокументПодбораМатериалов.Номер);
	Запрос.УстановитьПараметр("СтатусДокумента", Перечисления.ТТМ_СтатусыПодбораМатериалов.Собран);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда 
		ВыгруженнаяТаблица = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Возврат ВыгруженнаяТаблица;
КонецФункции

&НаСервере
Процедура ЗагрузитьПодборНаСервере()
	
	ПараметрыОтбора = Новый Структура("Обрабатывать",Истина);
	МассивЭтаповОбработки = Этапы.Выгрузить(ПараметрыОтбора,"ЭтапПроизводства");
	МассивЭтаповОбработки.Свернуть("ЭтапПроизводства");
	//МассивЭтаповДокумента = Объект.ДокументПодбораМатериалов.Этапы.Выгрузить(,"ЭтапПроизводства");
	//МассивОтсутствующихЭтапов = Новый Массив;
	ТекстСообщения = "";
	Для Каждого СтрЭтап из Объект.ДокументПодбораМатериалов.Этапы Цикл 
		Если МассивЭтаповОбработки.Найти(СтрЭтап.ЭтапПроизводства) = Неопределено Тогда 
			ТекстСообщения = ТекстСообщения + СтрЭтап.ЭтапПроизводства + Символы.ПС;
			//МассивОтсутствующихЭтапов.Добавить(СтрЭтап.ЭтапПроизводства); 			
		КонецЕсли; 
	КонецЦикла;
	Если ТекстСообщения <> "" Тогда 
		Сообщить("Данные не загружены! Не выбраны этапы для переноса данных "+Символы.ПС + ТекстСообщения, СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	//ТабПодбора = ПолучитьТаблицуПодбора();   
	ТабПодбора = ПолучитьТаблицуПодбораНовая();   
	Если ТабПодбора = Неопределено Тогда 
		Сообщить("Нет данных для загрузки");
		Возврат;
	КонецЕсли;
	
	ОстатокРезервирования = 0;              
	КоличествоУпаковокРезервирования = 0;          
	НезарезервированныйОстаток = 0;
	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();   
	НомерЭтапа = 0;
	Для Каждого СтрПодбора из ТабПодбора Цикл     
		
		ДобавитьСтрокуДоНорматива = Ложь;
		Норматив = ?(ЗначениеЗаполнено(СтрПодбора.Норматив), СтрПодбора.Норматив, 0);
		Если не ТекНоменклатура = СтрПодбора.Номенклатура Тогда 
			ТекНоменклатура = СтрПодбора.Номенклатура;
			ОстатокРезервирования = СтрПодбора.КоличествоУпаковок;   
			НомерЭтапа = СтрПодбора.КоличествоЭтапов;
		Иначе    
			//Если ОстатокРезервирования - СтрПодбора.Норматив >= 0 Тогда 
			//	ОстатокРезервирования = ОстатокРезервирования - СтрПодбора.Норматив;
			//Иначе 
			//	ОстатокРезервирования = 0;
			//КонецЕсли;
		КонецЕсли;  
		Если Норматив <> 0 Тогда 
			Если ОстатокРезервирования - Норматив >= 0 Тогда 
				КоличествоУпаковокРезервирования = СтрПодбора.Норматив;
			ИначеЕсли ОстатокРезервирования > 0 Тогда 
			    КоличествоУпаковокРезервирования = ОстатокРезервирования;  
				НезарезервированныйОстаток = СтрПодбора.Норматив - КоличествоУпаковокРезервирования;
			Иначе 
				КоличествоУпаковокРезервирования = 0;
			КонецЕсли;
			//ПодобраноПоСтроке = СтрПодбора.КоличествоУпаковок;
		Иначе 
			Если УпаковкаШтуки(СтрПодбора.Упаковка) Тогда 
				//+21.08.2025                                                                                                               
				Если ОстатокРезервирования / СтрПодбора.ЗапланированоВсего = Цел(ОстатокРезервирования / СтрПодбора.ЗапланированоВсего) Тогда 
				//Если ОстатокРезервирования / СтрПодбора.КоличествоЭтапов = Цел(ОстатокРезервирования / СтрПодбора.КоличествоЭтапов) Тогда 
					//КоличествоУпаковокРезервирования = ОстатокРезервирования / СтрПодбора.КоличествоЭтапов;
					КоличествоУпаковокРезервирования = ОстатокРезервирования / СтрПодбора.ЗапланированоВсего * СтрПодбора.Запланировано;
				Иначе
					Если НомерЭтапа = СтрПодбора.КоличествоЭтапов Тогда
						КоличествоУпаковокРезервирования = ОстатокРезервирования;
					Иначе 
						КоличествоУпаковокРезервирования = 1;
					КонецЕсли;
				КонецЕсли; 
			Иначе 
				//КоличествоУпаковокРезервирования = ОстатокРезервирования / СтрПодбора.КоличествоЭтапов;
				КоличествоУпаковокРезервирования = ОстатокРезервирования / СтрПодбора.ЗапланированоВсего * СтрПодбора.Запланировано;
			КонецЕсли;
		КонецЕсли;
		
		
		СтруктураИзменяемыхДанных = Новый Структура;
		СтруктураИзменяемыхДанных.Вставить("Номенклатура", СтрПодбора.Номенклатура);
		СтруктураИзменяемыхДанных.Вставить("ЭтапПроизводства", СтрПодбора.ЭтапПроизводства);
		
		//СтруктураИзменяемыхДанных.Вставить("ПодборНаТСД",Истина);
		СтруктураОтбора = Новый Структура("Номенклатура, ЭтапПроизводства,ПодборНаТСД,ПодборУпаковка");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора,СтруктураИзменяемыхДанных);
		СтруктураОтбора.ПодборУпаковка = СтрПодбора.Упаковка;
		Если КоличествоУпаковокРезервирования >= СтрПодбора.Норматив Тогда  
			СтруктураИзменяемыхДанных.Вставить("ВариантОбеспеченияНовый", Перечисления.ВариантыОбеспечения.СоСклада);
			СтруктураОтбора.ПодборНаТСД = КоличествоУпаковокРезервирования; //СтрПодбора.КоличествоУпаковок;
		Иначе
			Если КоличествоУпаковокРезервирования > 0 Тогда 
				СтруктураИзменяемыхДанных.Вставить("ВариантОбеспеченияНовый", Перечисления.ВариантыОбеспечения.СоСклада);
				СтруктураОтбора.ПодборНаТСД = КоличествоУпаковокРезервирования; //СтрПодбора.КоличествоУпаковок;
				ДобавитьСтрокуДоНорматива = Истина; 
				//НезарезервированныйОстаток = СтрПодбора.Норматив - КоличествоУпаковокРезервирования;
			Иначе 
				СтруктураИзменяемыхДанных.Вставить("ВариантОбеспеченияНовый", Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления);
				СтруктураОтбора.ПодборНаТСД = СтрПодбора.Норматив;
			КонецЕсли;
		КонецЕсли;
		ИзменитьСтрокуРегистра(СтруктураИзменяемыхДанных,СтруктураОтбора);   
		Если ДобавитьСтрокуДоНорматива Тогда 
			СтруктураИзменяемыхДанных.Вставить("ВариантОбеспеченияНовый", Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления);
			СтруктураОтбора.ПодборНаТСД = НезарезервированныйОстаток;
			//Добавить строку в регистр копированием текущей
			НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
			НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
			НЗ.Отбор.ЭтоСписание.Установить(не Объект.Резерв);
			НЗ.Отбор.Номенклатура.Установить(СтрПодбора.Номенклатура);
			НЗ.Отбор.ЭтапПроизводства.Установить(СтрПодбора.ЭтапПроизводства);
			НЗ.Прочитать();
			Для Каждого СтрНЗ из НЗ Цикл 
				НоваяСтрока = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрНЗ);
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
				НоваяСтрока.КоличествоУпаковок = НезарезервированныйОстаток;
				НЗ.Записать();
				Прервать;
			КонецЦикла;  
		КонецЕсли; 
		
		//Если ОстатокРезервирования - СтрПодбора.Норматив >= 0 Тогда 
		//	ОстатокРезервирования = ОстатокРезервирования - СтрПодбора.Норматив;
		//Иначе 
		//	ОстатокРезервирования = ОстатокРезервирования - КоличествоУпаковокРезервирования;
		//КонецЕсли;                                                                           
		ОстатокРезервирования = ОстатокРезервирования - КоличествоУпаковокРезервирования;
		НомерЭтапа = НомерЭтапа + 1;
		
	КонецЦикла;   
	Сообщить("Загрузка материалов, подобранных на ТСД завершена!");
	 
	ДокОбъект = Объект.ДокументПодбораМатериалов.ПолучитьОбъект();
	ДокОбъект.Статус= Перечисления.ТТМ_СтатусыПодбораМатериалов.Обработан;
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		Сообщить("Ошибка Записи документа " + ДокОбъект.Ссылка + " " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаПодбораПродолжение(РезультатЗакрытия,ДопПараметры) Экспорт
	
	//ЗарезервироватьПоДанымТСДнаСервере();
	//ПоЭтапам = Ложь;
	//ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	////УстановитьУсловноеОформлениеМатериаловСпецификации();
КонецПроцедуры

&НаКлиенте
Процедура ПереводОперацииПродолжение(Результат,ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда 
		//ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаЭтапы;
		//Новая_ЗаполнитьЭтапыНаСервере();      
		Для Каждого СтрЭтап из Этапы Цикл 
			Если не СтрЭтап.Обрабытывать Тогда 
				Продолжить;
			Иначе 
				Если СтрЭтап.КоличествоУпаковокФакт < 0.5 Тогда 
					Сообщить("Не по всем этапам произведен выпуск! Вернитесь на страницу ""Этапы"" и выберите выпущенные!", СтатусСообщения.ОченьВажное);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Элементы.РаспределениеМатериалаРезерв.Видимость = Объект.Резерв;
		Элементы.РаспределениеМатериалаМягкиРезерв.Видимость = Объект.Резерв;
		Элементы.РаспределениеМатериалаОтгрузить.Видимость = не Объект.Резерв;
		
		ПроверитьУстановитьЭтоСписание();
	Иначе 
		Объект.Резерв = Не Объект.Резерв;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура РаспределениеМатериалаРезервПриИзменении(Элемент)  
	
	СтруктураИзменяемыхДанных = Новый Структура;
	//РаспределениеМатериалаРезервПриИзмененииНаСервере();   
	ТекСтрокаМатериалыСпецификации = Элементы.МатериалыСпецификации.ТекущаяСтрока;
	//ИДТекСтрокаМатериалыСпецификации = ТекСтрокаМатериалыСпецификации.ПолучитьИнентификатор();
	ТекСтрока = Элементы.РаспределениеМатериала.ТекущиеДанные;   
	
	Если ТекСтрока.Резерв Тогда 
		ТекСтрока.МягкийРезерв = Не ТекСтрока.Резерв; 
		СтруктураИзменяемыхДанных.Вставить("ВариантОбеспеченияНовый",ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"));
	Иначе 
		Если ТекСтрока.МягкийРезерв Тогда 
			СтруктураИзменяемыхДанных.Вставить("ВариантОбеспеченияНовый",ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления"));
		//ИначеЕсли Тогда  
			
		КонецЕсли;
	КонецЕсли;
	//ТекСтрокаНомер = Элементы.РаспределениеМатериала.ТекущаяСтрока; //Элемент.Родитель.ТекущаяСтрока;
	ЭтапПроизводства = ТекСтрока.ЭтапПроизводства;
	ИДТекСтрокираспределениеМатериала = Элементы.РаспределениеМатериала.ТекущиеДанные.ПолучитьИдентификатор(); 
	
	
	
	
	ДанныеСтрокиРаспределенияМатериалов = ПолучитьСтруктуруДанныхСтрокиТЧРаспределениеМатериала();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиРаспределенияМатериалов,ТекСтрока);   
	
	//ТекСтрокаМатериалыСпецификации = Элементы.МатериалыСпецификации.ТекущиеДанные;
	//ТекНоменклатура = ТекСтрокаМатериалыСпецификации.Номенклатура;
	
	//Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
		ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
		ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
		Номенклатура = ТекСтрока.Номенклатура;
	Иначе            
		Если Объект.МатериалыСпецификации.Количество() > 0 Тогда 
			ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(0);
			ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
			Номенклатура = ТекущаяНоменклатура;
		КонецЕсли;
	КонецЕсли;
	
	ЗаписатьИзмененияВРегистрНовая(ДанныеСтрокиРаспределенияМатериалов, ИсходныеДанныеСтрокиМатериаловСпецификации, ЭтапПроизводства, "ВариантОбеспечения"); 
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	
	//Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
		ТекСтрока = МассивСтрокПоНоменклатуре[0]; //Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;     
	
	//29.05.2025
	ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекущаяНоменклатура);   
	//-
	
	//+Ганьшина Е. 29.04.2025
	//Восстановим ТекущуюСтрокуТЧ РАспределениематериалов
	ПараметрыОтбораРАспределениеМатериалов = Новый Структура("ЭтапПроизводства", ТекущийЭтап);
	МассивНайденныхСтрок = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыОтбораРАспределениеМатериалов);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		ТекСтр = МассивНайденныхСтрок[0];
		Элементы.РаспределениеМатериала.ТекущаяСтрока = ТекСтр.ПолучитьИдентификатор();
	Иначе 
		Элементы.РаспределениеМатериала.ТекущаяСтрока = 0;
	КонецЕсли;   
	//- Ганьшина Е
	
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(Номенклатура);   
	//
	//Если Элементы.РаспределениеМатериала.ТекущаяСтрока = Неопределено Тогда 
	//	Элементы.РаспределениеМатериала.ТекущаяСтрока = ИДТекСтрокираспределениеМатериала;
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РаспределениеМатериалаМягкиРезервПриИзмененииНаСервере()
	//РаспределениеМатериалаРезервПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеМатериалаМягкиРезервПриИзменении(Элемент)
	ТекСтрока = Элементы.РаспределениеМатериала.ТекущиеДанные;
	//ТекСтрока.Резерв = Не ТекСтрока.МягкийРезерв;         
	Если ТекСтрока.Резерв Тогда 
		ТекСтрока.Резерв = не ТекСтрока.МягкийРезерв;
	Иначе     
		
	КонецЕсли;
	//ТекСтрокаНомер = Элементы.РаспределениеМатериала.ТекущаяСтрока; //Элемент.Родитель.ТекущаяСтрока;
	ЭтапПроизводства = ТекСтрока.ЭтапПроизводства;
	ИДТекСтроки = Элементы.РаспределениеМатериала.ТекущиеДанные.ПолучитьИдентификатор();
	
	ДанныеСтрокиРаспределенияМатериалов = ПолучитьСтруктуруДанныхСтрокиТЧРаспределениеМатериала();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиРаспределенияМатериалов,ТекСтрока);   
	
	ТекСтрокаМатериалыСпецификации = Элементы.МатериалыСпецификации.ТекущиеДанные;
	ТекНоменклатура = ТекСтрокаМатериалыСпецификации.Номенклатура;
	
	//Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
		ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
		ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
		Номенклатура = ТекСтрока.Номенклатура;
	Иначе  
		Если ЗначениеЗаполнено(Элемент.Родитель.ТекущиеДанные.Номенклатура) Тогда 
			Номенклатура = ЗначениеЗаполнено(Элемент.Родитель.ТекущиеДанные.Номенклатура);
		КонецЕсли;
	КонецЕсли;
	
	ЗаписатьИзмененияВРегистрНовая(ДанныеСтрокиРаспределенияМатериалов, ИсходныеДанныеСтрокиМатериаловСпецификации, ЭтапПроизводства, "ВариантОбеспечения"); 
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	
	//Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
		ТекСтрока = МассивСтрокПоНоменклатуре[0]; //Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;        
	
	//+Ганьшина Е. 29.04.2025
	//Восстановим ТекущуюСтрокуТЧ РАспределениематериалов
	ПараметрыОтбораРАспределениеМатериалов = Новый Структура("ЭтапПроизводства", ТекущийЭтап);
	МассивНайденныхСтрок = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыОтбораРАспределениеМатериалов);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		ТекСтр = МассивНайденныхСтрок[0];
		Элементы.РаспределениеМатериала.ТекущаяСтрока = ТекСтр.ПолучитьИдентификатор();
	Иначе 
		Элементы.РаспределениеМатериала.ТекущаяСтрока = 0;
	КонецЕсли;   
	//- Ганьшина Е
	
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекНоменклатура);   
	//
	//Если Элементы.РаспределениеМатериала.ТекущаяСтрока = Неопределено Тогда 
	//	Элементы.РаспределениеМатериала.ТекущаяСтрока = ИДТекСтроки;
	//КонецЕсли;
КонецПроцедуры       

&НаКлиенте
Процедура РаспределениеМатериалаОтгрузитьПриИзменении(Элемент)
	ТекСтрока = Элементы.РаспределениеМатериала.ТекущиеДанные;

	Если ТекСтрока.Отгрузить Тогда 
		Если ТекСтрока.Резерв Тогда 
			ТекСтрока.Резерв = Ложь;
		ИначеЕсли ТекСтрока.МягкийРезерв Тогда 
			ТекСтрока.МягкийРезерв = Ложь;
		КонецЕсли;
	Иначе
		ТекСтрока.МягкийРезерв = Истина;
	КонецЕсли; 
		
	//ТекСтрокаНомер = Элементы.РаспределениеМатериала.ТекущаяСтрока; //Элемент.Родитель.ТекущаяСтрока;
	ЭтапПроизводства = ТекСтрока.ЭтапПроизводства;
	ИДТекСтроки = Элементы.РаспределениеМатериала.ТекущиеДанные.ПолучитьИдентификатор();
	
	ДанныеСтрокиРаспределенияМатериалов = ПолучитьСтруктуруДанныхСтрокиТЧРаспределениеМатериала();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиРаспределенияМатериалов,ТекСтрока);   
	
	ТекСтрокаМатериалыСпецификации = Элементы.МатериалыСпецификации.ТекущиеДанные;
	ТекНоменклатура = ТекСтрокаМатериалыСпецификации.Номенклатура; 
	
	//30.05.2025               
	//Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(ТекСтрока.Номенклатура, Объект.Склад, ТабЭтапы.ВыгрузитьКолонку("ЭтапПроизводства"), ТабЭтапы);	
	//Если ТекСтрока.Количество > Остаток Тогда 
	ТекСтрока.Отгрузить = Ложь;
	//КонецЕсли;
	
	ЗаписатьИзмененияВРегистрНовая(ДанныеСтрокиРаспределенияМатериалов, ИсходныеДанныеСтрокиМатериаловСпецификации, ЭтапПроизводства, "ВариантОбеспечения"); 
	
	//Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	Если ЗначениеЗаполнено(ТекущаяНоменклатура) Тогда 
		Номенклатура = ТекущаяНоменклатура;
	Иначе           
		Сообщить("АДМ Текущая номенклатура не найдена! Проверить заполнение Текущей номенклатуры!");
		//Объект.МатериалыСпецификации[0].Номенклатура;  
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
		ТекСтрокаМатериалыСпецификации = Элементы.МатериалыСпецификации[0];
		Номенклатура = ТекСтрокаМатериалыСпецификации.Номенкдатула;
	КонецЕсли;
	//Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
	//	ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	//	ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	//	Номенклатура = ТекСтрока.Номенклатура;
	//Иначе            
	//	Если Объект.МатериалыСпецификации.Количество() > 0 Тогда 
	//		//ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(0);
	//		//ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	//		//Номенклатура = ТекСтрока.Номенклатура;    
	//		Номенклатура = ТекущаяНоменклатура;
	//	КонецЕсли;
	//КонецЕсли;
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);   
	
	//Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
		ТекСтрока = МассивСтрокПоНоменклатуре[0]; //Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;
	
	//Обновить ТЧ РаспределениеМатериалов
	ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(Номенклатура); //ТекущаяНоменклатура;
	
	
	//+Ганьшина Е. 29.04.2025
	//Восстановим ТекущуюСтрокуТЧ РАспределениематериалов
	ПараметрыОтбораРаспределениеМатериалов = Новый Структура("ЭтапПроизводства", ТекущийЭтап);
	МассивНайденныхСтрок = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыОтбораРАспределениеМатериалов);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		ТекСтр = МассивНайденныхСтрок[0];
		Элементы.РаспределениеМатериала.ТекущаяСтрока = ТекСтр.ПолучитьИдентификатор();
	Иначе 
		Элементы.РаспределениеМатериала.ТекущаяСтрока = 0;
	КонецЕсли;   
	//- Ганьшина Е
	
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекНоменклатура);  
	//
	//Если Элементы.РаспределениеМатериала.ТекущаяСтрока = Неопределено Тогда 
	//	Элементы.РаспределениеМатериала.ТекущаяСтрока = ИДТекСтроки;
	//КонецЕсли;

КонецПроцедуры          

&НаСервере 
//Описание
//Данная вункция универсальная дл\ внесения изменений в строку регистра через интерфейс
//обработка 1 строки
//Структура изменяемых данных содержит следующие Ключи:
//Номенклатура    							| замена Номенлатуры
//НомерклатураНовая							| замена Номенлатуры
//ВариантОбеспеченияНовый                   | изменение варианта обеспечения
//КоличествоУпаковокОбщее					| изменение количества в ТЧ МатериалыСпецификации
//КоличествоУпаковок                        | изменение количества в ТЧ РаспределениеМатериала
//Этаппроизводства                          | передается всегда когда изменения в ТЧ РаспределениеМатериала    
//Добавить!!!
//ПодборНаТСД								| Резерв по подобранным на ТСД
//Отметка									| изменение отметки в ТЧ РаспределениеМАтериала
//СтруктураОтбора 							| содержит параметры отбора строки регистра (Номенклатура, ЭтапПроизводства, ПодборНаТСД)
Процедура ИзменитьСтрокуРегистра(СтруктураИзменяемыхДанных, СтруктураОтбора)
	
	Если СтруктураИзменяемыхДанных.Свойство("Номенклатура") Тогда
		Номенклатура = СтруктураИзменяемыхДанных.Номенклатура;
	КонецЕсли;                                                 
	Если СтруктураИзменяемыхДанных.Свойство("НоменклатураНовая") Тогда
		НоменклатураНовая = СтруктураИзменяемыхДанных.НоменклатураНовая;
	КонецЕсли;   
	Если СтруктураИзменяемыхДанных.Свойство("ВариантОбеспеченияНовый") Тогда
		ВариантОбеспеченияНовый = СтруктураИзменяемыхДанных.ВариантОбеспеченияНовый;
	КонецЕсли;
	Если СтруктураИзменяемыхДанных.Свойство("КоличествоУпаковокОбщее") Тогда
		НовоеКоличествоУпаковокОбщее = СтруктураИзменяемыхДанных.КоличествоУпаковокОбщее;
	КонецЕсли;
	Если СтруктураИзменяемыхДанных.Свойство("КоличествоУпаковок") Тогда
		НовоеКоличествоУпаковок = СтруктураИзменяемыхДанных.КоличествоУпаковок;
	КонецЕсли; 
	Если СтруктураИзменяемыхДанных.Свойство("ЭтапПроизводства") Тогда
		ЭтапПроизводства = СтруктураИзменяемыхДанных.ЭтапПроизводства;
	КонецЕсли;  
	Если СтруктураОтбора.Свойство("ПодборНаТСД") Тогда 
		ПодборНаТСД = СтруктураОтбора.ПодборНаТСД;
		ПодборУпаковка = СтруктураОтбора.ПодборУпаковка;
	Иначе 
		ПодборНаТСД = 0;                                
		ПодборУпаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;     
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	Если ЗначениеЗаполнено(ЭтапПроизводства) Тогда 
		//получим норматив для нового материала. 
		Нормативы = ПолучитьНормативыИзВременногоХранилища(ЭтапПроизводства);//(СтрНЗ.ЭтапПроизводства);
		Назначение = ЭтапПроизводства.НазначениеПродукция;
	Иначе 
		Нормативы = Неопределено;
		Назначение = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;
	
	ВО_Зарезервировать = Перечисления.ВариантыОбеспечения.СоСклада;
	ВО_Отгрузить = Перечисления.ВариантыОбеспечения.Отгрузить;
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.ЭтоСписание.Установить(не Объект.Резерв);
	НЗ.Отбор.Пользователь.Установить(Пользователь);
	НЗ.Отбор.Номенклатура.Установить(Номенклатура);
	Если ЗначениеЗаполнено(ЭтапПроизводства) Тогда 
		НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства);
	КонецЕсли;
	НЗ.Прочитать();
	Если НЗ.Количество() > 1 Тогда 
		Сообщить("Найдено более 1 записи регистра для изменения! Изменение не выполнено!",СтатусСообщения.ОченьВажное);
		Возврат;
	ИначеЕсли НЗ.Количество() = 0 Тогда          
		Если ПодборНаТСД <> 0 Тогда  
			//ДобавитьСтроку в регистр по команде "ЗарезервироватьПоДанным ТСД"
			
			//Эта процедура уже вызывается из цикла
			////ДанныеДокументаПодбора
			//ТЗ = Объект.ДокументПодбораМатериалов.ОбеспечениеМатериаламиИРаботами.Выгрузить(); 
			//ПараметрыОтбора = Новый Структура("Номенклатура", Номенклатура);
			//МассивСтрок = ТЗ.НайтиСтроки(ПараметрыОтбора);  
			//Для Каждого СтрНоменклатура из МассивСтрок Цикл
				НоваяСтрока = НЗ.Добавить();
				НоваяСтрока.Номенклатура = Номенклатура;
				НоваяСтрока.ЭтапПроизводства = ЭтапПроизводства;  
				//Обеспечение
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
				НоваяСтрока.ОтборПоВариантамОбеспечения = 4;
				НоваяСтрока.Обособленно = Ложь;
				НоваяСтрока.Назначение = ЭтапПроизводства.НазначениеПродукция; //Справочники.Назначения.ПустаяСсылка();
				//Норматив		
				//////////////////////////////////////////////////
				Если не Нормативы = Неопределено Тогда 
					СтруктураПоиска = Новый Структура("Номенклатура",Номенклатура); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
					МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
					Если МассивНайденныхСтрок.Количество() > 1 Тогда 
						Сообщить("Норматив: найдено более 1 строки! " + НоменклатураНовая);
					ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
						Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
					Иначе   
						Норматив = 0;
					КонецЕсли;      
				Иначе 
					Норматив = 0;
				КонецЕсли;
				//////////////////////////////////////////////////
				НоваяСтрока.Норматив = Норматив;
			 
				НоваяСтрока.КоличествоУпаковок =  ПодборНаТСД; //Номенклатура.КоличествоУпаковок;
				НоваяСтрока.Упаковка = ПодборУпаковка;
				Числитель = ?(ЗначениеЗаполнено(ПодборУпаковка.Числитель),ПодборУпаковка.Числитель,1);
				Знаменатель = ?(ЗначениеЗаполнено(ПодборУпаковка.Знаменатель),ПодборУпаковка.Знаменатель,1); 
				НоваяСтрока.Количество = НоваяСтрока.КоличествоУпаковок * Числитель / Знаменатель;
				НоваяСтрока.ПодобраноНаТСД = 0;
				
				/////////////////////////////////
				//Общие реквизиты                        
				
				НоваяСтрока.КлючСвязиСпецификация = Новый УникальныйИдентификатор();
				//НоваяСтрока.Обеспечить = НоваяСтрока
				//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");  
				ПараметрыПоиска = Новый Структура("Обрабатывать",Истина);    
				ТабЭтапы = Этапы.Выгрузить(ПараметрыПоиска,"ЭтапПроизводства,Спецификация");
				НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(НоменклатураНовая,Объект.Склад,ТабЭтапы.ВыгрузитьКолонку("ЭтапПроизводства"),ТабЭтапы);	
				//НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(Номенклатура, Объект.Склад, Этапы.Выгрузить(,"ЭтапПРоизводства"));
				//ОбработкаОбъект.ПолучитьОстаток_2_5(Номенклатура, Объект.Склад, Этапы.Выгрузить(,"ЭтапПРоизводства"));
				НоваяСтрока.КатегорияМатериала = ТТМ_ДанныеВыбораСервер.ПолучитьКатегориюМатериала(Номенклатура,Объект.ДР_КатегорияМатериала);
				НоваяСтрока.ПериодОтгрузки = ТекущаяДатаСеанса();
				НоваяСтрока.Подразделение = Объект.Склад.Подразделение;
				НоваяСтрока.Пользователь = Пользователь;
				НоваяСтрока.Склад = Объект.Склад;
				НоваяСтрока.Спецификация = Спецификация;
				НоваяСтрока.СтатьяКалькуляции = Объект.СтатьяКалькуляции;
				НоваяСтрока.ЭтапПроизводства = СтруктураОтбора.ЭтапПроизводства;
				НоваяСтрока.ЭтоСписание = не Объект.Резерв;
				
				НЗ.Записать();
			//КонецЦикла;
		Иначе 
			
		КонецЕсли;
		//Сообщить("Не найдено строк в регистре для изменения по номенклатуре " + Номенклатура + " Изменение не выполнено!",СтатусСообщения.ОченьВажное);
		//Возврат;// добавить в регистр строки по номенклатуре
	//КонецЕсли;
	ИначеЕсли НЗ.Количество() = 1 Тогда 
		//1. Изменение номенклатуры 
		Если ЗначениеЗаполнено(НоменклатураНовая) Тогда 
			НЗ1 = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
			НЗ1.Отбор.ЭтоСписание.Установить(не Объект.Резерв);
			НЗ1.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
			НЗ1.Отбор.Номенклатура.Установить(НоменклатураНовая);
			НЗ1.Прочитать();
			Для Каждого СтрНЗ из НЗ Цикл    
				НоваяСтрока = НЗ1.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрНЗ);
				НоваяСтрока.Номенклатура = НоменклатураНовая;
				////получим норматив для нового материала. 
				////////////////////////////////////////////////////
				//Нормативы = ПолучитьНормативыИзВременногоХранилища(АдресХранилищаНормативы);//(СтрНЗ.ЭтапПроизводства);
				СтруктураПоиска = Новый Структура("Номенклатура",НоменклатураНовая); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
				МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
				Если МассивНайденныхСтрок.Количество() > 1 Тогда 
					Сообщить("Норматив: найдено более 1 строки! " + НоменклатураНовая);
				ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
					Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
				Иначе   
					Норматив = 0;
				КонецЕсли;   
				//////////////////////////////////////////////////
				НоваяСтрока.Норматив = Норматив;
				//Рассчитаем остаток для измененной позиции спецификации
				//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");   
				ПараметрыПоиска = Новый Структура("Обрабатывать",Истина);    
				ТабЭтапы = Этапы.Выгрузить(ПараметрыПоиска,"ЭтапПроизводства,Спецификация");
				НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(НоменклатураНовая,Объект.Склад,ТабЭтапы.ВыгрузитьКолонку("ЭтапПроизводства"),ТабЭтапы);	
				//НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(НоменклатураНовая,Объект.Склад,Этапы.Выгрузить(,"ЭтапПроизводства"));
				//ОбработкаОбъект.ПолучитьОстаток_2_5(НоменклатураНовая,Объект.Склад,Этапы.Выгрузить(,"ЭтапПроизводства"));	
			КонецЦикла; 
			НЗ1.Записать();
			НЗ.Очистить();  
			НЗ.Записать();	
		//2. Изменение ВариантаОбеспечения
		ИначеЕсли ЗначениеЗаполнено(ВариантОбеспеченияНовый) Тогда   
		    Для Каждого СтрНЗ из НЗ Цикл 
				ВариантОбеспеченияДо = СтрНЗ.ВариантОбеспечения;      
				Если не ВариантобеспеченияНовый = ВариантОбеспеченияДо Тогда 
					//УстановитьВариантОбеспеченияНовая(ВариантобеспеченияНовый,Обособленно,ЭтоСписание,СтруктуктураОтбора);
					//ЗарезервироватьПоДаннымТСД
					Если СтруктураОтбора.Свойство("ПодборНаТСД") и ВариантОбеспеченияНовый = ВО_Зарезервировать Тогда 
						//Если не ЗначениеЗаполнено(СтрНЗ.ПодобраноНаТСД) Тогда  
						//	Продолжить;  
						//КонецЕсли;     
						
						//Если СтрНЗ.ВариантОбеспечения = ВО_Зарезервировать или СтрНЗ.ВариантОбеспечения = ВО_Отгрузить Тогда 
						//	Сообщить("В строке по номенклатуре " + Номенклатура +" количество заменено на подобранное", СтатусСообщения.Важное);
						//	//СтрНЗ.КоличествоУпаковок = СтрНЗ.КоличествоУпаковок + СтрНЗ.ПодобраноНаТСД;
						//	СтрНЗ.КоличествоУпаковок = СтрНЗ.ПодобраноНаТСД;
						//Иначе 
						//	СтрНЗ.КоличествоУпаковок = СтрНЗ.ПодобраноНаТСД;
						//	СтрНЗ.ВариантОбеспечения = ВариантОбеспеченияНовый;
						//КонецЕсли;   
						СтрНЗ.КоличествоУпаковок = СтруктураОтбора.ПодборНаТСД;
						СтрНЗ.ПодобраноНаТСД = 0;
						Числитель = ?(ЗначениеЗаполнено(СтруктураОтбора.ПодборУпаковка.Числитель),СтруктураОтбора.ПодборУпаковка.Числитель,1);
						Знаменатель = ?(ЗначениеЗаполнено(СтруктураОтбора.ПодборУпаковка.Знаменатель),СтруктураОтбора.ПодборУпаковка.Знаменатель,1); 
						СтрНЗ.Количество = СтрНЗ.КоличествоУпаковок * Числитель / Знаменатель;
					КонецЕсли;
					СтрНЗ.ВариантОбеспечения = ВариантОбеспеченияНовый;
					Если ВариантОбеспеченияНовый = ВО_Зарезервировать или ВариантОбеспеченияНовый = ВО_Отгрузить Тогда 
						СтрНЗ.Обособленно = Ложь;
					Иначе 
						СтрНЗ.Обособленно = Истина;
					КонецЕсли;                                                                      
					Если ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
						СтрНЗ.ОтборПоВариантамОбеспечения = 5;
					ИначеЕсли ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.СоСклада Тогда
						СтрНЗ.ОтборПоВариантамОбеспечения = 4;
					ИначеЕсли ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда
						СтрНЗ.ОтборПоВариантамОбеспечения = 3;
					ИначеЕсли ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
						СтрНЗ.ОтборПоВариантамОбеспечения = 1;
					КонецЕсли; 
					Если не СтрНЗ.Обособленно Тогда 
						СтрНЗ.Назначение = Назначение; //Справочники.Назначения.ПустаяСсылка();
					Иначе 
						Если не ЗначениеЗаполнено(СтрНЗ.Назначение) Тогда 
							СтрНЗ.Назначение = Назначение; //СтрНЗ.ЭтапПроизводства.НазначениеПродукция;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли; 
			КонецЦикла;
			НЗ.Записать(); 
		//3. изменение количества (общего, в ТЧ МатериалыСпецификации)
		ИначеЕсли ЗначениеЗаполнено(НовоеКоличествоУпаковокОбщее) Тогда  
			НовоеКоличествоДляРаспределения = НовоеКоличествоУпаковокОбщее;
			РаспределитьКоличествоНаСервере(,НЗ);
		//4. изменение количества (в ТЧ РаспрееделениеМатериала)
		ИначеЕсли ЗначениеЗаполнено(НовоеКоличествоУпаковок) Тогда 
			Если НЗ.Количество() = 1 Тогда 
				Для Каждого СтрНЗ из НЗ Цикл
					СтрНЗ.КоличествоУпаковок = НовоеКоличествоУпаковок;   
					Упаковка = СтрНЗ.Упаковка;
					Знаменатель = ?(ЗначениеЗаполнено(Упаковка.Знаменатель),Упаковка.Знаменатель,1);
					Числитель = ?(ЗначениеЗаполнено(Упаковка.Числитель),Упаковка.Числитель,1);
					КоэффициентУпаковки = Знаменатель/Числитель;
					СтрНЗ.Количество = НовоеКоличествоУпаковок * КоэффициентУпаковки;     
					СтрНЗ.Обеспечить = СтрНЗ.Норматив - (НовоеКоличествоУпаковок - СтрНЗ.Количество);
				КонецЦикла;   
				НЗ.Записать();
			ИначеЕсли НЗ.Количество() > 1 Тогда  
				Сообщить("Найдено более 1 записи регистра при изменении количества в  ТЧ РаспределениеМатериаловСпецификации", СтатусСообщения.Важное);
			Иначе 
				Сообщить("Не найдено записи регистра для изменения при изменении количества в  ТЧ РаспределениеМатериаловСпецификации", СтатусСообщения.Важное);
			КонецЕсли;
			НЗ.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРаспределениеКоличества()
	
	ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	
	РаспределитьКоличествоНаСервере();//СписокКолонокРаспределениеМатериалов);  
	////!!!!!!!!!!!!!!!!!!!!Раскомментить!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(поЭтапам);
	
	ТекСтрокаПослеОбновления = Объект.МатериалыСпецификации.Получить(ИндексТекСтроки);
	Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрокаПослеОбновления.ПолучитьИдентификатор();
	ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекущаяНоменклатура);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Проверим / очистим регистр (если выход был некорректный, то могди остаться записи в регистре по пользователю)
	//НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	//НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	//НЗ.Прочитать();
	//НЗ.Очистить(); 
	//НЗ.Записать();
	ОчиститьРегистрСведенийПриВыходеИзОбработки();
	
	Если не ЗначениеЗаполнено(Объект.ПериодОтгрузки) Тогда 
		Объект.ПериодОтгрузки = ТекущаяДатаСеанса();
	КонецЕсли;
	Если не ЗначениеЗаполнено(Объект.ДатаЗапуска) Тогда 
		Объект.ДатаЗапуска = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	ПериодОтгрузки = ТекущаяДатаСеанса();

	//При выполнении на сервере не сохраняется, поэтому выполняется при открытии формы
	Если ЗначениеЗаполнено(Объект.ДР_КатегорияМатериала) Тогда 
		Элементы.КатегорияМатериала.СписокВыбора.Очистить();
		//Элементы.ОтборКатегорияМатериалаРезервирование.СписокВыбора.Очистить();   
		Элементы.ОтборКатегорияМатериала.СписокВыбора.Очистить();
		//ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("КатегорияМатериала");
		//ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("ОтборКатегорияМатериалаРезервирование");
		ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("ОтборКатегорияМатериала");
	КонецЕсли;
	//Элементы.ВариантОбеспечения.СписокВыбора.Очистить();
	//Элементы.ВариантОбеспеченияРезервирование.СписокВыбора.Очистить();
	Элементы.ОтборВариантОбеспечения.СписокВыбора.Очистить();
	//ЗаполнитьЗначенияСпискаВыбораВариантОбеспечения("ВариантОбеспечения");
	//ЗаполнитьЗначенияСпискаВыбораВариантОбеспечения("ВариантОбеспеченияРезервирование"); 
	ЗаполнитьЗначенияСпискаВыбораВариантОбеспечения("ОтборВариантОбеспечения");
	
	СоответствиеВариантовОбеспеченияОтбору = Новый Структура();
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьОбособленно"			,1);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("Требуется"						,2);
	////СоответствиеВариантовОбеспеченияОтбору.Вставить("КОбеспечнию"					,1);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("НеТребуется"					,3);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("СоСклада"						,4);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьИзЗаказов"				,4);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("Отгрузить"						,5);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьОтгрузитьОбособленно"	,5);      
	
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьОбособленно"			,1);       
	СоответствиеВариантовОбеспеченияОтбору.Вставить("КОбеспечнию"					,1);
	СоответствиеВариантовОбеспеченияОтбору.Вставить("НеТребуется"					,2);
	СоответствиеВариантовОбеспеченияОтбору.Вставить("РезервироватьПоМереПоступления",3);
	СоответствиеВариантовОбеспеченияОтбору.Вставить("СоСклада"						,4);
	СоответствиеВариантовОбеспеченияОтбору.Вставить("Отгрузить"						,5);
	//СоответствиеВариантовОбеспеченияОтбору.Вставить("УдалитьОтгрузитьОбособленно"	,5);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступноТолькоРезервирование = ПроверитьДоступ("АРМ_Резервирование");
	
	Если ДоступноТолькоРезервирование Тогда 
		ТолькоРезерв = Истина;
		Элементы.Списание.Видимость = Ложь;
	Иначе 
		ТолькоРезерв = Ложь;
		Элементы.Списание.Видимость = Истина;
	КонецЕсли;
	
	//ТекСтраница = "Списание";
	
	//СформироватьСтруктуруСтрокИсходныхДанных();
	ЕстьНесохраненныеДанныеРезервирования = Истина;
	ЕстьНесохраненныеДанныеСписания = Истина;
		
	ТабЭтапы = Этапы;
	//ТабЭтапыРезервирование = ЭтапыРезервирование; 
	Списание = не Объект.Резерв;
	ЗаполнитьЭтапыНаСервере(ТабЭтапы, Списание);
	//ЗаполнитьЭтапыНаСервере(ТабЭтапыРезервирование, Ложь);
	
	//Списки выбора не сохраняются, если заполнять на сервере при создании формы, поэтому здесь!!!
	Если ЗначениеЗаполнено(Объект.ДР_КатегорияМатериала) Тогда 
		Элементы.КатегорияМатериала.СписокВыбора.Очистить();
		//Элементы.ОтборКатегорияМатериалаРезервирование.СписокВыбора.Очистить();
		Элементы.ОтборКатегорияМатериала.СписокВыбора.Очистить();  
		//ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("КатегорияМатериала");
		//ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("ОтборКатегорияМатериалаРезервирование");
		ЗаполнитьЗначенияСпискаВыбораКатегорияМатериала("ОтборКатегорияМатериала");
	КонецЕсли;	                       
	
	//Элементы.ОтборВариантОбеспечения.СписокВыбора.Очистить();
	//ЗаполнитьЗначенияСпискаВыбораВариантОбеспечения("ОтборВариантОбеспечения");
	
	СформироватьСтруктуруСтрокИсходныхДанных();
	//!!!При открытии формы данные в регистр не записываем, 
	//!!!так как записываем при переходе на конкретную страницу материалов данные по отмеченным этапам!!!!
	
	//ПрочитатьНастройкиНаСервере();
	Элементы._Протокол.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСтруктуруСтрокИсходныхДанных() 
		
	СтруктураДанныхСтроки = Новый Структура;
	СтруктураДанныхСтроки.Вставить("Номенклатура");
	СтруктураДанныхСтроки.Вставить("ИсходнаяНоменклатура");
	СтруктураДанныхСтроки.Вставить("Упаковка");
	СтруктураДанныхСтроки.Вставить("Норматив");
	СтруктураДанныхСтроки.Вставить("Расход");
	СтруктураДанныхСтроки.Вставить("Остаток");
	СтруктураДанныхСтроки.Вставить("ЭтапПроизводства");
	СтруктураДанныхСтроки.Вставить("ВариантОбеспечения");
	СтруктураДанныхСтроки.Вставить("Обособленно");
	СтруктураДанныхСтроки.Вставить("ВидНоменклатуры");
	СтруктураДанныхСтроки.Вставить("Обеспечить");
	СтруктураДанныхСтроки.Вставить("Отгрузить");
	СтруктураДанныхСтроки.Вставить("Зарезервировать");
	СтруктураДанныхСтроки.Вставить("Спецификация");
	СтруктураДанныхСтроки.Вставить("КоличествоСтрок");
	СтруктураДанныхСтроки.Вставить("КонтрольОстатка");
	СтруктураДанныхСтроки.Вставить("КатегорияМатериала");
	СтруктураДанныхСтроки.Вставить("ОстатокДляУО");
	СтруктураДанныхСтроки.Вставить("РасчетнаяПотребность");
	СтруктураДанныхСтроки.Вставить("НоменклатураРодитель");
	СтруктураДанныхСтроки.Вставить("Уровень");
	СтруктураДанныхСтроки.Вставить("КОбеспечению");
	СтруктураДанныхСтроки.Вставить("ВыходноеИзделие");
	СтруктураДанныхСтроки.Вставить("Характеристика");
	СтруктураДанныхСтроки.Вставить("Серия");
	СтруктураДанныхСтроки.Вставить("КоличествоУпаковок");
	СтруктураДанныхСтроки.Вставить("Количество");
	СтруктураДанныхСтроки.Вставить("Склад");
	СтруктураДанныхСтроки.Вставить("Производится");
	СтруктураДанныхСтроки.Вставить("Назначение");
	СтруктураДанныхСтроки.Вставить("СтатусУказанияСерий");
	СтруктураДанныхСтроки.Вставить("СтатусУказанияСерийОтправитель");
	СтруктураДанныхСтроки.Вставить("СтатусУказанияСерийПолучатель");
	СтруктураДанныхСтроки.Вставить("КодСтроки");
	СтруктураДанныхСтроки.Вставить("ИспользуетсяАвтовыбор");
	СтруктураДанныхСтроки.Вставить("СведенияАвтовыбора");
	СтруктураДанныхСтроки.Вставить("ПрименениеМатериала");
	СтруктураДанныхСтроки.Вставить("КлючСвязиСпецификация");
	СтруктураДанныхСтроки.Вставить("СтатьяКалькуляции");
	СтруктураДанныхСтроки.Вставить("ПериодЗатрат");
	СтруктураДанныхСтроки.Вставить("АналитикаУчетаНоменклатуры");
	СтруктураДанныхСтроки.Вставить("КорАналитикаУчетаНоменклатуры");
	СтруктураДанныхСтроки.Вставить("ИдентификаторСтрокиРегистра");
	СтруктураДанныхСтроки.Вставить("ОтборПоВариантамОбеспечения");    
	
	ИсходныеДанныеСтрокиДереваМатериалов = СтруктураДанныхСтроки;
	ИсходныеДанныеСтрокиДереваМатериаловРезервирование = СтруктураДанныхСтроки; 
	ИсходныеДанныеСтрокиМатериаловСпецификации = СтруктураДанныхСтроки;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьДоступ(Роль)
	Доступность = ?(РольДоступна(Роль), Истина, Ложь);
	Возврат Доступность;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если Не ЗавершениеРаботы Тогда 
		Если Не ЗакрытьФормуОбработки Тогда 
			Отказ = Истина;
			ОповещениеПриВыходе = Новый ОписаниеОповещения("ВопросПриВыходеПродолжение", ЭтаФорма,);
			ПоказатьВопрос(ОповещениеПриВыходе, "При выходе из обработки все несохраненные данные будут потеряны, продолжить?", РежимДиалогаВопрос.ДаНет);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриВыходеПродолжение(ОтветПользователя, ДопПараметры) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	ОчиститьРегистрСведенийПриВыходеИзОбработки(); 
	Объект.ДокументПодбораМатериалов = ПредопределенноеЗначение("Документ.ТТМ_ПодборМатериаловПоСпецификации.ПустаяСсылка");
	ЗакрытьФормуОбработки = Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры

#КонецОбласти


 ///////////////////////////////////////////////////////////////////////////////////
 
 //25.04.2025        
 //Не используется
 #Область Проверено2
 
 &НаКлиенте
 Процедура НомерЗаказаОчистка(Элемент, СтандартнаяОбработка)   
	 ПредопределенноеЗначение("Справочник.Назначения.ПустаяСсылка");
	//ОчиститьЗаказНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаказНаСервере()
	Справочники.Назначения.ПустаяСсылка();	
КонецПроцедуры

 
 #КонецОбласти
 
 
#Область ПриИзмененииПолейФормы

&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)
	ЗаказВерный = ПроверитьВведенныйЗаказПользователем(Новый Структура("Назначение", Объект.НомерЗаказа));
	
	Если Не ЗаказВерный Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не верно выбран номер заказа'"),, "Объект.НомерЗаказа");
		Возврат;
	КонецЕсли;
	
	Новая_ЗаполнитьЭтапыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаказаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("СтрокаПоиска", Текст);
	СтруктураОтбора.Вставить("ВводПоСтрокеРасширенный", Истина);
	
	ДанныеВыбора = ПолучитьДанныеВыбораРасширенные(СтруктураОтбора);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораРасширенные(СтруктураОтбора)
	
	СписокВыбора = Новый СписокЗначений;
	СтрокаПоиска = СтрЗаменить(СтруктураОтбора.СтрокаПоиска, """", ""); 
	
	Если СтрокаПоиска <> "" И СтруктураОтбора.Свойство("ВводПоСтрокеРасширенный") Тогда
		МассивСловПоиска = СтрРазделить(СтрокаПоиска, " ", Ложь); 

		Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ
                       |	Назначения.Ссылка КАК Заказ,
                       |	Назначения.Наименование КАК Наименование,
                       |	Назначения.ПометкаУдаления КАК ПометкаУдаления
                       |ИЗ
                       |	Справочник.Назначения КАК Назначения
                       |ГДЕ
                       |	Назначения.Наименование ПОДОБНО &СловоПоиска
                       |	И НЕ Назначения.ПометкаУдаления";
			
		Запрос.УстановитьПараметр("СловоПоиска", "%" + СтрокаПоиска + "%");
				
		Выборка = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
				
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Значение", ВыборкаДетальныеЗаписи.Заказ);
			СтруктураОтбора.Вставить("ПометкаУдаления", ВыборкаДетальныеЗаписи.ПометкаУдаления);
			
			СписокВыбора.Добавить(СтруктураОтбора, ТТМ_ДанныеВыбораСервер.ПодсветитьСлова(ВыборкаДетальныеЗаписи.Наименование, МассивСловПоиска));
		КонецЦикла;
	
		ДанныеВыбора = СписокВыбора;
	КонецЕсли;
	
	Возврат ДанныеВыбора;	
КонецФункции

&НаКлиенте
Процедура НомерЗаказаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Текст = "" Тогда
		ОчиститьЗаказНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьВведенныйЗаказПользователем(СтруктураОтбора, Знач ЗаказВерный = Истина)
	
	МассивНайденных = Этапы.НайтиСтроки(СтруктураОтбора);
	
	Если МассивНайденных.Количество() = 0 Тогда
		ЗаказВерный = Ложь;
	КонецЕсли;
	
	Если СтруктураОтбора["Назначение"] = Справочники.Назначения.ПустаяСсылка() Тогда
		ЗаказВерный = Истина;
	КонецЕсли;
		
	Возврат ЗаказВерный; 
КонецФункции

&НаКлиенте
Процедура РезервПриИзменении(Элемент)
	
	Если не ЗначениеЗаполнено(Объект.ПериодОтгрузки) Тогда 
		Объект.ПериодОтгрузки = ПолучитьТекущуюДату();
	КонецЕсли;
	
	ИсходнаяОперация = Не Объект.Резерв;
	ЕстьЗаписиВРегистреНеСоответствующиеОтбору = ПолучитьЗаписиРегистраПоОтбору(ИсходнаяОперация);
	
	Если ЕстьЗаписиВРегистреНеСоответствующиеОтбору Тогда     
		Сообщить("В регистре присутствуют данные, не соответствующие отбору!");
		Объект.Резерв = Не Объект.Резерв;
		Возврат;
	Иначе          
		ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаЭтапы;
		Новая_ЗаполнитьЭтапыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущуюДату()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Списание = не Объект.Резерв;    
	
	/////////////////////////////////////////////////////////////////
	//Предупредить о потере данных
	////////////////////////////////////////////////////////////////
	ЗаписейВРегистре = ПолучитьКоличествоЗаписейРегистра(Списание);    
	Если ЗаписейВРегистре > 0 Тогда                                                                                      
		Номенклатура = ПолучитьНоменклатуруСпецификации(Спецификация);
		ДополнительныеПараметры = Новый Структура("ЭтоСписание,Номенклатура",не Объект.Резерв,Номенклатура);
		ОповещениеОбУдаленииЗаписейРегистра = Новый ОписаниеОповещения("УдалениеЗаписейРегистраПродолжение",ЭтаФорма,ДополнительныеПараметры);
		ПоказатьВопрос(ОповещениеОбУдаленииЗаписейРегистра,"Внимание, данные по номенклатуре! " + Номенклатура + "будут очищены! Продолжить?",РежимДиалогаВопрос.ДаНет,);
	КонецЕсли;
	//Если ЗаписейВРегистре > 0 Тогда  		
	//	УдалитьЗаписиРегистра(Списание);
	//КонецЕсли;
	////////////////////////////////////////////////////////////////
	
	Спецификация = ПредопределенноеЗначение("Справочник.РесурсныеСпецификации.ПустаяСсылка");
	Объект.НомерЗаказа = ПредопределенноеЗначение("Справочник.Назначения.ПустаяСсылка");
	
	АдресХранилищаНормативы = "";
	ДанныеПартииПроизводства = Неопределено;	
	Новая_ЗаполнитьЭтапыНаСервере();
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыделитьВсеЭтапы(Команда)
	ОтметитьВыбранныеЭтапы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделениеВсехЭтапов(Команда)
	ОтметитьВыбранныеЭтапы();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыбранныеЭтапы(Знач Флаг = Ложь) 
	Для Каждого СтрокаТЧ из Этапы Цикл 
		СтрокаТЧ.Обрабатывать = Флаг;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ДР_КатегорияМатериала1ПриИзменении(Элемент)
	ОбновитьМатериалыСпецификации(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборКатегорияМатериалаПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ДР_КатегорияМатериала) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru ='Не выбрана категория в настройках. После выбора необходимо перезапустить обработку'"),, 
			"Объект.ДР_КатегорияМатериала");
		Возврат;
	КонецЕсли;
	
	ОбновитьМатериалыСпецификации(Ложь);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруСпецификации(Спецификация)
	Возврат Спецификация.ОсновноеИзделиеНоменклатура;
КонецФункции

&НаСервереБезКонтекста
Процедура ОчиститьРегистрСведенийПриВыходеИзОбработки()
	ТекПользователь = Пользователи.АвторизованныйПользователь(); 
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(ТекПользователь);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область ЗаполнениеЭтаповНаСтраницеЭтапыКСписанию

&НаКлиенте
Процедура Новая_ЗаполнитьЭтапы(Команда)
	ПроверкаВыполнена = ПроверкаЗаполненияВажныхПолейФормы(Команда.Действие);
	
	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	Новая_ЗаполнитьЭтапыНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненияВажныхПолейФормы(ТекущаяКоманда, Знач ПроверкаВыполнена = Истина)
	Если ТекущаяКоманда = "Новая_ЗаполнитьЭтапы" Тогда
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено поле организация'"),, "Объект.Организация");	
			ПроверкаВыполнена = Ложь;
		ИначеЕсли Не ЗначениеЗаполнено(Объект.ПериодОтгрузки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана дата'"),, "Объект.ПериодОтгрузки");	
			ПроверкаВыполнена = Ложь;			
		ИначеЕсли Не ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено поле продукция'"),, "Объект.Номенклатура");
			ПроверкаВыполнена = Ложь;			
		КонецЕсли;		
	КонецЕсли;
	
	Если ТекущаяКоманда = "РаспределитьКоличество" Тогда
		Если НовоеКоличествоДляРаспределения = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Количество не может быть нулевым'"),, "НовоеКоличествоДляРаспределения");
			ПроверкаВыполнена = Ложь;
		КонецЕсли;
	КонецЕсли;
		
	Если ТекущаяКоманда = "ЗафиксироватьКорректировкиНовая" Тогда
		Если ПроцентВыполнения = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Значение не может быть нулевым'"),, "ПроцентВыполнения");
			ПроверкаВыполнена = Ложь;
		ИначеЕсли Не Объект.Резерв И Не ЗначениеЗаполнено(Объект.ПериодОтгрузки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните дату отгрузки!'"),, "Объект.ПериодОтгрузки");
			ПроверкаВыполнена = Ложь;
		КонецЕсли;
		
		ПараметрыПоска = Новый Структура("Количество",0);
		МассивСтрокСНУлевымКоличеством = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыПоска);
		Если МассивСтрокСНУлевымКоличеством.Количество() > 0 Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Количество не может быть нулевым!'"),, "РаспределениеМатералов.Количество");
			ПроверкаВыполнена = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущаяКоманда = "ЗагрузитьПодобранныеМатериалы" Тогда
		Если Не ЗначениеЗаполнено(Объект.ДокументПодбораМатериалов) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите номер документ в настройках'"),, "Объект.ДокументПодбораМатериалов");
			ПроверкаВыполнена = Ложь;
		КонецЕсли;
	КонецЕсли; 
 
	Возврат ПроверкаВыполнена; 
КонецФункции

&НаСервере
Процедура Новая_ЗаполнитьЭтапыНаСервере()
	ПеремЭтапы = Этапы;       
	Списание = Не Объект.Резерв;
	ЗаполнитьЭтапыНаСервере(ПеремЭтапы, Списание);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтапыНаСервере(перемЭтапы,Списание); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК Ссылка,
	               |	СУММА(ЭтапПроизводства2_2ВыходныеИзделия.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_КоличествоПроизведено
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Организация = &Организация ";
	Если Списание Тогда Запрос.Текст = Запрос.Текст + "
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Произведено ";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК Регистратор,
				   |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
				   |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер
				   |ПОМЕСТИТЬ ВТ_СерийныеНомера
			       |ИЗ
				   |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
				   |ГДЕ
				   |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2";
			Если ЗначениеЗаполнено(Объект.Номенклатура)  Тогда //или ЗначениеЗаполнено(Объект.НоменклатураРезервирование)
				Запрос.Текст = Запрос.Текст + "
				   |	И ТТМ_УчетСерийныхНомеровПродукции.Номенклатура = &Номенклатура";
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ      
				   |	1 КАК НомерСтроки,
	               |	ЛОЖЬ КАК Обрабатывать,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус КАК Статус,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Номер КАК Номер,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ДатаПроизводства КАК ДатаПроизводства,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК ЭтапПроизводства,
				   |	ЕСТЬNULL(ВТ_СерийныеНомера.СерийныйНомер, """") КАК СерийныйНомер,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокПлан КАК Запланировано,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация КАК Спецификация
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоПроизведено КАК ВТ_КоличествоПроизведено
	               |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Ссылка = ВТ_КоличествоПроизведено.Ссылка";                       
	Если Списание Тогда Запрос.Текст = Запрос.Текст + "			   
	               |			И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокПлан = ВТ_КоличествоПроизведено.Количество";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + " 
				   |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СерийныеНомера КАК ВТ_СерийныеНомера
			       |		ПО (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ВТ_СерийныеНомера.Регистратор)
				   |			И (ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ВТ_СерийныеНомера.Номенклатура)
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Организация = &Организация
	               
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат)";
	               
	Если Списание Тогда 
		Запрос.Текст = Запрос.Текст + "
		            |	И ЭтапПроизводства2_2ВыходныеИзделия.Произведено";
					//|	И НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ДатаПроизводства, ДЕНЬ) = &Период
					//|	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)
					//|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт = 0.5";  
		Если ЗначениеЗаполнено(Объект.Номенклатура)  Тогда //или ЗначениеЗаполнено(Объект.НоменклатураРезервирование)
			Запрос.Текст = Запрос.Текст + "
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура";
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ПериодОтгрузки)  Тогда //или ЗначениеЗаполнено(Объект.НоменклатураРезервирование)
			Запрос.Текст = Запрос.Текст + "
	               |	И НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ДатаПроизводства, ДЕНЬ) = &Период";
		КонецЕсли;
	Иначе 
		Запрос.Текст = Запрос.Текст + "
					//|	И НАЧАЛОПЕРИОДА(ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ФактическоеНачалоЭтапа, ДЕНЬ) = &Период
		           	|	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокФакт < 0.5";
		Если ЗначениеЗаполнено(Объект.Номенклатура)  Тогда 
			Запрос.Текст = Запрос.Текст + "
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура";
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НомерЗаказа) Тогда  //или ЗначениеЗаполнено(Объект.НомерЗаказаРезервирование)
		Запрос.Текст = Запрос.Текст + "	
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Назначение = &НомерЗаказа";
	КонецЕсли;    
	
	Запрос.Текст = Запрос.Текст + "	
	               |	УПОРЯДОЧИТЬ ПО Номер, КоличествоУпаковокФакт";
		
	Запрос.УстановитьПараметр("Организация", Объект.Организация);  
	Запрос.УстановитьПараметр("Период", Объект.ПериодОтгрузки);
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	Запрос.УстановитьПараметр("НомерЗаказа", Объект.НомерЗаказа);
		
	ТабЭтапы = Запрос.Выполнить().Выгрузить();
	ОбъектСравнения = Новый СравнениеЗначений;
	ТабЭтапы.Сортировать("ЭтапПроизводства", ОбъектСравнения);
	
	//Заполним номера строк
	Счетчик = 0;
	Для Каждого СтрЭтап из ТабЭтапы Цикл 
		Счетчик = Счетчик + 1;
		СтрЭтап.НомерСтроки = Счетчик;
	КонецЦикла; 
	
	/////////////////////////////////////////////////////////////////////////////////////////
	// Очистим данные регистра	
	УдалитьЗаписиРегистра(Списание);
	/////////////////////////////////////////////////////////////////////////////////////////
	
	ЗначениеВДанныеФормы(ТабЭтапы,перемЭтапы);
	
	//11.06.2025
	КопироватьДанныеФормы(перемЭтапы,Этапы);
	//Если Списание Тогда 
	//	КопироватьДанныеФормы(перемЭтапы,Этапы);
	//Иначе 
	//	КопироватьДанныеФормы(перемЭтапы,ЭтапыРезервирование);
	//КонецЕсли;     
	//-
	
КонецПроцедуры

//СтарыйВариант - (Возможно не используется) переписать
&НаКлиенте
Процедура ЗаполнитьЭтапыСВопросом(Списание)	
	Списание = Не Объект.Резерв; 
	ПеремЭтапы = Этапы;
	ЗаполнитьЭтапыНаСервере(ПеремЭтапы, Списание);	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область ВзаимодействиеСПользователем

&НаКлиенте
Процедура ВопросПользователюПередВыполнениемОперации(Знач ПереходНаСтраницуЭтапы = Ложь, Знач ТекущаяКоманда = Неопределено)
	
	Если ПереходНаСтраницуЭтапы Тогда
		Если Объект.МатериалыСпецификации.Количество() > 0 Тогда
			Списание = Не Объект.Резерв;
			ДопПараметры = Новый Структура("ЭтоСписание",Списание);
			ОповещениеПриПереходеНаСтрЭтапы = Новый ОписаниеОповещения("ПереходНаСтрЭтапыПродолжение", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(ОповещениеПриПереходеНаСтрЭтапы, "Данные по корректировке материалов будут утеряны, продолжить?", РежимДиалогаВопрос.ДаНет, 300);
		КонецЕсли;
	ИначеЕсли ТекущаяКоманда = "ВыгрузитьМатериалыДляТСД" Тогда
		ОповещениеВыгрузкаТСД = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриВыполненииОперации", ЭтотОбъект, ТекущаяКоманда);
		ПоказатьВопрос(ОповещениеВыгрузкаТСД, "Сформировать документ ТСД?", РежимДиалогаВопрос.ДаНет, 0,, "Документ ТСД");
	ИначеЕсли ТекущаяКоманда = "ЗафиксироватьКорректировкиНовая" Тогда
		ОповещениеВыгрузкаТСД = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриВыполненииОперации", ЭтотОбъект, ТекущаяКоманда);
		ПоказатьВопрос(ОповещениеВыгрузкаТСД, "Зарезервировать выбранные материалы?", РежимДиалогаВопрос.ДаНет, 0,, "Резервирование");
	ИначеЕсли ТекущаяКоманда = "ВыполнитьСписание" Тогда
		ОповещениеВыгрузкаТСД = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПриВыполненииОперации", ЭтотОбъект, ТекущаяКоманда);
		ПоказатьВопрос(ОповещениеВыгрузкаТСД, "Выполнить списание выбранных материалов?", РежимДиалогаВопрос.ДаНет, 0,, "Списание");	
	Иначе
		ОповещениеПриПереходеНаСтрЭтапы = Новый ОписаниеОповещения("ПереходНаСтрМатериалыСпецификацииПродолжение", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеПриПереходеНаСтрЭтапы, "Подготовить список материалов для резервирования и списания?", РежимДиалогаВопрос.ДаНет, 300);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходНаСтрЭтапыПродолжение(ОтветПользователя, ДопПараметры) Экспорт   
	
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда 
		УдалитьМатериалыДляКорректирвкиИзРегистра(ДопПараметры.ЭтоСписание);
		Объект.МатериалыСпецификации.Очистить();
		Объект.РаспределениеМатериала.Очистить();
	Иначе 
		Если Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаЭтапы" Тогда 
			Элементы.СтраницыСписания.ТекущаяСтраница = Элементы.СтраницаМатериалыСпецификации;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереходНаСтрМатериалыСпецификацииПродолжение(ОтветПользователя, ДопПараметры) Экспорт
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	// <+ 
	_Протокол.ДобавитьСтроку(СтрШаблон("Начало заполнения материалов - %1",ТекущаяДата()));
	// +>
		
	ЭтоСписание = Не Объект.Резерв;	
	ЗаполнитьСпецификациюПоВыбраннымЭтапам("Этапы", ЭтоСписание);
	Команда = "ПереходыМеждуСтраницами";
	
	Попытка
		ДлительнаяОперация = ЗаполнитьМатериалыСпецификации(Истина, Истина);
	 	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	 	ПараметрыОжидания.Заголовок = "Формирование списка материалов...";
	 	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	 	ПараметрыОжидания.ВыводитьСообщения = Истина;
	 	ПараметрыОжидания.ПолучатьРезультат = Истина;
	 	 
	 	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбработкиФоновойОперации", ЭтотОбъект, Команда);
	 	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка формирования списка материалов: '") + КраткоеПредставлениеОшибки(ОписаниеОшибки()));
	КонецПопытки;
	
	//Элементы.РаспределениеМатериалаРезерв.Видимость = Объект.Резерв;	
КонецПроцедуры	

&НаКлиенте
Процедура ОповеститьПользователя(Знач ПереходМеждуСтраниц = Ложь, Знач ВыгрузкаТСД = Ложь, Знач Резервирование = Ложь, Знач ОформленоСписание = Ложь)
	
	Если ПереходМеждуСтраниц Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Резервирование и списание'"),, 
			НСтр("ru = 'Список материалов успешно сформирован!'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация);
	ИначеЕсли ВыгрузкаТСД Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Резервирование и списание'"),, 
			НСтр("ru = 'Документ ТСД сформирован!'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация);
	ИначеЕсли Резервирование Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Резервирование и списание'"),, 
			НСтр("ru = 'Материалы зарезервированы!'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация);
	ИначеЕсли ОформленоСписание Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'АРМ Резервирование и списание'"),, 
			НСтр("ru = 'Материалы списаны!'"), 
			БиблиотекаКартинок.Информация, 
			СтатусОповещенияПользователя.Информация);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПриВыполненииОперации(ОтветПользователя, ДопПараметры) Экспорт
	
	/////////////////////////////////////////////////////
	Если ДопПараметры = "ВыгрузитьМатериалыДляТСД" Тогда
		Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		Попытка 
			ВыгрузитьМатериалыДляТСДНаСервере(Спецификация);
			ОперацияВыполнена = Истина;
		Исключение
			ОперацияВыполнена = Ложь;
		КонецПопытки;
		
		Если ОперацияВыполнена Тогда	
			ОповеститьПользователя(, Истина);
		КонецЕсли;
	КонецЕсли;
	
	/////////////////////////////////////////////////////
	Если ДопПараметры = "ЗафиксироватьКорректировкиНовая" Тогда
		Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		ВыполнитьРезервированиеПодтверждение(ДопПараметры);	
	КонецЕсли;

	/////////////////////////////////////////////////////
	Если ДопПараметры = "ВыполнитьСписание" Тогда
		Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;

		ВыполнитьСписаниеПодтверждение(ДопПараметры);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииОбработкиФоновойОперации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
	//	ОчиститьДанныеИзВременногоРегистраФоновыхЗаданий();
	  	Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		// <+
		_Протокол.ДобавитьСтроку(СтрШаблон("Изделие: %1",Объект.Номенклатура));
		_Протокол.ДобавитьСтроку(СтрШаблон("Выполнено - %1",ТекущаяДата()));
		// +>
		
		Если ДополнительныеПараметры = "ПереходыМеждуСтраницами" Тогда
			СписокНоменклатурыБезОстатка.Очистить();
			СтатусВыполнения = ЗаполнитьМатериалыСпецификации(Истина, Ложь, Истина);
			
			Если СтатусВыполнения Тогда
				Если СписокНоменклатурыБезОстатка.Количество() > 0 Тогда 
					ТекстСообщенияНоменклатураБезОстатка = "";
					Для Каждого Номенклатура из СписокНоменклатурыБезОстатка Цикл 
						ТекстСообщенияНоменклатураБезОстатка = ТекстСообщенияНоменклатураБезОстатка + Номенклатура + Символы.ПС;
					КонецЦикла;
					Сообщить("Нет остатка на складе по номенклатуре:" + Символы.ПС + ТекстСообщенияНоменклатураБезОстатка);
				КонецЕсли;
				Элементы.РаспределениеМатериалаМягкиРезерв.Видимость = Объект.Резерв;
				Элементы.РаспределениеМатериалаОтгрузить.Видимость = Не Объект.Резерв;
				
				//28.05.2025
				ТекущаяНоменклатура = Объект.МатериалыСпецификации[0].Номенклатура;  
				ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекущаяНоменклатура);
				//
				ОповеститьПользователя(Истина);
			КонецЕсли;
		КонецЕсли;
		
		Если ДополнительныеПараметры = "ЗафиксироватьКорректировкиНовая" Тогда
			ОповеститьПользователя(,, Истина);
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Резервирование завершено!'"));
		КонецЕсли;
		
		Если ДополнительныеПараметры = "ВыполнитьСписание" Тогда
			ОтборСтрок = Новый Структура("Обрабатывать", Истина);
			МассивЭтаповДляОбработки = Этапы.НайтиСтроки(ОтборСтрок);
			
			Для Каждого СтрЭтап Из МассивЭтаповДляОбработки Цикл
				Если Не СтрЭтап.Обрабатывать Тогда 
					Продолжить;
				КонецЕсли;
				
				Этап = СтрЭтап.ЭтапПроизводства;
				РасходыЗаполнены = ЗаполнитьРасходЭтапа(Этап);
				
				Если Не РасходыЗаполнены Тогда
					Возврат;
				КонецЕсли;
			КонецЦикла;
			
			ОповеститьПользователя(,,, Истина);
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru ='Списание завершено!'"));
		КонецЕсли; 
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область ПереходыНаСтраницы

&НаКлиенте
Процедура СтраницыСписанияПриСменеСтраницы(Элемент, ТекущаяСтраница) 
		
	//++Дарвин А.А.
	КоличествоВыбранныхЭтапов = ПолучитьКоличествоВыбранныхЭтапов(, Истина);
	
	Если КоличествоВыбранныхЭтапов = 0 Тогда
		Возврат;
	КонецЕсли;
	//Дарвин А.А
		
	//УстановитьДанныеПартииПроизводства(Этап);  
	//Нормативы = ПолучитьИзВременногоХранилища(Этап);
	
	Если ТекущаяСтраница.Имя = "СтраницаЭтапы" Тогда
		ВопросПользователюПередВыполнениемОперации(Истина);	
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаМатериалыСпецификации" Тогда 
		ВопросПользователюПередВыполнениемОперации();		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
//+ Ганьшина Е 20.08.2025    
// переделала
Функция ПолучитьКоличествоВыбранныхЭтапов(Знач ВыбратьОтмеченные = Ложь, Знач ПолучитьТолькоКоличество = Ложь, ВернутьМассивЭтапов = ложь)
	
	ПараметрыОтбора = Новый Структура("Обрабатывать", Истина); 
	
	
	ТабВсеЭтапы = Этапы.Выгрузить(); 
	КолонкиГруппировки = "Обрабатывать,  Статус, ЭтапПроизводства, КоличествоУпаковокФакт, ДатаПроизводства, Назначение, Номенклатура, Запланировано, Спецификация"; 
	ТабВсеЭтапы.Свернуть(КолонкиГруппировки);
	ТабЭтапы = Этапы.Выгрузить(ПараметрыОтбора);
	ТабОтмеченныеЭтапы = ТабЭтапы.Скопировать(); 
	ТабОтмеченныеЭтапы.Свернуть(КолонкиГруппировки);
	
	Если ПолучитьТолькоКоличество Тогда
		Возврат ТабОтмеченныеЭтапы.Количество();
	КонецЕсли;
		
	Если ВыбратьОтмеченные Тогда
		
		Если ВернутьМассивЭтапов Тогда 
			Возврат ТабОтмеченныеЭтапы.ВыгрузитьКолонку("ЭтапПроизводства");
		Иначе 
			Возврат ТабОтмеченныеЭтапы;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВернутьМассивЭтапов Тогда
		Возврат ТабВсеЭтапы.ВыгрузитьКолонку("ЭтапПроизводства");
	Иначе 
		Возврат ТабВсеЭтапы;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСпецификациюПоВыбраннымЭтапам(ИмяТаблицыЭтапы, ЭтоСписание)
	
	ПараметрыОтбора = Новый Структура("Обрабатывать",Истина);
	МассивСтрок = ЭтаФорма[ИмяТаблицыЭтапы].НайтиСтроки(ПараметрыОтбора);
	ТЗ = ЭтаФорма[ИмяТаблицыЭтапы].Выгрузить(МассивСтрок,"Спецификация"); 
	ТЗ.Свернуть("Спецификация");
	//МассивСпецификаций = ТЗ.ВыгрузитьКолонку("Спецификация");
	//МассивСпецификаций = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСпецификаций); 
	Если ТЗ.Количество() = 1 Тогда  //МассивСпецификаций.Количество() = 1 Тогда 
		Спецификация = ТЗ[0].Спецификация;
		//Если ЭтоСписание Тогда 
		//	Спецификация = МассивСпецификаций[0];
		//Иначе 
		//	СпецификацияРезервирование = МассивСпецификаций[0];
		//КонецЕсли;
	Иначе  
		Сообщить("Не удалось однозначно определить спецификацию по Этапам, выберите спецификацию вручную");
		Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();  
		Для Каждого Стр из ТЗ Цикл 
			Элементы.Спецификация1.СписокВыбора.Добавить(Стр.Спецификация);
		КонецЦикла;
		//Если ЭтоСписание Тогда 
		//	Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
		//Иначе 
		//	СпецификацияРезервирование = Справочники.РесурсныеСпецификации.ПустаяСсылка();
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере  
//25/12/2025
Функция ПолучитьМатериалыПоРегистру(ОтборПоВариантамОбеспечения, ДатаОстатков, Склад, Списание)
	
	ТекстЗапросаУсловие = СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа КАК СпецификацияЭтапа
	               |ПОМЕСТИТЬ СпецификацииЭтапов
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |				ТОГДА РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок
	               |			ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок / РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель * РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель
	               |		КОНЕЦ) КАК Норматив,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие
	               |ПОМЕСТИТЬ НормативыпоСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииЭтапов КАК СпецификацииЭтапов
	               |			ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = СпецификацииЭтапов.СпецификацияЭтапа
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Спецификация,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК СсылкаНаНоменклатуру
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	СсылкаНаНоменклатуру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК СсылкаНаНоменклатуру,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ПОМЕСТИТЬ ЗначенияДополнительногоРеквизита
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТ_Номенклатура.СсылкаНаНоменклатуру
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(РаспределениеЗапасов.Склад, 0) КАК Склад,
	               |	СУММА(ЕСТЬNULL(РаспределениеЗапасов.Зарезервировано, 0)) КАК ЗарезервированоПоМереПоступления
	               |ПОМЕСТИТЬ ВТ_ЗарезервированоПоМереПоступления
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = РаспределениеЗапасов.Номенклатура
	               |ГДЕ
	               |	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
	               |	И РаспределениеЗапасов.Склад В(&Склад)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(РаспределениеЗапасов.Склад, 0),
	               |	РаспределениеЗапасов.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	               |	ВТ_Номенклатура.СсылкаНаНоменклатуру КАК Номенклатура,
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличии,
	               |	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0)) КАК Резерв,
	               |	СУММА(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК Отгружается,
	               |	ЕСТЬNULL(ВТ_ЗарезервированоПоМереПоступления.ЗарезервированоПоМереПоступления, 0) КАК ЗарезервированоПоМереОбеспечения
	               |ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов_v1
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(
	               |				,
	               |				Номенклатура В
	               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |							Таб.СсылкаНаНоменклатуру
	               |						ИЗ
	               |							ВТ_Номенклатура КАК Таб)
	               |					И Склад В (&Склад)) КАК ЗапасыИПотребностиОстатки
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = ЗапасыИПотребностиОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = ТоварыКОтгрузкеОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗарезервированоПоМереПоступления КАК ВТ_ЗарезервированоПоМереПоступления
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = ВТ_ЗарезервированоПоМереПоступления.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = ТоварыНаСкладахОстатки.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Номенклатура.СсылкаНаНоменклатуру,
	               |	ЕСТЬNULL(ВТ_ЗарезервированоПоМереПоступления.ЗарезервированоПоМереПоступления, 0),
	               |	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0),
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад, ЗапасыИПотребностиОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства
	               |ПОМЕСТИТЬ ВТ_Этапы
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировано,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отгружено
	               |ПОМЕСТИТЬ ВТ_ОтгруженоИЗарезервированоПоЭтапам
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЭтапПроизводства
	               |			ИЗ
	               |				ВТ_Этапы КАК Т)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика КАК Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия КАК Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад КАК Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится КАК Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки КАК КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)) КАК СтатьяКалькуляции,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат КАК ПериодЗатрат,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК СпецификацияЭтапа,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь КАК Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание КАК ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска КАК ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК Количество,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок) КАК КоличествоУпаковок,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
	               |	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Резерв, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Отгружается, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0) КАК Остаток,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |					ИЛИ ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обеспечить,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала КАК КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	1 КАК КоличествоСтрок,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК КоличествоВЭтапе,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Отгрузить,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировать,
	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ВыходноеИзделие,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра КАК ИДСтрокиРегистра,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение КАК Подразделение,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПодобраноНаТСД) КАК ПодобраноНаТСД,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.КоличествоУпаковокПлан КАК Запланировано,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения1,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура КАК КлючНоменклатура
	               |ПОМЕСТИТЬ ПредварительныеДанные
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа = ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.ресурсныеСпецификации.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияДополнительногоРеквизита КАК ЗначенияДополнительногоРеквизита
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ЗначенияДополнительногоРеквизита.СсылкаНаНоменклатуру, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтгруженоИЗарезервированоПоЭтапам КАК ВТ_ОтгруженоИЗарезервированоПоЭтапам
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НовыеОстаткиИзЗапасов_v1 КАК ВТ_НовыеОстаткиИзЗапасов_v1
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)))
	               |			И (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад = ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)))
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация,
	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.КоличествоУпаковокПлан,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура,
	               |	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Резерв, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Отгружается, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
	               |	ПредварительныеДанные.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ПредварительныеДанные.Характеристика КАК Характеристика,
	               |	ПредварительныеДанные.Серия КАК Серия,
	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеДанные.Обособленно КАК Обособленно,
	               |	ПредварительныеДанные.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ПредварительныеДанные.Склад КАК Склад,
	               |	ПредварительныеДанные.Производится КАК Производится,
	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
	               |	ПредварительныеДанные.Назначение КАК Назначение,
	               |	ПредварительныеДанные.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ПредварительныеДанные.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ПредварительныеДанные.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ПредварительныеДанные.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ПредварительныеДанные.КодСтроки КАК КодСтроки,
	               |	ПредварительныеДанные.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ПредварительныеДанные.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ПредварительныеДанные.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ПредварительныеДанные.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ПредварительныеДанные.ПериодЗатрат КАК Период,
	               |	ПредварительныеДанные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ПредварительныеДанные.Пользователь КАК Пользователь,
	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеДанные.ЭтоСписание КАК ЭтоСписание,
	               |	ПредварительныеДанные.ДатаЗапуска КАК ДатаЗапуска,
	               |	ПредварительныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПредварительныеДанные.Количество КАК Количество,
	               |	ПредварительныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПредварительныеДанные.Норматив КАК Норматив,
	               |	ПредварительныеДанные.Остаток КАК ОстатокОбщий,
	               |	ПредварительныеДанные.Остаток КАК Остаток,
	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
	               |	ПредварительныеДанные.ПодобраноНаТСД КАК ПодобраноНаТСД,
	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоЭтапов,
	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
	               |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	ПредварительныеДанные.ИДСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход,
	               |	ПредварительныеДанные.Подразделение КАК Подразделение,
	               |	ПредварительныеДанные.Запланировано КАК Запланировано,
	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения1 КАК МАХОтборПоВариантамОбеспечения,
	               |	ПредварительныеДанные.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ПредварительныеДанные.КлючНоменклатура КАК КлючНоменклатура
	               |ИЗ
	               |	ПредварительныеДанные КАК ПредварительныеДанные
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ЭтапПроизводства
	               |ИТОГИ
	               |	МАКСИМУМ(Номенклатура),
	               |	МАКСИМУМ(ИсходнаяНоменклатура),
	               |	МАКСИМУМ(Упаковка),
	               |	МАКСИМУМ(ВариантОбеспечения),
	               |	МАКСИМУМ(Обособленно),
	               |	МАКСИМУМ(Склад),
	               |	МАКСИМУМ(Назначение),
	               |	МАКСИМУМ(НазначениеОбеспечения),
	               |	МАКСИМУМ(КлючСвязиСпецификация),
	               |	МАКСИМУМ(СтатьяКалькуляции),
	               |	СУММА(Количество),
	               |	СУММА(КоличествоУпаковок),
	               |	СУММА(Норматив),
	               |	СРЕДНЕЕ(ОстатокОбщий),
	               |	СРЕДНЕЕ(Остаток),
	               |	СУММА(Обеспечить),
	               |	СУММА(ПодобраноНаТСД),
	               |	СРЕДНЕЕ(ОтборПоВариантамОбеспечения),
	               |	МАКСИМУМ(ВидНоменклатуры),
	               |	СУММА(КоличествоСтрок),
	               |	СУММА(Отгрузить),
	               |	СУММА(Зарезервировать),
	               |	СУММА(Расход),
	               |	МАКСИМУМ(Подразделение),
	               |	СРЕДНЕЕ(Запланировано),
	               |	МАКСИМУМ(МАХОтборПоВариантамОбеспечения),
	               |	МАКСИМУМ(КлючСвязиНабор),
	               |	МАКСИМУМ(КлючНоменклатура)
	               |ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Текст = Запрос.Текст + "
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ                                           
				   |	ПредварительныеДанные.Номенклатура.КодДляПоиска КАК КодНоменклатуры,
	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
	               |	ПредварительныеДанные.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ПредварительныеДанные.Характеристика КАК Характеристика,
	               |	ПредварительныеДанные.Серия КАК Серия,
	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеДанные.Обособленно КАК Обособленно,
	               |	ПредварительныеДанные.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ПредварительныеДанные.Склад КАК Склад,
	               |	ПредварительныеДанные.Производится КАК Производится,
	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
	               |	ПредварительныеДанные.Назначение КАК Назначение,
				   |	ПредварительныеДанные.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ПредварительныеДанные.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ПредварительныеДанные.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ПредварительныеДанные.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ПредварительныеДанные.КодСтроки КАК КодСтроки,
	               |	ПредварительныеДанные.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ПредварительныеДанные.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ПредварительныеДанные.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ПредварительныеДанные.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ПредварительныеДанные.ПериодЗатрат КАК Период,
	               |	ПредварительныеДанные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ПредварительныеДанные.Пользователь КАК Пользователь,
	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеДанные.ЭтоСписание КАК ЭтоСписание,
	               |	ПредварительныеДанные.ДатаЗапуска КАК ДатаЗапуска,
	               |	ПредварительныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПредварительныеДанные.Количество КАК Количество,
	               |	ПредварительныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПредварительныеДанные.Норматив КАК Норматив,
	               |	ПредварительныеДанные.Остаток КАК ОстатокОбщий,                               
				   |	ПредварительныеДанные.Остаток КАК Остаток,  
	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
				   |	ПредварительныеДанные.ПодобраноНаТСД КАК ПодобраноНаТСД,
	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоЭтапов,
	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
	               |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	ПредварительныеДанные.ИДСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход,
				   |	ПредварительныеДанные.Подразделение КАК Подразделение,
				   |	ПредварительныеДанные.Запланировано КАК Запланировано,
				   |	ПредварительныеДанные.ОтборПоВариантамОбеспечения1 КАК МАХОтборПоВариантамОбеспечения,
				   |	ПредварительныеДанные.КлючСвязиНабор КАК КлючСвязиНабор,
				   |	ПредварительныеДанные.КлючНоменклатура КАК КлючНоменклатура
	               |ИЗ
	               |	ПредварительныеДанные КАК ПредварительныеДанные
	               |
				   |ГДЕ %ТекстЗапросаУсловие
				   |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ЭтапПроизводства
	               |ИТОГИ
	               |	МАКСИМУМ(Номенклатура),
	               |	МАКСИМУМ(ИсходнаяНоменклатура),  
				   |	МАКСИМУМ(Упаковка),
	               |	МАКСИМУМ(ВариантОбеспечения),
	               |	МАКСИМУМ(Обособленно),
	               |	МАКСИМУМ(Склад),
	               |	МАКСИМУМ(Назначение),
				   |	МАКСИМУМ(НазначениеОбеспечения),
				   |	МАКСИМУМ(КлючСвязиСпецификация),
				   |	МАКСИМУМ(СтатьяКалькуляции),
				   |	МАКСИМУМ(ОтборПоВариантамОбеспечения1),
				   |	СУММА(Количество),
				   |	СУММА(КоличествоУпаковок),
	               |	СУММА(Норматив),
	               |	СРЕДНЕЕ(ОстатокОбщий),
	               |	СРЕДНЕЕ(Остаток),
				   |	СРЕДНЕЕ(Запланировано),
	               |	СУММА(Обеспечить),
	               |	СРЕДНЕЕ(ОтборПоВариантамОбеспечения),
	               |	МАКСИМУМ(ВидНоменклатуры),
	               |	СУММА(КоличествоСтрок),
	               |	СУММА(Отгрузить),
	               |	СУММА(Зарезервировать),
	               |	СУММА(Расход), 
				   |	СУММА(ПодобраноНаТСД), 
				   |	МАКСИМУМ(Подразделение),
				   |	МАКСИМУМ(КлючСвязиНабор),
				   |	МАКСИМУМ(КлючНоменклатура)
	               |ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаОстатков",КонецДня(ДатаОстатков));
	Запрос.УстановитьПараметр("Свойство",Объект.ДР_КатегорияМатериала);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь()); 
	Запрос.УстановитьПараметр("ЭтоСписание", Списание);
	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе); 
	Запрос.УстановитьПараметр("СтатьяКалькуляции",Объект.СтатьяКалькуляции);
	//Запрос.УстановитьПараметр("СостояниеЗарезервированоПриПоступлении", Перечисления.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении);
	СкладПФ = Справочники.Склады.НайтиПоНаименованию("Склад ПФ",Ложь);
	СписокСкладов = Новый Массив;
	СписокСкладов.Добавить(Объект.Склад);
	СписокСкладов.Добавить(СкладПФ);
	Запрос.УстановитьПараметр("Склад", СписокСкладов);
	
	Если ТекстЗапросаУсловие <> "" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ТекстЗапросаУсловие",ТекстЗапросаУсловие); 
		Если СтрНайти(ТекстЗапросаУсловие,"&КатегорияМатериала") > 0 Тогда 
			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериала);
		КонецЕсли;
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ %ТекстЗапросаУсловие","");
	КонецЕсли;
	//Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

//18.07.2024
//Ганьшина Е.
//Удалила таблицу ПриходыСледующегоМесяца
//Надо изменить получение остатков по новому регистру Запасы и Потребности на дату

//не считается остаток, если остаток присутствует по нескольким складам
Функция ПолучитьМатериалыПоРегистру_СтараяСГруппировкойОстатковПоСкладу(ОтборПоВариантамОбеспечения, ДатаОстатков, Склад, Списание)
	
	
	ТекстЗапросаУсловие = СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа КАК СпецификацияЭтапа
	               |ПОМЕСТИТЬ СпецификацииЭтапов
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |				ТОГДА РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок
	               |			ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок / РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель * РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель
	               |		КОНЕЦ) КАК Норматив,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие
	               |ПОМЕСТИТЬ НормативыпоСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииЭтапов КАК СпецификацииЭтапов
	               |			ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = СпецификацииЭтапов.СпецификацияЭтапа
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Спецификация,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК СсылкаНаНоменклатуру
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	СсылкаНаНоменклатуру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК СсылкаНаНоменклатуру,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ПОМЕСТИТЬ ЗначенияДополнительногоРеквизита
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТ_Номенклатура.СсылкаНаНоменклатуру
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
	               |	РаспределениеЗапасов.Склад КАК Склад,
	               |	РаспределениеЗапасов.ВНаличии КАК ВНаличии,
	               |	РаспределениеЗапасов.Резерв КАК ВРезервеСоСклада,
	               |	0 КАК КОтгрузке
	               |ПОМЕСТИТЬ ВТ_СвободныеОстатки
	               |ИЗ
	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |ГДЕ
	               |	РаспределениеЗапасов.Состояние = &Состояние
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
	               |	ТоварыКОтгрузкеОстатки.Характеристика,
	               |	ТоварыКОтгрузкеОстатки.Склад,
	               |	0,
	               |	0,
	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	               |ИЗ
	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвободныеОстатки.Номенклатура КАК Номенклатура,
	               |	ВТ_СвободныеОстатки.Характеристика КАК Характеристика,
	               |	ВТ_СвободныеОстатки.Склад КАК Склад,
	               |	СУММА(ВТ_СвободныеОстатки.ВНаличии) КАК ВНаличии,
	               |	СУММА(ВТ_СвободныеОстатки.ВРезервеСоСклада) КАК ВРезервеСоСклада,
	               |	ВЫБОР
	               |		КОГДА СУММА(ВТ_СвободныеОстатки.ВНаличии) >= СУММА(ВТ_СвободныеОстатки.КОтгрузке)
	               |			ТОГДА СУММА(ВТ_СвободныеОстатки.КОтгрузке)
	               |		ИНАЧЕ СУММА(ВТ_СвободныеОстатки.ВНаличии)
	               |	КОНЕЦ КАК КОтгрузке
	               |ПОМЕСТИТЬ ВТ_СвободныеОстаткиСгруппированные
	               |ИЗ
	               |	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_СвободныеОстатки.Номенклатура,
	               |	ВТ_СвободныеОстатки.Склад,
	               |	ВТ_СвободныеОстатки.Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства
	               |ПОМЕСТИТЬ ВТ_Этапы
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировано,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отгружено
	               |ПОМЕСТИТЬ ВТ_ОтгруженоИЗарезервированоПоЭтапам
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЭтапПроизводства
	               |			ИЗ
	               |				ВТ_Этапы КАК Т)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика КАК Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия КАК Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад КАК Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится КАК Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки КАК КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)) КАК СтатьяКалькуляции,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат КАК ПериодЗатрат,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК СпецификацияЭтапа,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь КАК Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание КАК ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска КАК ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК Количество,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок) КАК КоличествоУпаковок,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
	               |	ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВНаличии, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеСоСклада, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.КОтгрузке, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0) КАК Остаток,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |					ИЛИ ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обеспечить,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала КАК КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	1 КАК КоличествоСтрок,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК КоличествоВЭтапе,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Отгрузить,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировать,
	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ВыходноеИзделие,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра КАК ИДСтрокиРегистра,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение КАК Подразделение,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПодобраноНаТСД) КАК ПодобраноНаТСД,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.КоличествоУпаковокПлан КАК Запланировано,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения1,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура КАК КлючНоменклатура
	               |ПОМЕСТИТЬ ПредварительныеДанные
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа = ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.ресурсныеСпецификации.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияДополнительногоРеквизита КАК ЗначенияДополнительногоРеквизита
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ЗначенияДополнительногоРеквизита.СсылкаНаНоменклатуру, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвободныеОстаткиСгруппированные КАК ВТ_СвободныеОстаткиСгруппированные
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)))
	               |			И (ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтгруженоИЗарезервированоПоЭтапам КАК ВТ_ОтгруженоИЗарезервированоПоЭтапам
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация,
	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра,
	               |	ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВНаличии, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеСоСклада, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.КОтгрузке, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.КоличествоУпаковокПлан,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения";
				   //|;
				   //|
				   //|////////////////////////////////////////////////////////////////////////////////
				   //|ВЫБРАТЬ
				   //|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
				   //|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
				   //|	ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
				   //|	ЗапасыИПотребностиОстатки.ВНаличииОстаток КАК ВНаличииОстаток
				   //|ПОМЕСТИТЬ ВТ_ОстаткиЗапасовНаДату
				   //|ИЗ
				   //|	РегистрНакопления.ЗапасыИПотребности.Остатки(&ДатаОстатков, Склад = &СкладМатериалов) КАК ЗапасыИПотребностиОстатки
	               //";
	Запрос.Текст = Запрос.Текст + "
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
	               |	ПредварительныеДанные.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ПредварительныеДанные.Характеристика КАК Характеристика,
	               |	ПредварительныеДанные.Серия КАК Серия,
	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеДанные.Обособленно КАК Обособленно,
	               |	ПредварительныеДанные.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ПредварительныеДанные.Склад КАК Склад,
	               |	ПредварительныеДанные.Производится КАК Производится,
	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
	               |	ПредварительныеДанные.Назначение КАК Назначение,
				   |	ПредварительныеДанные.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ПредварительныеДанные.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ПредварительныеДанные.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ПредварительныеДанные.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ПредварительныеДанные.КодСтроки КАК КодСтроки,
	               |	ПредварительныеДанные.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ПредварительныеДанные.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ПредварительныеДанные.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ПредварительныеДанные.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ПредварительныеДанные.ПериодЗатрат КАК Период,
	               |	ПредварительныеДанные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ПредварительныеДанные.Пользователь КАК Пользователь,
	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеДанные.ЭтоСписание КАК ЭтоСписание,
	               |	ПредварительныеДанные.ДатаЗапуска КАК ДатаЗапуска,
	               |	ПредварительныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПредварительныеДанные.Количество КАК Количество,
	               |	ПредварительныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПредварительныеДанные.Норматив КАК Норматив,
	               |	ПредварительныеДанные.Остаток КАК ОстатокОбщий,                               
				   |	ПредварительныеДанные.Остаток КАК Остаток,  
	               //|	ПредварительныеДанные.Остаток - ПредварительныеДанные.Поступило КАК Остаток,  
	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
				   |	ПредварительныеДанные.ПодобраноНаТСД КАК ПодобраноНаТСД,
	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоЭтапов,
	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
	               |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	ПредварительныеДанные.ИДСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход,
				   |	ПредварительныеДанные.Подразделение КАК Подразделение,
				   |	ПредварительныеДанные.Запланировано КАК Запланировано,
				   |	ПредварительныеДанные.ОтборПоВариантамОбеспечения1 КАК МАХОтборПоВариантамОбеспечения,
				   |	ПредварительныеДанные.КлючСвязиНабор КАК КлючСвязиНабор,
				   |	ПредварительныеДанные.КлючНоменклатура КАК КлючНоменклатура
	               |ИЗ
	               |	ПредварительныеДанные КАК ПредварительныеДанные
	               |
				   |ГДЕ %ТекстЗапросаУсловие
				   |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ЭтапПроизводства
	               |ИТОГИ
	               |	МАКСИМУМ(Номенклатура),
	               |	МАКСИМУМ(ИсходнаяНоменклатура),  
				   |	МАКСИМУМ(Упаковка),
	               |	МАКСИМУМ(ВариантОбеспечения),
	               |	МАКСИМУМ(Обособленно),
	               |	МАКСИМУМ(Склад),
	               |	МАКСИМУМ(Назначение),
				   |	МАКСИМУМ(НазначениеОбеспечения),
				   |	МАКСИМУМ(КлючСвязиСпецификация),
				   |	МАКСИМУМ(СтатьяКалькуляции),
				   |	МАКСИМУМ(ОтборПоВариантамОбеспечения1),
				   |	СУММА(Количество),
				   |	СУММА(КоличествоУпаковок),
	               |	СУММА(Норматив),
	               |	СРЕДНЕЕ(ОстатокОбщий),
	               |	СРЕДНЕЕ(Остаток),
				   |	СРЕДНЕЕ(Запланировано),
	               |	СУММА(Обеспечить),
	               |	СРЕДНЕЕ(ОтборПоВариантамОбеспечения),
	               |	МАКСИМУМ(ВидНоменклатуры),
	               |	СУММА(КоличествоСтрок),
	               |	СУММА(Отгрузить),
	               |	СУММА(Зарезервировать),
	               |	СУММА(Расход), 
				   |	СУММА(ПодобраноНаТСД), 
				   |	МАКСИМУМ(Подразделение),
				   |	МАКСИМУМ(КлючСвязиНабор),
				   |	МАКСИМУМ(КлючНоменклатура)
	               |ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаОстатков",КонецДня(ДатаОстатков));
	Запрос.УстановитьПараметр("Свойство",Объект.ДР_КатегорияМатериала);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь()); 
	Запрос.УстановитьПараметр("ЭтоСписание", Списание);
	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Если ТекстЗапросаУсловие <> "" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ТекстЗапросаУсловие",ТекстЗапросаУсловие); 
		Если СтрНайти(ТекстЗапросаУсловие,"&КатегорияМатериала") > 0 Тогда 
			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериала);
		КонецЕсли;
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ %ТекстЗапросаУсловие","");
	КонецЕсли;
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

//18.07.2024
//Ганьшина Е.
&НаСервере
//Функция ПолучитьМатериалыПоРегиструСтарая(ОтборПоВариантамОбеспечения, ДатаОстатков, Склад, Списание)
//	
//	ТекстЗапросаУсловие = СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание);
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа КАК СпецификацияЭтапа
//	               |ПОМЕСТИТЬ СпецификацииЭтапов
//	               |ИЗ
//	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
//	               |ГДЕ
//	               |	НЕ ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
//	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
//	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	               |				ТОГДА РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок
//	               |			ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок / РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель * РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель
//	               |		КОНЕЦ) КАК Норматив,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
//	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
//	               |	КОНЕЦ КАК Упаковка,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
//	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие
//	               |ПОМЕСТИТЬ НормативыпоСпецификации
//	               |ИЗ
//	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
//	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииЭтапов КАК СпецификацииЭтапов
//	               |			ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = СпецификацииЭтапов.СпецификацияЭтапа
//	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
//	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
//	               |	КОНЕЦ,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
//	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
//	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура
//	               |
//	               |ИНДЕКСИРОВАТЬ ПО
//	               |	Спецификация,
//	               |	Номенклатура
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК СсылкаНаНоменклатуру
//	               |ПОМЕСТИТЬ ВТ_Номенклатура
//	               |ИЗ
//	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
//	               |ГДЕ
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
//	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
//	               |
//	               |ИНДЕКСИРОВАТЬ ПО
//	               |	СсылкаНаНоменклатуру
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК СсылкаНаНоменклатуру,
//	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
//	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
//	               |ПОМЕСТИТЬ ЗначенияДополнительногоРеквизита
//	               |ИЗ
//	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
//	               |		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТ_Номенклатура.СсылкаНаНоменклатуру
//	               |ГДЕ
//	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
//	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
//	               |	РаспределениеЗапасов.Склад КАК Склад,
//	               |	РаспределениеЗапасов.ВНаличии КАК ВНаличии,
//	               |	РаспределениеЗапасов.Резерв КАК ВРезервеСоСклада,
//	               |	0 КАК КОтгрузке
//	               |ПОМЕСТИТЬ ВТ_СвободныеОстатки
//	               |ИЗ
//	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
//	               |ГДЕ
//	               |	РаспределениеЗапасов.Состояние = &Состояние
//	               |
//	               |ОБЪЕДИНИТЬ ВСЕ
//	               |
//	               |ВЫБРАТЬ
//	               |	ТоварыКОтгрузкеОстатки.Номенклатура,
//	               |	ТоварыКОтгрузкеОстатки.Характеристика,
//	               |	ТоварыКОтгрузкеОстатки.Склад,
//	               |	0,
//	               |	0,
//	               |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
//	               |ИЗ
//	               |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ВТ_СвободныеОстатки.Номенклатура КАК Номенклатура,
//	               |	ВТ_СвободныеОстатки.Характеристика КАК Характеристика,
//	               |	ВТ_СвободныеОстатки.Склад КАК Склад,
//	               |	СУММА(ВТ_СвободныеОстатки.ВНаличии) КАК ВНаличии,
//	               |	СУММА(ВТ_СвободныеОстатки.ВРезервеСоСклада) КАК ВРезервеСоСклада,
//	               |	ВЫБОР
//	               |		КОГДА СУММА(ВТ_СвободныеОстатки.ВНаличии) >= СУММА(ВТ_СвободныеОстатки.КОтгрузке)
//	               |			ТОГДА СУММА(ВТ_СвободныеОстатки.КОтгрузке)
//	               |		ИНАЧЕ СУММА(ВТ_СвободныеОстатки.ВНаличии)
//	               |	КОНЕЦ КАК КОтгрузке
//	               |ПОМЕСТИТЬ ВТ_СвободныеОстаткиСгруппированные
//	               |ИЗ
//	               |	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ВТ_СвободныеОстатки.Номенклатура,
//	               |	ВТ_СвободныеОстатки.Склад,
//	               |	ВТ_СвободныеОстатки.Характеристика
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	РаспределениеЗапасов.Склад КАК Склад,
//	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
//	               |	РаспределениеЗапасов.Характеристика КАК Характеристика,
//	               |	СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличии,
//	               |	СУММА(РаспределениеЗапасов.Резерв) КАК Резерв
//	               |ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов
//	               |ИЗ
//	               |	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
//	               |ГДЕ
//	               |	РаспределениеЗапасов.Номенклатура В
//	               |			(ВЫБРАТЬ
//	               |				НормативыпоСпецификации.Номенклатура КАК Номенклатура
//	               |			ИЗ
//	               |				НормативыпоСпецификации КАК НормативыпоСпецификации)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	РаспределениеЗапасов.Номенклатура,
//	               |	РаспределениеЗапасов.Склад,
//	               |	РаспределениеЗапасов.Характеристика
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства
//	               |ПОМЕСТИТЬ ВТ_Этапы
//	               |ИЗ
//	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
//	               |ГДЕ
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
//	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
//	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Зарезервировано,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
//	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Отгружено
//	               |ПОМЕСТИТЬ ВТ_ОтгруженоИЗарезервированоПоЭтапам
//	               |ИЗ
//	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
//	               |ГДЕ
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
//	               |			(ВЫБРАТЬ
//	               |				Т.ЭтапПроизводства
//	               |			ИЗ
//	               |				ВТ_Этапы КАК Т)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	РаспределениеЗапасовДвижения.Номенклатура КАК Номенклатура,
//	               |	РаспределениеЗапасовДвижения.Период КАК Период,
//	               |	СУММА(РаспределениеЗапасовДвижения.ВНаличии) КАК Поступило
//	               |ПОМЕСТИТЬ ПриходыСледующегоМесяца
//	               |ИЗ
//	               |	РегистрНакопления.ТоварыНаСкладах КАК РаспределениеЗапасовДвижения
//	               |ГДЕ
//	               |	РаспределениеЗапасовДвижения.Регистратор ССЫЛКА Документ.ПриобретениеТоваровУслуг
//	               |	И РаспределениеЗапасовДвижения.Период >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаОстатков, МЕСЯЦ, 1), МЕСЯЦ)
//	               |	И РаспределениеЗапасовДвижения.Склад = &Склад
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	РаспределениеЗапасовДвижения.Номенклатура,
//	               |	РаспределениеЗапасовДвижения.Период
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика КАК Характеристика,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия КАК Серия,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
//	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
//	               |	КОНЕЦ КАК Упаковка,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки КАК ДатаОтгрузки,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад КАК Склад,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится КАК Производится,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения КАК НазначениеОбеспечения,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий КАК СтатусУказанияСерий,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки КАК КодСтроки,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора КАК СведенияАвтовыбора,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала КАК ПрименениеМатериала,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
//	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)) КАК СтатьяКалькуляции,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат КАК ПериодЗатрат,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
//	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК СпецификацияЭтапа,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь КАК Пользователь,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание КАК ЭтоСписание,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска КАК ДатаЗапуска,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК Количество,
//	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок) КАК КоличествоУпаковок,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
//	               |	ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВНаличии, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеСоСклада, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0) КАК Остаток,
//	               |	ЕСТЬNULL(ПриходыСледующегоМесяца.Поступило, 0) КАК Поступило,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
//	               |					ИЛИ ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
//	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Обеспечить,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала КАК КатегорияМатериала,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
//	               |	1 КАК КоличествоСтрок,
//	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК КоличествоВЭтапе,
//	               |	ВЫБОР
//	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
//	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
//	               |		ИНАЧЕ 0
//	               |	КОНЕЦ КАК Отгрузить,
//	               |	СУММА(ВЫБОР
//	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
//	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
//	               |			ИНАЧЕ 0
//	               |		КОНЕЦ) КАК Зарезервировать,
//	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ВыходноеИзделие,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра КАК ИДСтрокиРегистра,
//	               |	ПриходыСледующегоМесяца.Номенклатура КАК Номенклатура1,
//	               |	ПриходыСледующегоМесяца.Период КАК Период,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение КАК Подразделение,
//	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПодобраноНаТСД) КАК ПодобраноНаТСД,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.КоличествоУпаковокПлан КАК Запланировано,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения1,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор КАК КлючСвязиНабор,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура КАК КлючНоменклатура
//	               |ПОМЕСТИТЬ ПредварительныеДанные
//	               |ИЗ
//	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
//	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
//	               |			И (ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа = ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.ресурсныеСпецификации.ПустаяСсылка)))
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияДополнительногоРеквизита КАК ЗначенияДополнительногоРеквизита
//	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ЗначенияДополнительногоРеквизита.СсылкаНаНоменклатуру, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтгруженоИЗарезервированоПоЭтапам КАК ВТ_ОтгруженоИЗарезервированоПоЭтапам
//	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПриходыСледующегоМесяца КАК ПриходыСледующегоМесяца
//	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ПриходыСледующегоМесяца.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СвободныеОстаткиСгруппированные КАК ВТ_СвободныеОстаткиСгруппированные
//	               |		ПО ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад = ВТ_СвободныеОстаткиСгруппированные.Склад
//	               |			И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ВТ_СвободныеОстаткиСгруппированные.Номенклатура
//	               |			И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика = ВТ_СвободныеОстаткиСгруппированные.Характеристика
//	               |ГДЕ
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
//	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия,
//	               |	ВЫБОР
//	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
//	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
//	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
//	               |	КОНЕЦ,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация,
//	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)),
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры,
//	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)),
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры,
//	               |	ВЫБОР
//	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
//	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
//	               |		ИНАЧЕ 0
//	               |	КОНЕЦ,
//	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно,
//	               |	ПриходыСледующегоМесяца.Номенклатура,
//	               |	ПриходыСледующегоМесяца.Период,
//	               |	ЕСТЬNULL(ПриходыСледующегоМесяца.Поступило, 0),
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.КоличествоУпаковокПлан,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор,
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура,
//	               |	ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВНаличии, 0) - ЕСТЬNULL(ВТ_СвободныеОстаткиСгруппированные.ВРезервеСоСклада, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0),
//	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения";
//	Запрос.Текст = Запрос.Текст + "
//				   |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
//	               |	ПредварительныеДанные.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
//	               |	ПредварительныеДанные.Характеристика КАК Характеристика,
//	               |	ПредварительныеДанные.Серия КАК Серия,
//	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
//	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
//	               |	ПредварительныеДанные.Обособленно КАК Обособленно,
//	               |	ПредварительныеДанные.ДатаОтгрузки КАК ДатаОтгрузки,
//	               |	ПредварительныеДанные.Склад КАК Склад,
//	               |	ПредварительныеДанные.Производится КАК Производится,
//	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
//	               |	ПредварительныеДанные.Назначение КАК Назначение,
//				   |	ПредварительныеДанные.НазначениеОбеспечения КАК НазначениеОбеспечения,
//	               |	ПредварительныеДанные.СтатусУказанияСерий КАК СтатусУказанияСерий,
//	               |	ПредварительныеДанные.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
//	               |	ПредварительныеДанные.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
//	               |	ПредварительныеДанные.КодСтроки КАК КодСтроки,
//	               |	ПредварительныеДанные.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
//	               |	ПредварительныеДанные.СведенияАвтовыбора КАК СведенияАвтовыбора,
//	               |	ПредварительныеДанные.ПрименениеМатериала КАК ПрименениеМатериала,
//	               |	ПредварительныеДанные.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
//	               |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
//	               |	ПредварительныеДанные.ПериодЗатрат КАК Период,
//	               |	ПредварительныеДанные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	               |	ПредварительныеДанные.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
//	               |	ПредварительныеДанные.СпецификацияЭтапа КАК СпецификацияЭтапа,
//	               |	ПредварительныеДанные.Пользователь КАК Пользователь,
//	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
//	               |	ПредварительныеДанные.ЭтоСписание КАК ЭтоСписание,
//	               |	ПредварительныеДанные.ДатаЗапуска КАК ДатаЗапуска,
//	               |	ПредварительныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	               |	ПредварительныеДанные.Количество КАК Количество,
//	               |	ПредварительныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
//	               |	ПредварительныеДанные.Норматив КАК Норматив,
//	               |	ПредварительныеДанные.Остаток КАК ОстатокОбщий,
//	               |	ПредварительныеДанные.Поступило КАК Поступило,
//	               |	ПредварительныеДанные.Остаток - ПредварительныеДанные.Поступило КАК Остаток,
//	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
//				   |	ПредварительныеДанные.ПодобраноНаТСД КАК ПодобраноНаТСД,
//	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
//	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
//	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
//	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,
//	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоЭтапов,
//	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
//	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
//	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
//	               |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
//	               |	ПредварительныеДанные.ИДСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
//	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход,
//				   |	ПредварительныеДанные.Подразделение КАК Подразделение,
//				   |	ПредварительныеДанные.Запланировано КАК Запланировано,
//				   |	ПредварительныеДанные.ОтборПоВариантамОбеспечения1 КАК МАХОтборПоВариантамОбеспечения,
//				   |	ПредварительныеДанные.КлючСвязиНабор КАК КлючСвязиНабор,
//				   |	ПредварительныеДанные.КлючНоменклатура КАК КлючНоменклатура
//	               |ИЗ
//	               |	ПредварительныеДанные КАК ПредварительныеДанные
//	               |
//				   |ГДЕ %ТекстЗапросаУсловие
//				   |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	Номенклатура,
//	               |	ЭтапПроизводства
//	               |ИТОГИ
//	               |	МАКСИМУМ(Номенклатура),
//	               |	МАКСИМУМ(ИсходнаяНоменклатура),  
//				   |	МАКСИМУМ(Упаковка),
//	               |	МАКСИМУМ(ВариантОбеспечения),
//	               |	МАКСИМУМ(Обособленно),
//	               |	МАКСИМУМ(Склад),
//	               |	МАКСИМУМ(Назначение),
//				   |	МАКСИМУМ(НазначениеОбеспечения),
//				   |	МАКСИМУМ(КлючСвязиСпецификация),
//				   |	МАКСИМУМ(СтатьяКалькуляции),
//				   |	МАКСИМУМ(ОтборПоВариантамОбеспечения1),
//				   |	СУММА(Количество),
//				   |	СУММА(КоличествоУпаковок),
//	               |	СУММА(Норматив),
//	               |	СРЕДНЕЕ(ОстатокОбщий),
//	               |	СРЕДНЕЕ(Поступило),
//	               |	СРЕДНЕЕ(Остаток),
//				   |	СРЕДНЕЕ(Запланировано),
//	               |	СУММА(Обеспечить),
//	               |	СРЕДНЕЕ(ОтборПоВариантамОбеспечения),
//	               |	МАКСИМУМ(ВидНоменклатуры),
//	               |	СУММА(КоличествоСтрок),
//	               |	СУММА(Отгрузить),
//	               |	СУММА(Зарезервировать),
//	               |	СУММА(Расход), 
//				   |	СУММА(ПодобраноНаТСД), 
//				   |	МАКСИМУМ(Подразделение),
//				   |	МАКСИМУМ(КлючСвязиНабор),
//				   |	МАКСИМУМ(КлючНоменклатура)
//	               |ПО
//	               |	Номенклатура
//	               |АВТОУПОРЯДОЧИВАНИЕ";
//	
//	Запрос.УстановитьПараметр("ДатаОстатков",КонецДня(ДатаОстатков));
//	Запрос.УстановитьПараметр("Свойство",Объект.ДР_КатегорияМатериала);
//	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь()); 
//	Запрос.УстановитьПараметр("ЭтоСписание", Списание);
//	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе);
//	Запрос.УстановитьПараметр("Склад", Объект.Склад);
//	
//	Если ТекстЗапросаУсловие <> "" Тогда 
//		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ТекстЗапросаУсловие",ТекстЗапросаУсловие); 
//		Если СтрНайти(ТекстЗапросаУсловие,"&КатегорияМатериала") > 0 Тогда 
//			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериала);
//		КонецЕсли;
//	Иначе 
//		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ %ТекстЗапросаУсловие","");
//	КонецЕсли;
//	Запрос.УстановитьПараметр("Склад", Склад);
//	РезультатЗапроса = Запрос.Выполнить();
//	Возврат РезультатЗапроса;
//	
//КонецФункции


//Процедура записывает в регистр данные по обеспечению материалами по данным Этапов производста.
//устанавливает каждой строке регистра Уникальный идентификатор для связи со строками дерева знрачений.
//Параметры: Период = период среза остатков по материалам;
&НаСервере
Процедура ЗаписатьДанныеРезервированиеСписаниеМатериаловВРегистрСведений(РезультатЗапроса, Период, ЭтоСписание, ДатаОтгрузкиМатериалов)
	
	ТабДанныеРегистра = РезультатЗапроса.Выгрузить();
	
	
	Если ТабДанныеРегистра.Количество() > 0 Тогда 
		
		НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		ТекПользователь = Пользователи.АвторизованныйПользователь(); 
		НЗ.Отбор.Пользователь.Установить(ТекПользователь);
		НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ.Прочитать();   	
		НЗ.Загрузить(ТабДанныеРегистра); 
		НЗ.Записать();
		
		ПараметрыОтбора = Новый Структура("Обрабатывать",Истина);
		МассивЭтапов = Этапы.НайтиСтроки(ПараметрыОтбора);   
				
		МассивНоменклатурыБезНормативов = Новый Массив;
		Для Каждого ЭлементМассива из МассивЭтапов Цикл 
			Этап = ЭлементМассива.ЭтапПроизводства;
			НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
			НЗ.Отбор.Пользователь.Установить(ТекПользователь);
			НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
			НЗ.Отбор.ЭтапПроизводства.Установить(Этап);
			НЗ.Прочитать();
			//Установим для каждой строки регистра УникальныйИдентификатор 
			//Этап = Неопределено; 
			
			Для Каждого СтрНЗ из НЗ Цикл 
				
				СтрНЗ.ДатаОтгрузки = ДатаОтгрузкиМатериалов; 
				СтрНЗ.ИдентификаторСтрокиРегистра = Новый УникальныйИдентификатор;
				
				//Получим нормативы
				УстановитьДанныеПартииПроизводства(Этап);  
				Нормативы = ПолучитьНормативыИзВременногоХранилища(Этап);  
				
				//Запишем нормативы в регистр 
				
				СтруктураПоиска = Новый Структура("Номенклатура",СтрНЗ.Номенклатура); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
				МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
				Если МассивНайденныхСтрок.Количество() > 1 Тогда 
					Сообщить("Норматив: найдено более 1 строки! " + СтрНЗ.Номенклатура);
				ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
					СтрНЗ.Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
				Иначе   
					Если МассивНоменклатурыБезНормативов.Найти(СтрНЗ.Номенклатура) = Неопределено Тогда 
						МассивНоменклатурыБезНормативов.Добавить(СтрНЗ.Номенклатура);
					КонецЕсли;
					
				КонецЕсли; 
					
			КонецЦикла; 
			НЗ.Записать();
			АдресХранилищаНормативы = Неопределено;
		КонецЦикла;
		
		ТекстНачалаСообщения = "Данная позиция отсутствует в спецификации, норматив не найден:" + Символы.ПС;
		ТекстСообщения = "";
		Для Каждого СтрНоменклатура из МассивНоменклатурыБезНормативов Цикл 
			ТекстСообщения = ТекстСообщения + СтрНоменклатура + Символы.ПС;  //ТекстНачалаСообщения + 
		КонецЦикла;        
		Если не ТекстСообщения = "" Тогда 
			ТекстСообщения = ТекстНачалаСообщения + ТекстСообщения;
			Сообщить(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

//Рабочая 30.04.2025
&НаСервере
Функция ЗаполнитьМатериалыСпецификации(Знач ПоЭтапам = Истина, Знач ЗапускФоновогоЗадания = Ложь, Знач ОчиститьВременныйРегистр = Ложь)
	
	//Параметры для фонового задания
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	       	
	///////////////////////////////////////////////////////////////
	ТаблицаВыбранныхЭтапов = ПолучитьКоличествоВыбранныхЭтапов(Истина);	
	Списание = Не Объект.Резерв;
	СтатусВыполнения = Ложь;
	
	Если Списание Тогда 
		Если Объект.РазрешитьОстаткиНаТекущуюДатуПриСписании Тогда 
			Если Месяц(Объект.ПериодОтгрузки) <> Месяц(ТекущаяДатаСеанса()) Тогда 
				ДатаОстатков = КонецМесяца(Объект.ПериодОтгрузки);
			Иначе 
				ДатаОстатков = ТекущаяДатаСеанса();
			КонецЕсли;
		Иначе   
			ДатаОстатков = Объект.ПериодОтгрузки; 
		КонецЕсли; 
		ДатаОтгрузкиМатериалов = Объект.ПериодОтгрузки;
	Иначе 
		ДатаОстатков = ТекущаяДатаСеанса();
		ДатаОтгрузкиМатериалов = ТекущаяДатаСеанса();
	КонецЕсли;
	ОтборПоВариантамОбеспечения = ОтборВариантОбеспечения;
	
	Если ПоЭтапам Тогда		
		
		ИмяФункции = "ТТМ_ДанныеВыбораСервер.ПолучитьМатериалыПоДаннымЭтаповДляРегистра";
		//++ Дарвин А.А. 16.01.2024
		МассивСкладов = Новый Массив;
		МассивСкладов.Добавить(Объект.Склад);
		МассивСкладов.Добавить(Объект.СкладПФ);
		Если ЗапускФоновогоЗадания Тогда
			Возврат ДлительныеОперации.ВыполнитьФункцию(
		 		ПараметрыВыполнения, 
				ИмяФункции,
		 		ДатаОстатков, 
				МассивСкладов, 
				Списание, 
				ТаблицаВыбранныхЭтапов, 
				Объект.ДР_КатегорияМатериала);
		КонецЕсли;		 			
	КонецЕсли;
	ДанныеРегистра = ПолучитьМатериалыПоРегистру(ОтборПоВариантамОбеспечения, ДатаОстатков, Объект.Склад, Списание);
	ВыборкаМатериалов = ДанныеРегистра.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Объект.МатериалыСпецификации.Очистить();
	
	МассивНоменклатурыБезОстатка = Новый Массив;  
	СписокНоменклатурыБезОстатка.Очистить();
	Пока ВыборкаМатериалов.Следующий() Цикл  
		НоваяСтрока = Объект.МатериалыСпецификации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаМатериалов);   
		КонтрольОстатка = ?(ЗначениеЗаполнено(ВыборкаМатериалов.Остаток),ВыборкаМатериалов.Остаток,0) - ?(ЗначениеЗаполнено(ВыборкаМатериалов.ПодобраноНаТСД),ВыборкаМатериалов.ПодобраноНаТСД,ВыборкаМатериалов.Обеспечить) - ВыборкаМатериалов.Зарезервировать - ВыборкаМатериалов.Отгрузить;
		НоваяСтрока.КонтрольОстатка = КонтрольОстатка; 
		
		Если КонтрольОстатка < 0 Тогда 
			МассивНоменклатурыБезОстатка.Добавить(ВыборкаМатериалов.Номенклатура); 
			СписокНоменклатурыБезОстатка.Добавить(ВыборкаМатериалов.Номенклатура); 
		КонецЕсли;
		
		Если ВыборкаМатериалов.ОтборПоВариантамОбеспечения = ВыборкаМатериалов.МАХОтборПоВариантамОбеспечения Тогда 
			НоваяСтрока.УО_ОтборПоВариантамОбеспечения = ВыборкаМатериалов.МАХОтборПоВариантамОбеспечения;
		Иначе 
			НоваяСтрока.УО_ОтборПоВариантамОбеспечения = 1;
		КонецЕсли;
		СтатусВыполнения = Истина;
	КонецЦикла;  
	
	Если МассивНоменклатурыбезОстатка.Количество() <> 0 Тогда 
		
	КонецЕсли;


	Возврат СтатусВыполнения;
	
КонецФункции

&НаСервере  
//28/01/2025
Функция ПолучитьМатериалыПоРегистру_резерв_26_05_25(ОтборПоВариантамОбеспечения, ДатаОстатков, Склад, Списание)
	
	ТекстЗапросаУсловие = СформироватьТекстУсловияДляЗапроса(ОтборПоВариантамОбеспечения, Списание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа КАК СпецификацияЭтапа
	               |ПОМЕСТИТЬ СпецификацииЭтапов
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |				ТОГДА РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок
	               |			ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок / РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Числитель * РесурсныеСпецификацииМатериалыИУслуги.Упаковка.Знаменатель
	               |		КОНЕЦ) КАК Норматив,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК Спецификация,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК ВыходноеИзделие
	               |ПОМЕСТИТЬ НормативыпоСпецификации
	               |ИЗ
	               |	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СпецификацииЭтапов КАК СпецификацииЭтапов
	               |			ПО РесурсныеСпецификацииМатериалыИУслуги.Ссылка = СпецификацииЭтапов.СпецификацияЭтапа
	               |		ПО РесурсныеСпецификацииВыходныеИзделия.Ссылка = РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(РесурсныеСпецификацииМатериалыИУслуги.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ РесурсныеСпецификацииМатериалыИУслуги.Упаковка
	               |	КОНЕЦ,
	               |	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	               |	РесурсныеСпецификацииМатериалыИУслуги.СтатьяКалькуляции,
	               |	РесурсныеСпецификацииВыходныеИзделия.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Спецификация,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК СсылкаНаНоменклатуру
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	СсылкаНаНоменклатуру
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК СсылкаНаНоменклатуру,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ПОМЕСТИТЬ ЗначенияДополнительногоРеквизита
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ПО НоменклатураДополнительныеРеквизиты.Ссылка = ВТ_Номенклатура.СсылкаНаНоменклатуру
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(РаспределениеЗапасов.Склад, 0) КАК Склад,
	               |	СУММА(ЕСТЬNULL(РаспределениеЗапасов.Зарезервировано, 0)) КАК ЗарезервированоПоМереПоступления
	               |ПОМЕСТИТЬ ВТ_ЗарезервированоПоМереПоступления
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = РаспределениеЗапасов.Номенклатура
	               |ГДЕ
	               |	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении)
	               |	И РаспределениеЗапасов.Склад В(&Склад)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(РаспределениеЗапасов.Склад, 0),
	               |	РаспределениеЗапасов.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения, ЗапасыИПотребностиОстатки.Склад), ТоварыКОтгрузкеОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Склад,
	               |	ВТ_Номенклатура.СсылкаНаНоменклатуру КАК Номенклатура,
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) КАК ВНаличии,
	               |	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0)) КАК Резерв,
	               |	СУММА(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК Отгружается,
	               |	ЕСТЬNULL(ВТ_ЗарезервированоПоМереПоступления.ЗарезервированоПоМереПоступления, 0) КАК ЗарезервированоПриПоступлении
	               |ПОМЕСТИТЬ ВТ_НовыеОстаткиИзЗапасов_v1
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	               |				,
	               |				АналитикаУчетаНоменклатуры.МестоХранения ССЫЛКА Справочник.Склады
	               |					И АналитикаУчетаНоменклатуры.МестоХранения В (&Склад)) КАК ТоварыОрганизацийОстатки
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(, Склад В (&Склад)) КАК ЗапасыИПотребностиОстатки
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = ЗапасыИПотребностиОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад В (&Склад)) КАК ТоварыКОтгрузкеОстатки
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = ТоварыКОтгрузкеОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗарезервированоПоМереПоступления КАК ВТ_ЗарезервированоПоМереПоступления
	               |		ПО ВТ_Номенклатура.СсылкаНаНоменклатуру = ВТ_ЗарезервированоПоМереПоступления.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ЕСТЬNULL(ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Характеристика, ЗапасыИПотребностиОстатки.Характеристика), ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	               |	ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0),
	               |	ЕСТЬNULL(ВТ_ЗарезервированоПоМереПоступления.ЗарезервированоПоМереПоступления, 0),
	               |	ВТ_Номенклатура.СсылкаНаНоменклатуру,
	               |	ЕСТЬNULL(ЕСТЬNULL(ЕСТЬNULL(ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.МестоХранения, ЗапасыИПотребностиОстатки.Склад), ТоварыКОтгрузкеОстатки.Склад), ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства
	               |ПОМЕСТИТЬ ВТ_Этапы
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |					ИЛИ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировано,
	               |	СУММА(ВЫБОР
	               |			КОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |				ТОГДА ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Количество
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Отгружено
	               |ПОМЕСТИТЬ ВТ_ОтгруженоИЗарезервированоПоЭтапам
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	               |ГДЕ
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка В
	               |			(ВЫБРАТЬ
	               |				Т.ЭтапПроизводства
	               |			ИЗ
	               |				ВТ_Этапы КАК Т)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика КАК Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия КАК Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ КАК Упаковка,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад КАК Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится КАК Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки КАК КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, &СтатьяКалькуляции) КАК СтатьяКалькуляции,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат КАК ПериодЗатрат,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)) КАК СпецификацияЭтапа,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь КАК Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание КАК ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска КАК ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК Количество,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок) КАК КоличествоУпаковок,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
	               |	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Резерв, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Отгружается, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ЗарезервированоПриПоступлении, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0) КАК Остаток,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |					ИЛИ ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Обеспечить,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала КАК КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	1 КАК КоличествоСтрок,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК КоличествоВЭтапе,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Отгрузить,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |				ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК Зарезервировать,
	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ВыходноеИзделие,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра КАК ИДСтрокиРегистра,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение КАК Подразделение,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПодобраноНаТСД) КАК ПодобраноНаТСД,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.КоличествоУпаковокПлан КАК Запланировано,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения1,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура КАК КлючНоменклатура
	               |ПОМЕСТИТЬ ПредварительныеДанные
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НормативыпоСпецификации КАК НормативыпоСпецификации
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(НормативыпоСпецификации.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ТТМ_АРМ_РезервированиеСписаниеМатериалов.СпецификацияЭтапа = ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.ресурсныеСпецификации.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияДополнительногоРеквизита КАК ЗначенияДополнительногоРеквизита
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ЗначенияДополнительногоРеквизита.СсылкаНаНоменклатуру, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтгруженоИЗарезервированоПоЭтапам КАК ВТ_ОтгруженоИЗарезервированоПоЭтапам
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НовыеОстаткиИзЗапасов_v1 КАК ВТ_НовыеОстаткиИзЗапасов_v1
	               |		ПО (ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)))
	               |			И (ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)))
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &ЭтоСписание
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИсходнаяНоменклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Характеристика,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Серия,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	               |			ТОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ЕдиницаИзмерения
	               |		ИНАЧЕ ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка
	               |	КОНЕЦ,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаОтгрузки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Склад,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Производится,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерий,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийОтправитель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СтатусУказанияСерийПолучатель,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КодСтроки,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИспользуетсяАвтовыбор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.СведенияАвтовыбора,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПрименениеМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиСпецификация,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПериодЗатрат,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.АналитикаУчетаНоменклатуры,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КорАналитикаУчетаНоменклатуры,
	               |	ЕСТЬNULL(НормативыпоСпецификации.Спецификация, ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ДатаЗапуска,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЕдиницаИзмерения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КатегорияМатериала,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура.ВидНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ЕСТЬNULL(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество, 0)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ЕСТЬNULL(НормативыпоСпецификации.ВыходноеИзделие, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ИдентификаторСтрокиРегистра,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Подразделение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.КоличествоУпаковокПлан,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура,
	               |	ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ВНаличии, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Резерв, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.Отгружается, 0) - ЕСТЬNULL(ВТ_НовыеОстаткиИзЗапасов_v1.ЗарезервированоПриПоступлении, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Зарезервировано, 0) + ЕСТЬNULL(ВТ_ОтгруженоИЗарезервированоПоЭтапам.Отгружено, 0),
	               |	ЕСТЬNULL(НормативыпоСпецификации.СтатьяКалькуляции, &СтатьяКалькуляции),
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ОтборПоВариантамОбеспечения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПредварительныеДанные.Номенклатура.КодДляПоиска КАК КодНоменклатуры,
	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
	               |	ПредварительныеДанные.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ПредварительныеДанные.Характеристика КАК Характеристика,
	               |	ПредварительныеДанные.Серия КАК Серия,
	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеДанные.Обособленно КАК Обособленно,
	               |	ПредварительныеДанные.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ПредварительныеДанные.Склад КАК Склад,
	               |	ПредварительныеДанные.Производится КАК Производится,
	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
	               |	ПредварительныеДанные.Назначение КАК Назначение,
	               |	ПредварительныеДанные.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ПредварительныеДанные.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ПредварительныеДанные.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ПредварительныеДанные.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ПредварительныеДанные.КодСтроки КАК КодСтроки,
	               |	ПредварительныеДанные.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ПредварительныеДанные.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ПредварительныеДанные.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ПредварительныеДанные.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ПредварительныеДанные.ПериодЗатрат КАК Период,
	               |	ПредварительныеДанные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ПредварительныеДанные.Пользователь КАК Пользователь,
	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеДанные.ЭтоСписание КАК ЭтоСписание,
	               |	ПредварительныеДанные.ДатаЗапуска КАК ДатаЗапуска,
	               |	ПредварительныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПредварительныеДанные.Количество КАК Количество,
	               |	ПредварительныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПредварительныеДанные.Норматив КАК Норматив,
	               |	ПредварительныеДанные.Остаток КАК ОстатокОбщий,
	               |	ПредварительныеДанные.Остаток КАК Остаток,
	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
	               |	ПредварительныеДанные.ПодобраноНаТСД КАК ПодобраноНаТСД,
	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоЭтапов,
	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
	               |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	ПредварительныеДанные.ИДСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход,
	               |	ПредварительныеДанные.Подразделение КАК Подразделение,
	               |	ПредварительныеДанные.Запланировано КАК Запланировано,
	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения1 КАК МАХОтборПоВариантамОбеспечения,
	               |	ПредварительныеДанные.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ПредварительныеДанные.КлючНоменклатура КАК КлючНоменклатура
	               |ИЗ
	               |	ПредварительныеДанные КАК ПредварительныеДанные
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ЭтапПроизводства
	               |ИТОГИ
	               |	МАКСИМУМ(Номенклатура),
	               |	МАКСИМУМ(ИсходнаяНоменклатура),
	               |	МАКСИМУМ(Упаковка),
	               |	МАКСИМУМ(ВариантОбеспечения),
	               |	МАКСИМУМ(Обособленно),
	               |	МАКСИМУМ(Склад),
	               |	МАКСИМУМ(Назначение),
	               |	МАКСИМУМ(НазначениеОбеспечения),
	               |	МАКСИМУМ(КлючСвязиСпецификация),
	               |	МАКСИМУМ(СтатьяКалькуляции),
	               |	СУММА(Количество),
	               |	СУММА(КоличествоУпаковок),
	               |	СУММА(Норматив),
	               |	СРЕДНЕЕ(ОстатокОбщий),
	               |	СРЕДНЕЕ(Остаток),
	               |	СУММА(Обеспечить),
	               |	СУММА(ПодобраноНаТСД),
	               |	СРЕДНЕЕ(ОтборПоВариантамОбеспечения),
	               |	МАКСИМУМ(ВидНоменклатуры),
	               |	СУММА(КоличествоСтрок),
	               |	СУММА(Отгрузить),
	               |	СУММА(Зарезервировать),
	               |	СУММА(Расход),
	               |	МАКСИМУМ(Подразделение),
	               |	СРЕДНЕЕ(Запланировано),
	               |	МАКСИМУМ(МАХОтборПоВариантамОбеспечения),
	               |	МАКСИМУМ(КлючСвязиНабор),
	               |	МАКСИМУМ(КлючНоменклатура)
	               |ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Текст = Запрос.Текст + "
				   |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ                                           
				   |	ПредварительныеДанные.Номенклатура.КодДляПоиска КАК КодНоменклатуры,
	               |	ПредварительныеДанные.Номенклатура КАК Номенклатура,
	               |	ПредварительныеДанные.ИсходнаяНоменклатура КАК ИсходнаяНоменклатура,
	               |	ПредварительныеДанные.Характеристика КАК Характеристика,
	               |	ПредварительныеДанные.Серия КАК Серия,
	               |	ПредварительныеДанные.Упаковка КАК Упаковка,
	               |	ПредварительныеДанные.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ПредварительныеДанные.Обособленно КАК Обособленно,
	               |	ПредварительныеДанные.ДатаОтгрузки КАК ДатаОтгрузки,
	               |	ПредварительныеДанные.Склад КАК Склад,
	               |	ПредварительныеДанные.Производится КАК Производится,
	               |	ПредварительныеДанные.Спецификация КАК Спецификация,
	               |	ПредварительныеДанные.Назначение КАК Назначение,
				   |	ПредварительныеДанные.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ПредварительныеДанные.СтатусУказанияСерий КАК СтатусУказанияСерий,
	               |	ПредварительныеДанные.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
	               |	ПредварительныеДанные.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
	               |	ПредварительныеДанные.КодСтроки КАК КодСтроки,
	               |	ПредварительныеДанные.ИспользуетсяАвтовыбор КАК ИспользуетсяАвтовыбор,
	               |	ПредварительныеДанные.СведенияАвтовыбора КАК СведенияАвтовыбора,
	               |	ПредварительныеДанные.ПрименениеМатериала КАК ПрименениеМатериала,
	               |	ПредварительныеДанные.КлючСвязиСпецификация КАК КлючСвязиСпецификация,
	               |	ПредварительныеДанные.СтатьяКалькуляции КАК СтатьяКалькуляции,
	               |	ПредварительныеДанные.ПериодЗатрат КАК Период,
	               |	ПредварительныеДанные.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	               |	ПредварительныеДанные.СпецификацияЭтапа КАК СпецификацияЭтапа,
	               |	ПредварительныеДанные.Пользователь КАК Пользователь,
	               |	ПредварительныеДанные.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ПредварительныеДанные.ЭтоСписание КАК ЭтоСписание,
	               |	ПредварительныеДанные.ДатаЗапуска КАК ДатаЗапуска,
	               |	ПредварительныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПредварительныеДанные.Количество КАК Количество,
	               |	ПредварительныеДанные.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ПредварительныеДанные.Норматив КАК Норматив,
	               |	ПредварительныеДанные.Остаток КАК ОстатокОбщий,                               
				   |	ПредварительныеДанные.Остаток КАК Остаток,  
	               |	ПредварительныеДанные.Обеспечить КАК Обеспечить,
				   |	ПредварительныеДанные.ПодобраноНаТСД КАК ПодобраноНаТСД,
	               |	ПредварительныеДанные.КатегорияМатериала КАК КатегорияМатериала,
	               |	ПредварительныеДанные.ОтборПоВариантамОбеспечения КАК ОтборПоВариантамОбеспечения,
	               |	ПредварительныеДанные.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоСтрок,
	               |	ПредварительныеДанные.КоличествоСтрок КАК КоличествоЭтапов,
	               |	ПредварительныеДанные.КоличествоВЭтапе КАК КоличествоВЭтапе,
	               |	ПредварительныеДанные.Отгрузить КАК Отгрузить,
	               |	ПредварительныеДанные.Зарезервировать КАК Зарезервировать,
	               |	ПредварительныеДанные.ВыходноеИзделие КАК ВыходноеИзделие,
	               |	ПредварительныеДанные.ИДСтрокиРегистра КАК ИдентификаторСтрокиРегистра,
	               |	ПредварительныеДанные.Отгрузить + ПредварительныеДанные.Зарезервировать КАК Расход,
				   |	ПредварительныеДанные.Подразделение КАК Подразделение,
				   |	ПредварительныеДанные.Запланировано КАК Запланировано,
				   |	ПредварительныеДанные.ОтборПоВариантамОбеспечения1 КАК МАХОтборПоВариантамОбеспечения,
				   |	ПредварительныеДанные.КлючСвязиНабор КАК КлючСвязиНабор,
				   |	ПредварительныеДанные.КлючНоменклатура КАК КлючНоменклатура
	               |ИЗ
	               |	ПредварительныеДанные КАК ПредварительныеДанные
	               |
				   |ГДЕ %ТекстЗапросаУсловие
				   |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ЭтапПроизводства
	               |ИТОГИ
	               |	МАКСИМУМ(Номенклатура),
	               |	МАКСИМУМ(ИсходнаяНоменклатура),  
				   |	МАКСИМУМ(Упаковка),
	               |	МАКСИМУМ(ВариантОбеспечения),
	               |	МАКСИМУМ(Обособленно),
	               |	МАКСИМУМ(Склад),
	               |	МАКСИМУМ(Назначение),
				   |	МАКСИМУМ(НазначениеОбеспечения),
				   |	МАКСИМУМ(КлючСвязиСпецификация),
				   |	МАКСИМУМ(СтатьяКалькуляции),
				   |	МАКСИМУМ(ОтборПоВариантамОбеспечения1),
				   |	СУММА(Количество),
				   |	СУММА(КоличествоУпаковок),
	               |	СУММА(Норматив),
	               |	СРЕДНЕЕ(ОстатокОбщий),
	               |	СРЕДНЕЕ(Остаток),
				   |	СРЕДНЕЕ(Запланировано),
	               |	СУММА(Обеспечить),
	               |	СРЕДНЕЕ(ОтборПоВариантамОбеспечения),
	               |	МАКСИМУМ(ВидНоменклатуры),
	               |	СУММА(КоличествоСтрок),
	               |	СУММА(Отгрузить),
	               |	СУММА(Зарезервировать),
	               |	СУММА(Расход), 
				   |	СУММА(ПодобраноНаТСД), 
				   |	МАКСИМУМ(Подразделение),
				   |	МАКСИМУМ(КлючСвязиНабор),
				   |	МАКСИМУМ(КлючНоменклатура)
	               |ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ДатаОстатков",КонецДня(ДатаОстатков));
	Запрос.УстановитьПараметр("Свойство",Объект.ДР_КатегорияМатериала);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь()); 
	Запрос.УстановитьПараметр("ЭтоСписание", Списание);
	Запрос.УстановитьПараметр("Состояние", Перечисления.РаспределениеЗапасовСостояния.ОстатокНаСкладе); 
	Запрос.УстановитьПараметр("СтатьяКалькуляции",Объект.СтатьяКалькуляции);
	//Запрос.УстановитьПараметр("СостояниеЗарезервированоПриПоступлении", Перечисления.РаспределениеЗапасовСостояния.ЗарезервированПриПоступлении);
	СкладПФ = Справочники.Склады.НайтиПоНаименованию("Склад ПФ",Ложь);
	СписокСкладов = Новый Массив;
	СписокСкладов.Добавить(Объект.Склад);
	СписокСкладов.Добавить(СкладПФ);
	Запрос.УстановитьПараметр("Склад", СписокСкладов);
	
	Если ТекстЗапросаУсловие <> "" Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ТекстЗапросаУсловие",ТекстЗапросаУсловие); 
		Если СтрНайти(ТекстЗапросаУсловие,"&КатегорияМатериала") > 0 Тогда 
			Запрос.УстановитьПараметр("КатегорияМатериала", ОтборКатегорияМатериала);
		КонецЕсли;
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ГДЕ %ТекстЗапросаУсловие","");
	КонецЕсли;
	//Запрос.УстановитьПараметр("Склад", Склад);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////
#Область РаботаНаСтраницеМатериалыСпецификации

&НаСервере   
//ТекСтрока данные строки на форме
//ТекстрокаРЕгистра - данные строкирегистра (еще не измененные)
Процедура ЗаписатьИзмененияВРегистрНоваяСтарая(ТекСтрока, ТекстрокаРегистра, ЭтапПроизводства = Неопределено) //, СтруктураОтбора = Новый Структура) //Номенклатура, ЭтапПроизводства, Отметка)
	
	ИзменениеКоличества = Ложь;
	ИзменениеОтметки = Ложь;
	ИзменениеНоменклатуры = Ложь;   
	ИзменениеТЧРаспределение = Ложь;
	ЭтоСписание = не Объект.Резерв;    
	
	//Получим норматив для измененной позиции спецификации 
	ПараметрыОтбора = Новый Структура("Обрабатывать",Истина);
	МассивЭтапов = Этапы.НайтиСтроки(ПараметрыОтбора);
	//Этап = МассивЭтапов[0].ЭтапПроизводства;   
	Если ЗначениеЗаполнено(ЭтапПроизводства) Тогда  
		ИзменениеТЧРаспределение = Истина;  
		Нормативы = ПолучитьНормативыИзВременногоХранилища(ЭтапПроизводства); //АдресХранилищаНормативы
	Иначе 
		Нормативы = ПолучитьНормативыИзВременногоХранилища(МассивЭтапов[0].ЭтапПроизводства);
	КонецЕсли;
	СтруктураПоиска = Новый Структура("Номенклатура",ТекстрокаРегистра.Номенклатура); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
	МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
	Если МассивНайденныхСтрок.Количество() > 1 Тогда 
		Сообщить("Норматив: найдено более 1 строки! " + ТекстрокаРегистра.Номенклатура);
	ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
		Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
	Иначе   
		Норматив = 0;
	КонецЕсли;
	
	Если ИзменениеТЧРаспределение Тогда  //ЗначениеЗаполнено(ЭтапПроизводства) Тогда 
		//ИзменениеТЧРаспределение = Истина;  
		
		Резерв = Текстрока.Резерв = Истина;
		МягкийРезерв = ТекСтрока.МягкийРезерв = Истина;
		Отгрузить = ТекСтрока.Отгрузить = Истина;
		Если ТекСтрока.Отметка и (Резерв или МягкийРезерв или Отгрузить) Тогда  
			Обособленно = Ложь;
			Если Резерв Тогда 
				ВариантобеспеченияНовый = Перечисления.ВариантыОбеспечения.СоСклада;
			ИначеЕсли МягкийРезерв Тогда
				ВариантобеспеченияНовый = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
			ИначеЕсли Отгрузить Тогда 
				ВариантобеспеченияНовый = Перечисления.ВариантыОбеспечения.Отгрузить;
			КонецЕсли;       
		ИначеЕсли не ТекСтрока.Отметка Тогда  
			//Восстановление строки регистра с количество по нормативу
			ИзменениеОтметки = Истина;
			Обособленно = Истина;                               
			ВариантобеспеченияНовый = Перечисления.ВариантыОбеспечения.КОбеспечению;
		КонецЕсли; 
		//Получим норматив для измененной позиции спецификации 
		//Нормативы = ПолучитьНормативыИзВременногоХранилища(Этап);
		СтруктураПоиска = Новый Структура("Номенклатура",ТекстрокаРегистра.Номенклатура); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
		МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденныхСтрок.Количество() > 1 Тогда 
			Сообщить("Норматив: найдено более 1 строки! " + ТекстрокаРегистра.Номенклатура);
		ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
			Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
		Иначе   
			Норматив = 0;
		КонецЕсли;
		
		СтруктуктураОтбора = Новый Структура("Номенклатура,ЭтапПроизводства");
		ЗаполнитьЗначенияСвойств(СтруктуктураОтбора,ТекСтрока);
		
		ВариантОбеспеченияДо = ПолучитьВариантОбеспеченияИзРегистра(ТекстрокаРегистра.Номенклатура,ТекСтрока.ЭтапПроизводства);
		
		Если не ВариантобеспеченияНовый = ВариантОбеспеченияДо Тогда 
			УстановитьВариантОбеспеченияНовая(ВариантобеспеченияНовый,Обособленно,ЭтоСписание,СтруктуктураОтбора);
			Возврат;
		КонецЕсли;
	КонецЕсли; 
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();   
	//!!!НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);//!!!!!
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.Номенклатура.Установить(ТекстрокаРегистра.Номенклатура);
	Если ИзменениеТЧРаспределение Тогда 
		НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства);	   
		//+Ганьшина Е 09.04.2025     
		НЗ.Прочитать();
		Если НЗ.Количество() = 0 Тогда 
			ИзменениеОтметки = Истина; 
		Иначе  
			НЗ.Отбор.ВариантОбеспечения.Установить(ТекСтрока.ВариантОбеспечения);
			НЗ.Прочитать(); 
			Если НЗ.Количество() > 0 Тогда 
				СтрокаРегистра = НЗ[0];   
				Если ТекСтрока.КоличествоУпаковок <> СтрокаРегистра.КоличествоУпаковок Тогда  
					//Изменение количества в ТЧ РаспределениеМатериалов
					ИзменениеКоличества = Истина;   
				КонецЕсли;  
			Иначе 
				//Изменение отметки
				ИзменениеОтметки = Истина;
			КонецЕсли;
		КонецЕсли;       
		//-Ганьшина Е 09.04.2025   
	Иначе 
		Если ТекСтрока.КоличествоУпаковок <> РасходВсего и не ИзменениеТЧРаспределение Тогда 
			//Изменение количества в ТЧ МатериалыСпецификации
			ИзменениеКоличества = Истина;   
			//Количество = РасходВсего;  	//+ Ганьшина Е. 11.04.2025
			КоличествоНовое = ТекСтрока.КоличествоУпаковок;   
			// Выполним распределение количества по всем изделиям этапов.
			НовоеКоличествоДляРаспределения = КоличествоНовое;
		ИначеЕсли ТекСтрока.Номенклатура <> НЗ[0].Номенклатура Тогда 
			//Изменение Номенклатуры
			ИзменениеНоменклатуры = Истина; 
			Номенклатура = ТекстрокаРегистра.Номенклатура;
			НоменклатураНовая = ТекСтрока.Номенклатура;     
		КонецЕсли;
	КонецЕсли;           
	Если ИзменениеОтметки Тогда
		НЗ.Прочитать();
		Если не ТекСтрока.Отметка Тогда  
			//Удаляем строку регистра с текущим отбором
			Для Каждого СтрНЗ из НЗ Цикл 
				НЗ.Удалить(СтрНЗ);
			КонецЦикла;  
		Иначе                        
			//Добавляем строку регистра с текущим отбором
			ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
			Если НЗ.Количество() = 0 Тогда 
				НоваяСтрока = НЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);  //+ Ганьшина Е 11.04.2025 // ТекСтрокаРегистра
				НоваяСтрока.ЭтапПроизводства = ТекСтрока.ЭтапПроизводства;                                  
				НоваяСтрока.Норматив = Норматив;
				Знаменатель = ?(ЗначениеЗаполнено(ТекСтрока.Упаковка.Знаменатель),ТекСтрока.Упаковка.Знаменатель,1);
				Числитель = ?(ЗначениеЗаполнено(ТекСтрока.упаковка.Числитель),ТекСтрока.Упаковка.Числитель,1);
				КоэффициентУпаковки = Знаменатель/Числитель;
				НоваяСтрока.Количество = НоваяСтрока.Норматив*КоэффициентУпаковки;    
				НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Норматив;
				НоваяСтрока.Упаковка = ?(ЗначениеЗаполнено(ТекСтрока.Упаковка),ТекСтрока.Упаковка,ТекСтрока.Номенклатура.ЕдиницаИзмерения);
				НоваяСтрока.Номенклатура = ТекстрокаРегистра.Номенклатура; 
				Если не ЗначениеЗаполнено(НоваяСтрока.пользователь) Тогда 
					НоваяСтрока.Пользователь = Пользователи.АвторизованныйПользователь();
				КонецЕсли;
				НоваяСтрока.ЭтоСписание = ЭтоСписание;
				НоваяСтрока.ДатаОтгрузки = Объект.ПериодОтгрузки;
				НоваяСтрока.ЕдиницаИзмерения = ТекстрокаРегистра.Номенклатура;
				НоваяСтрока.КатегорияМатериала = ОбработкаОбъект.ПолучитьКатегориюМатериала(ТекстрокаРегистра.Номенклатура,Объект.ДР_КатегорияМатериала);
				НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
				НоваяСтрока.Обособленно = Истина;
				НоваяСтрока.ОтборПоВариантамОбеспечения = 1;                      
				НоваяСтрока.Назначение = ЭтапПроизводства.НазначениеПродукция;
				НоваяСтрока.НазначениеОбеспечения = ЭтапПроизводства.НазначениеПродукция;
				//Если НоваяСтрока.Обособленно Тогда 
				//	НоваяСтрока.Назначение = ЭтапПроизводства.НазначениеПродукция; 
				//Иначе 
				//	НоваяСтрока.Назначение = Справочники.Назначения.ПустаяСсылка();
				//КонецЕсли;   
				Если НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
					НоваяСтрока.Обеспечить = НоваяСтрока.КоличествоУпаковок;
				КонецЕсли;
				НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(ТекстрокаРегистра.Номенклатура,Объект.Склад,Этапы.Выгрузить(,"ЭтапПроизводства"));
				НоваяСтрока.Подразделение = Объект.Склад.Подразделение;
				НоваяСтрока.Склад = Объект.Склад;
				НоваяСтрока.Спецификация = Спецификация;
				НоваяСтрока.СпецификацияЭтапа = ЭтапПроизводства.Спецификация;
				НоваяСтрока.СтатьяКалькуляции = Объект.СтатьяКалькуляции;
				//+Ганьшина Е 09.04.2025
				НоваяСтрока.Запланировано = ЭтапПроизводства.КоличествоУпаковокПлан;
				//-Ганьшина Е 09.04.2025
					
			КонецЕсли;
		КонецЕсли;
		НЗ.Записать();   
		Если ЗначениеЗаполнено(НовоеКоличествоДляРаспределения) Тогда 
			ВыполнитьРаспределениеКоличества();
			НовоеКоличествоДляРаспределения = 0;
		КонецЕсли;
	ИначеЕсли ИзменениеНоменклатуры Тогда   
		//ТЗ = НЗ.Выгрузить();   
		НЗ.Отбор.ВариантОбеспечения.Установить(ТекстрокаРегистра.ВариантОбеспечения);
		НЗ.Прочитать();  
		
		НЗ1 = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ1.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ1.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
		НЗ1.Отбор.Номенклатура.Установить(НоменклатураНовая);
		НЗ1.Прочитать();
		Для Каждого СтрНЗ из НЗ Цикл    
			НоваяСтрока = НЗ1.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрНЗ);
			НоваяСтрока.Номенклатура = НоменклатураНовая; //ТекСтрока.Номенклатура; 
			НоваяСтрока.Норматив = Норматив;
			//Нормативы = ПолучитьНормативыИзВременногоХранилища(Этап);
			////СтруктураПоиска = Новый Структура("Номенклатура",ТекСтрока.Номенклатура); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
			//СтруктураПоиска = Новый Структура("Номенклатура",НоменклатураНовая); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
			//МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
			//Если МассивНайденныхСтрок.Количество() > 1 Тогда 
			//	Сообщить("Норматив: найдено более 1 строки! " + НоменклатураНовая); //СтрНЗ.Номенклатура
			//ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
			//	НоваяСтрока.Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
			//Иначе   
			//	НоваяСтрока.Норматив = 0;
			//КонецЕсли;  
			
			//Рассчитаем остаток для измененной позиции спецификации
			ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
			//НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(ТекСтрока.Номенклатура,Объект.Склад,Этапы.Выгрузить(,"ЭтапПроизводства"));	
			НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(НоменклатураНовая,Объект.Склад,Этапы.Выгрузить(,"ЭтапПроизводства"));	
		КонецЦикла; 
		НЗ1.Записать();
		НЗ.Очистить();  
		НЗ.Записать();		
	ИначеЕсли ИзменениеКоличества Тогда 
		//1. Изменение количества в ТЧ Распределение материала   
		НЗ.Отбор.ВариантОбеспечения.Установить(ТекСтрока.ВариантОбеспечения); 	//+ Ганьшина Е 11.04.2025 ТекстрокаРегистра.ВариантОбеспечения);
		НЗ.Прочитать();
		Если ИзменениеТЧРаспределение Тогда 
			Если НЗ.Количество() = 1 Тогда 
				Для Каждого СтрНЗ из НЗ Цикл
					СтрНЗ.КоличествоУпаковок = ТекСтрока.КоличествоУпаковок;
					Знаменатель = ?(ЗначениеЗаполнено(ТекСтрока.Упаковка.Знаменатель),ТекСтрока.Упаковка.Знаменатель,1);
					Числитель = ?(ЗначениеЗаполнено(ТекСтрока.упаковка.Числитель),ТекСтрока.Упаковка.Числитель,1);
					КоэффициентУпаковки = Знаменатель/Числитель;
					СтрНЗ.Количество = ТекСтрока.КоличествоУпаковок * КоэффициентУпаковки;
					СтрНЗ.Обеспечить = СтрНЗ.Обеспечить - (ТекСтрока.Количество - ТекстрокаРегистра.Количество);
				КонецЦикла;   
				НЗ.Записать();
			ИначеЕсли НЗ.Количество() > 1 Тогда  
				Сообщить("Найдено более 1 записи регистра при изменении количества в  ТЧ РаспределениеМатериаловСпецификации", СтатусСообщения.Важное);
			Иначе 
				Сообщить("Не найдено записи регистра для изменения при изменении количества в  ТЧ РаспределениеМатериаловСпецификации", СтатусСообщения.Важное);
			КонецЕсли;
		//2. Изменение количества в ТЧ МатериалыСпецификации 
		Иначе
			НовоеКоличествоДляРаспределения = ТекСтрока.КоличествоУпаковок;
			//СписокКолонокРаспределениеМатериалов = "Отметка,ЭтапПроизводства,Норматив,Упаковка,Количество,КоличествоУпаковок,НомерЭтапа,ДатаЭтапа";
			РаспределитьКоличествоНаСервере(); //(СписокКолонокРаспределениеМатериалов);
		КонецЕсли;
	КонецЕсли; 
	
	////Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации  
	//Если не ИзменениеНоменклатуры Тогда 
	//	Номенклатура = ТекущаяНоменклатура;
	//Иначе 
	//	Номенклатура = НоменклатураНовая;
	//КонецЕсли;
	
	////Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
	////	ТекСтрокаМС = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	////	//ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрокаМС);
	////	Номенклатура = ТекСтрокаМС.Номенклатура;
	////Иначе            
	////	//Если Объект.МатериалыСпецификации.Количество() > 0 Тогда 
	////	Если ЗначениеЗаполнено(ТекущаяНоменклатура) Тогда 
	////		//ТекСтрокаМС = ТекущаяНоменклатура; //Объект.МатериалыСпецификации.НайтиПоИдентификатору(0);
	////		//ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрокаМС);
	////		Номенклатура = ТекущаяНоменклатура; //ТекСтрокаМС.Номенклатура;
	////	КонецЕсли;
	////КонецЕсли;   
	
	поЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(поЭтапам);
	
	////Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	//ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	//МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	//Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
	//	ТекСтрокаМС = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрокаМС.ПолучитьИдентификатор();
	//Иначе 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	//КонецЕсли;     
	
	ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(Номенклатура);   
	
	////Востановление строки ТЧ РаспределениеМатериалов     
	//Если ЗначениеЗаполнено(ЭтапПроизводства) Тогда 
	//	ПараметрыПоиска = Новый Структура("ЭтапПроизводства",ЭтапПроизводства);
	//	МассивСтрокТЧРаспределениеМатериалов = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыПоиска);
	//	Если МассивСтрокТЧРаспределениеМатериалов.Количество() > 0 Тогда 
	//		ТекСтрокаРМ = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыПоиска)[0];
	//		Элементы.РаспределениеМатериала.ТекущаяСтрока = ТекСтрокаРМ.ПолучитьИдентификатор();
	//	КонецЕсли; 
	//Иначе 
	//	Элементы.РаспределениеМатериала.ТекущаяСтрока = 0;
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНормативПоНоменклатуре(Номенклатура)
	
	ПараметрыОтбора = Новый Структура("Обрабатывать",Истина);
	МассивЭтапов = Этапы.НайтиСтроки(ПараметрыОтбора);
	Если ЗначениеЗаполнено(ТекущийЭтап) Тогда  
		//ИзменениеТЧРаспределение = Истина;  
		Нормативы = ПолучитьНормативыИзВременногоХранилища(ТекущийЭтап); //АдресХранилищаНормативы
	Иначе 
		Нормативы = ПолучитьНормативыИзВременногоХранилища(МассивЭтапов[0].ЭтапПроизводства);
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Номенклатура",Номенклатура); //,КлючСвязиСпецификация,СтрНЗ.КлючСвязиСпецификация
	МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
	Если МассивНайденныхСтрок.Количество() > 1 Тогда 
		Сообщить("Норматив: найдено более 1 строки! " + Номенклатура);
	ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
		Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
	Иначе   
		Норматив = 0;
	КонецЕсли;   
	
	Возврат Норматив;
	
КонецФункции

&НаСервере   
//ТекСтрока данные строки на форме
//ТекстрокаРЕгистра - данные строкирегистра (еще не измененные)
Процедура ЗаписатьИзмененияВРегистрНовая(ТекСтрока, ТекстрокаРегистра, ЭтапПроизводства = Неопределено, ИзменяемыйРеквизит) // ИзменяемыйРеквизит = "Отметка", "Номенклатура", "Количество", "ВариантОбеспечения"
	
	///////////////////////////////////////////////////////////////////////////////////////////////////
	
	ЭтоСписание = не Объект.Резерв;
	
	Номенклатура = ТекущаяНоменклатура; //ТекстрокаРегистра.Номенклатура; // 16.04.2025  НоменклатураНовая = ТекСтрока.Номенклатура;
	НормативТекущий = ПолучитьНормативПоНоменклатуре(Номенклатура); 
	
	ИзменениеТЧРаспределение = Ложь;
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.Номенклатура.Установить(Номенклатура);                 
	
	// 1. Изменение ТЧМатериалыСпецификации       
	Если ИзменяемыйРеквизит = "Номенклатура" Тогда 
		
		НоменклатураНовая = ТекСтрока.Номенклатура; 
		ТекущаяНоменклатура = НоменклатураНовая;
		
		Норматив = ПолучитьНормативПоНоменклатуре(НоменклатураНовая);
		Если Норматив = 0 Тогда
			Норматив = НормативТекущий;
		КонецЕсли;
		
		//НЗ.Отбор.ВариантОбеспечения.Установить(ТекстрокаРегистра.ВариантОбеспечения);
		НЗ.Прочитать();  
		
		НЗ1 = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ1.Отбор.ЭтоСписание.Установить(ЭтоСписание);
		НЗ1.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
		НЗ1.Отбор.Номенклатура.Установить(НоменклатураНовая);
		НЗ1.Прочитать();
		
		Для Каждого СтрНЗ из НЗ Цикл    
			
			НоваяСтрока = НЗ1.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрНЗ);
			НоваяСтрока.Номенклатура = НоменклатураНовая; //ТекСтрока.Номенклатура; 
			НоваяСтрока.Норматив = Норматив; 
			
			//Рассчитаем остаток для измененной позиции спецификации
			
			//ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
			//НоваяСтрока.Остаток = ОбработкаОбъект.ПолучитьОстаток_2_5(НоменклатураНовая,Объект.Склад,Этапы.Выгрузить(,"ЭтапПроизводства"));	
			
			ПараметрыПоиска = Новый Структура("Обрабатывать",Истина);    
			ТабЭтапы = Этапы.Выгрузить(ПараметрыПоиска,"ЭтапПроизводства,Спецификация");
			НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(НоменклатураНовая, Объект.Склад, ТабЭтапы.ВыгрузитьКолонку("ЭтапПроизводства"), ТабЭтапы, ЭтоСписание);	
			
		КонецЦикла; 
		
		НЗ1.Записать();
		НЗ.Очистить();  
		НЗ.Записать(); 
		ТекущаяНоменклатура = НоменклатураНовая;
		
	// 2. Изменение ТЧРаспределениеМатериалов
	Иначе
		
		Резерв = Текстрока.Резерв = Истина;
		МягкийРезерв = ТекСтрока.МягкийРезерв = Истина;
		Отгрузить = ТекСтрока.Отгрузить = Истина; 
		
		Если Резерв или МягкийРезерв или Отгрузить Тогда  
				
			Обособленно = Ложь;
			Назначение = ТекущийЭтап.НазначениеПродукция; //Справочники.Назначения.ПустаяСсылка();
			
			Если Резерв Тогда 
				ВариантобеспеченияНовый = Перечисления.ВариантыОбеспечения.СоСклада;
			ИначеЕсли МягкийРезерв Тогда
				ВариантобеспеченияНовый = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
			ИначеЕсли Отгрузить Тогда 
				ВариантобеспеченияНовый = Перечисления.ВариантыОбеспечения.Отгрузить;
			КонецЕсли;
		Иначе 
			Обособленно = Истина;
			ВариантобеспеченияНовый = Перечисления.ВариантыОбеспечения.КОбеспечению;
			Назначение = ТекущийЭтап.НазначениеПродукция;
		КонецЕсли;
		
		НЗ.Отбор.ЭтапПроизводства.Установить(ТекущийЭтап);
		
		//2.1. Изменение Отметки 
		#Область ИзменениеОтметки
		Если ИзменяемыйРеквизит = "Отметка" Тогда 
			
			Норматив = ПолучитьНормативПоНоменклатуре(Номенклатура);
			НЗ.Прочитать();
			
			Если не ТекСтрока.Отметка Тогда 
				//Удалить строку по отбору
				Для Каждого СтрНЗ из НЗ Цикл 
					НЗ.Удалить(СтрНЗ);
				КонецЦикла;    
				
				НЗ.Записать(); 
				
			Иначе 
				//Восстановим строку регистра 
				Если НЗ.Количество() = 0 Тогда 
					НоваяСтрока = НЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);  //+ Ганьшина Е 11.04.2025 // ТекСтрокаРегистра
					НоваяСтрока.ЭтапПроизводства = ТекСтрока.ЭтапПроизводства;                                  
					НоваяСтрока.Норматив = Норматив;
					Знаменатель = ?(ЗначениеЗаполнено(ТекСтрока.Упаковка.Знаменатель),ТекСтрока.Упаковка.Знаменатель,1);
					Числитель = ?(ЗначениеЗаполнено(ТекСтрока.упаковка.Числитель),ТекСтрока.Упаковка.Числитель,1);
					КоэффициентУпаковки = Знаменатель/Числитель;
					НоваяСтрока.Количество = ?(НоваяСтрока.Норматив = 0, 1, НоваяСтрока.Норматив*КоэффициентУпаковки);    
					НоваяСтрока.КоличествоУпаковок = ?(Норматив = 0, 1, Норматив);
					НоваяСтрока.Упаковка = ?(ЗначениеЗаполнено(ТекСтрока.Упаковка),ТекСтрока.Упаковка,ТекСтрока.Номенклатура.ЕдиницаИзмерения);
					НоваяСтрока.Номенклатура = Номенклатура; //ТекстрокаРегистра.Номенклатура; 
					Если не ЗначениеЗаполнено(НоваяСтрока.пользователь) Тогда 
						НоваяСтрока.Пользователь = Пользователи.АвторизованныйПользователь();
					КонецЕсли;
					НоваяСтрока.ЭтоСписание = ЭтоСписание;
					НоваяСтрока.ДатаОтгрузки = Объект.ПериодОтгрузки;
					НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
					НоваяСтрока.КатегорияМатериала = ТТМ_ДанныеВыбораСервер.ПолучитьКатегориюМатериала(ТекстрокаРегистра.Номенклатура,Объект.ДР_КатегорияМатериала);
					НоваяСтрока.ВариантОбеспечения = ВариантобеспеченияНовый;
					НоваяСтрока.Обособленно = Обособленно;
					НоваяСтрока.ОтборПоВариантамОбеспечения = 1;
					НоваяСтрока.Назначение = Назначение;      
					НоваяСтрока.НазначениеОбеспечения = Назначение;
					Если НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
						НоваяСтрока.Обеспечить = НоваяСтрока.КоличествоУпаковок;
					КонецЕсли;                                                                                    
					ПараметрыПоиска = Новый Структура("Обрабатывать", Истина);  
					ТабЭтапы = Этапы.Выгрузить(ПараметрыПоиска,"ЭтапПроизводства,Спецификация");
					НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(НоменклатураНовая,Объект.Склад,ТабЭтапы.ВыгрузитьКолонку("ЭтапПроизводства"),ТабЭтапы);	
					//НоваяСтрока.Остаток = ТТМ_ДанныеВыбораСервер.ПолучитьОстаток_2_5(ТекущаяНоменклатура,Объект.Склад,Этапы.Выгрузить(ПараметрыПоиска,"ЭтапПроизводства"));
					НоваяСтрока.Подразделение = Объект.Склад.Подразделение;
					НоваяСтрока.Склад = Объект.Склад;
					НоваяСтрока.Спецификация = Спецификация;
					НоваяСтрока.СпецификацияЭтапа = ЭтапПроизводства.Спецификация;
					НоваяСтрока.СтатьяКалькуляции = Объект.СтатьяКалькуляции;
					//+Ганьшина Е 09.04.2025
					НоваяСтрока.Запланировано = ЭтапПроизводства.КоличествоУпаковокПлан;
					//-Ганьшина Е 09.04.2025
				КонецЕсли;    
				
				НЗ.Записать();
				
			КонецЕсли;
		#КонецОбласти
		//2.2. ВариантОбеспечения
		#Область ИзменениеВариантаОбесппечения
		ИначеЕсли ИзменяемыйРеквизит = "ВариантОбеспечения" Тогда 
						
			СтруктуктураОтбора = Новый Структура("Номенклатура,ЭтапПроизводства");
			ЗаполнитьЗначенияСвойств(СтруктуктураОтбора,ТекСтрока);
			
			//ВариантОбеспеченияДо = ПолучитьВариантОбеспеченияИзРегистра(ТекстрокаРегистра.Номенклатура,ТекСтрока.ЭтапПроизводства);
			ВариантОбеспеченияДо = ТекстрокаРегистра.ВариантОбеспечения;
			
			УстановитьВариантОбеспеченияНовая(ВариантобеспеченияНовый, Обособленно, ЭтоСписание, СтруктуктураОтбора);
		#КонецОбласти	
		//2.3. Количество
		#Область ИзменениеКоличества
		ИначеЕсли ИзменяемыйРеквизит = "Количество" Тогда 
			//1. Изменение количества в ТЧ Распределение материала   
						
			Если ЗначениеЗаполнено(ЭтапПроизводства) Тогда 
				ИзменениеТЧРаспределение = Истина;
			КонецЕсли;
				
			Если ИзменениеТЧРаспределение Тогда 
				НЗ.Отбор.ВариантОбеспечения.Установить(ТекстрокаРегистра.ВариантОбеспечения); 	//+ Ганьшина Е 11.04.2025 ТекстрокаРегистра.ВариантОбеспечения);
				НЗ.Отбор.Обособленно.Установить(ТекстрокаРегистра.Обособленно);  //29.05.2025
				НЗ.Прочитать();
				Если НЗ.Количество() = 1 Тогда 
					Для Каждого СтрНЗ из НЗ Цикл
						СтрНЗ.КоличествоУпаковок = ТекСтрока.КоличествоУпаковок;
						Знаменатель = ?(ЗначениеЗаполнено(ТекСтрока.Упаковка.Знаменатель),ТекСтрока.Упаковка.Знаменатель,1);
						Числитель = ?(ЗначениеЗаполнено(ТекСтрока.упаковка.Числитель),ТекСтрока.Упаковка.Числитель,1);
						КоэффициентУпаковки = Знаменатель/Числитель;
						СтрНЗ.Количество = ТекСтрока.КоличествоУпаковок * КоэффициентУпаковки;
						Если СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
							СтрНЗ.Обеспечить = СтрНЗ.Количество;
						Иначе     
							СтрНЗ.Обеспечить = 0;
							//СтрНЗ.Обеспечить = СтрНЗ.Обеспечить - (ТекСтрока.Количество - ТекстрокаРегистра.Количество);
						КонецЕсли;
					КонецЦикла;   
					НЗ.Записать();
				ИначеЕсли НЗ.Количество() > 1 Тогда  
					Сообщить("Найдено более 1 записи регистра при изменении количества в  ТЧ РаспределениеМатериаловСпецификации", СтатусСообщения.Важное);
				Иначе 
					Сообщить("Не найдено записи регистра для изменения при изменении количества в  ТЧ РаспределениеМатериаловСпецификации", СтатусСообщения.Важное);
				КонецЕсли;
			//2. Изменение количества в ТЧ МатериалыСпецификации 
			Иначе
				НовоеКоличествоДляРаспределения = ТекСтрока.КоличествоУпаковок;
				//СписокКолонокРаспределениеМатериалов = "Отметка,ЭтапПроизводства,Норматив,Упаковка,Количество,КоличествоУпаковок,НомерЭтапа,ДатаЭтапа";
				РаспределитьКоличествоНаСервере(); //(СписокКолонокРаспределениеМатериалов);
			КонецЕсли;
		КонецЕсли;   
	    #КонецОбласти
	КонецЕсли;  
	
	поЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(поЭтапам);  
		
	//ПараметрыПоиска = Новый Структура("Номенклатура",ТекущаяНоменклатура);
	//МассивСтрок = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыПоиска);
	//Элементы.МатериалыСпецификации.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	//
	////28.05.2025
	////ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекСтрока.Номенклатура);
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекущаяНоменклатура);
		
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(Номенклатура);   
	
	///////////////////////////////////////////////////////////////////////////////////////////////////
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЭтапы.ЭтапПроизводства КАК СсылкаНаЭтап,
	               |	ТЭтапы.Обрабатывать КАК Обрабатывать
	               |ПОМЕСТИТЬ ТЭтапы
	               |ИЗ
	               |	&ТЭтапы КАК ТЭтапы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИСТИНА КАК Отметка,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Резерв,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК МягкийРезерв,
	               |	ВЫБОР
	               |		КОГДА ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Отгрузить,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Норматив КАК Норматив,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество КАК Количество,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка КАК Упаковка,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.Номер КАК Номер,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтапПроизводства.Дата КАК Дата,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Обособленно КАК Обособленно,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение КАК Назначение,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.ПодобраноНаТСД КАК ПодобраноНаТСД,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Запланировано КАК Запланировано,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.КлючНоменклатура КАК КлючНоменклатура
	               |ПОМЕСТИТЬ ДанныеРегистра
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = &Номенклатура
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &ТекПользователь
	               |	И ТТМ_АРМ_РезервированиеСписаниеМатериалов.ЭтоСписание = &Списание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДанныеРегистра.ЭтапПроизводства, ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)) = ТЭтапы.СсылкаНаЭтап
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Отметка,
	               |	ДанныеРегистра.Резерв КАК Резерв,
	               |	ДанныеРегистра.МягкийРезерв КАК МягкийРезерв,
	               |	ДанныеРегистра.Отгрузить КАК Отгрузить,
	               |	ТЭтапы.СсылкаНаЭтап КАК ЭтапПроизводства,
	               |	ЕСТЬNULL(ДанныеРегистра.Норматив, 0) КАК Норматив,
	               |	ЕСТЬNULL(ДанныеРегистра.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК Упаковка,
	               |	ДанныеРегистра.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	ДанныеРегистра.Количество КАК Количество,
	               |	ЕСТЬNULL(ДанныеРегистра.ЭтапПроизводства.Номер, """") КАК НомерЭтапа,
	               |	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ДанныеРегистра.ЭтапПроизводства.Дата, """")) КАК ДатаЭтапа,
	               |	ДанныеРегистра.ВариантОбеспечения КАК ВариантОбеспечения,
	               |	ДанныеРегистра.Обособленно КАК Обособленно,
	               |	ДанныеРегистра.Назначение КАК Назначение,
	               |	ДанныеРегистра.НазначениеОбеспечения КАК НазначениеОбеспечения,
	               |	ДанныеРегистра.ПодобраноНаТСД КАК ПодобраноНаТСД,
	               |	ДанныеРегистра.Номенклатура КАК Номенклатура,
	               |	ДанныеРегистра.Запланировано КАК Запланировано,
	               |	ДанныеРегистра.КлючСвязиНабор КАК КлючСвязиНабор,
	               |	ДанныеРегистра.КлючНоменклатура КАК КлючНоменклатура
	               |ИЗ
	               |	ТЭтапы КАК ТЭтапы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра
	               |		ПО (ТЭтапы.СсылкаНаЭтап = ЕСТЬNULL(ДанныеРегистра.ЭтапПроизводства, ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)))
	               |ГДЕ
	               |	ТЭтапы.Обрабатывать";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТекПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Списание",не Объект.Резерв);
	ПараметрыОтбора = Новый Структура("Обрабатывать",Истина);                                                    
	КолонкиГруппировки = "Обрабатывать, ЭтапПроизводства"; 
	ТВыбранныеЭтапы = Этапы.Выгрузить(ПараметрыОтбора,"ЭтапПроизводства,Обрабатывать");
	ТВыбранныеЭтапы.Свернуть(КолонкиГруппировки);
	Запрос.УстановитьПараметр("ТЭтапы",ТВыбранныеЭтапы);
	ТабЭтапы = Запрос.Выполнить().Выгрузить();
	Объект.РаспределениеМатериала.Загрузить(ТабЭтапы);
	
КонецПроцедуры	

&НаКлиенте
Процедура РаспределитьКоличество(Команда)
	//СписокКолонокРаспределениеМатериалов = "Отметка,ЭтапПроизводства,Норматив,Упаковка,Количество,КоличествоУпаковок,НомерЭтапа,ДатаЭтапа";
	ПроверкаВыполнена = ПроверкаЗаполненияВажныхПолейФормы(Команда.Действие);
	
	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	//ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	//ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	Если ЗначениеЗаполнено(ТекущаяНоменклатура) Тогда 
		Номенклатура = ТекущаяНоменклатура;
	КонецЕсли;	
	
	//!!!###??? проверить какая процедура верная
	//ВыполнитьРаспределениеКоличества();
	РаспределитьКоличествоНаСервере();//СписокКолонокРаспределениеМатериалов);  
	////!!!!!!!!!!!!!!!!!!!!Раскомментить!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
	//ПоЭтапам = Ложь;
	//ОбновитьМатериалыСпецификацииНаСервере(поЭтапам);
	//       
	
	//Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
		ТекСтрокаМС = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрокаМС.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;
	
	//ТекСтрокаПослеОбновления = Объект.МатериалыСпецификации.Получить(ИндексТекСтроки);
	//Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрокаПослеОбновления.ПолучитьИдентификатор();
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекущаяНоменклатура);
	////!!!!!!!!!!!!!!!!!!!!Раскомментить!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСписаниеПриАктивизацииСтроки(Элемент)  
	//ТекСтрокаМатериалы = Элементы.МатериалыСписание.ТекущиеДанные;
	//ТекМатериал = ТекСтрокаМатериалы.Номенклатура;                            
	//МатериалыСписаниеПриАктивизацииСтрокиНаСервере(ТекМатериал);
КонецПроцедуры 

&НаКлиенте
Процедура МатериалыСпецификацииПриАктивизацииСтроки(Элемент) 
	
	НовоеКоличествоДляРаспределения = 0;
	
	Если Элементы.МатериалыСпецификации.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат; 
	КонецЕсли; 
	Если ОбновлениеДанныхФормы Тогда        //+ Ганьшина Е 14.04.2025
			
		ПараметрыПоиска = Новый Структура("Номенклатура", ТекущаяНоменклатура);
		МассивНайденныхСтрок = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыПоиска);
		Если МассивНайденныхСтрок.Количество() > 0 Тогда 
			ТекСтрока = МассивНайденныхСтрок[0]; 
			Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
		
		ОбновлениеДанныхФормы = Ложь; 
		Возврат;
	КонецЕсли;  							//- Ганьшина Е 14.04.2025
	
	Если Элемент.ТекущиеДанные = Неопределено и не ЗначениеЗаполнено(Элемент.ТекущаяСтрока) Тогда 
		//Элемент.ТекущаяСтрока = 0; 
		Возврат;  //+ Ганьшина Е 14.04.2025 //-
	ИначеЕсли не ЗначениеЗаполнено(Элемент.ТекущаяСтрока) Тогда 
		//Элемент.ТекущаяСтрока = 0;
		//Возврат; //+ Ганьшина Е 14.04.2025 //29.05.2025 закомментировала
	КонецЕсли;
	
	ТекСтрокаМатериалы = Элемент.ТекущиеДанные;
	
	Попытка
		ТекМатериал = ТекСтрокаМатериалы.Номенклатура;    
		ТекущаяНоменклатура = ТекМатериал;
	Исключение               
		Возврат; //+ Ганьшина Е 14.04.2025
	КонецПопытки;
	ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекМатериал); 
	Элементы.РаспределениеМатериала.ТекущаяСтрока = 0;
	Попытка                  

	Исключение
	КонецПопытки;
	РасходВсего = Объект.РаспределениеМатериала.Итог("КоличествоУпаковок");
	//ПараметрыОтбора = Новый Структура("Отметка",Истина);
	//МассивОтмеченныхСтрок = Объект.РаспределениеМатериала.Выгрузить(ПараметрыОтбора,"Отметка");
	КоличествоОтмеченныхЭтапов = ПолучитьКоличествоОтмеченныхЭтапов();//МассивОтмеченныхСтрок.Количество();
	//КоличествоОтмеченныхЭтапов = Объект.РаспределениеМатериала.Количество();    
	
	ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиМатериаловСпецификации, ТекСтрокаМатериалы);  
	
	Если Элементы.РаспределениеМатериала.ТекущиеДанные = Неопределено Тогда  
		Если Объект.РаспределениеМатериала.Количество() > 0 Тогда 
			ЭтапПроизводства = Объект.РаспределениеМатериала[0].ЭтапПроизводства;
			КоличествоУпаковок = Объект.РаспределениеМатериала[0].КоличествоУпаковок; 
			Количество = Объект.РаспределениеМатериала[0].Количество; ///??Закомментировать и проверить
		Иначе 
			ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
			КоличествоУпаковок = 0; 
			Количество = 0;
		КонецЕсли; 
	Иначе 
		ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
		КоличествоУпаковок = 0; 
		Количество = 0;
	КонецЕсли;
	
	//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиМатериаловСпецификации,
	ИсходныеДанныеСтрокиМатериаловСпецификации.ЭтапПроизводства = ЭтапПроизводства;
	ИсходныеДанныеСтрокиМатериаловСпецификации.КоличествоУпаковок = КоличествоУпаковок;    
	ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура = ТекущаяНоменклатура;   
	
	СтруктураКоэффициента = ПолучитьКоэффициентУпаковки(ИсходныеДанныеСтрокиМатериаловСпецификации);
	КоэффициентУпаковки = СтруктураКоэффициента.Знаменатель / СтруктураКоэффициента.Числитель; 
	ИсходныеДанныеСтрокиМатериаловСпецификации.Количество = КоличествоУпаковок * КоэффициентУпаковки;
	
	ОбновлениеДанныхФормы = Ложь;
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьКоличествоОтмеченныхЭтапов()
	ПараметрыОтбора = Новый Структура("Отметка",Истина);
	МассивОтмеченныхСтрок = Объект.РаспределениеМатериала.Выгрузить(ПараметрыОтбора,"Отметка");
	Возврат МассивОтмеченныхСтрок.Количество();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКоэффициентУпаковки(ТекСтрокаМатериалы) 

	Если не ТекСтрокаМатериалы.Номенклатура = Неопределено Тогда 	
		СтруктураКоэффициента = Новый Структура;
		Знаменатель = ?(ЗначениеЗаполнено(ТекСтрокаМатериалы.Упаковка), ТекСтрокаМатериалы.Упаковка.Знаменатель,1);
		Числитель = ?(ЗначениеЗаполнено(ТекСтрокаМатериалы.Упаковка.Числитель),ТекСтрокаМатериалы.Упаковка.Числитель,1);
		СтруктураКоэффициента.Вставить("Числитель",Числитель);
		СтруктураКоэффициента.Вставить("Знаменатель",Знаменатель);
		Возврат СтруктураКоэффициента;                           
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура МатериалыСпецификацииНоменклатураПриИзмененииНаСервере(ИДТекСтроки, ИДСтрокиРаспределения = Неопределено, ИзменяемыйРеквизит)
	//ИДТекСтроки = Элементы.МатериалыСпецификации.ТекущиеДанные.ПолучитьИдентификатор(); 
	
	Если не ИДСтрокиРаспределения = Неопределено Тогда 
		ТекСТрока = Объект.РаспределениеМатериала.НайтиПоИдентификатору(ИДСтрокиРаспределения);
		ЭтапПроизводства = ТекСТрока.ЭтапПроизводства;
	Иначе     
		ТекСТрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(ИДТекСтроки);
		ЭтапПроизводства = Неопределено;
	КонецЕсли;                
	ЗаписатьИзмененияВРегистрНовая(ТекСтрока, ИсходныеДанныеСтрокиМатериаловСпецификации,ЭтапПроизводства, ИзменяемыйРеквизит);
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	//Если не ЭтапПроизводства = Неопределено Тогда 
	//	ЗаписатьИзмененияВРегистрНовая(ТекСтрока, ИсходныеДанныеСтрокиМатериаловСпецификации,ЭтапПроизводства);
	//Иначе 
	//	
	//КонецЕсли;
	
	
	//ПоЭтапам = Ложь;    
	
	//Обновление материалов спецификации 
	//ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	//Если Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = ИДТекСтроки;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСпецификацииНоменклатураПриИзменении(Элемент)       
	
	ИДТекСтроки = Элементы.МатериалыСпецификации.ТекущиеДанные.ПолучитьИдентификатор(); 
	МатериалыСпецификацииНоменклатураПриИзмененииНаСервере(ИДТекСтроки,,"Номенклатура");	
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
	
	Элементы.МатериалыСпецификации.ТекущаяСтрока = ИДТекСтроки;
	
	//28.05.2025
	ПараметрыОтбора = Новый Структура("Номенклатура",ТекущаяНоменклатура); 
	Если Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда 
		ТекСтрока = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;   
	//ПараметрыПоиска = Новый Структура("Номенклатура",ТекущаяНоменклатура);
	//МассивСтрок = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыПоиска);
	//Элементы.МатериалыСпецификации.ТекущаяСтрока = МассивСтрок[0].ПолучитьИдентификатор();
	
	//28.05.2025
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекСтрока.Номенклатура);
	ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекущаяНоменклатура);
	
	УстановитьУсловноеОформлениеМатериаловСпецификации();
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСпецификацииКоличествоУпаковокПриИзменении(Элемент)
	ИДТекСтроки = Элементы.МатериалыСпецификации.ТекущиеДанные.ПолучитьИдентификатор();   
	НовоеКоличествоДляРаспределения = Элементы.МатериалыСпецификации.ТекущиеДанные.КоличествоУпаковок;
	
	//++Дарвин А.А. 11.12.2023
	Если НовоеКоличествоДляРаспределения = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Количество не может быть нулевым'"),, 
			"Объект.МатериалыСпецификации.КоличествоУпаковок");
		Возврат;
	КонецЕсли;
	//Дарвин А.А.
	
	ВыполнитьРаспределениеКоличества();
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификации(ПоЭтапам);
	
	Элементы.МатериалыСпецификации.ТекущаяСтрока = ИДТекСтроки    
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеМатериалаКоличествоУпаковокПриИзменении(Элемент)
	
	ИДТекСтроки = Элементы.МатериалыСпецификации.ТекущиеДанные.ПолучитьИдентификатор();
	ИДСтрокиРаспределения = Элементы.РаспределениеМатериала.ТекущиеДанные.ПолучитьИдентификатор();
	
	МатериалыСпецификацииНоменклатураПриИзмененииНаСервере(ИДТекСтроки, ИДСтрокиРаспределения, "Количество");
	
	//Элементы.МатериалыСпецификации.ТекущаяСтрока = ИДТекСтроки;
	//Элементы.РаспределениеМатериала.ТекущаяСтрока = ИДСтрокиРаспределения;
	
	//+Ганьшина Е. 29.04.2025
	//Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	ПараметрыОтбораТЧМС = Новый Структура("Номенклатура",ТекущаяНоменклатура);
	МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбораТЧМС); 
	Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
		ТекСтрока = МассивСтрокПоНоменклатуре[0]; //Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;    
	
	//Восстановим ТекущуюСтрокуТЧ РАспределениематериалов
	ПараметрыОтбораРАспределениеМатериалов = Новый Структура("ЭтапПроизводства", ТекущийЭтап);
	МассивНайденныхСтрок = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыОтбораРАспределениеМатериалов);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда 
		ТекСтр = МассивНайденныхСтрок[0];
		Элементы.РаспределениеМатериала.ТекущаяСтрока = ТекСтр.ПолучитьИдентификатор();
	Иначе 
		Элементы.РаспределениеМатериала.ТекущаяСтрока = 0;
	КонецЕсли;   
	//- Ганьшина Е
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВариантОбеспеченияПриИзменении(Элемент)
	ОбновитьМатериалыСпецификации(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборКатегорияМатериалаОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьМатериалыСпецификации(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборВариантОбеспеченияОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьМатериалыСпецификации(Ложь);
КонецПроцедуры

&НаСервере
Процедура РаспределитьКоличествоНаСервере(знач НЗ = Неопределено, Норматив = Неопределено) //(СписокКолонокРаспределениеМатериалов = "", НЗ = Неопределено, Норматив = Неопределено) 
	 
	//ТекНоменклатура = ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура;     
	//ЕдиницаИзмерения_ШТ = ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура.ЕдиницаИзмерения.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796",Истина);
	
	ЕдиницаИзмерения_ШТ = ТекущаяНоменклатура.ЕдиницаИзмерения.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796",Истина); //ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура.ЕдиницаИзмерения.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796",Истина);
	
	СтруктураОтбора = Новый Структура("Отметка",Истина);   
	ТабОтмеченныеЭтапы = Объект.РаспределениеМатериала.Выгрузить(СтруктураОтбора); 
	Этап = ТабОтмеченныеЭтапы[0].ЭтапПроизводства;
	
	Если Норматив = Неопределено Тогда    
		УстановитьДанныеПартииПроизводства(Этап);  
		Нормативы = ПолучитьНормативыИзВременногоХранилища(Этап);
		//Нормативы = ПолучитьИзВременногоХранилища(АдресХранилищаНормативы);
		СтруктураПоиска = Новый Структура("Номенклатура",ТекущаяНоменклатура); //ТекНоменклатура);
		МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденныхСтрок.Количество() > 1 Тогда 
			Сообщить("Норматив: найдено более 1 строки! " + ТекущаяНоменклатура); //ТекНоменклатура);
		ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
			Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
		Иначе   
			Норматив = 0;
		КонецЕсли;	  
	КонецЕсли;
	
	Если НЗ = Неопределено Тогда
		НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭтоСписание.Установить(не Объект.Резерв);
		НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());	
		НЗ.Отбор.Номенклатура.Установить(ТекущаяНоменклатура); // ТекНоменклатура); 
		НЗ.Прочитать();
	КонецЕсли;
	
	ОстатокРаспределения = НовоеКоличествоДляРаспределения;
	ОтмеченоЭтапов = ТабОтмеченныеЭтапы.Количество();  
	РасчетныйОстатокНаСкладе = Неопределено;
	Счетчик = 0;  
	ВО_Отгрузить = Перечисления.ВариантыОбеспечения.Отгрузить;
	ВО_Резерв = Перечисления.ВариантыОбеспечения.СоСклада;
	ВО_МягкийРезерв = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
	
	ВсегоИзделий = НЗ.Итог("Запланировано");
	Для Каждого СтрНЗ из НЗ Цикл     
		НадоДобавитьСтроку = Ложь;  
		КоличествоДобавить = 0;
		Если ТабОтмеченныеЭтапы.Найти(СтрНЗ.ЭтапПроизводства,"ЭтапПроизводства") = Неопределено Тогда 
			Продолжить;
		КонецЕсли;  
		Если РасчетныйОстатокНаСкладе = Неопределено Тогда 
			РасчетныйОстатокНаСкладе = СтрНЗ.Остаток;
		КонецЕсли;
		Знаменатель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Знаменатель),СтрНЗ.Упаковка.Знаменатель,1);
		Числитель = ?(ЗначениеЗаполнено(СтрНЗ.упаковка.Числитель),СтрНЗ.Упаковка.Числитель,1);
		КоэффициентУпаковки = Знаменатель/Числитель;
		Счетчик = Счетчик + 1;                                                                                     
		Если ЕдиницаИзмерения_ШТ и ШтукиТолькоЦеликом Тогда   
			//+29.05.2025
			//распределяем только целыми штуками
			Если Счетчик = КоличествоОтмеченныхЭтапов Тогда 
				//Это последний этап = распределяем остатки
				СтрНЗ.Количество = Цел(ОстатокРаспределения)*КоэффициентУпаковки;
				СтрНЗ.КоличествоУпаковок = Цел(ОстатокРаспределения);
			Иначе         
				Если РасчетныйОстатокНаСкладе <= 0 и ОстатокРаспределения > 0 Тогда 
					//остатка не хватает 
					//1. проверим Вариант обеспечения, если Резервировать или Отгрузить тогда установим количетво = ОстатокРаспределения
					//2.на остаток добавим строку с вариантом обеспечения "К обеспечению".	
					
					Если СтрНЗ.ВариантОбеспечения = ВО_Резерв или СтрНЗ.ВариантОбеспечения = ВО_Отгрузить Тогда    
						СтрНЗ.Количество = ОстатокРаспределения/КоэффициентУпаковки;
						СтрНЗ.КоличествоУпаковок = ОстатокРаспределения;
					Иначе 
						//СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения/ОтмеченоЭтапов*КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
						СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20); //ОтмеченоЭтапов*КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
						СтрНЗ.КоличествоУпаковок = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20); 	 //* ?(Норматив= 0,1,Норматив)		  //ОтмеченоЭтапов,0,РежимОкругления.Окр15как20);
					КонецЕсли;  
				Иначе 
					СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20); //* ?(Норматив = 0,1,Норматив         ОтмеченоЭтапов*КоэффициентУпаковки;
					СтрНЗ.КоличествоУпаковок = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20);
				КонецЕсли;  
			КонецЕсли;   
			ОстатокРаспределения = ОстатокРаспределения - СтрНЗ.КоличествоУпаковок;
			//-
			
			////распределяем только целыми штуками
			//Если Счетчик = КоличествоОтмеченныхЭтапов Тогда 
			//	//Это последний этап = распределяем остатки
			//	СтрНЗ.Количество = Цел(ОстатокРаспределения)*КоэффициентУпаковки;
			//	СтрНЗ.КоличествоУпаковок = Цел(ОстатокРаспределения);
			//Иначе         
			//	Если РасчетныйОстатокНаСкладе <= 0 и ОстатокРаспределения > 0 Тогда 
			//		//остатка не хватает 
			//		//1. проверим Вариант обеспечения, если Резервировать или Отгрузить тогда установим количетво = ОстатокРаспределения
			//		//2.на остаток добавим строку с вариантом обеспечения "К обеспечению".	
			//		
			//		Если СтрНЗ.ВариантОбеспечения = ВО_Резерв или СтрНЗ.ВариантОбеспечения = ВО_Отгрузить Тогда    
			//			СтрНЗ.Количество = ОстатокРаспределения/КоэффициентУпаковки;
			//			СтрНЗ.КоличествоУпаковок = ОстатокРаспределения;
			//		Иначе 
			//			//СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения/ОтмеченоЭтапов*КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
			//			СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20); //ОтмеченоЭтапов*КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
			//			СтрНЗ.КоличествоУпаковок = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20); 	 //* ?(Норматив= 0,1,Норматив)		  //ОтмеченоЭтапов,0,РежимОкругления.Окр15как20);
			//		КонецЕсли;  
			//	Иначе 
			//		СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20); //* ?(Норматив = 0,1,Норматив         ОтмеченоЭтапов*КоэффициентУпаковки;
			//		СтрНЗ.КоличествоУпаковок = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20);
			//	КонецЕсли;  
			//КонецЕсли;   
			//ОстатокРаспределения = ОстатокРаспределения - СтрНЗ.КоличествоУпаковок;
		Иначе 
			//29.05.2025 
			//распределяем поровну на все этапы
			Если РасчетныйОстатокНаСкладе <= ОстатокРаспределения Тогда 
				Если СтрНЗ.ВариантОбеспечения = ВО_Резерв или СтрНЗ.ВариантОбеспечения = ВО_Отгрузить 
							или СтрНЗ.ВариантОбеспечения = ВО_МягкийРезерв Тогда
							
					Если РасчетныйОстатокНаСкладе = 0 Тогда
						//Переведем строку в режим КОбеспечению и разделим количество поровну		
						СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
						СтрНЗ.Обособленно = Истина;
						СтрНЗ.ОтборПоВариантамОбеспечения = 1;
						//СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
						//СтрНЗ.КоличествоУпаковок = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20);					
						СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения / ОтмеченоЭтапов * КоэффициентУпаковки,2,РежимОкругления.Окр15как20);
						СтрНЗ.КоличествоУпаковок = Окр(НовоеКоличествоДляРаспределения / ОтмеченоЭтапов,2,РежимОкругления.Окр15как20);					
					Иначе     
						//
						Если ОстатокРаспределения / ОтмеченоЭтапов >= РасчетныйОстатокНаСкладе Тогда 
							СтрНЗ.Количество = ОстатокРаспределения / ОтмеченоЭтапов;
							СтрНЗ.КоличествоУпаковок = ОстатокРаспределения / ОтмеченоЭтапов * КоэффициентУпаковки;
						Иначе 
							СтрНЗ.Количество = РасчетныйОстатокНаСкладе;
							СтрНЗ.КоличествоУпаковок = РасчетныйОстатокНаСкладе * КоэффициентУпаковки;
							НадоДобавитьСтроку = Истина;  
							//29.05.2025
							КоличествоДобавить = Окр((ОстатокРаспределения - РасчетныйОстатокНаСкладе) / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
							КоличествоУпаковокДобавить = Окр((ОстатокРаспределения - РасчетныйОстатокНаСкладе) / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20);
							//КоличествоДобавить = Окр(НовоеКоличествоДляРаспределения / ОтмеченоЭтапов / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
							//КоличествоУпаковокДобавить = Окр(НовоеКоличествоДляРаспределения / ОтмеченоЭтапов / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20);
						КонецЕсли;
					КонецЕсли;
				Иначе 
					СтрНЗ.Количество = НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки;
					СтрНЗ.КоличествоУпаковок = НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано;
				КонецЕсли;
			Иначе
				//остатка на складе хватает
				СтрНЗ.Количество = НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки;
				СтрНЗ.КоличествоУпаковок = НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано;
			КонецЕсли;  
			//
			//29.05.2025
			////распределяем поровну на все этапы   
			//Если РасчетныйОстатокНаСкладе <= 0 и ОстатокРаспределения > 0 Тогда 
			//	
			//	//остатка не хватает 
			//	//1. проверим Вариант обеспечения, если Резервировать или Отгрузить тогда установим количетво = ОстатокРаспределения
			//	//2.на остаток добавим строку с вариантом обеспечения "К обеспечению".
			//	
			//	Если СтрНЗ.ВариантОбеспечения = ВО_Резерв или СтрНЗ.ВариантОбеспечения = ВО_Отгрузить Тогда 
			//		
			//		СтрНЗ.Количество = ОстатокРаспределения;
			//		СтрНЗ.КоличествоУпаковок = ОстатокРаспределения * КоэффициентУпаковки;
			//		НадоДобавитьСтроку = Истина;  
			//		КоличествоДобавить = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
			//		КоличествоУпаковокДобавить = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20);
			//		
			//	Иначе          
			//		
			//		СтрНЗ.Количество = ОстатокРаспределения;        
			//		СтрНЗ.КоличествоУпаковок = ОстатокРаспределения * КоэффициентУпаковки;
			//		
			//	КонецЕсли;	
			//Иначе    
			//	
			//	СтрНЗ.Количество = НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки;
			//	СтрНЗ.КоличествоУпаковок = НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано;
			//	
			//КонецЕсли;
			//ОстатокРаспределения = ОстатокРаспределения - СтрНЗ.КоличествоУпаковок;
		КонецЕсли; 
		
		//Если СтрНЗ.КоличествоУпаковок = 0 Тогда  
		//	//Установить количество по нормативу (если заполнен) и вариант обеспечения "КОбеспечению" 
		//	//если норматив не заполнен, тогла количество = 1
		//	Если ЗначениеЗаполнено(СтрНЗ.Норматив) Тогда 
		//		СтрНЗ.Количество = СтрНЗ.Норматив;
		//		СтрНЗ.КоличествоУпаковок = СтрНЗ.Норматив * КоэффициентУпаковки;
		//	Иначе 
		//		СтрНЗ.Количество = 1;
		//		СтрНЗ.КоличествоУпаковок = 1*КоэффициентУпаковки;
		//		СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;  
		//		СтрНЗ.ОтборПоВариантамОбеспечения = 1;
		//	КонецЕсли;
		//КонецЕсли;
		
		
		Если НадоДобавитьСтроку Тогда    
			
			СтрНЗ1 = НЗ.Добавить();   
			ЗаполнитьЗначенияСвойств(СтрНЗ1,СтрНЗ);
			//Установим Вариант обеспечения = КОбеспечению
			СтрНЗ1.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
			СтрНЗ1.ОтборПоВариантамОбеспечения = 1;//Проверить!!!????????????????
			Кол = КоличествоДобавить;   
			КолУп = КоличествоУпаковокДобавить;  
			//29.05.2025
			СтрНЗ1.КоличествоУпаковок = КолУп; //Остаток распределения в Упаковках? ДА!!!
			СтрНЗ1.Количество = КолУп / КоэффициентУпаковки; //Проверить!!!
			//
			//СтрНЗ1.КоличествоУпаковок = КолУп / ОтмеченоЭтапов - ОстатокРаспределения; //Остаток распределения в Упаковках? ДА!!!
			//СтрНЗ1.Количество = (КолУп / ОтмеченоЭтапов - ОстатокРаспределения) / КоэффициентУпаковки; //Проверить!!!
			
		КонецЕсли;    
		Если РасчетныйОстатокНаСкладе > 0 Тогда 
			РасчетныйОстатокНаСкладе = РасчетныйОстатокНаСкладе - СтрНЗ.КоличествоУпаковок;
		КонецЕсли;
			
	КонецЦикла; 
	НЗ.Записать(); 

	///////////////////////////////////////////////
	/////////////////////////////////////////////
	//////////////////////////////////////////

	//+ Ганьшина Е 16.04.2025 Закомментирвоала
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекущаяНоменклатура);

	////Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	//Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
	//	ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	//	//ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	//	Номенклатура = ТекСтрока.Номенклатура;   
	//ИначеЕсли ЗначениеЗаполнено(ТекущаяНоменклатура) Тогда 
	//	Номенклатура = ТекущаяНоменклатура;
	//КонецЕсли;   
	//
	//поЭтапам = Ложь;
	//ОбновитьМатериалыСпецификацииНаСервере(поЭтапам);
	//
	////Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	//ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	//МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	//Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
	//	ТекСтрока = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	//Иначе 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	//КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура РаспределитьКоличествоНаСервереНовая_НЕ_ОТЛАЖЕНА(знач НЗ = Неопределено, Норматив = Неопределено) //(СписокКолонокРаспределениеМатериалов = "", НЗ = Неопределено, Норматив = Неопределено) 
	 
	//ТекНоменклатура = ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура;     
	//ЕдиницаИзмерения_ШТ = ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура.ЕдиницаИзмерения.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796",Истина);
	
	ЕдиницаИзмерения_ШТ = ТекущаяНоменклатура.ЕдиницаИзмерения.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796",Истина); //ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура.ЕдиницаИзмерения.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796",Истина);
	
	СтруктураОтбора = Новый Структура("Отметка",Истина);   
	ТабОтмеченныеЭтапы = Объект.РаспределениеМатериала.Выгрузить(СтруктураОтбора); 
	Этап = ТабОтмеченныеЭтапы[0].ЭтапПроизводства;
	
	Если Норматив = Неопределено Тогда    
		УстановитьДанныеПартииПроизводства(Этап);  
		Нормативы = ПолучитьНормативыИзВременногоХранилища(Этап);
		//Нормативы = ПолучитьИзВременногоХранилища(АдресХранилищаНормативы);
		СтруктураПоиска = Новый Структура("Номенклатура",ТекущаяНоменклатура); //ТекНоменклатура);
		МассивНайденныхСтрок = Нормативы.ОбеспечениеМатериаламиИРаботами.НайтиСтроки(СтруктураПоиска);
		Если МассивНайденныхСтрок.Количество() > 1 Тогда 
			Сообщить("Норматив: найдено более 1 строки! " + ТекущаяНоменклатура); //ТекНоменклатура);
		ИначеЕсли МассивНайденныхСтрок.Количество() = 1 Тогда 
			Норматив = МассивНайденныхСтрок[0].КоличествоУпаковок;
		Иначе   
			Норматив = 0;
		КонецЕсли;	  
	КонецЕсли;
	
	Если НЗ = Неопределено Тогда
		НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
		НЗ.Отбор.ЭтоСписание.Установить(не Объект.Резерв);
		НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());	
		НЗ.Отбор.Номенклатура.Установить(ТекущаяНоменклатура); // ТекНоменклатура); 
		НЗ.Прочитать();
	КонецЕсли;
	
	ОстатокРаспределения = НовоеКоличествоДляРаспределения;
	ОтмеченоЭтапов = ТабОтмеченныеЭтапы.Количество();  
	РасчетныйОстатокНаСкладе = Неопределено;
	Счетчик = 0;  
	ВО_Отгрузить = Перечисления.ВариантыОбеспечения.Отгрузить;
	ВО_Резерв = Перечисления.ВариантыОбеспечения.СоСклада;
	ВО_МягкийРезерв = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления;
	
	ВсегоИзделий = НЗ.Итог("Запланировано");
	Для Каждого СтрНЗ из НЗ Цикл     
		НадоДобавитьСтроку = Ложь;  
		КоличествоДобавить = 0;
		Если ТабОтмеченныеЭтапы.Найти(СтрНЗ.ЭтапПроизводства,"ЭтапПроизводства") = Неопределено Тогда 
			Продолжить;
		КонецЕсли;  
		Если РасчетныйОстатокНаСкладе = Неопределено Тогда 
			РасчетныйОстатокНаСкладе = СтрНЗ.Остаток;
		КонецЕсли;
		Знаменатель = ?(ЗначениеЗаполнено(СтрНЗ.Упаковка.Знаменатель),СтрНЗ.Упаковка.Знаменатель,1);
		Числитель = ?(ЗначениеЗаполнено(СтрНЗ.упаковка.Числитель),СтрНЗ.Упаковка.Числитель,1);
		КоэффициентУпаковки = Знаменатель/Числитель;
		Счетчик = Счетчик + 1;                                                                                     
		Если ЕдиницаИзмерения_ШТ и ШтукиТолькоЦеликом Тогда          
			//распределяем только целыми штуками
			Если Счетчик = КоличествоОтмеченныхЭтапов Тогда     
				Если РасчетныйОстатокНаСкладе <= 0 и ОстатокРаспределения > 0 Тогда
					СтрНЗ.Количество = Цел(РасчетныйОстатокНаСкладе)*КоэффициентУпаковки;
					СтрНЗ.КоличествоУпаковок = Цел(РасчетныйОстатокНаСкладе); 
				Иначе 
					//Это последний этап = распределяем остатки
					СтрНЗ.Количество = Цел(ОстатокРаспределения)*КоэффициентУпаковки;
					СтрНЗ.КоличествоУпаковок = Цел(ОстатокРаспределения);  
				КонецЕсли;
			Иначе         
				Если РасчетныйОстатокНаСкладе <= 0 и ОстатокРаспределения > 0 Тогда 
					//остатка не хватает 
					//1. проверим Вариант обеспечения, если Резервировать или Отгрузить тогда установим количетво = ОстатокРаспределения
					//2.на остаток добавим строку с вариантом обеспечения "К обеспечению".	
					
					Если СтрНЗ.ВариантОбеспечения = ВО_Резерв или СтрНЗ.ВариантОбеспечения = ВО_Отгрузить 
													или СтрНЗ.ВариантОбеспечения = ВО_МягкийРезерв Тогда    
						СтрНЗ.Количество = Окр(РасчетныйОстатокНаСкладе / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20);  //ОстатокРаспределенияы //29.05.2025
						СтрНЗ.КоличествоУпаковок = Окр(РасчетныйОстатокНаСкладе / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20); //ОстатокРаспределения; //29.05.2025
					Иначе 
						//СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения/ОтмеченоЭтапов*КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
						СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20); //ОтмеченоЭтапов*КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
						СтрНЗ.КоличествоУпаковок = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20); 	 //* ?(Норматив= 0,1,Норматив)		  //ОтмеченоЭтапов,0,РежимОкругления.Окр15как20);
					КонецЕсли;  
				Иначе 
					СтрНЗ.Количество = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20); //* ?(Норматив = 0,1,Норматив         ОтмеченоЭтапов*КоэффициентУпаковки;
					СтрНЗ.КоличествоУпаковок = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20);
				КонецЕсли;  
			КонецЕсли;
			ОстатокРаспределения = ОстатокРаспределения - СтрНЗ.КоличествоУпаковок;
		Иначе  
			Если Счетчик = КоличествоОтмеченныхЭтапов Тогда 
				//Это последний этап = распределяем остатки
				Если РасчетныйОстатокНаСкладе <= 0 и ОстатокРаспределения > 0 Тогда
					СтрНЗ.Количество = РасчетныйОстатокНаСкладе * КоэффициентУпаковки;
					СтрНЗ.КоличествоУпаковок = РасчетныйОстатокНаСкладе; 
				Иначе 
					СтрНЗ.Количество = ОстатокРаспределения * КоэффициентУпаковки;
					СтрНЗ.КоличествоУпаковок = ОстатокРаспределения;  
				КонецЕсли;
			Иначе 
				//распределяем поровну на все этапы   
				Если РасчетныйОстатокНаСкладе <= 0 и ОстатокРаспределения > 0 Тогда 
					
					//остатка не хватает 
					//1. проверим Вариант обеспечения, если Резервировать или Отгрузить тогда установим количетво = ОстатокРаспределения
					//2.на остаток добавим строку с вариантом обеспечения "К обеспечению".
					
					Если СтрНЗ.ВариантОбеспечения = ВО_Резерв или СтрНЗ.ВариантОбеспечения = ВО_Отгрузить  
													или СтрНЗ.ВариантОбеспечения = ВО_МягкийРезерв Тогда 
						
						//КоличествоДобавить = ОстатокРаспределения;
						//КоличествоУпаковокДобавить = ОстатокРаспределения * КоэффициентУпаковки;
						СтрНЗ.Количество = РасчетныйОстатокНаСкладе; //ОстатокРаспределения;  //29.05.2025
						СтрНЗ.КоличествоУпаковок = РасчетныйОстатокНаСкладе * КоэффициентУпаковки; //ОстатокРаспределения * КоэффициентУпаковки;   //29.05.2025
						
						НадоДобавитьСтроку = Истина; 
						КоличествоДобавить = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки,0,РежимОкругления.Окр15как20);
						КоличествоУпаковокДобавить = Окр(НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано,0,РежимОкругления.Окр15как20);
						
					Иначе          
						
						СтрНЗ.Количество = ОстатокРаспределения;        
						СтрНЗ.КоличествоУпаковок = ОстатокРаспределения * КоэффициентУпаковки;
						
					КонецЕсли;	
				Иначе    
					
					СтрНЗ.Количество = НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано * КоэффициентУпаковки;
					СтрНЗ.КоличествоУпаковок = НовоеКоличествоДляРаспределения / ВсегоИзделий * СтрНЗ.Запланировано;
					
				КонецЕсли;
				ОстатокРаспределения = ОстатокРаспределения - СтрНЗ.КоличествоУпаковок;
			КонецЕсли;
		КонецЕсли; 
		
		//29.05.2025
		Если СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
			СтрНЗ.Обеспечить = СтрНЗ.Количество;
		Иначе 
			СтрНЗ.Обеспечить = 0;
		КонецЕсли; 
		//
		
		Если СтрНЗ.КоличествоУпаковок = 0 Тогда  
			//Установить количество по нормативу (если заполнен) и вариант обеспечения "КОбеспечению" 
			//если норматив не заполнен, тогла количество = 1
			Если ЗначениеЗаполнено(СтрНЗ.Норматив) Тогда 
				СтрНЗ.Количество = СтрНЗ.Норматив;
				СтрНЗ.КоличествоУпаковок = СтрНЗ.Норматив * КоэффициентУпаковки;
			Иначе 
				СтрНЗ.Количество = 1;
				СтрНЗ.КоличествоУпаковок = 1*КоэффициентУпаковки;
				СтрНЗ.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;  
				СтрНЗ.ОтборПоВариантамОбеспечения = 1;
			КонецЕсли;
		КонецЕсли;
		
		
		Если НадоДобавитьСтроку Тогда 
			СтрНЗ1 = НЗ.Добавить();   
			ЗаполнитьЗначенияСвойств(СтрНЗ1,СтрНЗ);
			//Установим Вариант обеспечения = КОбеспечению
			СтрНЗ1.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;
			СтрНЗ1.ОтборПоВариантамОбеспечения = 1;//Проверить!!!????????????????
			Кол = КоличествоДобавить;   
			КолУп = КоличествоУпаковокДобавить;
			СтрНЗ1.КоличествоУпаковок = КолУп - ОстатокРаспределения; //Остаток распределения в Упаковках? ДА!!!
			СтрНЗ1.Количество = (КолУп - ОстатокРаспределения)/КоэффициентУпаковки; //Проверить!!!
			
		КонецЕсли;
		РасчетныйОстатокНаСкладе = РасчетныйОстатокНаСкладе - СтрНЗ.КоличествоУпаковок;
			
	КонецЦикла; 
	НЗ.Записать(); 

	///////////////////////////////////////////////
	/////////////////////////////////////////////
	//////////////////////////////////////////

	//+ Ганьшина Е 16.04.2025 Закомментирвоала
	//ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(ТекущаяНоменклатура);

	////Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	//Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
	//	ТекСтрока = Объект.МатериалыСпецификации.НайтиПоИдентификатору(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	//	//ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ТекСтрока);
	//	Номенклатура = ТекСтрока.Номенклатура;   
	//ИначеЕсли ЗначениеЗаполнено(ТекущаяНоменклатура) Тогда 
	//	Номенклатура = ТекущаяНоменклатура;
	//КонецЕсли;   
	//
	//поЭтапам = Ложь;
	//ОбновитьМатериалыСпецификацииНаСервере(поЭтапам);
	//
	////Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	//ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	//МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора); 
	//Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
	//	ТекСтрока = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	//Иначе 
	//	Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	//КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область ДобавлениеНовойНоменклатуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
	МассивЭтапов = Новый Массив; //Этапы.Выгрузить(,"ЭтапПроизводства");
	
	Для Каждого СтрЭтап из Этапы Цикл //.Выгрузить(,"ЭтапПроизводства");
		Если СтрЭтап.Обрабатывать Тогда 
			МассивЭтапов.Добавить(СтрЭтап.ЭтапПроизводства);
		КонецЕсли;
	КонецЦикла;
	
	
		
	//ДопПараметры = Новый Структура (
		//"ИмяДерева, ЭтоСписание, МассивЭтапов, ДР_КатегорияМатериала, Склад, ДатаОтгрузки, КлючСвязиСпецификация, Подразделение, Спецификация", 
		//ИмяДерева, ЭтоСписание, МассивЭтапов, Объект.ДР_КатегорияМатериала, Объект.Склад, Объект.ПериодОтгрузки, ,);
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("МассивЭтапов", МассивЭтапов);	
	ДопПараметры.Вставить("ДР_КатегорияМатериала", Объект.ДР_КатегорияМатериала);
	ДопПараметры.Вставить("Склад", Объект.Склад);
	ДопПараметры.Вставить("ДатаОтгрузки", Объект.ПериодОтгрузки);
	ДопПараметры.Вставить("КлючСвязиСпецификация");
	ДопПараметры.Вставить("Подразделение");
	ДопПараметры.Вставить("Спецификация");
	ДопПараметры.Вставить("ЭтоСписание", Не Объект.Резерв);
	
	ОповещениеОВыбореНоменклатуры = Новый ОписаниеОповещения("ВыборНоменклатурыПродолжение", ЭтаФорма,ДопПараметры);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",, ЭтаФорма,,,, ОповещениеОВыбореНоменклатуры);
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыборНоменклатурыПродолжение(РезультатЗакрытия,ДопПараметры) Экспорт
	Если РезультатЗакрытия <> Неопределено Тогда 
		//Если РезультатЗакрытия.Свойство("Номенклатура") Тогда  
		ПараметрыОткрытияФормы = Новый Структура;
			   
		//ПараметрыОткрытияФормы.Вставить("ИмяДерева", ДопПараметры.ИмяДерева);
		ПараметрыОткрытияФормы.Вставить("Номенклатура", РезультатЗакрытия);	
		ПараметрыОткрытияФормы.Вставить("ЭтоСписание", ДопПараметры.ЭтоСписание);
		ПараметрыОткрытияФормы.Вставить("МассивЭтапов", ДопПараметры.МассивЭтапов);
		ПараметрыОткрытияФормы.Вставить("ДР_КатегорияМатериала", ДопПараметры.ДР_КатегорияМатериала);
		ПараметрыОткрытияФормы.Вставить("Склад", ДопПараметры.Склад);   
		ПараметрыОткрытияФормы.Вставить("КлючСвязиСпецификация", ДопПараметры.КлючСвязиСпецификация);
		ПараметрыОткрытияФормы.Вставить("ДатаОтгрузки",ДопПараметры.ДатаОтгрузки);                   
		
		СписокКолонок = "ЭтапПроизводства,Спецификация";
		АдресХранилищаТабЭтапы = ПолучитьАдресТабЭтапы(СписокКолонок);
		ПараметрыОткрытияФормы.Вставить("АдресХранилищаТабЭтапы", АдресХранилищаТабЭтапы);
		
		//ПараметрыОткрытияФормы.Вставить("СохранитьИзменения", Ложь);
		ОповещениеОДобавленииНоменклатуры = Новый ОписаниеОповещения("ДобавлениеНоменклатурыЗавершение", ЭтаФорма);
		ОткрытьФорму(
			"Обработка.ТТМ_АРМ_Резервирование_Списание_Материалов_2_2.Форма.ФормаДобавленияНоменклатуры", 
			ПараметрыОткрытияФормы,
			ЭтаФорма,,,,
			ОповещениеОДобавленииНоменклатуры
		);
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Функция ПолучитьАдресТабЭтапы(СписокКолонок)
	
	ПараметрыПоиска = Новый Структура("Обрабатывать", Истина);
	ТабЭтапы = Этапы.Выгрузить(ПараметрыПоиска,СписокКолонок);
	Возврат ПоместитьВоВременноеХранилище(ТабЭтапы,УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ДобавлениеНоменклатурыЗавершение(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда 
		Если РезультатЗакрытия.Свойство("Номенклатура") Тогда 
			ТекущаяНоменклатура = РезультатЗакрытия.Номенклатура;
		КонецЕсли;
		
		Если РезультатЗакрытия.Свойство("ЗаписатьСтрокиВРегистр") И РезультатЗакрытия.ЗаписатьСтрокиВРегистр Тогда  
			ТекущаяНоменклатура = РезультатЗакрытия.МассивСтрок[0].Номенклатура;
			Для Каждого СтрТаб Из РезультатЗакрытия.МассивСтрок Цикл  
				ДобавитьСтрокуВРегистр(СтрТаб, РезультатЗакрытия.ЭтоСписание, Объект.ПериодОтгрузки);      
			КонецЦикла; 		
		КонецЕсли;        
				
		ПоЭтапам = Ложь;
		ЗаполнитьМатериалыСпецификации(ПоЭтапам); 
		
		ПараметрыОтбора = Новый Структура("Номенклатура",ТекущаяНоменклатура); 
		Если Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда 
			ТекСтрока = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
			Элементы.МатериалыСпецификации.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
		УстановитьУсловноеОформлениеМатериаловСпецификации();
		//ОбновитьДанныеПоМатериаламНаСервере(РезультатЗакрытия.ИмяДерева,Ложь);   
		////ОбновитьИдентификаторыСтрокДерева(РезультатЗакрытия.ИмяДерева);
		//ВосстановитьСостояниеДерева(РезультатЗакрытия.ИмяДерева);
	КонецЕсли;                        
		
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область УсловноеОформлениеСтарыйВариант

&НаСервере
Процедура УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева)
	
	#Область УОстрок1уровня
	
	УсловноеОформление.Элементы.Очистить();
	ЭлементыУО = УсловноеОформление.Элементы;
		
	///////////////////////////////////////////////////////
	//Установим оформление Зарезервированных строк 1 уровня
	НовыйЭлементУО = ЭлементыУО.Добавить();
	ГруппаЭлементовОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 2; // 4;
	ЭлементОтбора.Использование = Истина;
	
	//ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	//ЭлементОтбора.ПравоеЗначение = 5;
	//ЭлементОтбора.Использование = Истина;
		
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтый);
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	//Установим оформление Отгруженных строк 1 уровня
	НовыйЭлементУО = ЭлементыУО.Добавить();
	ГруппаЭлементовОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 5;
	ЭлементОтбора.Использование = Истина;
		
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноЗеленый);
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;    
	
	//Установим оформление строк 1 уровня с Остатком на Складе < Потребности
	НовыйЭлементУО = ЭлементыУО.Добавить();
	ГруппаЭлементовОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".КонтрольОстатка");          //".ОстатокДляУО");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	#конецОбласти
	
	#Область УОподчиненныхстрок
	
	//Установим оформление строк с Остатком на Складе < Потребности
	НовыйЭлементУО = ЭлементыУО.Добавить(); 
	ГруппаОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	//10.03.2022
	//ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".КонтрольОстатка");     //".ОстатокДляУО");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	//Установим оформление Зарезервированных строк (подчиненных)
	НовыйЭлементУО = ЭлементыУО.Добавить();
	//ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ГруппаОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 2; //4;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
		
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтый);
	
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	//Установим оформление Отгруженных строк (подчиненных)
	НовыйЭлементУО = ЭлементыУО.Добавить();
	ГруппаОтбораИ = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".ОтборПоВариантамОбеспечения"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 5;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяДерева+".Уровень");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 1;
	ЭлементОтбора.Использование = Истина;
		
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый); !!
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Аквамарин); -- синезел яркий
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ВесеннеЗеленый); -- яркий
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноЗеленый);
	
	ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных(ИмяДерева); 
	ПоляЭлементаУО.Использование = Истина;
	
	#конецОбласти
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьУсловноеОформлениеМатериаловСпецификации()
	
	//УсловноеОформление.Элементы.Очистить();
	//ЭлементыУО = УсловноеОформление.Элементы;
	//	
	/////////////////////////////////////////////////////////
	////Установим оформление Зарезервированных строк 
	//НовыйЭлементУО = ЭлементыУО.Добавить();
	//
	//ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации.УО_ОтборПоВариантамОбеспечения"); 
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение = 4; //Перечисления.ВариантыОбеспечения.СоСклада;
	//ЭлементОтбора.Использование = Истина;
	//
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЖелтый);
	//ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	//ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации"); 
	//ПоляЭлементаУО.Использование = Истина;
	//
	////Установим оформление Отгруженных строк
	//НовыйЭлементУО = ЭлементыУО.Добавить();
	//
	//ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации.УО_ОтборПоВариантамОбеспечения"); 
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ЭлементОтбора.ПравоеЗначение = 5; //Перечисления.ВариантыОбеспечения.Отгрузить;
	//ЭлементОтбора.Использование = Истина;
	//
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.НейтральноЗеленый);
	//ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	//ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации"); 
	//ПоляЭлементаУО.Использование = Истина;   
	//
	///////////////////////////////////////////////////////////
	////////Установим оформление строк, подобранных на ТСД (расход больше остатка)
	////НовыйЭлементУО = ЭлементыУО.Добавить();
	////
	////ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	////ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации.КонтрольОстатка"); 
	////ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	////ЭлементОтбора.ПравоеЗначение = 0;
	////ЭлементОтбора.Использование = Истина;
	////
	////НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗолотистый);
	////ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	////ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации"); 
	////ПоляЭлементаУО.Использование = Истина;

	///////////////////////////////////////////////////////////
	//////Установим оформление строк, подобранных на ТСД (расход меньше остатка)
	////НовыйЭлементУО = ЭлементыУО.Добавить();
	////
	////ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	////ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации.КонтрольОстатка"); 
	////ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	////ЭлементОтбора.ПравоеЗначение = 0;
	////ЭлементОтбора.Использование = Истина;
	////
	////НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Кирпичный);
	////ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	////ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации"); 
	////ПоляЭлементаУО.Использование = Истина;
	//
	////Установим оформление строк с Остатком на Складе < Потребности
	//НовыйЭлементУО = ЭлементыУО.Добавить();
	//
	//ЭлементОтбора = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.МатериалыСпецификации.КонтрольОстатка");          
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	//ЭлементОтбора.ПравоеЗначение = 0;
	//ЭлементОтбора.Использование = Истина;
	//
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	//ПоляЭлементаУО = НовыйЭлементУО.Поля.Элементы.Добавить();
	//ПоляЭлементаУО.Поле = Новый ПолеКомпоновкиДанных("МатериалыСпецификации"); 
	//ПоляЭлементаУО.Использование = Истина;
		
КонецПроцедуры 

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область ОбработкаСписание

 &НаКлиенте
Процедура ОтгрузитьВыбранныеСтроки(Команда)
	
	//Если Объект.Резерв Тогда 
	//	Сообщить("Данные в режиме резервирования! Отгрузка не выполнена.");
	//	Возврат;
	//КонецЕсли; 
	
	МассивВыделенныхСтрок = Элементы.МатериалыСпецификации.ВыделенныеСтроки;
	ИДСтрокиМатериалыСпецификации = МассивВыделенныхСтрок[0];  
	//Перепишем ИД строк в новый массив, чтобы не изменялся, когда срабатывает при активизации строки.
	МассивИДСтрокМатериалов = Новый Массив;
	Для Каждого СтрокаМассива из МассивВыделенныхСтрок Цикл                                    
		МассивИДСтрокМатериалов.Добавить(СтрокаМассива);
	КонецЦикла;    
	
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
	Обособленно = Ложь;   
	
	ЗарезервироватьВыбранныеСтрокиНаСервере(МассивИДСтрокМатериалов, ВариантОбеспеченияНовый, Обособленно);

	Элементы.МатериалыСпецификации.ТекущаяСтрока = ИДСтрокиМатериалыСпецификации;
	
	//Если ТекСтраница = "Списание" Тогда 
	//	Если ЗначениеЗаполнено(ОтборВариантОбеспечения) Тогда 
	//		Если ОтборВариантОбеспечения = 3 Тогда 
	//			Возврат;
	//			Сообщить("Отгружать материалы не требуется!", СтатусСообщения.Важное);
	//		ИначеЕсли ОтборВариантОбеспечения = 5 Тогда 
	//			Возврат;
	//			Сообщить("Материалы уже отгружены!", СтатусСообщения.Важное);
	//		КонецЕсли;
	//	КонецЕсли;
	//	ЭтоСписание = Истина;
	//	ИмяДерева = "ДеревоМатериалов";  
	//	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
	//ИначеЕсли ТекСтраница = "Резервирование"  Тогда 
	//	ЭтоСписание = Ложь;
	//	ИмяДерева = "ДеревоМатериаловРезервирование";
	//	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование"; 
	//КонецЕсли; 
		
	//СписокВариантовОбеспечения = новый СписокЗначений;
	////СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьОбособленно"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"));
	////СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьИзЗаказов"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления"));
	////СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется"));
	//
	//МассивСтруктурОбрабатываемыхСтрок = ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки(СписокВариантовОбеспечения, ИмяДерева, ЭтоСписание);
	//ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
	//ОтборПоВариантуОбеспечения = 5;
	//ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивСтруктурОбрабатываемыхСтрок, ИмяДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения);
	//
	////ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные;
	//////ИДТекСтроки = Элемент.ТекущаяСтрока(); 
	////ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();
	////
	////ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства, ИДТекСтроки);
	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
	////ОбновитьИдентификаторыСтрокДерева(ИмяДерева,Неопределено);
	//ВосстановитьСостояниеДерева(ИмяДерева);
	
КонецПроцедуры

&НаКлиенте                                         
//НЕОБОСОБЛЕННО!!! Отгружает все  материалы табличной части Материалы спецификации
Процедура ОтгрузитьМатериалыСпецификации(Команда)
	//ОтгрузитьСтрокиРегистраПоОтбору(Истина);   
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
	Обособленно = Ложь;
	МатериалыСпецификацииУстановитьВариантОбеспечения(ВариантОбеспеченияНовый, Обособленно);
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам); 
	Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	
КонецПроцедуры  

 &НаКлиенте
Процедура МатериалыСпецификацииКОбеспечениюОбособленноВсе(Команда)
	
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению");
	Обособленно = Истина;
	МатериалыСпецификацииУстановитьВариантОбеспечения(ВариантОбеспеченияНовый, Обособленно);

	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСписание(Команда)
		
	Если ЕстьНеотгруженныеСтроки() Тогда 
		ТекстСообщения = "Не все материалы отгружены! Списание не выполнено!";
		Сообщить(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ВопросПользователюПередВыполнениемОперации(, Команда.Действие);
			
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПереченьКолонокТЧМатериалыЭтапа()
	
	//++Дарвин А.А. 12.12.2023
	ПереченьКолонок = 
	"Номенклатура,
	|Характеристика,
	|Серия,
	|Упаковка,
	|КоличествоУпаковок,
	|Количество,
	|ВариантОбеспечения,
	|Обособленно,
	|ДатаОтгрузки,
	|Склад,
	|Производится,
	|Спецификация,
	|Назначение,
	|НазначениеОбеспечения,
	|СтатусУказанияСерий,
	|СтатусУказанияСерийОтправитель,
	|СтатусУказанияСерийПолучатель,
	|КодСтроки,
	|ИспользуетсяАвтовыбор,
	|СведенияАвтовыбора,
	|ПрименениеМатериала,
	|КлючСвязиСпецификация,
	|СтатьяКалькуляции,
	|Отменено,
	|ПричинаОтмены,
	|Период,
	|АналитикаУчетаНоменклатуры,
	|КорАналитикаУчетаНоменклатуры,
	|Подразделение,
	//|ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	|ИдентификаторСтроки,
	|КлючСвязиНабор,
	|КлючНоменклатура";
	//Дарвин А.А.
	
	//"Номенклатура,  
	//|Характеристика, 
	//|Серия, 
	//|Упаковка, 
	//|КоличествоУпаковок, 
	//|Количество, 
	//|ВариантОбеспечения, 
	//|ДатаОтгрузки, 
	//|Склад, 
	//|Производится, 
	//|Спецификация, 
	//|Назначение, 
	//|СтатусУказанияСерий, 
	//|СтатусУказанияСерийОтправитель, 
	//|СтатусУказанияСерийПолучатель, 
	//|КодСтроки, 
	//|ИспользуетсяАвтовыбор, 
	//|СведенияАвтовыбора, 
	//|ПрименениеМатериала, 
	//|КлючСвязиСпецификация, 
	//|СтатьяКалькуляции, 
	//|Период, 
	//|АналитикаУчетаНоменклатуры, 
	//|КорАналитикаУчетаНоменклатуры";
	Возврат ПереченьКолонок;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПереченьКолонокТЧМатериалыЭтапаДляСвертки()
	//без количества
	
	//++Дарвин А.А. 12.12.2023
	ПереченьКолонок = 
	"Номенклатура,
	|Характеристика,
	|Серия,
	|Упаковка,
	|ВариантОбеспечения,
	|ДатаОтгрузки,
	|Склад,Производится,
	|Спецификация,
	|Назначение,
	|СтатусУказанияСерий,
	|СтатусУказанияСерийОтправитель,
	|СтатусУказанияСерийПолучатель,
	|КодСтроки,
	|ИспользуетсяАвтовыбор,
	|СведенияАвтовыбора,
	|ПрименениеМатериала,
	|КлючСвязиСпецификация,
	|СтатьяКалькуляции,
	|Период,
	|АналитикаУчетаНоменклатуры,
	|КорАналитикаУчетаНоменклатуры,
	|Обособленно,
	|Отменено,
	|ПричинаОтмены,
	|Подразделение,
	//|ВариантОбеспеченияДоИзмененияОбновлениемИБ,
	|ИдентификаторСтрок";
	//Дарвин А.А.
	
	//"Номенклатура,  
	//|Характеристика, 
	//|Серия, 
	//|Упаковка, 
	////|КоличествоУпаковок, 
	////|Количество, 
	//|ВариантОбеспечения, 
	//|ДатаОтгрузки, 
	//|Склад, 
	//|Производится, 
	//|Спецификация, 
	//|Назначение, 
	//|СтатусУказанияСерий, 
	//|СтатусУказанияСерийОтправитель, 
	//|СтатусУказанияСерийПолучатель, 
	//|КодСтроки, 
	//|ИспользуетсяАвтовыбор, 
	//|СведенияАвтовыбора, 
	//|ПрименениеМатериала, 
	//|КлючСвязиСпецификация, 
	//|СтатьяКалькуляции, 
	//|Период, 
	//|АналитикаУчетаНоменклатуры, 
	//|КорАналитикаУчетаНоменклатуры";
	Возврат ПереченьКолонок;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСписаниеПодтверждение(Команда)
	
	ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима();
	
	Оповещение = Новый ОписаниеОповещения("ПослеПредоставленияРазрешения",ЭтаФорма);
	МассивИДРазрешений = ПолучитьМассивИдентификаторовРазрешений(СписокИДЗапросовРазрешений);
	РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(МассивИДРазрешений, ЭтаФорма, Оповещение);
	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Истина);
	
	ОтборСтрок = Новый Структура("Обрабатывать",Истина);
	МассивЭтаповДляОбработки = Этапы.НайтиСтроки(ОтборСтрок);

	//МассивЭтаповКИзменению = Новый Массив;
		
	//Для Каждого СтрЭтап из МассивЭтаповДляОбработки Цикл  
	//	
	//	Если не СтрЭтап.Обрабатывать Тогда 
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если СтрЭтап.КоличествоУпаковокФакт < 0.5 Тогда 
	//		Сообщить("Этап " + СтрЭтап.ЭтапПроизводства + " не списан, так как по нему отсутствует выпуск!");
	//		Продолжить;
	//	КонецЕсли;     
	//	
	//	Этап = СтрЭтап.ЭтапПроизводства;
	//	ДанныеЭтапа = ПолучитьДанныеЭтапа(Этап);

	//	Если ДанныеЭтапа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен") Или ДанныеЭтапа.КолСтрРасход > 0 Тогда 
	//		ЭтапОтменен = ОтменитьРасходМатериаловВЭтапе(Этап);  
	//		Если ЭтапОтменен Тогда 
	//			УдалитьСвязанныеПередачиМатериалов(Этап);
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	МассивЭтаповКИзменению.Добавить(Этап);					
	//КонецЦикла;	
		
	////Параметры для длительной операции
	//ДлительнаяОперация = НачатьВыполнениеФоновогоЗаданияСписаниеИРезервирование(МассивЭтаповКИзменению, Истина);
	//ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	//ПараметрыОжидания.Заголовок = "Списание материалов...";
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//ПараметрыОжидания.ВыводитьСообщения = Истина;
	//ПараметрыОжидания.ПолучатьРезультат = Истина;
	// 	 
	//Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбработкиФоновойОперации", ЭтотОбъект, Команда);
	//ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);       
	
	//****************************************************************
	//+ Ганьшина Е. вернула запись без длительной операции, так как 
	 Для Каждого СтрЭтап из МассивЭтаповДляОбработки Цикл  
		//НачатьТранзакцию();
	//Для Каждого СтрЭтап из ТабЭтапы Цикл 
		////
		////ПараметрыФормы = Новый Структура("Ключ",СтрЭтап.ЭтапПроизводства);
		////Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",ПараметрыФормы,ЭтаФорма);
		
		//Если не СтрЭтап.Обрабатывать Тогда 
		//	Продолжить;
		//КонецЕсли; 
		Если СтрЭтап.КоличествоУпаковокФакт < 0.5 Тогда 
			Сообщить("Этап " + СтрЭтап.ЭтапПроизводства + " не списан, так как по нему отсутствует выпуск!");
			Продолжить;
		КонецЕсли;
		//СтруктураКлючФормы = Новый Структура("Ключ",СтрЭтап.ЭтапПроизводства);
		//Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",СтруктураКлючФормы);
		//ТЧОбеспечение = Форма.Объект.ОбеспечениеМатериаламиИРаботами;
		//ТЧОбеспечение.Очистить();
		//ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапа();
		////ТабМатериалы = 
		//ПеренестиКорректировкиВТЧ(ЭтоСписание, СтрЭтап.ЭтапПроизводства, ПереченьКолонок);
		////ТЧОбеспечение.Загрузить(ТабМатериалы.Выгрузить()); //**Метод недоступен на клиенте**//
		//Для Каждого Стр из ТабМатериалы Цикл 
		//	НоваяСтрока = ТЧОбеспечение.Добавить();
		//	ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
		//КонецЦикла;
		////ЭтапОбъект = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
		////ЭтапОбъект.
		////форма.объект.
		//Форма.Объект.НеОтгружатьЧастями = Истина;
		//Если ЭтоСписание Тогда 
		//	Форма.Объект.ДатаОтгрузки = Объект.ПериодОтгрузки;
		//КонецЕсли;
		//Попытка
		//	Форма.Записать();
		//Исключение
		//	Сообщить("Ошибка записи "+СтрЭтап.ЭтапПроизводства+"  "+ОписаниеОшибки());
		//КонецПопытки;      
		
		Этап = СтрЭтап.ЭтапПроизводства;
		
		ДанныеЭтапа = ПолучитьДанныеЭтапа(Этап);
		//Если ТекСтраница = "Списание" Тогда 
		Если ДанныеЭтапа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен") или ДанныеЭтапа.КолСтрРасход > 0 Тогда 
			ЭтапОтменен = ОтменитьРасходМатериаловВЭтапе(Этап);  
			Если ЭтапОтменен Тогда 
				УдалитьСвязанныеПередачиМатериалов(Этап);
			КонецЕсли;
		КонецЕсли;

		//КонецЕсли;
		МатериалыЗаполнили = ЗаполнитьМатериалыЭтапаПоДаннымРегистра_Новая(Этап,Истина); //!!!Списание = Истина, 
																						//чтобы определить таблицу формы, 
																						//через которую будем переносить материалы
		Если не МатериалыЗаполнили Тогда    
			//ОтменитьТранзакцию();
			Возврат; //Сообщение с описанием ошибки в функции
		КонецЕсли;
		//Если ЭтоСписание Тогда 
		СформировалиПередачуМатериалов = СформироватьПередачуМатериаловНаСервере(Этап);
		Если не СформировалиПередачуМатериалов Тогда
			//ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		ЗаполнилиРасходЭтапа = ЗаполнитьРасходЭтапа(Этап);
		Если не ЗаполнилиРасходЭтапа Тогда
			//ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		//КонецЕсли;  
		//КонецЕсли;      
		//ЗафиксироватьТранзакцию();
		Сообщить("Обработка этапа завершена " + Этап);
		
	КонецЦикла;	
	
	Сообщить("Время окончания обработки этапов "+ Строка(ТекущаяДата()));
	//****************************************************************
	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеОперацииСписанияВФоне(МассивЭтаповКИзменению, ЭтоСписание)
	ПараметрыДляОбработки = Новый Структура;
	ПараметрыДляОбработки.Вставить("МассивЭтаповКИзменению", МассивЭтаповКИзменению);
	ПараметрыДляОбработки.Вставить("ЭтоСписание", ЭтоСписание);
	ПараметрыДляОбработки.Вставить("ПериодОтгрузки", Объект.ПериодОтгрузки);
	ПараметрыДляОбработки.Вставить("Резерв", Объект.Резерв);
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
				
	 Возврат ДлительныеОперации.ВыполнитьФункцию(
	 	ПараметрыВыполнения, 
	    "ТТМ_ДанныеВыбораСервер.ВыполнитьСписаниеМатериаловВФоне", 
	 	ПараметрыДляОбработки);

КонецФункции

&НаКлиенте
Функция ЗаполнитьРасходЭтапа(Этап)

	ПараметрыФормы = Новый Структура("Ключ",Этап);
	Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",ПараметрыФормы);	
	Форма.РасходМатериаловИРабот_ЗаполнитьПоДаннымОбеспеченияЗавершение(КодВозвратаДиалога.Да, Неопределено);
	Для каждого Строка из Форма.Объект.РасходМатериаловИРабот Цикл
		Строка.ДатаРасхода = Объект.ПериодОтгрузки;
	КонецЦикла;
	Форма.Объект.РасходОднойДатой = Истина;
	Форма.Объект.ДатаРасхода = Объект.ПериодОтгрузки;
	ФактНачалоЭтапа = Форма.Объект.ФактическоеНачалоЭтапа;
	Если НачалоДня(ФактНачалоЭтапа) = Объект.ПериодОтгрузки Тогда
		Форма.Объект.ФактическоеОкончаниеЭтапа = ФактНачалоЭтапа;
	Иначе
		Форма.Объект.ФактическоеОкончаниеЭтапа = Объект.ПериодОтгрузки;
	КонецЕсли;
	Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен");
	Форма.Объект.КоличествоУпаковокФакт = Форма.Объект.КоличествоУпаковокПлан;
	//Форма.ОбработатьЗавершениеВыполненияЭтапа();
	Попытка
		Форма.Записать();
		Возврат Истина;
	Исключение
		Сообщить("Ошибка при заполнении расхода "+Этап+" "+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
		
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область Резервирование

&НаКлиенте
Процедура ЗарезервироватьВыбранныеСтроки(Команда)
	
	МассивВыделенныхСтрок = Элементы.МатериалыСпецификации.ВыделенныеСтроки; 
	ИДСтрокиМатериалыСпецификации = МассивВыделенныхСтрок[0];                
	
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда  
		МассивВыделенныхСтрок.Добавить(Элементы.МатериалыСпецификации.ТекущаяСтрока);
	КонецЕсли;
	
	//Перепишем ИД строк в новый массив, чтобы не изменялся, когда срабатывает при активизации строки.
	МассивИДСтрокМатериалов = Новый Массив;
	Для Каждого СтрокаМассива из МассивВыделенныхСтрок Цикл                                    
		МассивИДСтрокМатериалов.Добавить(СтрокаМассива);
	КонецЦикла;                          
	
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	Обособленно = Ложь;   
	
	ЗарезервироватьВыбранныеСтрокиНаСервере(МассивИДСтрокМатериалов, ВариантОбеспеченияНовый, Обособленно);
	Элементы.МатериалыСпецификации.ТекущаяСтрока = ИДСтрокиМатериалыСпецификации;  

	////СформироватьСтруктуруСтрокИсходныхДанных();
	//  
	//СтруктураДанныхИсходнойСтроки = ИсходныеДанныеСтрокиМатериаловСпецификации;
	//ЭтоСписание = не Объект.Резерв;
	////ТекущаяНоменклатура = Элементы.МатериалыСпецификации.ТекущиеДанные.Номенклатура;
	////ДанныеТекущейСтроки = Элементы.МатериалыСпецификации.ТекущиеДанные;    
	////ЗаполнитьЗначенияСвойств(СтруктураДанныхИсходнойСтроки,ДанныеТекущейСтроки);
	//
	//СписокВариантовОбеспечения = новый СписокЗначений;
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления"));
	//СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется"));
	//
	//МассивСтруктурОбрабатываемыхСтрок = ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки_Новая(СписокВариантовОбеспечения, ЭтоСписание);  
		//ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	//ОтборПоВариантуОбеспечения = 4;
	//ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивСтруктурОбрабатываемыхСтрок, ИмяДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения);
	//
	////УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,,ВариантОбеспеченияНовый);
	//
	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь,ДанныеИсходнойСтроки);
	//ВосстановитьСостояниеДерева(ИмяДерева);
	 
	//ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	//Обособленно = Ложь;
	//МатериалыСпецификацииУстановитьВариантОбеспечения(ВариантОбеспеченияНовый, Обособленно);
		
КонецПроцедуры      

&НаСервере
Процедура ЗарезервироватьВыбранныеСтрокиНаСервере(МассивИДСтрокМатериалов, ВариантОбеспеченияНовый, Обособленно);
	
	ИДСтрокиМатериалыСпецификации = МассивИДСтрокМатериалов[0];
	
	//Запомним Номенклатру текущей строки ТЧ МатериалыСпецификации     
	Если не Элементы.МатериалыСпецификации.ТекущаяСтрока = Неопределено Тогда 
		ПерваяСтрокаВыделения = Объект.МатериалыСпецификации.НайтиПоИдентификатору(ИДСтрокиМатериалыСпецификации);
	Иначе            
		Если Объект.МатериалыСпецификации.Количество() > 0 Тогда 
			ПерваяСтрокаВыделения = Объект.МатериалыСпецификации.НайтиПоИдентификатору(0);
		КонецЕсли;
	КонецЕсли;
	
	ИндексТекСтроки = Объект.МатериалыСпецификации.Индекс(ПерваяСтрокаВыделения);
	Номенклатура = ПерваяСтрокаВыделения.Номенклатура;
	Остаток = ПерваяСтрокаВыделения.Остаток;
	
	//ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	//Обособленно = Ложь;   
	Для Каждого ИДСтроки из МассивИДСтрокМатериалов Цикл 
		ТекСтрока = объект.МатериалыСпецификации.НайтиПоИдентификатору(ИДСтроки);
		СтруктураОтбора = Новый Структура("Номенклатура");
		ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекСтрока);
		УстановитьВариантОбеспеченияНовая(ВариантОбеспеченияНовый,Обособленно,НЕ Объект.Резерв,СтруктураОтбора);
		
		Если ТекСтрока.Остаток < ТекСтрока.КоличествоУпаковок Тогда 
			Сообщить("По номенклатуре "+ТекСтрока.Номенклатура+" Зарезеовировано только доступное для резерва количество!",СтатусСообщения.Важное);
			НовоеКоличествоДляРаспределения = ТекСтрока.КоличествоУпаковок;
			НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
			НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
			НЗ.Отбор.Номенклатура.Установить(ТекСтрока.Номенклатура);
			НЗ.Прочитать();                             
			Если ЗначениеЗаполнено(ТекСтрока.Норматив) Тогда 
				Норматив = ТекСтрока.Норматив;
			Иначе 
				Норматив = 1;
			КонецЕсли;
			РаспределитьКоличествоНаСервере(НЗ,Норматив);
		КонецЕсли;
	КонецЦикла;  
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам); 
	
	ЗаполнитьТЧРаспределениеМатериалаПоДаннымРегистра(Номенклатура); 
	Элементы.РаспределениеМатериала.ТекущаяСтрока = 0;
	
	//Восстановим ТекущуюСтроку ТЧ (по номенклатуре)          
	ПараметрыОтбора = Новый Структура("Номенклатура",Номенклатура);
	МассивСтрокПоНоменклатуре = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора);
	
	Если МассивСтрокПоНоменклатуре.Количество() > 0 Тогда 
		ПерваяСтрокаВыделения = Объект.МатериалыСпецификации.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = ПерваяСтрокаВыделения.ПолучитьИдентификатор();
	Иначе 
		Элементы.МатериалыСпецификации.ТекущаяСтрока = 0;
	КонецЕсли;
	
	УстановитьУсловноеОформлениеМатериаловСпецификации();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПодобранныеМатериалы(Команда)
	
	ПроверкаВыполнена = ПроверкаЗаполненияВажныхПолейФормы(Команда.Действие);
	
	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
		
	МассивЭтапов = Новый СписокЗначений;
	
	Для Каждого Стр из Этапы Цикл 
		Если стр.Обрабатывать и МассивЭтапов.НайтиПоЗначению(Стр.ЭтапПроизводства) = Неопределено Тогда
			МассивЭтапов.Добавить(Стр.ЭтапПроизводства);
		КонецЕсли;
	КонецЦикла;
	
	ЗагрузитьПодборНаСервере(); 
	  	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам);
КонецПроцедуры      

//&НаКлиенте
//Процедура ЗарезервироватьВсе(Команда)
//	Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
//		ЭтоСписание = Ложь;
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		//ЗарезервироватьВсеНаСервере("ДеревоМатериаловРезервирование", Ложь);
//	ИначеЕсли Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда   
//		ЭтоСписание = Истина;
//		ИмяДерева = "ДеревоМатериалов"
//		//ЗарезервироватьВсеНаСервере("ДеревоМатериалов", Истина); 
//	КонецЕсли;         
//	ВариантОбеспеченияПосле = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
//	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,,ВариантОбеспеченияПосле);
//	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//КонецПроцедуры


&НаКлиенте
Процедура ЗарезервироватьМатериалыСпецификации(Команда)    
	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
	Обособленно = Ложь;
	МатериалыСпецификацииУстановитьВариантОбеспечения(ВариантОбеспеченияНовый, Обособленно);
	
	ПоЭтапам = Ложь;
	ОбновитьМатериалыСпецификацииНаСервере(ПоЭтапам); 
	Элементы.МатериалыСпецификации.ТекущаяСтрока = 0; 
	УстановитьУсловноеОформлениеМатериаловСпецификации();
	//ЗарезервироватьМатериалыСпецификацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьКорректировкиНовая(Команда)
	
	ПроверкаВыполнена = ПроверкаЗаполненияВажныхПолейФормы(Команда.Действие);
	
	Если Не ПроверкаВыполнена Тогда
		Возврат;
	КонецЕсли;
			
	ВопросПользователюПередВыполнениемОперации(, Команда.Действие);

КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьМатериалыЭтапаПоДаннымРегистра_Новая(ЭтапПроизводства,ЭтоСписание)
	
		СтруктураКлючФормы = Новый Структура("Ключ",ЭтапПроизводства);
		Форма = ПолучитьФорму("Документ.ЭтапПроизводства2_2.ФормаОбъекта",СтруктураКлючФормы);
		ТЧОбеспечение = Форма.Объект.ОбеспечениеМатериаламиИРаботами;
		ТЧОбеспечение.Очистить();
		ПереченьКолонок = ПолучитьПереченьКолонокТЧМатериалыЭтапа();   
		//ТабМатериалы = 
		//ПеренестиКорректировкиВТЧ(не Объект.Резерв, ЭтапПроизводства, ПереченьКолонок);
		ПеренестиКорректировкиВТЧ(ЭтоСписание, ЭтапПроизводства, ПереченьКолонок);
		//ТЧОбеспечение.Загрузить(ТабМатериалы.Выгрузить()); //**Метод недоступен на клиенте**// 
		Если ЭтоСписание Тогда 
			ИмяТаблицыДанных = "МатериалыСписание";
		Иначе
			ИмяТаблицыДанных = "МатериалыРезервирование";
		КонецЕсли;
		
		ЕстьРезервИлиМягкийРезерв = Ложь;
		
		Для Каждого Стр из Объект[ИмяТаблицыДанных] Цикл //МатериалыСпецификации Цикл 
			НоваяСтрока = ТЧОбеспечение.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);   
			НоваяСтрока.ДатаОтгрузки = Объект.ПериодОтгрузки;  
			Если НоваяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада")
				ИЛИ НоваяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления") 
				ИЛИ НоваяСтрока.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить") Тогда 
				ЕстьРезервИлиМягкийРезерв = Истина;
			КонецЕсли;
		КонецЦикла;  
		//Форма.Объект.ОбеспечениеМатериаламиИРаботами = ТЧОбеспечение;
		Форма.Объект.НеОтгружатьЧастями = Истина;             
		Форма.Объект.ДатаОтгрузки = Объект.ПериодОтгрузки;
		
		//++Дарвин А.А. 12.12.2023		
		Если Форма.Объект.КоличествоУпаковокФакт < ПроцентВыполнения Тогда	
			Если ЕстьРезервИлиМягкийРезерв Тогда
				Форма.Объект.КоличествоУпаковокФакт = ПроцентВыполнения;
			КонецЕсли;
		КонецЕсли;
		//Дарвин А.А.
		
		//Если ЭтоСписание Тогда 
		//	Форма.Объект.ДатаОтгрузки = Объект.ПериодОтгрузки;
		////Иначе 
		////	Форма.Объект.ДатаОтгрузки = ТекущаяДатаСеанса();
		//КонецЕсли;
		Попытка
			Форма.Записать();
			Возврат Истина;
		Исключение
			Сообщить("Ошибка записи " + Стр.ЭтапПроизводства + "  " + ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	//КонецЦикла;
	
КонецФункции

//&НаКлиенте
//Процедура МягкийРезерв(Команда)
//	ИмяДерева = "ДеревоМатериаловРезервирование";
//	ЭтоСписание = Ложь;                               
//	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,, ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления"));
//	//ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//	//УстановитьпризнакОбособленноВРегистре(ИмяДерева,ЭтоСписание,Обособленно); //,Пользователи.АвторизованныйПользователь());
//	
//КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРезервированиеПодтверждение(Команда)
	ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима();
	
	Оповещение = Новый ОписаниеОповещения("ПослеПредоставленияРазрешения",ЭтаФорма);
	МассивИДРазрешений = ПолучитьМассивИдентификаторовРазрешений(СписокИДЗапросовРазрешений);
	РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(МассивИДРазрешений, ЭтаФорма, Оповещение);
	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Истина);  
	
	/////////////////////////////////////////////////////////////////	         
	ОтборСтрок = Новый Структура("Обрабатывать",Истина);
	МассивЭтаповДляОбработки = Этапы.НайтиСтроки(ОтборСтрок);	
	МассивЭтаповКИзменению = Новый Массив;
	
	Для Каждого СтрЭтап из МассивЭтаповДляОбработки Цикл //ТабЭтапы  
		Этап = СтрЭтап.ЭтапПроизводства;          
		
		ДанныеЭтапа = ПолучитьДанныеЭтапа(Этап);
		Если ДанныеЭтапа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен") Или ДанныеЭтапа.КолСтрРасход > 0 Тогда 
			ЭтапОтменен = ОтменитьРасходМатериаловВЭтапе(Этап);  
			Если ЭтапОтменен Тогда 
				УдалитьСвязанныеПередачиМатериалов(Этап);
			КонецЕсли;
		КонецЕсли; 
		
		ЭтоСписание = Ложь;
		МассивЭтаповКИзменению.Добавить(Этап);
	КонецЦикла;
	
	//Параметры для длительной операции
	ДлительнаяОперация = НачатьВыполнениеФоновогоЗаданияСписаниеИРезервирование(МассивЭтаповКИзменению, ЭтоСписание);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = "Резервирование материалов...";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ПолучатьРезультат = Истина;
	 	 
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбработкиФоновойОперации", ЭтотОбъект, Команда);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаСервере
Процедура ПеренестиКорректировкиВТЧ(ЭтоСписание, ЭтапПроизводства, ПереченьКолонок)	
	Если ЭтоСписание Тогда 
		ТабМатериалы = Объект.МатериалыСписание;
	Иначе 
		ТабМатериалы = Объект.МатериалыРезервирование;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныхРегистра();
	Запрос.УстановитьПараметр("ЭтапПроизводства", ЭтапПроизводства);
	Запрос.УстановитьПараметр("ЭтоСписание", не Объект.Резерв);  
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	ТЗ = Запрос.Выполнить().Выгрузить();
		
	ТЗСкорректирвоанныеСтрокиЭтапа = ТЗ.Скопировать(,ПереченьКолонок);
	ТЗСкорректирвоанныеСтрокиЭтапа.Сортировать("Номенклатура Возр");  
	ТабМатериалы.Загрузить(ТЗСкорректирвоанныеСтрокиЭтапа);   

КонецПроцедуры    

&НаСервере
Функция ПолучитьДанныеЭтапа(Этап)
	
	ДанныеЭтапа = Новый Структура("Статус, КолСтрРасход",Этап.Статус,Этап.РасходМатериаловИРабот.Количество());
	Возврат ДанныеЭтапа;
	
КонецФункции

&НаСервере
Процедура УдалитьСвязанныеПередачиМатериалов(Этап)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Разрешенные
		|	СвязанныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	КритерийОтбора.СвязанныеДокументы(&Этап) КАК СвязанныеДокументы
		|ГДЕ
		|	СвязанныеДокументы.Ссылка.Проведен = ИСТИНА
		|	И СвязанныеДокументы.Ссылка ССЫЛКА Документ.ДвижениеПродукцииИМатериалов
		|	И СвязанныеДокументы.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВПроизводство)";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектПередачаМатериалов = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			ОбъектПередачаМатериалов.УстановитьПометкуУдаления(Истина);
		Исключение
			Сообщить("Не удалось пометить связанный документ " + ОбъектПередачаМатериалов + Этап);
		КонецПопытки;
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеФоновогоЗаданияСписаниеИРезервирование(МассивЭтаповКИзменению, ЭтоСписание)
	
	ПараметрыДляОбработки = Новый Структура;
	ПараметрыДляОбработки.Вставить("МассивЭтаповКИзменению", МассивЭтаповКИзменению);
	ПараметрыДляОбработки.Вставить("ЭтоСписание", ЭтоСписание);
	ПараметрыДляОбработки.Вставить("ПериодОтгрузки", Объект.ПериодОтгрузки);
	ПараметрыДляОбработки.Вставить("ПроцентВыполнения", ПроцентВыполнения);
	ПараметрыДляОбработки.Вставить("Резерв", Объект.Резерв);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
				
	 Возврат ДлительныеОперации.ВыполнитьФункцию(
	 	ПараметрыВыполнения, 
	    "ТТМ_ДанныеВыбораСервер.ЗафиксироватьКорректировкиВЭтапахСписаниеИРезервированиеВФоне", 
	 	ПараметрыДляОбработки);
КонецФункции

&НаКлиенте
функция ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки(СписокВариантовОбеспечения, ИмяДерева, ЭтоСписание)
	
	МассивСтрок = Элементы[ИмяДерева].ВыделенныеСтроки;
	МассивОбрабатываемыхСтрок = Новый Массив;
	Для Каждого Стр из МассивСтрок Цикл  
		ОтменаРезерва = не МассивОбрабатываемыхСтрок.Найти(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада")) = Неопределено;
		Если ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Стр).Остаток = 0 и не ОтменаРезерва Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Стр) <> Неопределено Тогда 
			ДочерниеСтроки = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(Стр).ПолучитьЭлементы();
			Если ДочерниеСтроки.Количество() <> 0 Тогда 
				Для Каждого НСтр из ДочерниеСтроки Цикл 
					МассивОбрабатываемыхСтрок.Добавить(НСтр.ПолучитьИдентификатор());
				КонецЦикла;
			Иначе 
				МассивОбрабатываемыхСтрок.Добавить(Стр);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
	Для Каждого МСтр из МассивОбрабатываемыхСтрок Цикл 
		ТекСтрока = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(МСтр);
		ДанныеСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, ВариантОбеспечения");
		Если ТекСтрока <> Неопределено Тогда        
			Если СписокВариантовОбеспечения.НайтиПоЗначению(Текстрока.ВариантОбеспечения) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
			МассивСтруктурОбрабатываемыхСтрок.Добавить(ДанныеСтроки);
		КонецЕсли;
	КонецЦикла;                              
	
	Возврат МассивСтруктурОбрабатываемыхСтрок;
	
КонецФункции

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////////
#Область ОперацииТСД

&НаСервере
Процедура ВыгрузитьМатериалыДляТСДНаСервере(Спецификация)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура КАК Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка КАК Упаковка,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация КАК Спецификация,
	               |	&Пользователь КАК Пользователь,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.Количество) КАК Количество,
	               |	СУММА(ТТМ_АРМ_РезервированиеСписаниеМатериалов.КоличествоУпаковок) КАК КоличествоУпаковок,
	               |	&КоличествоЭтапов КАК КоличествоЭтапов,
	               |	ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
				   |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Остаток КАК Остаток
	               |ИЗ
	               |	РегистрСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов КАК ТТМ_АРМ_РезервированиеСписаниеМатериалов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам КАК ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам
	               |		ПО ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура = ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	               |ГДЕ
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Пользователь = &Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Номенклатура,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Упаковка,
	               |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Спецификация,
	               |	ТТМ_РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка,
				   |	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Остаток
				   //,
	               //|	ТТМ_АРМ_РезервированиеСписаниеМатериалов.Назначение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";

	ОтборЭтапов = Новый Структура("Обрабатывать",Истина); 
	ТабЭтапы = Этапы.Выгрузить(ОтборЭтапов, "ЭтапПроизводства, Назначение,Запланировано");
	ТабЭтапы.Свернуть("ЭтапПроизводства, Назначение,Запланировано");
	КоличествоЭтаповДляОбработки = ТабЭтапы.Количество();	
	Запрос.УстановитьПараметр("КоличествоЭтапов", КоличествоЭтаповДляОбработки);  
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДокПодборМатериалов = Документы.ТТМ_ПодборМатериаловПоСпецификации.СоздатьДокумент();
	ДокПодборМатериалов.Организация = Объект.Организация; 
	ДокПодборМатериалов.Статус = Перечисления.ТТМ_СтатусыПодбораМатериалов.Сформирован;
	ДокПодборМатериалов.Склад = Объект.Склад;
	ДокПодборМатериалов.Дата = ТекущаяДатаСеанса();
	ДокПодборМатериалов.Продукция = Объект.Номенклатура;
	ДокПодборМатериалов.Спецификация = Спецификация;
	ДокПодборМатериалов.Ответственный = Пользователи.АвторизованныйПользователь();
	
	ДокПодборМатериалов.Этапы.Загрузить(ТабЭтапы);                                       
	КоличествоИзделий = ТабЭтапы.Итог("Запланировано");     
	КоличествоЭтапов = ТабЭтапы.Количество();
	ДокПодборМатериалов.Количество = КоличествоИзделий;  
	ДокПодборМатериалов.Комментарий = "## "+КоличествоИзделий + " " + Спецификация;
	
	
	Пока Выборка.Следующий() Цикл    
		НоваяСтрокаТЧ = ДокПодборМатериалов.ОбеспечениеМатериаламиИРаботами.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,Выборка); 
	КонецЦикла;
	
	Попытка
		НачатьТранзакцию();	
		ДокПодборМатериалов.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);    		
		ЗафиксироватьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Создан: '") + ДокПодборМатериалов.Ссылка);
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка во время записи документа: '") + ДокПодборМатериалов.Ссылка);
	КонецПопытки;
	
КонецПроцедуры   

&НаКлиенте
Процедура ВыгрузитьМатериалыДляТСД(Команда)  
	Если не ЗначениеЗаполнено(Спецификация) Тогда 
		Сообщить("Выберите спецификацию для сборки! Документ не создан!"); 
		Возврат;
	КонецЕсли;
	ВопросПользователюПередВыполнениемОперации(, Команда.Действие);
	Объект.ДокументПодбораМатериалов = ОчиститьСсылкуНаДокументПодбораПослеФормирования();
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПодбора(Знач ВыгруженнаяТаблица = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТТМ_ПодборМатериаловПоСпецификацииЭтапы.ЭтапПроизводства) КАК КоличествоЭтапов,
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ КоличествоЭтаповДокумента
	               |ИЗ
	               |	Документ.ТТМ_ПодборМатериаловПоСпецификации.Этапы КАК ТТМ_ПодборМатериаловПоСпецификацииЭтапы
	               |ГДЕ
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Проведен
	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Ответственный = &Пользователь
	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Статус = &СтатусДокумента
	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Номер = &НомерДокумента
	               |	И НАЧАЛОПЕРИОДА(ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка КАК ДокументПодбора,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель, 1) = 1
	               |			ТОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / КоличествоЭтаповДокумента.КоличествоЭтапов / 1 * ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Знаменатель, 1)
	               |		КОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель = 0
	               |			ТОГДА ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / КоличествоЭтаповДокумента.КоличествоЭтапов / 1 * 1
	               |		ИНАЧЕ ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / КоличествоЭтаповДокумента.КоличествоЭтапов / ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Числитель, 1) * ЕСТЬNULL(ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка.Знаменатель, 1)
	               |	КОНЕЦ КАК Количество,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Упаковка КАК Упаковка,
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.ЭтапПроизводства КАК ЭтапПроизводства,
	               |	ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Назначение КАК Назначение,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация КАК Спецификация,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Склад КАК Склад,
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Количество / КоличествоЭтаповДокумента.КоличествоЭтапов КАК КоличествоУпаковок,
	               |	КоличествоЭтаповДокумента.КоличествоЭтапов КАК КоличествоЭтапов
	               |ИЗ
	               |	Документ.ТТМ_ПодборМатериаловПоСпецификации.ОбеспечениеМатериаламиИРаботами КАК ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТТМ_ПодборМатериаловПоСпецификации.Этапы КАК ТТМ_ПодборМатериаловПоСпецификацииЭтапы
	               |		ПО ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка = ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоЭтаповДокумента КАК КоличествоЭтаповДокумента
	               |		ПО (КоличествоЭтаповДокумента.Ссылка = ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка)
	               |ГДЕ
	               |	ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Ответственный = &Пользователь
	               |	И ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Проведен
	               |	И ТТМ_ПодборМатериаловПоСпецификацииОбеспечениеМатериаламиИРаботами.Ссылка.Статус = &СтатусДокумента
	               |	И ТТМ_ПодборМатериаловПоСпецификацииЭтапы.Ссылка В
	               |			(ВЫБРАТЬ ПЕРВЫЕ 1
	               |				Т.Ссылка
	               |			ИЗ
	               |				КоличествоЭтаповДокумента КАК Т)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДокументПодбора,
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Объект.ДокументПодбораМатериалов.Дата)); 
	Запрос.УстановитьПараметр("НомерДокумента", Объект.ДокументПодбораМатериалов.Номер);
	Запрос.УстановитьПараметр("СтатусДокумента", Перечисления.ТТМ_СтатусыПодбораМатериалов.Собран);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыгруженнаяТаблица = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Возврат ВыгруженнаяТаблица; 

КонецФункции

&НаСервереБезКонтекста
Функция ОчиститьСсылкуНаДокументПодбораПослеФормирования()
	Возврат Документы.ТТМ_ПодборМатериаловПоСпецификации.ПустаяСсылка();
КонецФункции
	
#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////
#Область НастройкиФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	КлючНастроек = "ТТМ_АРМ_Резервирование_Списание_Материалов_2_2" + ПараметрыСеанса.ТекущийПользователь;
	Настройки = Новый Соответствие;
	Настройки.Вставить("Выполнено", ПроцентВыполнения);
	Настройки.Вставить("КатегорияМатериала", Объект.ДР_КатегорияМатериала);
	Настройки.Вставить("ДокументПодбораМатериалов", Объект.ДокументПодбораМатериалов);
	Настройки.Вставить("СтатьяКалькуляции", Объект.СтатьяКалькуляции);
	    
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ТТМ_АРМ_Резервирование_Списание_Материалов_2_2", КлючНастроек, Настройки);	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиНаСервере()
	КлючНастроек = "ТТМ_АРМ_Резервирование_Списание_Материалов_2_2" + ПараметрыСеанса.ТекущийПользователь;
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ТТМ_АРМ_Резервирование_Списание_Материалов_2_2", КлючНастроек);
			
	Если ЗначениеНастроек = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='Не найден список настроек для данного поля'"),, "ПроцентВыполнения");
		Возврат;
	КонецЕсли;
			
	Если ТипЗнч(ЗначениеНастроек) = Тип("Соответствие") Тогда
		Для Каждого ТекНастройки Из ЗначениеНастроек Цикл
			Если ТекНастройки.Ключ = "Выполнено" Тогда  
				ПроцентВыполнения = ТекНастройки.Значение;
			ИначеЕсли ТекНастройки.Ключ = "КатегорияМатериала" Тогда  
				Объект.ДР_КатегорияМатериала = ТекНастройки.Значение;
			ИначеЕсли ТекНастройки.Ключ = "ДокументПодбораМатериалов" Тогда
				Объект.ДокументПодбораМатериалов = ТекНастройки.Значение;			
			ИначеЕсли ТекНастройки.Ключ = "СтатьяКалькуляции" Тогда
				Объект.СтатьяКалькуляции = ТекНастройки.Значение;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
//	ПрочитатьНастройкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПроцентВыполненияПриИзменении(Элемент)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийРаспределениеМатериала

&НаКлиенте
Процедура РаспределениеМатериалаПриАктивизацииСтроки(Элемент)
	
	Если Элементы.МатериалыСпецификации.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;         
	КонецЕсли;    
	
	//+ Ганьшина Е 14.04.2025
	Если ОбновлениеДанныхФормы Тогда 
		Возврат;
	КонецЕсли;   
	//- Ганьшина Е 14.04.2025
	
	ВыбраннаяСтрока = Элемент.ТекущиеДанные; 
	Если ВыбраннаяСтрока <> Неопределено Тогда 
		ТекущийЭтап = ВыбраннаяСтрока.ЭтапПроизводства; //+ Ганьшина Е 14.04.2025
	КонецЕсли;     
	
	Если ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура <> Неопределено и ВыбраннаяСтрока <> Неопределено Тогда   
		//+ Ганьшина е. 16.04.2025
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиМатериаловСпецификации,ВыбраннаяСтрока);
		//-
		ИсходныеДанныеСтрокиМатериаловСпецификации.ЭтапПроизводства = ТекущийЭтап; //+ Ганьшина Е 14.04.2025 //ВыбраннаяСтрока.ЭтапПроизводства;
		КоличествоУпаковок = ?(ЗначениеЗаполнено(ВыбраннаяСтрока.КоличествоУпаковок), ВыбраннаяСтрока.КоличествоУпаковок, ВыбраннаяСтрока.Норматив);
		ИсходныеДанныеСтрокиМатериаловСпецификации.КоличествоУпаковок = КоличествоУпаковок; 
		СтруктураКоэффициента = ПолучитьКоэффициентУпаковки(ИсходныеДанныеСтрокиМатериаловСпецификации);
		КоэффициентУпаковки = СтруктураКоэффициента.Знаменатель / СтруктураКоэффициента.Числитель;
		ИсходныеДанныеСтрокиМатериаловСпецификации.Количество = КоличествоУпаковок * КоэффициентУпаковки;		
	КонецЕсли;       
	
	//+ Ганьшина Е 14.04.2025
	ПараметрыПоиска = Новый Структура("ЭтапПроизводства");
	МассивСтрок = Объект.РаспределениеМатериала.НайтиСтроки(ПараметрыПоиска);
	Если МассивСтрок.Количество() > 0 Тогда 
		ТекСтрока = МассивСтрок[0];
		Элементы.РаспределениеМатериала.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();    //Элементы.ПолучитьИдентификатор();    
	КонецЕсли;
	//- Ганьшина Е 14.04.2025
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеМатериалаПередУдалением(Элемент, Отказ)
	//ИсходныеДанныеСтрокиМатериаловСпецификации.ЭтапПроизводства = Элемент.Родитель.ТекущиеДанные().ЭтапПроизводства;
	Номенклатура = ИсходныеДанныеСтрокиМатериаловСпецификации.Номенклатура;
	ЭтапПроизводства = ИсходныеДанныеСтрокиМатериаловСпецификации.ЭтапПроизводства;
	УдалитьСтрокиРегистраСОтбором(Номенклатура,ЭтапПроизводства,Истина);
КонецПроцедуры  

&НаСервере
Функция УдалитьСтрокиРегистраСОтбором(Номенклатура, ЭтапПроизводства = Неопределено, ЭтоСписание)
	
	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
	НЗ.Отбор.Номенклатура.Установить(Номенклатура);
	
	Если ЗначениеЗаполнено(ЭтапПроизводства) Тогда 
		НЗ.Отбор.ЭтапПроизводства.Установить(ЭтапПроизводства);
	КонецЕсли;
	
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать();

КонецФункции

&НаКлиенте
Процедура ФлагиИстинаРезервРаспределениеМатериалов(Команда)
	УстановитьИлиСнятьФлагиРаспределениеМатериалов(Команда.Действие, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ФлагиИстинаМягкийРезервРаспределениеМатериалов(Команда)
	УстановитьИлиСнятьФлагиРаспределениеМатериалов(Команда.Действие, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ФлагиЛожьРезервРаспределениеМатериалов(Команда)
	УстановитьИлиСнятьФлагиРаспределениеМатериалов(Команда.Действие);
КонецПроцедуры

&НаКлиенте
Процедура ФлагиЛожьМягкийРезервРаспределениеМатериалов(Команда)
	УстановитьИлиСнятьФлагиРаспределениеМатериалов(Команда.Действие);
КонецПроцедуры

&НаСервере
Процедура УстановитьИлиСнятьФлагиРаспределениеМатериалов(ТекущаяКоманда, Знач Отмечено = Ложь)
	
	Если Объект.РаспределениеМатериала.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяКоманда = "ФлагиИстинаРезервРаспределениеМатериалов" Или ТекущаяКоманда = "ФлагиЛожьРезервРаспределениеМатериалов" Тогда
		Для Каждого ТекущийЭтап Из Объект.РаспределениеМатериала Цикл
			ТекущийЭтап.Резерв = Отмечено;
		КонецЦикла;
	ИначеЕсли ТекущаяКоманда = "ФлагиИстинаМягкийРезервРаспределениеМатериалов" Или ТекущаяКоманда = "ФлагиЛожьМягкийРезервРаспределениеМатериалов" Тогда
		Для Каждого ТекущийЭтап Из Объект.РаспределениеМатериала Цикл
			ТекущийЭтап.МягкийРезерв = Отмечено;
		КонецЦикла; 		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Протокол(Команда)
	Элементы._Протокол.Видимость = Не Элементы._Протокол.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсеЭтапыРаспределениеМатериалов(Команда)
	
	Для Каждого СтрЭтап из Объект.РаспределениеМатериала Цикл 
		СтрЭтап.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОбрабатыватьПриИзменении(Элемент)
	
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	ПараметрыПоиска = Новый Структура("ЭтапПроизводства",ТекСтрока.ЭтапПроизводства);
	МассивСтрокПоЭтапу = Этапы.НайтиСтроки(ПараметрыПоиска);
	Если ТекСтрока.Обрабатывать Тогда 
		Если МассивСтрокПоЭтапу.Количество() > 1 Тогда      
			Для Каждого Стр из МассивСтрокПоЭтапу Цикл 
				Стр.Обрабатывать = Истина;   
			КонецЦикла;
		КонецЕсли; 
		КоличествоОтмеченныхЭтапов = КоличествоОтмеченныхЭтапов + 1;
	Иначе 
		Если МассивСтрокПоЭтапу.Количество() > 1 Тогда      
			Для Каждого Стр из МассивСтрокПоЭтапу Цикл 
				Стр.Обрабатывать = Ложь;   
			КонецЦикла;
		КонецЕсли;
		КоличествоОтмеченныхЭтапов = КоличествоОтмеченныхЭтапов - 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////////

#Область СтарыйВариантРаботаСДеревомЗначений

//&НаКлиенте
//Процедура ОтгрузитьЗарезервированные(Команда)
//	Если ТекСтраница = "Списание" Тогда 
//		Если ОтборВариантОбеспечения = 5 Тогда 
//			Возврат;
//			Сообщить("Материалы по отбору уже отгружены! ",СтатусСообщения.Важное);
//		ИначеЕсли ОтборВариантОбеспечения = 3 Тогда 
//			Возврат;
//			Сообщить("Материалы по отбору отгружать не требуется! ",СтатусСообщения.Важное);
//		КонецЕсли;
//		ЭтоСписание = Истина;
//		ИмяДерева = "ДеревоМатериалов"; 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//		
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ЭтоСписание = Ложь;
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//		//Отгрузка доступна только при списании
//		Возврат;
//	КонецЕсли;
//	//Отбор = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
//	////ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
//	//ОтгрузитьНаСервере(ИмяДерева, ЭтоСписание, Отбор);          
//	
//	ВариантОбеспеченияДо = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада");
//	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.Отгрузить");
//	УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,ВариантОбеспеченияДо,ВариантОбеспеченияНовый);
//	
//	//ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные();    
//	////ИДТекСтроки = Элемент.ТекущаяСтрока(); 
//	//ИДТекСтроки = ТекСтрока.ПолучитьИдентификатор();   
//	//
//	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства,ИДТекСтроки);
//	ВосстановитьСостояниеДерева(ИмяДерева);
//КонецПроцедуры

//&НаКлиенте
//Процедура РазвернутьВсеСтрокидерева(Команда)
//	
//	Если ТекСтраница = "Списание" Тогда 
//		ИмяДерева = "ДеревоМатериалов";        
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//		Строки1Уровня = ЭтаФорма.ДеревоМатериалов.ПолучитьЭлементы();
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//		Строки1Уровня = ЭтаФорма.ДеревоМатериаловРезервирование.ПолучитьЭлементы();
//	КонецЕсли;                
//	ДанныеТекущейСтроки = Элементы[ИмяДерева].ТекущиеДанные;                  
//	ЭтаФорма[ИмяТаблицыИдентификаторов].Очистить();
//	НовыйИД = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
//	НовыйИД.ТекущаяСтрока = Ложь;//Истина;
//	НовыйИД.Номенклатура = ДанныеТекущейСтроки.Номенклатура;
//	НовыйИД.ИсходнаяНоменклатура = ДанныеТекущейСтроки.ИсходнаяНоменклатура;
//	НовыйИД.ЭтапПроизводства = ДанныеТекущейСтроки.ЭтапПроизводства;
//	НовыйИД.Идентификатор = ДанныеТекущейСтроки.ПолучитьИдентификатор();
//	Для Стр = 0 по Строки1Уровня.Количество()-1 Цикл 
//		ТекСтрока = Строки1Уровня.Получить(Стр);
//		Элементы[ИмяДерева].Развернуть(ТекСтрока.ПолучитьИдентификатор()); 
//		НоваяСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
//		НоваяСтрока.ТекущаяСтрока = Ложь;
//		НоваяСтрока.Номенклатура = ТекСтрока.Номенклатура;
//		НоваяСтрока.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
//		НоваяСтрока.ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СвернутьВсеСтрокиДерева(Команда)
//	
//	Если ТекСтраница = "Списание" Тогда 
//		ИмяДерева = "ДеревоМатериалов";   
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ИмяДерева = "ДеревоМатериаловРезервирование";  
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//	КонецЕсли;     
//	
//	ДанныеТекущейСтроки = Элементы[ИмяДерева].ТекущиеДанные; 
//	НовыйИД = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
//	НовыйИД.ТекущаяСтрока = Истина;
//	НовыйИД.Номенклатура = ДанныеТекущейСтроки.Номенклатура;
//	НовыйИД.ИсходнаяНоменклатура = ДанныеТекущейСтроки.ИсходнаяНоменклатура;
//	НовыйИД.ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
//	НовыйИД.Идентификатор = ДанныеТекущейСтроки.ПолучитьИдентификатор();
//	
//	Строки1Уровня = ЭтаФорма[ИмяДерева].ПолучитьЭлементы();
//	Для Стр = 0 по Строки1Уровня.Количество()-1 Цикл 
//		ТекСтрока = Строки1Уровня.Получить(Стр);
//		Элементы[ИмяДерева].Свернуть(ТекСтрока.ПолучитьИдентификатор());
//	КонецЦикла;  
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РазбитьСтроку(Команда)
//	
//	Если ТекСтраница = "Списание" Тогда 
//		ИмяДерева = "ДеревоМатериалов"; 
//		ЭтоСписание = Истина;
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		ЭтоСписание = Ложь;
//	КонецЕсли;       
//	Если Элементы[ИмяДерева].ТекущиеДанные.Уровень = 1 Тогда 
//		Возврат;
//	КонецЕсли;
//	//ДобавитьСтрокуВТекущуюВетку(ИмяДерева, ЭтоСписание);
//	РазделитьСтроку(ИмяДерева,ЭтоСписание);
//	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
//	
//КонецПроцедуры

//&НаСервере 
//Функция РазделитьСтроку(ИмяДерева, ЭтоСписание)
//	
//	//1.Добавить в Регистр строку по данным текущей строки
//	//2.перерисовать дерево
//	
//	//РодительскаяСтрока = ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(ИДТекСтроки).ПолучитьРодителя(); 
//	Если ЭтоСписание Тогда 
//		ИсходныеДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериалов;
//	Иначе 
//		ИсходныеДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
//	КонецЕсли;
//	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь()); 
//	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
//	НЗ.Отбор.Номенклатура.Установить(ИсходныеДанныеСтроки.Номенклатура);    
//	НЗ.Отбор.ЭтапПроизводства.Установить(ИсходныеДанныеСтроки.ЭтапПроизводства);    
//	НЗ.Отбор.ВариантОбеспечения.Установить(ИсходныеДанныеСтроки.ВариантОбеспечения);  
//	//НЗ.Отбор.ИсходнаяНоменклатура.Установить(ИсходныеДанныеСтроки.ИсходнаяНоменклатура);
//	НЗ.Прочитать(); 
//	НоваяСтрока = НЗ.Добавить();
//	ЗаполнитьЗначенияСвойств(НоваяСтрока,НЗ[0]);
//	Новаястрока.ИсходнаяНоменклатура = Справочники.Номенклатура.ПустаяССылка();
//	НоваяСтрока.Количество = ИсходныеДанныеСтроки.Норматив - ИсходныеДанныеСтроки.Количество;
//	НоваяСтрока.Обеспечить = НоваяСтрока.Количество;
//	//НЗ[0].Количество = НЗ[0].Количество - 1;
//	//НЗ[0].Обеспечить = НЗ[0].Обеспечить - 1;
//	НоваяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению;   //.УдалитьОбособленно;
//	НоваяСтрока.Обособленно = Истина;
//	НоваяСтрока.ОтборПоВариантамОбеспечения = 1;
//	
//	НЗ.Отбор.ВариантОбеспечения.Использование = Ложь;
//	НЗ.Записать();
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь); 
//	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
//		
//КонецФункции

//&НаКлиенте
//Процедура ВариантОбеспеченияРезервированиеПриИзменении(Элемент)
//	ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериаловРезервирование",Ложь);
//	//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериаловРезервирование");
//КонецПроцедуры

//&НаСервере
//Функция ДеревоМатериаловРезервированиеПередУдалениемНаСервере(ИДТекСтроки)
//	
//	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
//	
//	Пользователь = Пользователи.АвторизованныйПользователь();
//	ИмяДерева = "ДеревоМатериаловРезервирование";
//	СтруктураСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, Спецификация, ВариантОбеспечения");
//	ЗаполнитьЗначенияСвойств(СтруктураСтроки,ИсходныеДанныеСтрокиДереваМатериаловРезервирование);
//	
//	МассивСтруктурОбрабатываемыхСтрок.Добавить(СтруктураСтроки);
//	Попытка 
//		//НомерТекуще Элементы.ДеревоМатериаловРезервирование.ТекущаяСтрока
//		УдалитьСтрокуРегистра(МассивСтруктурОбрабатываемыхСтрок, Ложь);
//		
//		ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//		Возврат Истина;
//	Исключение       
//		Сообщить("Ошибка при удалении данных регистра по номенклатуре " + СтруктураСтроки.Номенклатура);
//		Возврат Ложь;
//	КонецПопытки;
//	
//	//НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//	//НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь()); 
//	//НЗ.Отбор.ЭтоСписание.Установить(Ложь);
//	//НЗ.Отбор.Номенклатура.Установить(ИсходныеДанныеСтрокиДереваМатериаловРезервирование.Номенклатура);
//	//Если ИсходныеДанныеСтрокиДереваМатериаловРезервирование.Уровень <> 1 Тогда 
//	//	НЗ.Отбор.ЭтапПроизводства.Установить(ИсходныеДанныеСтрокиДереваМатериаловРезервирование.ЭтапПроизводства);
//	//КонецЕсли;
//	//НЗ.Прочитать();

//	//Попытка
//	//	НЗ.Очистить();
//	//	НЗ.Записать(); 
//	//	ОбновитьДанныеПоМатериаламНаСервере(
//	//	Возврат Истина; 
//	//Исключение
//	//	Возврат Ложь;
//	//КонецПопытки;
//	
//КонецФункции

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеПередУдалением(Элемент, Отказ)
//	СтрокаУдалена = ДеревоМатериаловРезервированиеПередУдалениемНаСервере(Элемент.ТекущиеДанные.ПолучитьИдентификатор());
//	Если не СтрокаУдалена Тогда 
//		Отказ = Истина;
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ВариантОбеспеченияПриИзменении(Элемент)
//	ОбновитьДанныеПоМатериаламНаСервере("ДеревоМатериалов",Ложь);
//	//УстановитьУсловноеОформлениеДереваМатериалов("ДеревоМатериалов");
//КонецПроцедуры

//&НаКлиенте
//Процедура ВосстановитьСостояниеДерева(ИмяДерева)
//	
//	//ЭтаФорма[ИияДерева].Сортировать("ТекущаяСтрока возр");
//	//Элементы[ИмяДерева].Сортировать("ТекущаяСтрока возр");                 
//	Если ТекСтраница = "Списание" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование"
//	КонецЕсли;
//	//ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Сортировать("ТекущаяСтрока возр");
//	///ЭтаФорма[ИмяТаблицыИдентификаторов].Сортировать("ТекущаяСтрока возр");
//	МассивУдаляемыхСтрок = Новый Массив;
//	Для Каждого СтрТаб из ЭтаФорма[ИмяТаблицыИдентификаторов] Цикл 
//		Если ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(СтрТаб.Идентификатор) <> Неопределено Тогда
//			Если СтрТаб.ТекущаяСтрока = Ложь Тогда 
//			   Элементы[ИмяДерева].Развернуть(СтрТаб.Идентификатор);
//			Иначе 
//				Элементы[ИмяДерева].ТекущаяСтрока = СтрТаб.Идентификатор;
//			КонецЕсли;
//		Иначе 
//			//удалим идентификатор из таблицы, так как строки с таким идентификатором больше нет в дереве
//			МассивУдаляемыхСтрок.Добавить(СтрТаб);
//		КонецЕсли;
//	КонецЦикла;
//	Для Каждого УдаляемаяСтрока из МассивУдаляемыхСтрок Цикл 
//		ЭтаФорма[ИмяТаблицыИдентификаторов].Удалить(УдаляемаяСтрока);
//	КонецЦикла;
//			
//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеПередРазворачиванием(Элемент, Строка, Отказ)
//	// Запоминаем идентификатор строки развернутого узла
//	//**/////////////////////////////////////////////////////////////
//	//Элемент.ТекущаяСтрока = Строка;
//	ТекСтрока = Элемент.ДанныеСтроки(Строка);
//	ТекущаяНоменклатура = ТекСтрока.Номенклатура;
//	ИДТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
//	
//	СтруктураПоиска = Новый Структура;
//	СтруктураПоиска.Вставить("Идентификатор",Строка); 
//	//СтруктураПоиска.Вставить("ТекущаяСтрока",Ложь); 

//	МассивНайденныхСтрок = ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.НайтиСтроки(СтруктураПоиска);
//	КоличествонайденныхСтрок = МассивНайденныхСтрок.Количество();
//	
//	Если КоличествонайденныхСтрок = 0 Тогда 
//		СтрокаЗаписи = ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Добавить();
//		СтрокаЗаписи.Номенклатура = ТекущаяНоменклатура;
//		СтрокаЗаписи.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
//		СтрокаЗаписи.Идентификатор = ИДТекущейСтроки;
//		СтрокаЗаписи.ТекущаяСтрока = Ложь;
//	КонецЕсли;
//	//**//////////////////////////////////////////////////////////////
//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеПередСворачиванием(Элемент, ИДСтроки, Отказ)
//	//Удалим из ТаблицыИдентификаторв свернутый узел
//	 ТекСтрока = ЭтаФорма.ДеревоМатериаловРезервирование.НайтиПоИдентификатору(ИДСтроки);
//	 Если ТекСтрока = Неопределено Тогда
//		//ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование
//		Возврат;
//	КонецЕсли;
//	
//	//ТекущаяНоменклатура = ТекСтрока.Номенклатура;  
//	//ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
//	//ИДТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
//	
//	СтруктураПоиска = Новый Структура;
//	СтруктураПоиска.Вставить("Идентификатор",ИДСтроки); //ИДТекущейСтроки);
//		
//	МассивНайденныхСтрок = ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.НайтиСтроки(СтруктураПоиска);
//	КоличествонайденныхСтрок = МассивНайденныхСтрок.Количество();
//	Если КоличествонайденныхСтрок = 1 Тогда 
//		СтрокаТаблицыИД = МассивНайденныхСтрок[0];
//		ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Удалить(СтрокаТаблицыИД);
//	ИначеЕсли КоличествонайденныхСтрок > 1 Тогда 
//		СтрокаТаблицыИД = МассивНайденныхСтрок[0];
//		ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Удалить(СтрокаТаблицыИД);
//		Сообщить("В таблице Идентификаторов строк найдено более 1 строки. Уточните значения поиска");
//	Иначе 
//		Сообщить("В таблице Идентификаторов строк по условиям поиска строк не найдено.");
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеОбеспечитьПриИзменении(Элемент) 
//	
//	//ОБРАБОТКИ ПОКА НЕТ!!!!
//	
//	ИмяДерева = "ДеревоМатериаловРезервирование";
//	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//	
//	
//	//ИДТекСтроки = Элементы[ИмяДерева].ТекущаяСтрока;
//	//
//	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ИсходныеДанныеСтрокиДереваМатериаловРезервирование.Номенклатура, ИсходныеДанныеСтрокиДереваМатериаловРезервирование.ЭтапПроизводства, ИДТекСтроки);
//	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева
//	ВосстановитьСостояниеДерева(ИмяДерева);        
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловПередРазворачиванием(Элемент, Строка, Отказ)
//	// Запоминаем идентификатор строки развернутого узла
//	//**/////////////////////////////////////////////////////////////
//	//Элемент.ТекущаяСтрока = Строка;
//	ТекСтрока = Элемент.ДанныеСтроки(Строка);
//	ТекущаяНоменклатура = ТекСтрока.Номенклатура;
//	ИДТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
//	
//	СтруктураПоиска = Новый Структура;
//	СтруктураПоиска.Вставить("Идентификатор",Строка); 
//	//СтруктураПоиска.Вставить("ТекущаяСтрока",Ложь); 

//	МассивНайденныхСтрок = ИдентификаторыРаскрытыхСтрокДереваМатериалов.НайтиСтроки(СтруктураПоиска);
//	КоличествонайденныхСтрок = МассивНайденныхСтрок.Количество();
//	
//	Если КоличествонайденныхСтрок = 0 Тогда 
//		СтрокаЗаписи = ИдентификаторыРаскрытыхСтрокДереваМатериалов.Добавить();
//		СтрокаЗаписи.Номенклатура = ТекущаяНоменклатура;
//		СтрокаЗаписи.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
//		СтрокаЗаписи.Идентификатор = ИДТекущейСтроки;
//		СтрокаЗаписи.ТекущаяСтрока = Ложь;
//	КонецЕсли;
//	//**//////////////////////////////////////////////////////////////

//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловПередСворачиванием(Элемент, ИДСтроки, Отказ)
//	//Удалим из ТаблицыИдентификаторв свернутый узел
//	 ТекСтрока = ЭтаФорма.ДеревоМатериалов.НайтиПоИдентификатору(ИДСтроки);
//	 Если ТекСтрока = Неопределено Тогда
//		//ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование
//		Возврат;
//	КонецЕсли;
//	
//	//ТекущаяНоменклатура = ТекСтрока.Номенклатура;  
//	//ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура;
//	//ИДТекущейСтроки = ТекСтрока.ПолучитьИдентификатор();
//	
//	СтруктураПоиска = Новый Структура;
//	СтруктураПоиска.Вставить("Идентификатор",ИДСтроки); //ИДТекущейСтроки);
//		
//	МассивНайденныхСтрок = ИдентификаторыРаскрытыхСтрокДереваМатериалов.НайтиСтроки(СтруктураПоиска);
//	КоличествонайденныхСтрок = МассивНайденныхСтрок.Количество();
//	Если КоличествонайденныхСтрок = 1 Тогда 
//		СтрокаТаблицыИД = МассивНайденныхСтрок[0];
//		ИдентификаторыРаскрытыхСтрокДереваМатериалов.Удалить(СтрокаТаблицыИД);
//	ИначеЕсли КоличествонайденныхСтрок > 1 Тогда 
//		СтрокаТаблицыИД = МассивНайденныхСтрок[0];
//		ИдентификаторыРаскрытыхСтрокДереваМатериалов.Удалить(СтрокаТаблицыИД);
//		Сообщить("В таблице Идентификаторов строк найдено более 1 строки. Уточните значения поиска");
//	Иначе 
//		Сообщить("В таблице Идентификаторов строк по условиям поиска строк не найдено.");
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеПослеУдаления(Элемент)
//	Если ТекСтраница = "Списание" Тогда 
//		ИмяДерева = "ДеревоМатериалов";
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//	КонецЕсли;
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, Ложь);    
//	ВосстановитьСостояниеДерева(ИмяДерева);
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьпризнакОбособленноВРегистре(ИмяДерева,ЭтоСписание, Обособленно)   //, ТекПользователь)
//	
//	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//	НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
//	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
//	НЗ.Прочитать();
//	Для Каждого СтрНЗ из НЗ Цикл 
//		СтрНЗ.Обособленно = Обособленно;
//	КонецЦикла;                         
//	НЗ.Записать();
//	
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//	
//КонецПроцедуры     

//&НаСервере
//Процедура УстановитьВариантОбеспеченияНаСервере(ИмяДерева,ЭтоСписание,ВариантОбеспеченияДо, ВариантОбеспеченияПосле)
//	//////////1. Получим данные регистра с учетом отборов (Категория материала, ОтборПоВариантамОбеспечения, Пользователь, ЭтоСписание, ВариантОбеспечения (исходный))
//	//////////2. Изменим данные в соответствии с данными дерева (синхронизация по полю ИдентификаторСтрокиРегистра)
//	//////////3. Загрузить новые данные в регистр
//	Дерево = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
//	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
//	Для Каждого Строка из Дерево.Строки Цикл 
//		Если ТекНоменклатура <> Строка.Номенклатура Тогда
//			ТекНоменклатура = Строка.Номенклатура;
//			ТекОстаток = Строка.Остаток;
//		КонецЕсли;       
//		НоменклатураБезОстатка = Новый ТаблицаЗначений;
//		НоменклатураБезОстатка.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		НоменклатураБезОстатка.Колонки.Добавить("Этап",Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
//		
//		//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
//		//ТекстНачалаСообщения = "Отсутствует остаток для резервирования по номенклатуре ";
//		//ТекстСообщенияОтсутствуетОстаток = "";
//		Для Каждого Стр из Строка.Строки Цикл 
//			Если ТекНоменклатура = Стр.Номенклатура и (ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.СоСклада 
//				или ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.Отгрузить) тогда
//				ТекОстаток = ТекОстаток - Стр.Обеспечить;
//				Если ТекОстаток < 0 Тогда 
//					//Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства + Символы.ПС,СтатусСообщения.Важное);
//					//ТекстСообщенияОтсутствуетОстаток = ТекстНачалаСообщения + " " + Стр.Номенклатура + ", " + Стр.ЭтапПроизводства + Символы.ПС;
//					ПараметрыПоиска = Новый Структура("Номенклатура,Этап");
//					МассивСтрокБезОстатка = НоменклатураБезОстатка.НайтиСтроки(ПараметрыПоиска);
//					Если МассивСтрокБезОстатка.Количество() = 0 Тогда 
//						НоваяСтрока = НоменклатураБезОстатка.Добавить();
//						НоваяСтрока.Номенклатура = Стр.Номенклатура ;
//						НоваяСтрока.Этап = Стр.ЭтапПроизводства;     
//					КонецЕсли;
//					
//					Продолжить;
//					
//				КонецЕсли;
//			КонецЕсли;
//			//Если ТекОстаток >= 0 Тогда			
//			НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//			НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
//			НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
//			НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
//			НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);   
//			
//			//Отбор по ВариантамОбеспечения устанавливаем только по значениям ОтборВариантОбеспечения или ОтборВариантОбеспеченияРезервирование 
//			//ЕСЛИ этот отбор ЗАДАН
//			//Остальное решаем какое значениеобрабатывать и какое значение установить в момент формирования записи регистра 
//			//ОтборВариантОбеспечения 
//			//Количество (Обеспечить)
//			
//			Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
//				НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
//			ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
//				НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
//			КонецЕсли;
//			Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
//				НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериала);
//			ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда 
//				НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериалаРезервирование);
//			КонецЕсли;
//			НЗ.Прочитать();
//			Если НЗ.Количество() = 1 Тогда 
//				Для Каждого СтрНЗ из НЗ Цикл 
//					//Если НЗ.Отбор[НЗ.Отбор.Количество()-28] = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения").Использование  = Ложь Тогда 
//						//НЗ.Отбор.Удалить(НЗ.Отбор.Количество()-28);
//					//НЗ.Отбор[НЗ.Отбор.Количество()-28].Использование = Ложь;
//					//КонецЕсли;
//					//СтрНЗ.Количество = Стр.Обеспечить + Стр.;     
//					Если ЭтоСписание Тогда 
//						Если ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
//							СтрНЗ.Обеспечить = СтрНЗ.Количество - СтрНЗ.Обеспечить;
//							//СтрНЗ.Количество = СтрНЗ.Обеспечить + СтрНЗ.Количество;
//						КонецЕсли;
//					Иначе 
//						//СтрНЗ.Количество = СтрНЗ.Обеспечить;
//						Если ЗначениеЗаполнено(ВариантОбеспеченияПосле) и ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.СоСклада Тогда  
//							СтрНЗ.Обеспечить = СтрНЗ.Количество - СтрНЗ.Обеспечить;
//							//СтрНЗ.Количество = СтрНЗ.Обеспечить + СтрНЗ.Количество;
//						ИначеЕсли ЗначениеЗаполнено(ВариантОбеспеченияПосле) и ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
//							//СтрНЗ.Обеспечить = СтрНЗ.Количество - ?(ЗначениеЗаполнено(СтрНЗ.Обеспечить),СтрНЗ.Обеспечить,0) - ?(ЗначениеЗаполнено(СтрНЗ.о;
//						ИначеЕсли ЗначениеЗаполнено(ВариантОбеспеченияПосле) и ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.КОбеспечению
//							и ЗначениеЗаполнено(ВариантОбеспеченияДо) и ВариантОбеспеченияДо = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
//							СтрНЗ.Обеспечить = СтрНЗ.Количество + Стр.Зарезервировать;
//							//СтрНЗ.Количество = СтрНЗ.Количество + Стр.Зарезервировать;
//						КонецЕсли;   
//					КонецЕсли;
//					СтрНЗ.ВариантОбеспечения = ВариантОбеспеченияПосле; 
//					
//					//ИндексВариантаОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Индекс(ВариантОбеспеченияПосле);
//					//ИмяПеречисления = Строка(Метаданные.Перечисления.ВариантыОбеспечения.ЗначенияПеречисления[ИндексВариантаОбеспеченияНовый]);
//					//	
//					//СтрНЗ.ОтборПоВариантамОбеспечения = СоответствиеВариантовОбеспеченияОтбору[ИмяПеречисления];
//					СтрНЗ.ОтборПоВариантамОбеспечения = УстановитьЗначениеОтбораПоВариантамОбеспеченияВРегистре(ВариантОбеспеченияПосле);
//					
//					Если ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
//						Если СтрНЗ.Обособленно Тогда 
//							СтрНЗ.Обособленно = Ложь; 
//						КонецЕсли;
//						Если ЗначениеЗаполнено(СтрНЗ.Назначение) Тогда 
//							СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();   
//						КонецЕсли;
//					ИначеЕсли ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда 
//						Если СтрНЗ.Обособленно Тогда 
//							СтрНЗ.Обособленно = Ложь;
//						КонецЕсли;
//					ИначеЕсли СтрНЗ.Обособленно и не ЗначениеЗаполнено(СтрНЗ.Назначение) Тогда 
//						СтрНЗ.Назначение = СтрНЗ.ЭтапПроизводства.НазначениеПродукция; //.НазначениеМатериалы; 
//					ИначеЕсли не СтрНЗ.Обособленно и ЗначениеЗаполнено(СтрНЗ.Назначение) Тогда  
//						СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();            
//					ИначеЕсли ВариантОбеспеченияПосле = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
//						Если СтрНЗ.Обособленно Тогда 
//							СтрНЗ.Обособленно = Ложь;
//						КонецЕсли;
//						Если СтрНЗ.Обособленно Тогда 
//							СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();
//						КонецЕсли;
//					Иначе 
//						Сообщить("Неучтенный вариант события!!! Обратитесь к администратору!",СтатусСообщения.Важное);                           
//					КонецЕсли;			 
//				КонецЦикла;
//				ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
//				Если не ЭлементОтбора = Неопределено Тогда 
//					ЭлементОтбора.Использование = Ложь;
//				КонецЕсли;
//				НЗ.Записать();
//			ИначеЕсли НЗ.Количество() > 1 Тогда 
//				//Найти запись с нужным вариантом обеспечения
//				Сообщить("Найдено более 1 строки в регистре, уточните условия поиска",СтатусСообщения.Важное);
//			Иначе 
//				Сообщить("Не найдена строка регистра для корректировки данных, "+стр.Номенклатура + " "+ Стр.ЭтапПроизводства,СтатусСообщения.Важное);
//			КонецЕсли;
//			//Иначе 
//			//	Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства + Символы.ПС,СтатусСообщения.Важное);
//			//КонецЕсли;
//		КонецЦикла;	
//		ТекстНачалаСообщения = "Отсутствует остаток для резервирования по номенклатуре ";
//		ТекстСообщенияОтсутствуетОстаток = "";
//		Для Каждого СтрТЗ из НоменклатураБезОстатка Цикл  
//			ТекстСообщенияОтсутствуетОстаток = ТекстСообщенияОтсутствуетОстаток + ТекстНачалаСообщения + " " + СтрТЗ.Номенклатура + ", " + СтрТЗ.Этап + Символы.ПС;
//		КонецЦикла;  
//		Если не ТекстСообщенияОтсутствуетОстаток = "" Тогда 
//			Сообщить(ТекстСообщенияОтсутствуетОстаток,СтатусСообщения.Важное);
//		КонецЕсли;
//		//Для Каждого СтрТЗ из НоменклатураБезОстатка Цикл 
//		//	ТекстСообщения = ТекстСообщения + ТекстНачалаСообщения + " " + СтрТЗ.Номенклатура + ", " + СтрТЗ.Этап + Символы.ПС;
//		//КонецЦикла;
//		//Сообщить(ТекстСообщенияОтсутствуетОстаток);
//	КонецЦикла;
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//КонецПроцедуры

//&НаКлиенте
//Процедура Обособленно(Команда)
//	//Только для Резервирования    
//	ИмяДерева = "ДеревоМатериаловРезервирование";
//	ЭтоСписание = Ложь;
//	Обособленно = Истина;
//	УстановитьпризнакОбособленноВРегистре(ИмяДерева,ЭтоСписание,Обособленно); //Пользователи.АвторизованныйПользователь());
//КонецПроцедуры

//&НаКлиенте
//Процедура НеОбособленно(Команда)
//	//Только для Резервирования
//	ИмяДерева = "ДеревоМатериаловРезервирование";
//	ЭтоСписание = Ложь;                               
//	Обособленно = Ложь;
//	УстановитьпризнакОбособленноВРегистре(ИмяДерева,ЭтоСписание,Обособленно); //,Пользователи.АвторизованныйПользователь());
//КонецПроцедуры

//&НаСервере
////БезКонтекста
//Процедура ДеревоМатериаловРезервированиеОтгрузитьПриИзмененииНаСервере()
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеОтгрузитьПриИзменении(Элемент)
//	//ПОКА НЕТ ОБРАБОТКИ!!!///
//	//ДеревоМатериаловРезервированиеОтгрузитьПриИзмененииНаСервере();
//	
//	//ТекСтрока=Элементы.ДеревоМатериаловРезервирование.ТекущиеДанные; 
//	//ИДТекСтроки = Элементы.ДеревоМатериаловРезервирование.ТекущаяСтрока;
//	//ТекСтрока = Элемент.ТекущиеДанные();
//	
//	ИмяДерева = "ДеревоМатериаловРезервирование";
//	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";	
//	
//	//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства,ИДТекСтроки);
//	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,Элементы[ИмяДерева].ТекущиеДанные);
//	ВосстановитьСостояниеДерева(ИмяДерева);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеПриАктивизацииСтроки(Элемент)
//	
//	ИмяДерева = Элемент.Имя; 
//	ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//	Если Элемент.ВыделенныеСтроки.Количество() = 0 Тогда 
//		Возврат;
//	Иначе 
//		ТекСтрока = Элементы[ИмяДерева].ТекущиеДанные;         
//		//ИДТекСтроки = Элементы[ИмяДерева].ТекущаяСтрока;
//		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериаловРезервирование, ТекСтрока);
//		//ОбновитьИДТекущейСтроки(ИмяДерева,ИмяТаблицыИдентификаторов,ТекСтрока.Номенклатура, ТекСтрока.ЭтапПроизводства, ИДТекСтроки);
//	КонецЕсли;              
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловПриАктивизацииСтроки(Элемент)
//	
//	Если Элемент.ВыделенныеСтроки.Количество() = 0 Тогда 
//		Возврат;
//	Иначе 
//		ТекСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;
//		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериалов, ТекСтрока);
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловОтгрузитьПриИзменении(Элемент)
//	
//	ИсходныеДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;  
//	Если ТекСтраница = "Списание" Тогда 
//		ТекСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;     
//		ИмяДерева = "ДеревоМатериалов";
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//		//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериалов,ТекСтрока);
//		ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериалов;	
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ТекСтрока = Элементы.ДеревоМатериаловРезервирование.ТекущиеДанные;
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//		//ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтрокиДереваМатериаловРезервирование,ТекСтрока);
//		ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;
//	КонецЕсли;
//	
//	Если ТекСтрока.Уровень = 1 Тогда 
//		ОбщееКоличествоОбеспечить = ?(ЗначениеЗаполнено(ТекСтрока.Обеспечить), ТекСтрока.Обеспечить, 0);
//		ОбщееКоличествоОтгрузить = ?(ЗначениеЗаполнено(ТекСтрока.Отгрузить), ТекСтрока.Отгрузить, 0);
//		КоличествоПодчиненныхСтрок = ТекСтрока.ПолучитьЭлементы().Количество();   
//		ОбработаноСтрок = 0; 
//		ОсталосьОтгрузить = ОбщееКоличествоОтгрузить;
//		ДопустимыйОстаток = ДанныеСтроки.Остаток/КоличествоПодчиненныхСтрок;
//		Для Каждого ПодчиненнаяСтрока из ТекСтрока.ПолучитьЭлементы() Цикл   
//			ЗаполнитьЗначенияСвойств(ДанныеСтроки,ПодчиненнаяСтрока);
//			КоличествоИсходное = ПодчиненнаяСтрока.Количество;
//			Если УпаковкаШтуки(ПодчиненнаяСтрока.Упаковка) Тогда 
//				Если ОбработаноСтрок = КоличествоПодчиненныхСтрок - 1 Тогда 
//					Количество = ОсталосьОтгрузить;
//					//ПодчиненнаяСтрока.Резервировать = ОбщееКоличествоРезервировать;  
//					ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное, Истина, Ложь,ДопустимыйОстаток);
//				Иначе                     
//					Количество = Цел(ОбщееКоличествоОтгрузить/КоличествоПодчиненныхСтрок);
//					//ПодчиненнаяСтрока.Резервировать = Цел(ОбщееКоличествоРезервировать/КоличествоПодчиненныхСтрок);
//					//ПодчиненнаяСтрока.Обеспечить = ПодчиненнаяСтрока.Обеспечить +  
//					//ОбщееКоличествоРезервировать = ОбщееКоличествоРезервировать - ПодчиненнаяСтрока.Резервировать;
//					ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное, Истина, Ложь, ДопустимыйОстаток);
//					ОбработаноСтрок = ОбработаноСтрок + 1;
//				КонецЕсли;  
//			Иначе 
//				Количество = ОбщееКоличествоОтгрузить/КоличествоПодчиненныхСтрок;
//				ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное, Истина, Ложь, ДопустимыйОстаток);
//			КонецЕсли;
//			ОсталосьОтгрузить = ОбщееКоличествоОтгрузить - Количество;
//		КонецЦикла;                                                          
//		//ТекСтрока.Зарезервировать = ИсходныеДанныеСтрокиДереваМатериалов.Отгрузить;
//		//ТекСтрока.Отгрузить = ИсходныеДанныеСтрокиДереваМатериалов.Отгрузить;
//	Иначе        
//		ДопустимыйОстаток = ДанныеСтроки.Остаток;
//		КоличествоОбеспечить = ?(ЗначениеЗаполнено(ТекСтрока.Обеспечить), ТекСтрока.Обеспечить, 0);
//		КоличествоОтгрузить = ?(ЗначениеЗаполнено(ТекСтрока.Отгрузить), ТекСтрока.Отгрузить, 0);
//		Количество = КоличествоОтгрузить;
//		ЗаполнитьЗначенияСвойств(ДанныеСтроки,ТекСтрока);
//		КоличествоИсходное = ДанныеСтроки.Количество;
//		ИзменитьКоличествоВСтрокеРегистра(Количество, ДанныеСтроки, КоличествоИсходное, Истина, Ложь, ДопустимыйОстаток);  
//	КонецЕсли;     
//	
//	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);	
//	
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь, ДанныеСтроки); 
//	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
//	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
//	ВосстановитьСостояниеДерева(ИмяДерева);

//	//
//	//ТекСтрока = Элементы.ДеревоМатериалов.ТекущиеДанные;
//	//Если ТекСтрока.Уровень = 1 Тогда 
//	//	ОбщееКоличествоОбеспечить = ТекСтрока.Обеспечить;
//	//	ОбщееКоличествоОтгрузки = ТекСтрока.Отгрузить;
//	//	КоличествоПодчиненныхСтрок = ТекСтрока.ПолучитьЭлементы().Количество();
//	//	Для Каждого ПодчиненнаяСтрока из ТекСтрока.ПолучитьЭлементы() Цикл 
//	//		//ПодчиненнаяСтрока.Обеспечить
//	//	КонецЦикла;
//	//	ТекСтрока.Отгрузить = ИсходныеДанныеСтрокиДереваМатериалов.Отгрузить;
//	//	Возврат;    
//	//Иначе 
//	//	
//	//КонецЕсли; 
//	
//		
//КонецПроцедуры

////+20.01.22
//&НаСервере
////МассивДанныхРаскрытыхСтрок содержит структуры с данными строки (ИД, Номенклатура, ЭтапПроизводства(необязательно))
//Процедура ОбновитьИдентификаторыСтрокДереваНовая(ИмяДерева, ИмяТаблицыИдентификаторов, ДанныеТекСтроки)

//	//ЭтаФорма[ИмяДерева].НайтиПоИдентификатору(ДанныеТекСтроки.Идентификатор);
//	Для Каждого СтрокаДерева из ДеревоМатериаловРезервирование.ПолучитьЭлементы() Цикл //ИмяДерева 
//		Для Каждого СтрИД из ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование Цикл //ИмяТаблицыИдентификаторов 
//			СтрокаДерева.
//			СтрокаДерева.ПолучитьИдентификатор();
//		КонецЦикла;
//	КонецЦикла;
//	
//КонецПроцедуры
////-20.01.22          

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеОбособленноПриИзменении(Элемент)
//	ОбособленноПриИзмененииНаСервере("ДеревоМатериаловРезервирование",Элемент.ТекущиеДанные);
//	//ДеревоМатериаловРезервированиеОбособленноПриИзмененииНаСервере();
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьДеревоМатериаловпоРегистру (РезультатЗапроса, ИмяДерева)     
//	
//	Если ИмяДерева = "ДеревоМатериалов" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//	ИначеЕсли ИмяДерева = "ДеревоМатериаловРезервирование" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//	КонецЕсли;                                       
//	//СтруктураПоиска = Новый Структура("ТекущаяСтрока");
//	//МассивТекСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
//	//ТекСтрока = МассивТекСтрока[0]; 
//	//Если не ЗначениеЗаполнено(ТекСтрока.ЭтапПроизводства) Тогда 
//	//	ТекСтрокаУровень1 = Истина;
//	//Иначе 
//	//	ТекСтрокаУровень1 = Ложь;
//	//КонецЕсли;
//	
//	//ТЗ_ИД_Дерева = РеквизитФормыВЗначение(ИмяТаблицыИдентификаторов,Тип("ТаблицаЗначений"));
//	ТабМАтериалы = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
//	ДерМатериалов = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений")); //"ДеревоМатериалов"
//	ДерМатериалов.Строки.Очистить();     
//	
//	
//	//СтруктураПоискаИдентификатора = Новый Структура("Номенклатура, ЭтапПроизводства, ");
//	
//	НомерСтрокиНоменклатуры = 0;
//	Для Каждого СтрНоменклатура из ТабМАтериалы.Строки Цикл 
//		НомерСтрокиНоменклатуры = НомерСтрокиНоменклатуры + 1;
//		СтрНом = ДерМатериалов.Строки.Добавить();             
//		СтрНом.НомерСтрокиНоменклатуры = НомерСтрокиНоменклатуры;
//		ЗаполнитьЗначенияСвойств(СтрНом,СтрНоменклатура); //Проверить значение ИсходнойНоменклатуры!!!!!!!
//		СтрНом.Спецификация = СтрНоменклатура.СпецификацияЭтапа;
//		СтрНом.Уровень = 1;        
//		СтрНом.Расход = СтрНом.Зарезервировать + СтрНом.Отгрузить;
//		СтрНом.КонтрольОстатка = СтрНом.Остаток - СтрНом.Обеспечить - СтрНом.Расход;
//		СтрНом.ОстатокДляУО = СтрНом.Остаток - СтрНом.Обеспечить - СтрНом.Расход; // - СтрНом.КОбеспечению; 
//		РасходПоНоменклатуре = СтрНом.Расход;    
//		
//		///////////////////////////////
//		//Обновим идентификатор строки в ТаблицеИдентификаторов
//		Если СтрНом.Номенклатура = ТекущаяНоменклатура Тогда                    
//			СтруктураПоиска = Новый Структура("ТекущаяСтрока",Истина);
//			МассивИДТекСтроки = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
//			Если МассивИДТекСтроки.Количество() = 1 Тогда 
//				МассивИДТекСтроки[0].Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
//			ИначеЕсли МассивИДТекСтроки.Количество() = 0 Тогда 
//				ИДТекСтроки = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
//				ИДТекСтроки.Идентификатор = Элементы[ИмяДерева].ТекущаяСтрока;
//				ИДТекСтроки.Номенклатура = ТекущаяНоменклатура;
//				ИДТекСтроки.ТекущаяСтрока = Истина;
//				ИДТекСтроки.ИсходнаяНоменклатура = СтрНом.ИсходнаяНоменклатура;
//				ИДТекСтроки.НомерСтрокиНоменклатуры = НомерСтрокиНоменклатуры;
//			КонецЕсли;
//		КонецЕсли;
//		//Если ТекСтрокаУровень1 Тогда 
//		//	Если ТекСтрока.ИсходнаяНоменклатура = СтрНом.ИсходнаяНоменклатура 
//		/////////////////////////////////////   
//		
//		Для Каждого СтрЭтап из СтрНоменклатура.Строки Цикл 
//			СтрДет = СтрНом.Строки.Добавить(); 
//			ЗаполнитьЗначенияСвойств(СтрДет,СтрЭтап);             //Здесь ИсходнаяНоменклатура заполнена!!!
//			СтрНом.НомерСтрокиНоменклатуры = НомерСтрокиНоменклатуры;
//			СтрДет.Спецификация = СтрЭтап.СпецификацияЭтапа;
//			СтрДет.КонтрольОстатка = СтрДет.Остаток - СтрДет.Обеспечить - СтрДет.Расход; 
//			СтрДет.ОстатокДляУО = СтрДет.Остаток - СтрДет.Обеспечить - СтрДет.Расход; // - СтрДет.КОбеспечению; 
//		КонецЦикла;                                                                                             
//	КонецЦикла;
// 	ЗначениеВРеквизитФормы(ДерМатериалов,ИмяДерева);    
//	
//	//Очистим старые идентификаторы строк
//	//Для Каждого СтрТабИД из ТЗ_ИД_Дерева Цикл 
//	//	СтрТабИД.Идентификатор = Неопределено;
//	//КонецЦикла;
//	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева, );
//	
//	//ЗначениеВРеквизитФормы(ТЗ_ИД_Дерева, ИмяТаблицыИдентификаторов);
//	
//КонецПроцедуры     

//&НаСервере
//Процедура ОбновитьИдентификаторыСтрокДерева(ИмяДерева, ДанныеТекущейСтроки = Неопределено)
//	
//	СтрокиДерева = ЭтаФорма[ИмяДерева].ПолучитьЭлементы();
//	
//	//Очистим старые значения идентификаторов      
//	Если ИмяДерева = "ДеревоМатериалов" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//	ИначеЕсли ИмяДерева = "ДеревоМатериаловРезервирование" Тогда
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование"; 
//	КонецЕсли; 
//	
//	Если ЭтаФорма[ИмяТаблицыИдентификаторов].Количество() = 0 Тогда 
//		Возврат; //Ничего обновлять не надо. Нет ни одной раскрытой строки и ни одна строка не выделена
//	КонецЕсли;
//		
//	СтруктураПоискаТекСтроки = Новый Структура("ТекущаяСтрока",Истина);
//	МассивТекСтроки = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоискаТекСтроки);
//	КоличествоТекущихСтрок = МассивТекСтроки.Количество();
//	Если КоличествоТекущихСтрок > 1 Тогда 
//		ИскатьТекущуюСтроку = Истина;
//		Сообщить("Необходимо исправить запись в таблицу Идентификаторов. Сохранено несколько текущих строк.");
//	ИначеЕсли КоличествоТекущихСтрок = 1 Тогда
//		ИскатьТекущуюСтроку = Истина;
//	Иначе 
//		ИскатьТекущуюСтроку = Ложь;
//	КонецЕсли;
//	Если ИскатьТекущуюСтроку Тогда // и ТекСтрока = Неопределено Тогда 
//		ТекСтрока = МассивТекСтроки[0];
//	КонецЕсли;

//	НашлиТекущуюСтроку = Ложь; 
//	ИДТекущейСтроки = Неопределено;
//	Для Каждого СтрокаДерева из СтрокиДерева Цикл 
//		СтруктураПоиска = Новый Структура;         
//		СтруктураПоиска.Вставить("Номенклатура", СтрокаДерева.Номенклатура);
//		МассивНайденныхСтрок = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
//		КоличествоНайденныхСтрок = МассивНайденныхСтрок.Количество();
//		
//		Если КоличествоНайденныхСтрок = 1 Тогда 
//			СтрокаТаблицы = МассивНайденныхСтрок[0];
//			СтрокаТаблицы.Идентификатор = СтрокаДерева.ПолучитьИдентификатор(); 
//			Если СтрокаТаблицы.ТекущаяСтрока = Истина Тогда 
//				ИскатьТекущуюСтроку = Ложь;
//			КонецЕсли;
//		ИначеЕсли КоличествоНайденныхСтрок > 1 Тогда 
//			Для Каждого СтрокаТаблицы из МассивНайденныхСтрок Цикл 
//				СтрокаТаблицы.Идентификатор = СтрокаДерева.ПолучитьИдентификатор();   
//				Если СтрокаТаблицы.ТекущаяСтрока = Истина Тогда 
//					ИскатьТекущуюСтроку = Ложь;
//				КонецЕсли;
//			КонецЦикла;
//		Иначе 
//			Продолжить;
//		КонецЕсли;
//		Если ИскатьТекущуюСтроку и не НашлиТекущуюСтроку Тогда   
//			//Если выбрана строка 1 уровня         
//			Если СтрокаДерева.Номенклатура = ТекСтрока.Номенклатура Тогда //СтрокаДерева.ИсходнаяНоменклатура = ТекСтрока.ИсходнаяНоменклатура Тогда // 
//				Если не ЗначениеЗаполнено(ТекСтрока.ЭтапПроизводства) Тогда 
//					ТекСтрока.Идентификатор = СтрокаДерева.ПолучитьИдентификатор();
//					НашлиТекущуюСтроку = Истина;    
//					ИДТекущейСтроки = ТекСтрока.Идентификатор;
//				Иначе 
//					//выполнить поиск по дочерним строкам
//					ДочерниеСтроки = СтрокаДерева.ПолучитьЭлементы();
//					Если ДочерниеСтроки.Количество() > 0 Тогда 
//						Для Каждого ДочерняяСтрока из ДочерниеСтроки Цикл 
//							//ОбновитьИдентификаторыСтрокДерева(СтрокаДерева);
//							СтруктураПоиска = Новый Структура;
//							СтруктураПоиска.Вставить("Номенклатура", ДочерняяСтрока.Номенклатура);
//							СтруктураПоиска.Вставить("ЭтапПроизводства",ДочерняяСтрока.ЭтапПроизводства);
//							СтруктураПоиска.Вставить("ТекущаяСтрока",Истина);
//							МассивНайденныхСтрок = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска);
//							КоличествоНайденныхСтрок = МассивНайденныхСтрок.Количество();
//							
//							Если КоличествоНайденныхСтрок = 1 Тогда 
//								СтрокаТаблицы = МассивНайденныхСтрок[0];
//								СтрокаТаблицы.Идентификатор = ДочерняяСтрока.ПолучитьИдентификатор();  
//								НашлиТекущуюСтроку = Истина;     
//								ИДТекущейСтроки = СтрокаТаблицы.Идентификатор;
//							ИначеЕсли КоличествоНайденныхСтрок > 1 Тогда 
//								Для Каждого СтрокаТаблицы из МассивНайденныхСтрок Цикл 
//									//СтрокаТаблицы = МассивНайденныхСтрок[0];
//									СтрокаТаблицы.Идентификатор = ДочерняяСтрока.ПолучитьИдентификатор(); 
//									НашлиТекущуюСтроку = Истина;  
//									ИДТекущейСтроки = СтрокаТаблицы.Идентификатор;
//									//Сообщить("По номенклатуре "+СтрокаТаблицы.НоменклатураРодитель+" спецификации "+СтрокаТаблицы.Спецификация+" в дереве материалов найдено более 1 строки. Уточните условие поиска");
//								КонецЦикла;
//							Иначе 
//								//Если ничего не нашли, то и обновлять нечего
//								Продолжить;
//							КонецЕсли;
//						КонецЦикла;
//					КонецЕсли;
//				КонецЕсли; 				
//			КонецЕсли;
//		КонецЕсли;	
//	КонецЦикла;    
//	Элементы[ИмяДерева].ТекущаяСтрока = ИДТекущейСтроки;
//	//Удалим строки, которых больше нет в дереве (например после Записи в регистр)
//	Для Каждого СтрТабИД из ЭтаФорма[ИмяТаблицыИдентификаторов] Цикл 
//		Если СтрТабИД.Идентификатор = Неопределено Тогда 
//			ЭтаФорма[ИмяТаблицыИдентификаторов].Удалить(СтрТабИД);
//		КонецЕсли;
//	КонецЦикла; 
//		
//КонецПроцедуры

//&НаКлиенте
//Процедура ДеревоМатериаловРезервированиеНоменклатураПриИзменении(Элемент)
//	
//	ИмяДерева = Элемент.Родитель.Имя;
//	ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериаловРезервирование;	
//	 
//	Если ИмяДерева = "ДеревоМатериалов" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//		ЭтоСписание = Истина;
//	ИначеЕсли ИмяДерева = "ДеревоМатериаловРезервирование" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//		ЭтоСписание = Ложь;
//	КонецЕсли;
//	//ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
//	
//	//Перезапишем номенклатуру в строке таблицы ИдентификаторыРаскрытыхСтрокДерева
//	//так как номенклатура изменилась      
//	
//	ДанныеТекСтроки = Элемент.Родитель.ТекущиеДанные;     
//	ТекущаяНоменклатура = ДанныеТекСтроки.Номенклатура; 
//	СтруктураПоиска = Новый Структура("ТекущаяСтрока", Истина);
//	МассивТекСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска); 
//	Если МассивТекСтрока.Количество() = 1 Тогда 
//		МассивТекСтрока[0].Номенклатура = ДанныеТекСтроки.Номенклатура;
//		МассивТекСтрока[0].НомерСтрокиНоменклатуры = ДанныеТекСтроки.НомерСтрокиНоменклатуры;
//	Иначе 
//		НовыйИДТекСТроки = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
//		НовыйИДТекСТроки.ТекущаяСтрока = Истина;
//		НовыйИДТекСТроки.Номенклатура = ДанныеТекСтроки.Номенклатура;
//	    НовыйИДТекСТроки.НомерСтрокиНоменклатуры = ДанныеТекСтроки.НомерСтрокиНоменклатуры;  
//		НовыйИДТекСТроки.Идентификатор = Элемент.Родитель.ТекущаяСтрока;
//		Если ДанныеТекСтроки.Уровень <> 1 Тогда 
//			НовыйИДТекСТроки.ЭтапПроизводства = ДанныеТекСтроки.ЭтапПроизводства;    
//		Иначе 
//			НовыйИДТекСТроки.ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
//		КонецЕсли;
//	КонецЕсли;
//	
//	//!!!!!!ЗаменаМатералаВДереве(ИмяДерева, ИДСтрокиДерева, ЭтоСписание, ДанныеИсходнойСтроки);
//	
//	СтруктураТекущейСтроки = Новый Структура("Номенклатура,ЭтапПроизводства,ВариантОбеспечения,Спецификация,Склад,СтатьяКалькуляции, СпецификацияЭтапа, КатегорияМатериала, ВыходноеИзделие, КлючСвязиСпецификация");  
//	ЗаполнитьЗначенияСвойств(СтруктураТекущейСтроки,ДанныеСтроки);
//	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
//	МассивСтруктурОбрабатываемыхСтрок.Добавить(СтруктураТекущейСтроки); 
//	НоваяСтруктураТекущейСтроки = Новый Структура("Номенклатура,ЭтапПроизводства,ВариантОбеспечения,Спецификация,Склад,СтатьяКалькуляции, СпецификацияЭтапа, КатегорияМатериала, ВыходноеИзделие, КлючСвязиСпецификация");
//	ЗаполнитьЗначенияСвойств(НоваяСтруктураТекущейСтроки,ДанныеТекСтроки);
//	
//	ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок,НоваяСтруктураТекущейСтроки,ЭтоСписание); 
//	
//	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
//	
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь, НоваяСтруктураТекущейСтроки);
//	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
//	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
//	
//	ВосстановитьСостояниеДерева(ИмяДерева); 
//	
//КонецПроцедуры

// &НаКлиенте
//Процедура ДеревоМатериаловМатериалПриИзменении(Элемент)
//	
//	ИмяДерева = Элемент.Родитель.Имя;
//	ДанныеСтроки = ИсходныеДанныеСтрокиДереваМатериалов;
//	//??ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,"ИдентификаторыРаскрытыхСтрокДереваМатериалов");
//	//НоваяНоменклатура = МатериалПриИзменении();   
//	Если ИмяДерева = "ДеревоМатериалов" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериалов";
//		ЭтоСписание = Истина;
//	ИначеЕсли ИмяДерева = "ДеревоМатериаловРезервирование" Тогда 
//		ИмяТаблицыИдентификаторов = "ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование";
//		ЭтоСписание = Ложь;
//	КонецЕсли;
//	//ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,"ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование");
//	
//	//Перезапишем номенклатуру в строке таблицы ИдентификаторыРаскрытыхСтрокДерева
//	//так как номенклатура изменилась      
//	ДанныеТекСтроки = Элемент.Родитель.ТекущиеДанные;     
//	ТекущаяНоменклатура = ДанныеТекСтроки.Номенклатура; 
//	СтруктураПоиска = Новый Структура("ТекущаяСтрока", Истина);
//	МассивТекСтрока = ЭтаФорма[ИмяТаблицыИдентификаторов].НайтиСтроки(СтруктураПоиска); 
//	Если МассивТекСтрока.Количество() = 1 Тогда 
//		МассивТекСтрока[0].Номенклатура = ДанныеТекСтроки.Номенклатура;
//		МассивТекСтрока[0].НомерСтрокиНоменклатуры = ДанныеТекСтроки.НомерСтрокиНоменклатуры;
//	Иначе 
//		НовыйИДТекСТроки = ЭтаФорма[ИмяТаблицыИдентификаторов].Добавить();
//		НовыйИДТекСТроки.ТекущаяСтрока = Истина;
//		НовыйИДТекСТроки.Номенклатура = ДанныеТекСтроки.Номенклатура;
//	    НовыйИДТекСТроки.НомерСтрокиНоменклатуры = ДанныеТекСтроки.НомерСтрокиНоменклатуры;  
//		НовыйИДТекСТроки.Идентификатор = Элемент.Родитель.ТекущаяСтрока;
//		Если ДанныеТекСтроки.Уровень <> 1 Тогда 
//			НовыйИДТекСТроки.ЭтапПроизводства = ДанныеТекСтроки.ЭтапПроизводства;    
//		Иначе 
//			НовыйИДТекСТроки.ЭтапПроизводства = ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
//		КонецЕсли;
//	КонецЕсли;
//	
//	////////////////////////////////////////////////////////
//	СтруктураТекущейСтроки = Новый Структура("Номенклатура,ЭтапПроизводства,ВариантОбеспечения,Спецификация,Склад,СтатьяКалькуляции, СпецификацияЭтапа, КатегорияМатериала, ВыходноеИзделие");  
//	ЗаполнитьЗначенияСвойств(СтруктураТекущейСтроки,ДанныеСтроки);
//	МассивСтруктурОбрабатываемыхСтрок = Новый Массив;
//	МассивСтруктурОбрабатываемыхСтрок.Добавить(СтруктураТекущейСтроки); 
//	НоваяСтруктураТекущейСтроки = Новый Структура("Номенклатура,ЭтапПроизводства,ВариантОбеспечения,Спецификация,Склад,СтатьяКалькуляции, СпецификацияЭтапа, КатегорияМатериала, ВыходноеИзделие");
//	ЗаполнитьЗначенияСвойств(НоваяСтруктураТекущейСтроки,ДанныеТекСтроки);
//	
//	ЗаменаМатериалаВРегистре(МассивСтруктурОбрабатываемыхСтрок,НоваяСтруктураТекущейСтроки,ЭтоСписание); 
//	
//	ЗапишемДанныеТекущейСтрокиВТабИД(ИмяДерева,ИмяТаблицыИдентификаторов);
//	
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь, НоваяСтруктураТекущейСтроки);
//	УстановитьУсловноеОформлениеДереваМатериалов(ИмяДерева);
//	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
//	
//	ВосстановитьСостояниеДерева(ИмяДерева);
//	
//	//ОбновитьИдентификаторыСтрокДерева(ИмяДерева,ДанныеСтроки);
//	//ВосстановитьСостояниеДерева(ИмяДерева);
//	
//КонецПроцедуры      

//&НаСервере
//Процедура ОтгрузитьНаСервере(ИмяДерева,ЭтоСписание, Отбор)
//		
//	//////////0. Отбор - значение ВариантаОбеспечения (например, ОтгрузитьЗарезервированные)
//	//////////1. Получим данные регистра с учетом отборов (Категория материала, ОтборПоВариантамОбеспечения, Пользователь, ЭтоСписание, ВариантОбеспечения (исходный))
//	//////////2. Изменим данные в соответствии с данными дерева (синхронизация по полю ИдентификаторСтрокиРегистра)
//	//////////3. Загрузить новые данные в регистр
//	
//	Дерево = РеквизитФормыВЗначение(ИмяДерева,Тип("ДеревоЗначений"));
//	
//	ТекНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
//	Для Каждого СтрокаДерева из Дерево.Строки Цикл 
//		Если ТекНоменклатура <> СтрокаДерева.Номенклатура Тогда // строка 1 уровня. Зафиксируем данные по номенкдатуре и остаткам на складе.
//			ТекНоменклатура = СтрокаДерева.Номенклатура;
//			ТекОстаток = СтрокаДерева.Остаток;
//		КонецЕсли;
//		//ОстатокПослеРезервированияВсехСтрокПоНоменклатуре = ТекОстаток - Строка.Обеспечить;
//		Для Каждого Стр из СтрокаДерева.Строки Цикл 
//			Если ЗначениеЗаполнено(Отбор) и Стр.ВариантОбеспечения <> Отбор Тогда 
//				Продолжить;
//			ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
//				//или Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно Тогда 
//				Продолжить;
//			КонецЕсли;
//			Если ТекНоменклатура = Стр.Номенклатура тогда
//				ТекОстаток = ТекОстаток - Стр.Обеспечить;
//			КонецЕсли;
//			Если ТекОстаток >= 0 Тогда			
//				НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//				НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
//				НЗ.Отбор.ЭтоСписание.Установить(ЭтоСписание);
//				НЗ.Отбор.Номенклатура.Установить(Стр.Номенклатура);
//				НЗ.Отбор.ЭтапПроизводства.Установить(Стр.ЭтапПроизводства);
//				Если ЗначениеЗаполнено(ОтборВариантОбеспечения) и ЭтоСписание Тогда 
//					НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспечения);
//				ИначеЕсли ЗначениеЗаполнено(ОтборВариантОбеспеченияРезервирование) и не ЭтоСписание Тогда 
//					НЗ.Отбор.ОтборПоВариантамОбеспечения.Установить(ОтборВариантОбеспеченияРезервирование);
//				КонецЕсли;
//				Если ЗначениеЗаполнено(ОтборКатегорияМатериала) и ЭтоСписание Тогда 
//					НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериала);
//				ИначеЕсли ЗначениеЗаполнено(ОтборКатегорияМатериалаРезервирование) и не ЭтоСписание Тогда
//					НЗ.Отбор.КатегорияМатериала.Установить(ОтборКатегорияМатериалаРезервирование);
//				КонецЕсли;
//				НЗ.Прочитать(); 
//				ВариантОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Отгрузить;
//				Если НЗ.Количество() = 1 Тогда 
//					Для Каждого СтрНЗ из НЗ Цикл 
//							Если Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда 
//								//или Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьИзЗаказов тогда
//								Количество = Стр.Зарезервировать; 
//							ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления
//								ИЛИ Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда 
//								Количество = Стр.Обеспечить;
//							//ИначеЕсли Стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОбособленно Тогда  
//							//	Количество = Стр.Обеспечить;
//							Иначе 
//								Количество = 0;
//							КонецЕсли;
//							СтрНЗ.Количество = Количество;
//							СтрНЗ.ВариантОбеспечения = ВариантОбеспеченияНовый;
//							СтрНЗ.Обособленно = Ложь;
//							СтрНЗ.Назначение = Справочники.Назначения.ПустаяСсылка();
//							
//							ИндексВариантаОбеспеченияНовый = Перечисления.ВариантыОбеспечения.Индекс(ВариантОбеспеченияНовый);
//							ИмяПеречисления = Строка(Метаданные.Перечисления.ВариантыОбеспечения.ЗначенияПеречисления[ИндексВариантаОбеспеченияНовый]);
//							
//							СтрНЗ.ОтборПоВариантамОбеспечения = СоответствиеВариантовОбеспеченияОтбору[ИмяПеречисления];
//							СтрНЗ.Обеспечить = ?(ЗначениеЗаполнено(СтрНЗ.Обеспечить),СтрНЗ.Обеспечить,0) - ?(ЗначениеЗаполнено(Количество),Количество,0);
//						//В регистре только исходный остаток - его не изменяем!!!
//					КонецЦикла;
//					ЭлементОтбора = НЗ.Отбор.Найти("ОтборПоВариантамОбеспечения");
//					Если не ЭлементОтбора = Неопределено Тогда 
//						ЭлементОтбора.Использование = Ложь;
//					КонецЕсли;
//					НЗ.Записать();
//				ИначеЕсли НЗ.Количество() > 1 Тогда 
//					//Найти запись с нужным вариантом обеспечения
//					Сообщить("Найдено более 1 строки в регистре, уточните условия поиска "+стр.Номенклатура + " " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
//				Иначе 
//					Сообщить("Не найдена строка регистра для корректировки данных, "+стр.Номенклатура + " " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
//				КонецЕсли;
//			Иначе 
//				Сообщить("Отсутствует остаток для резервирования по номенклатуре "+Стр.Номенклатура + ", " + Стр.ЭтапПроизводства,СтатусСообщения.Важное);
//			КонецЕсли;
//		КонецЦикла;				
//	КонецЦикла;
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева,Ложь);
//			
//КонецПроцедуры

//&НаКлиенте
//Процедура ПереходНаСПисаниеРезервированиеПродолжение(Результат, ДопПараметры) Экспорт    
//	
//	Если ДопПараметры.ВернутьсяНаСтраницуМатериаловСписания Тогда 
//		//Переход со Списания на Резервирвоание // Возврат на страницу Списание материалов
//		Если Результат = КодВозвратаДиалога.Нет Тогда 
//			//Отменить переход
//			Элементы.Страницы.ТекущаяСтраница = Элементы.Найти("Списание"); // "СтраницаМатериалы"
//		Иначе    
//			//Переход на страницу Этапы раздела Резервирования
//			Элементы.СтраницыРезервирования.ТекущаяСтраница = Элементы.Найти("ЭтапыРезервирования");
//			ПеремЭтапы = ЭтапыРезервирование;
//			Этапы.Очистить(); 
//			Объект.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"); 
//			ЗаполнитьЭтапыНаСервере(ПеремЭтапы, Ложь);
//			ИдентификаторыРаскрытыхСтрокДереваМатериалов.Очистить();
//		КонецЕсли;
//	Иначе            
//		//Переход с Резервирвоания на Списание //Возврат к резервированию материалов
//		Если Результат = КодВозвратаДиалога.Нет Тогда
//			Элементы.Страницы.ТекущаяСтраница = Элементы.Найти("Резервирование"); // "МатериалыРезервирования"
//		Иначе
//			//Переход на страницу Этапы раздела Списание
//			Элементы.СтраницыСписания.ТекущаяСтраница = Элементы.Найти("СтраницаЭтапы");  
//			ПеремЭтапы = Этапы;
//			ЭтапыРезервирование.Очистить();   
//			Объект.НоменклатураРезервирование = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
//			ЗаполнитьЭтапыНаСервере(ПеремЭтапы, Истина);
//			ИдентификаторыРаскрытыхСтрокДереваМатериаловРезервирование.Очистить();
//		КонецЕсли;
//	КонецЕсли;        
//	
//КонецПроцедуры

// &НаКлиенте
//Процедура ЗафиксироватьКорректировки(Команда)
//	
//	Если ТекСтраница = "Списание" и не ЗначениеЗаполнено(Объект.ПериодОтгрузки) Тогда
//		Сообщить("Заполните ""Дату отгрузки""! списание не выполнено",СтатусСообщения.Важное);
//		Возврат;
//	КонецЕсли;
//	
//	/////////////////////////////////////////////////////////////////
//	ЗапроситьРазрешениеНаУстановкуПривилегированногоРежима();
//	
//	Оповещение = Новый ОписаниеОповещения("ПослеПредоставленияРазрешения",ЭтаФорма);
//	МассивИДРазрешений = ПолучитьМассивИдентификаторовРазрешений(СписокИДЗапросовРазрешений);
//	РаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(МассивИДРазрешений, ЭтаФорма, Оповещение);
//	
//	//УстановитьПривилегированныйРежим(Истина);
//	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Истина);  
//	
//	/////////////////////////////////////////////////////////////////
//	
//	Сообщить("Начало обработки этапов " + Строка(ТекущаяДата()));
//	
//	Если ТекСтраница = "Списание" Тогда 
//		ТабЭтапы = Этапы;
//	ИначеЕсли ТекСтраница = "Резервирование" Тогда 
//		ТабЭтапы = ЭтапыРезервирование;
//	КонецЕсли;           
//	ОтборСтрок = Новый Структура("Обрабатывать",Истина);
//	МассивЭтаповДляОбработки = ТабЭтапы.НайтиСтроки(ОтборСтрок);
//	Для Каждого СтрЭтап из МассивЭтаповДляОбработки Цикл //ТабЭтапы 
//		//Если СтрЭтап.Обрабатывать Тогда 
//		Этап = СтрЭтап.ЭтапПроизводства; 
//		//**//
//		//НачатьТранзакцию();
//		ДанныеЭтапа = ПолучитьДанныеЭтапа(Этап);
//		Если ТекСтраница = "Списание" Тогда 
//			Если ДанныеЭтапа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЭтаповПроизводства2_2.Завершен") или ДанныеЭтапа.КолСтрРасход > 0 Тогда 
//				ЭтапОтменен = ОтменитьРасходМатериаловВЭтапе(Этап);  
//				Если ЭтапОтменен Тогда 
//					УдалитьСвязанныеПередачиМатериалов(Этап);
//				КонецЕсли;
//			КонецЕсли;
//			//УдалитьСвязанныеПередачиМатериалов(Этап);
//		КонецЕсли;
//		МатериалыЗаполнили = ЗаполнитьМатериалыЭтапаПоДаннымРегистра(Этап);
//		Если не МатериалыЗаполнили Тогда    
//			//ОтменитьТранзакцию();
//			Возврат; //Сообщение с описанием ошибки в функции
//		КонецЕсли;
//		Если ТекСтраница = "Списание" Тогда 
//			СформировалиПередачуМатериалов = СформироватьПередачуМатериаловНаСервере(Этап);
//			Если не СформировалиПередачуМатериалов Тогда
//				//ОтменитьТранзакцию();
//				Возврат;
//			КонецЕсли;
//			ЗаполнилиРасходЭтапа = ЗаполнитьРасходЭтапа(Этап);
//			Если не ЗаполнилиРасходЭтапа Тогда
//				//ОтменитьТранзакцию();
//				Возврат;
//			КонецЕсли;
//		КонецЕсли;  
//		//КонецЕсли;      
//		//ЗафиксироватьТранзакцию();
//		Сообщить("Обработка этапа завершена " + Этап);
//	КонецЦикла;
//	
//	Сообщить("Время окончания обработки этапов "+ Строка(ТекущаяДата()));
//	
//	ЗаполнитьРеквизитыРФ_УстановитьПривилегированныйРежим(Ложь);
//	
//КонецПроцедуры


#КонецОбласти          



//////////////////////////////////////////////////////////////////////////////////

//Для возможности отмены закрытия формы без потери данных 
ЗакрытьФормуОбработки = Ложь; 

//&НаКлиенте                                        
////Дерево
//Процедура ОтменитьРезервВыделенныхСтрок(Команда)      
//	
//	Если Элементы.СтраницыРезервирования.ТекущаяСтраница.Имя = "МатериалыРезервирования" Тогда 
//		//МассивСтрок = Элементы.ДеревоМатериаловРезервирование.ВыделенныеСтроки;
//		ИмяДерева = "ДеревоМатериаловРезервирование";
//		ЭтоСписание = Ложь;
//	ИначеЕсли Элементы.СтраницыСписания.ТекущаяСтраница.Имя = "СтраницаМатериалы" Тогда 
//		//МассивСтрок = Элементы.ДеревоМатериалов.ВыделенныеСтроки;
//		ИмяДерева = "ДеревоМатериалов";
//		ЭтоСписание = Истина;
//	КонецЕсли;
//	
//	СписокВариантовОбеспечения = Новый СписокЗначений;
//	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.СоСклада"));
//	СписокВариантовОбеспечения.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьИзЗаказов"));    
//	
//	МассивСтруктурОбрабатываемыхСтрок = ПолучитьМассивСтруктурВыбранныхСтрокДляОбработки(СписокВариантовОбеспечения, ИмяДерева, ЭтоСписание);
//	
//	//ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.УдалитьОбособленно");
//	ВариантОбеспеченияНовый = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению");    //РезервироватьПоМереПоступления");
//	ОтборПоВариантуОбеспечения = 1;
//	
//	ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивСтруктурОбрабатываемыхСтрок, ИмяДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения);

//КонецПроцедуры    

//&НаСервере
////БезКонтекста
//Процедура ЗаписатьДанныеВыделенныхСтрокВРегистр(МассивВыбранныхСтрок, ИмяДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения) //
//	
//	Для Каждого Стр из МассивВыбранныхСтрок Цикл 
//		ОбновитьВариантОбеспеченияВСтрокеРегистра(Стр, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения);
//	КонецЦикла;
//	ОбновитьДанныеПоМатериаламНаСервере(ИмяДерева, Ложь);
//КонецПроцедуры

//&НаСервере
//Процедура ОбновитьВариантОбеспеченияВСтрокеРегистра(СтрокаДерева, ЭтоСписание, ВариантОбеспеченияНовый, ОтборПоВариантуОбеспечения)
//		
//	НЗ = РегистрыСведений.ТТМ_АРМ_РезервированиеСписаниеМатериалов.СоздатьНаборЗаписей();
//	НЗ.Отбор.Пользователь.Установить(Пользователи.АвторизованныйПользователь());
//	НЗ.Отбор.ЭтоСПисание.Установить(ЭтоСписание);
//	//НЗ.Отбор.ИдентификаторСтрокиРегистра.Установить(СтрокаДерева.ИдентификаторСтрокиРегистра);
//	НЗ.Отбор.Номенклатура.Установить(СтрокаДерева.Номенклатура);
//	НЗ.Отбор.ЭтапПРоизводства.Установить(СтрокаДерева.ЭтапПроизводства);
//	НЗ.Отбор.ВариантОбеспечения.Установить(СтрокаДерева.ВариантОбеспечения);
//	НЗ.Прочитать();
//	Если НЗ.Количество() = 1 Тогда 
//		//нашли единственную строку  //Добавить пропуск отгруженных строк
//		НЗ[0].ВариантОбеспечения = ВариантОбеспеченияНовый; //Перечисления.ВариантыОбеспечения.СоСклада;
//		НЗ[0].ОтборПоВариантамОбеспечения = ОтборПоВариантуОбеспечения; //4; 
//		НЗ[0].ДатаОтгрузки = ?(ЭтоСписание,Объект.ПериодОтгрузки,СтрокаДерева.ЭтапПроизводства.ДатаОтгрузки); 
//		//Если не НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.УдалитьОбособленно Тогда 
//		//	НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка();
//		//КонецЕсли;
//		Если НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада и НЗ[0].Обособленно Тогда 
//			НЗ[0].Обособленно = Ложь; 
//			НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка();
//		ИначеЕсли НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления Тогда  
//			Если не НЗ[0].Обособленно Тогда 
//				НЗ[0].Обособленно = Истина; 
//				НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка(); //Проверить!!!!
//			Иначе 
//				НазначениеПродукции = СтрокаДерева.ЭтапПроизводства.ВыходныеИзделия[0].Назначение;
//				НЗ[0].Назначение = НазначениеПродукции; //Проверить!!!!
//			КонецЕсли;   
//		ИначеЕсли НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
//			Если не НЗ[0].Обособленно Тогда 
//				НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка(); //Проверить!!!!
//			Иначе 
//				НазначениеПродукции = СтрокаДерева.ЭтапПроизводства.ВыходныеИзделия[0].Назначение;
//				НЗ[0].Назначение = НазначениеПродукции; //Проверить!!!!
//			КонецЕсли;
//		ИначеЕсли НЗ[0].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда 
//			НЗ[0].Обособленно = Ложь;
//			НЗ[0].Назначение = Справочники.Назначения.ПустаяСсылка();
//		КонецЕсли;
//	ИначеЕсли НЗ.Количество() > 1 Тогда 
//		Сообщить("Найдено более 1 строки регистра для резервирования! Уточните параметры поиска!",СтатусСообщения.Важное);
//	Иначе 
//		Сообщить("Не найдено строки для корректировки данных! Уточните параметры поиска!", СтатусСообщения.Важное);
//	КонецЕсли;
//	НЗ.Отбор.Найти("ВариантОбеспечения").Использование = Ложь;
//	НЗ.Записать();
//	
//КонецПроцедуры




///////////////////////////////////////////////////////////////////////////////////

