#Область ФормаВыбораЗаказовСОтказомОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыгруженныйСписок = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);
	Объект.ЗаказыСОтказом.Очистить();
	
	Для Каждого ТекДанные Из ВыгруженныйСписок Цикл
		НоваяСтрока = Объект.ЗаказыСОтказом.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
	КонецЦикла;
	
	Объект.Ответственный = Параметры.Ответственный;	
	ВызовИзФормыМенеджера = Параметры.ФормаПодразделения.ФормаМенеджеров;
	ВызовИзФормыКонструктора = Параметры.ФормаПодразделения.ФормаКонструкторов;
	ВызовИзФормыСнабжения = Параметры.ФормаПодразделения.ФормаСнабжения;		
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждитьИзменения(Команда)
	РезультатыВыбора = ОбработкаИзФормыВыбораЗаказовСОтказом();
	ОчиститьСообщения();
	
	Если ВызовИзФормыМенеджера Тогда
		Оповестить("ПослеВыбораЗаказаСОтказомМенеджер", РезультатыВыбора.МассивЗаказовСОтказом);
		ЭтаФорма.Закрыть();
	ИначеЕсли ВызовИзФормыКонструктора Тогда
		Если РезультатыВыбора.ЗаказПолностьюЗакрыт Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'В списке выбран заказ, который полностью закрыт. Вернуть закрытый заказ доступен менеджеру!'"),, "Объект.ЗаказыСОтказом");
		    Возврат;
		КонецЕсли;
		
		Оповестить("ПослеВыбораЗаказаСОтказомКонструктор", РезультатыВыбора.МассивЗаказовСОтказом);
		ЭтаФорма.Закрыть();
	ИначеЕсли ВызовИзФормыСнабжения Тогда
		Если РезультатыВыбора.ЗаказПолностьюЗакрыт Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'В списке выбран заказ, который полностью закрыт. Вернуть закрытый заказ доступен менеджеру!'"),, "Объект.ЗаказыСОтказом");
		    Возврат;
		КонецЕсли;

		Оповестить("ПослеВыбораЗаказаСОтказомКонструктор", РезультатыВыбора.МассивЗаказовСОтказом);
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработкаИзФормыВыбораЗаказовСОтказом()	
	МассивНайденныхСтрок = Объект.ЗаказыСОтказом.НайтиСтроки(Новый Структура("Выбрано", Истина));
	МассивЗаказовСОтказом = Новый Массив;
	ЗаказПолностьюЗакрыт = Ложь;
	
	Для Каждого ТекДанные Из МассивНайденныхСтрок Цикл 
		МассивЗаказовСОтказом.Добавить(ТекДанные.ЗаказКлиента);
	КонецЦикла;
	
	Для Каждого ЗаказОбработки Из МассивЗаказовСОтказом Цикл
		Если ЗаказОбработки.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
			ЗаказПолностьюЗакрыт = Истина;
		КонецЕсли;
	КонецЦикла;
	
	РезультатыВыбора = Новый Структура;
	РезультатыВыбора.Вставить("МассивЗаказовСОтказом", МассивЗаказовСОтказом);
	РезультатыВыбора.Вставить("ЗаказПолностьюЗакрыт", ЗаказПолностьюЗакрыт);
	
	Возврат РезультатыВыбора;	
КонецФункции

#КонецОбласти